{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CycleCount",
        "Battery"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.BatteryPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_battery_instancename_cyclecount",
    "rootDefinitionId": "android_deviceinventory_battery_instancename",
    "categoryId": "aa4ab968-c4d6-4bc3-b208-505a31173629",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_battery_instancename_cyclecount",
    "description": null,
    "helpText": null,
    "name": "CycleCount",
    "displayName": "Cycle Count",
    "defaultOptionId": "android_deviceinventory_battery_instancename_cyclecount_0",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "android_deviceinventory_battery_instancename_cyclecount_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "android_deviceinventory_battery_instancename",
                    "parentSettingId": "android_deviceinventory_battery_instancename"
                }
            ],
            "dependedOnBy": []
        }
    ]
}