{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "NetworkAdapter",
        "Network Adapter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.NetworkAdapterPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_networkadapter_identifier",
    "rootDefinitionId": "android_deviceinventory_networkadapter_identifier",
    "categoryId": "55c55954-44a0-4b69-ac26-1c980b9b36af",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_networkadapter_identifier",
    "description": null,
    "helpText": null,
    "name": "NetworkAdapter",
    "displayName": "NetworkAdapter",
    "childIds": [
        "android_deviceinventory_networkadapter_identifier_identifier",
        "android_deviceinventory_networkadapter_identifier_ipaddressv4",
        "android_deviceinventory_networkadapter_identifier_macaddress",
        "android_deviceinventory_networkadapter_identifier_type"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "android_deviceinventory_networkadapter_identifier_identifier",
            "required": true
        },
        {
            "dependedOnBy": "android_deviceinventory_networkadapter_identifier_ipaddressv4",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_networkadapter_identifier_macaddress",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_networkadapter_identifier_type",
            "required": false
        }
    ]
}