{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.CellularPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_cellular_singleton",
    "rootDefinitionId": "android_deviceinventory_cellular_singleton",
    "categoryId": "cd0677c6-dc57-4c96-968c-44e010da1a46",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_cellular_singleton",
    "description": null,
    "helpText": null,
    "name": "Cellular",
    "displayName": "Cellular",
    "childIds": [
        "android_deviceinventory_cellular_singleton_cellulartechnology"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "android_deviceinventory_cellular_singleton_cellulartechnology",
            "required": false
        }
    ]
}