{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Type",
        "Network Adapter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.NetworkAdapterPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_networkadapter_identifier_type",
    "rootDefinitionId": "android_deviceinventory_networkadapter_identifier",
    "categoryId": "55c55954-44a0-4b69-ac26-1c980b9b36af",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_networkadapter_identifier_type",
    "description": null,
    "helpText": null,
    "name": "Type",
    "displayName": "Type",
    "defaultOptionId": "android_deviceinventory_networkadapter_identifier_type_0",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "android_deviceinventory_networkadapter_identifier_type_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "android_deviceinventory_networkadapter_identifier",
                    "parentSettingId": "android_deviceinventory_networkadapter_identifier"
                }
            ],
            "dependedOnBy": []
        }
    ]
}