{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceCapacityBytes",
        "Device Storage"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.DeviceStoragePolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_devicestorage_singleton_devicecapacitybytes",
    "rootDefinitionId": "android_deviceinventory_devicestorage_singleton",
    "categoryId": "c9a7fc3c-2063-4a39-b09c-9d3e22ab7f2a",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_devicestorage_singleton_devicecapacitybytes",
    "description": null,
    "helpText": null,
    "name": "DeviceCapacityBytes",
    "displayName": "Device Capacity Bytes",
    "defaultOptionId": "android_deviceinventory_devicestorage_singleton_devicecapacitybytes_0",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "android_deviceinventory_devicestorage_singleton_devicecapacitybytes_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "android_deviceinventory_devicestorage_singleton",
                    "parentSettingId": "android_deviceinventory_devicestorage_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}