{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "SystemInfo",
        "System Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.SystemInfoPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_systeminfo_singleton",
    "rootDefinitionId": "android_deviceinventory_systeminfo_singleton",
    "categoryId": "527fa0bb-876a-4a9d-a0ea-313b48941fb0",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_systeminfo_singleton",
    "description": null,
    "helpText": null,
    "name": "SystemInfo",
    "displayName": "SystemInfo",
    "childIds": [
        "android_deviceinventory_systeminfo_singleton_hardwaremanufacturer",
        "android_deviceinventory_systeminfo_singleton_hardwaremodel",
        "android_deviceinventory_systeminfo_singleton_hardwareserialnumber"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "android_deviceinventory_systeminfo_singleton_hardwaremanufacturer",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_systeminfo_singleton_hardwaremodel",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_systeminfo_singleton_hardwareserialnumber",
            "required": false
        }
    ]
}