{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "OS Version"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.OsVersionPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_osversion_singleton",
    "rootDefinitionId": "android_deviceinventory_osversion_singleton",
    "categoryId": "0a2068a7-488e-4d02-beda-547071f9be20",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_osversion_singleton",
    "description": null,
    "helpText": null,
    "name": "OsVersion",
    "displayName": "OS Version",
    "childIds": [
        "android_deviceinventory_osversion_singleton_androidsecuritypatchlevel",
        "android_deviceinventory_osversion_singleton_buildversion",
        "android_deviceinventory_osversion_singleton_majorversion",
        "android_deviceinventory_osversion_singleton_minorversion",
        "android_deviceinventory_osversion_singleton_osname",
        "android_deviceinventory_osversion_singleton_osversion",
        "android_deviceinventory_osversion_singleton_patchversion"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "android_deviceinventory_osversion_singleton_androidsecuritypatchlevel",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_osversion_singleton_buildversion",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_osversion_singleton_majorversion",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_osversion_singleton_minorversion",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_osversion_singleton_osname",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_osversion_singleton_osversion",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_osversion_singleton_patchversion",
            "required": false
        }
    ]
}