{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "SimInfo",
        "Sim Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.SimInfoPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_siminfo_slotid",
    "rootDefinitionId": "android_deviceinventory_siminfo_slotid",
    "categoryId": "c55f9df1-6bbe-4e4f-90b9-d64305a899f8",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_siminfo_slotid",
    "description": null,
    "helpText": null,
    "name": "SimInfo",
    "displayName": "SimInfo",
    "childIds": [
        "android_deviceinventory_siminfo_slotid_imei",
        "android_deviceinventory_siminfo_slotid_meid",
        "android_deviceinventory_siminfo_slotid_phonenumber",
        "android_deviceinventory_siminfo_slotid_slotid",
        "android_deviceinventory_siminfo_slotid_subscribercarriernetwork"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "android_deviceinventory_siminfo_slotid_imei",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_siminfo_slotid_meid",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_siminfo_slotid_phonenumber",
            "required": false
        },
        {
            "dependedOnBy": "android_deviceinventory_siminfo_slotid_slotid",
            "required": true
        },
        {
            "dependedOnBy": "android_deviceinventory_siminfo_slotid_subscribercarriernetwork",
            "required": false
        }
    ]
}