{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OsName",
        "OS Version"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Android.OsVersionPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/android_deviceinventory_osversion_singleton_osname",
    "rootDefinitionId": "android_deviceinventory_osversion_singleton",
    "categoryId": "0a2068a7-488e-4d02-beda-547071f9be20",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "android_deviceinventory_osversion_singleton_osname",
    "description": null,
    "helpText": null,
    "name": "OsName",
    "displayName": "Os Name",
    "defaultOptionId": "android_deviceinventory_osversion_singleton_osname_0",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "android_deviceinventory_osversion_singleton_osname_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "android_deviceinventory_osversion_singleton",
                    "parentSettingId": "android_deviceinventory_osversion_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}