{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Battery"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.BatteryPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_battery_instancename",
    "rootDefinitionId": "apple_deviceinventory_battery_instancename",
    "categoryId": "aa4ab968-c4d6-4bc3-b208-505a31173629",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_battery_instancename",
    "description": null,
    "helpText": null,
    "name": "Battery",
    "displayName": "Battery",
    "childIds": [
        "apple_deviceinventory_battery_instancename_health",
        "apple_deviceinventory_battery_instancename_instancename"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_battery_instancename_health",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_battery_instancename_instancename",
            "required": true
        }
    ]
}