{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MajorVersion",
        "Os Version"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.OsVersionPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_osversion_singleton_majorversion",
    "rootDefinitionId": "apple_deviceinventory_osversion_singleton",
    "categoryId": "0a2068a7-488e-4d02-beda-547071f9be20",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_osversion_singleton_majorversion",
    "description": null,
    "helpText": null,
    "name": "MajorVersion",
    "displayName": "Major Version",
    "defaultOptionId": "apple_deviceinventory_osversion_singleton_majorversion_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_osversion_singleton_majorversion_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_osversion_singleton",
                    "parentSettingId": "apple_deviceinventory_osversion_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}