{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "AppleAutoSetupAdminAccounts",
        "Apple Auto Setup Admin Accounts"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleAutoSetupAdminAccountsPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appleautosetupadminaccounts_accountguid",
    "rootDefinitionId": "apple_deviceinventory_appleautosetupadminaccounts_accountguid",
    "categoryId": "69a43c2a-c9c3-4501-8335-c188b4ee5ea2",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appleautosetupadminaccounts_accountguid",
    "description": null,
    "helpText": null,
    "name": "AppleAutoSetupAdminAccounts",
    "displayName": "AppleAutoSetupAdminAccounts",
    "childIds": [
        "apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountguid",
        "apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountshortname"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountguid",
            "required": true
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountshortname",
            "required": false
        }
    ]
}