{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "SimInfo",
        "Sim Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.SimInfoPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_siminfo_slotid",
    "rootDefinitionId": "apple_deviceinventory_siminfo_slotid",
    "categoryId": "c55f9df1-6bbe-4e4f-90b9-d64305a899f8",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_siminfo_slotid",
    "description": null,
    "helpText": null,
    "name": "SimInfo",
    "displayName": "SIM Info",
    "childIds": [
        "apple_deviceinventory_siminfo_slotid_carriersettingsversion",
        "apple_deviceinventory_siminfo_slotid_currentcarriernetwork",
        "apple_deviceinventory_siminfo_slotid_currentmcc",
        "apple_deviceinventory_siminfo_slotid_currentmnc",
        "apple_deviceinventory_siminfo_slotid_datapreferred",
        "apple_deviceinventory_siminfo_slotid_eid",
        "apple_deviceinventory_siminfo_slotid_iccid",
        "apple_deviceinventory_siminfo_slotid_imei",
        "apple_deviceinventory_siminfo_slotid_isroaming",
        "apple_deviceinventory_siminfo_slotid_label",
        "apple_deviceinventory_siminfo_slotid_meid",
        "apple_deviceinventory_siminfo_slotid_phonenumber",
        "apple_deviceinventory_siminfo_slotid_slotid",
        "apple_deviceinventory_siminfo_slotid_subscribercarriernetwork",
        "apple_deviceinventory_siminfo_slotid_voicepreferred"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_carriersettingsversion",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_currentcarriernetwork",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_currentmcc",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_currentmnc",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_datapreferred",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_eid",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_iccid",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_imei",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_isroaming",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_label",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_meid",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_phonenumber",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_slotid",
            "required": true
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_subscribercarriernetwork",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_siminfo_slotid_voicepreferred",
            "required": false
        }
    ]
}