{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SlotId",
        "Sim Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.SimInfoPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_siminfo_slotid_slotid",
    "rootDefinitionId": "apple_deviceinventory_siminfo_slotid",
    "categoryId": "c55f9df1-6bbe-4e4f-90b9-d64305a899f8",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_siminfo_slotid_slotid",
    "description": null,
    "helpText": null,
    "name": "SlotId",
    "displayName": "Slot Id",
    "defaultOptionId": "apple_deviceinventory_siminfo_slotid_slotid_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_siminfo_slotid_slotid_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_siminfo_slotid",
                    "parentSettingId": "apple_deviceinventory_siminfo_slotid"
                }
            ],
            "dependedOnBy": []
        }
    ]
}