{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "AppleAccessibility",
        "Apple Accessibility"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleAccessibilityPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appleaccessibility_singleton",
    "rootDefinitionId": "apple_deviceinventory_appleaccessibility_singleton",
    "categoryId": "5f73326b-4995-43b8-90e4-2fd12e2a5381",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appleaccessibility_singleton",
    "description": null,
    "helpText": null,
    "name": "AppleAccessibility",
    "displayName": "Apple Accessibility",
    "childIds": [
        "apple_deviceinventory_appleaccessibility_singleton_boldtextenabled",
        "apple_deviceinventory_appleaccessibility_singleton_grayscaleenabled",
        "apple_deviceinventory_appleaccessibility_singleton_increasecontrastenabled",
        "apple_deviceinventory_appleaccessibility_singleton_reducemotionenabled",
        "apple_deviceinventory_appleaccessibility_singleton_reducetransparencyenabled",
        "apple_deviceinventory_appleaccessibility_singleton_textsize",
        "apple_deviceinventory_appleaccessibility_singleton_touchaccommodationsenabled",
        "apple_deviceinventory_appleaccessibility_singleton_voiceoverenabled",
        "apple_deviceinventory_appleaccessibility_singleton_zoomenabled"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_boldtextenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_grayscaleenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_increasecontrastenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_reducemotionenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_reducetransparencyenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_textsize",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_touchaccommodationsenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_voiceoverenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleaccessibility_singleton_zoomenabled",
            "required": false
        }
    ]
}