{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AutomaticOSInstallationEnabled",
        "Apple Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleUpdateSettingsPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appleupdatesettings_singleton_automaticosinstallationenabled",
    "rootDefinitionId": "apple_deviceinventory_appleupdatesettings_singleton",
    "categoryId": "249f1611-67ae-4b2e-9ea4-581c7eb6a3ae",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appleupdatesettings_singleton_automaticosinstallationenabled",
    "description": null,
    "helpText": null,
    "name": "AutomaticOSInstallationEnabled",
    "displayName": "Automatic OS Installation Enabled",
    "defaultOptionId": "apple_deviceinventory_appleupdatesettings_singleton_automaticosinstallationenabled_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_appleupdatesettings_singleton_automaticosinstallationenabled_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_appleupdatesettings_singleton",
                    "parentSettingId": "apple_deviceinventory_appleupdatesettings_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}