{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "NetworkAdapter",
        "Network Adapter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.NetworkAdapterPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_networkadapter_identifier",
    "rootDefinitionId": "apple_deviceinventory_networkadapter_identifier",
    "categoryId": "55c55954-44a0-4b69-ac26-1c980b9b36af",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_networkadapter_identifier",
    "description": null,
    "helpText": null,
    "name": "NetworkAdapter",
    "displayName": "NetworkAdapter",
    "childIds": [
        "apple_deviceinventory_networkadapter_identifier_identifier",
        "apple_deviceinventory_networkadapter_identifier_macaddress"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_networkadapter_identifier_identifier",
            "required": true
        },
        {
            "dependedOnBy": "apple_deviceinventory_networkadapter_identifier_macaddress",
            "required": false
        }
    ]
}