{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AccountGuid",
        "Apple Auto Setup Admin Accounts"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleAutoSetupAdminAccountsPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountguid",
    "rootDefinitionId": "apple_deviceinventory_appleautosetupadminaccounts_accountguid",
    "categoryId": "69a43c2a-c9c3-4501-8335-c188b4ee5ea2",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountguid",
    "description": null,
    "helpText": null,
    "name": "AccountGuid",
    "displayName": "Account Guid",
    "defaultOptionId": "apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountguid_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_appleautosetupadminaccounts_accountguid_accountguid_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_appleautosetupadminaccounts_accountguid",
                    "parentSettingId": "apple_deviceinventory_appleautosetupadminaccounts_accountguid"
                }
            ],
            "dependedOnBy": []
        }
    ]
}