{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Bluetooth"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.BluetoothPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_bluetooth_singleton",
    "rootDefinitionId": "apple_deviceinventory_bluetooth_singleton",
    "categoryId": "e5d6e74d-9e01-4797-b11f-6c10d0468d11",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_bluetooth_singleton",
    "description": null,
    "helpText": null,
    "name": "Bluetooth",
    "displayName": "Bluetooth",
    "childIds": [
        "apple_deviceinventory_bluetooth_singleton_macaddress"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_bluetooth_singleton_macaddress",
            "required": false
        }
    ]
}