{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "SystemInfo",
        "System Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.SystemInfoPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_systeminfo_singleton",
    "rootDefinitionId": "apple_deviceinventory_systeminfo_singleton",
    "categoryId": "527fa0bb-876a-4a9d-a0ea-313b48941fb0",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_systeminfo_singleton",
    "description": null,
    "helpText": null,
    "name": "SystemInfo",
    "displayName": "SystemInfo",
    "childIds": [
        "apple_deviceinventory_systeminfo_singleton_appleproductname",
        "apple_deviceinventory_systeminfo_singleton_applesilicon",
        "apple_deviceinventory_systeminfo_singleton_applesoftwareupdatedeviceid",
        "apple_deviceinventory_systeminfo_singleton_computername",
        "apple_deviceinventory_systeminfo_singleton_devicename",
        "apple_deviceinventory_systeminfo_singleton_hardwaremanufacturer",
        "apple_deviceinventory_systeminfo_singleton_hardwaremodel",
        "apple_deviceinventory_systeminfo_singleton_hardwareserialnumber",
        "apple_deviceinventory_systeminfo_singleton_marketingname",
        "apple_deviceinventory_systeminfo_singleton_uuid"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_appleproductname",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_applesilicon",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_applesoftwareupdatedeviceid",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_computername",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_devicename",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_hardwaremanufacturer",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_hardwaremodel",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_hardwareserialnumber",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_marketingname",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_systeminfo_singleton_uuid",
            "required": false
        }
    ]
}