{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "AppleDeviceStates",
        "Apple Device States"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleDeviceStatesPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appledevicestates_singleton",
    "rootDefinitionId": "apple_deviceinventory_appledevicestates_singleton",
    "categoryId": "acbbf3e8-17f6-4a51-b520-d4d729893092",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appledevicestates_singleton",
    "description": null,
    "helpText": null,
    "name": "AppleDeviceStates",
    "displayName": "AppleDeviceStates",
    "childIds": [
        "apple_deviceinventory_appledevicestates_singleton_activationlocksupported",
        "apple_deviceinventory_appledevicestates_singleton_awaitingconfiguration",
        "apple_deviceinventory_appledevicestates_singleton_eraseallcontentandsettingspreflight",
        "apple_deviceinventory_appledevicestates_singleton_mdmlostmodeenabled",
        "apple_deviceinventory_appledevicestates_singleton_pinrequiredfordevicelock",
        "apple_deviceinventory_appledevicestates_singleton_pinrequiredforerasedevice",
        "apple_deviceinventory_appledevicestates_singleton_supervised",
        "apple_deviceinventory_appledevicestates_singleton_supportsiosappinstalls",
        "apple_deviceinventory_appledevicestates_singleton_systemintegrityprotectionenabled"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_activationlocksupported",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_awaitingconfiguration",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_eraseallcontentandsettingspreflight",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_mdmlostmodeenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_pinrequiredfordevicelock",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_pinrequiredforerasedevice",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_supervised",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_supportsiosappinstalls",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appledevicestates_singleton_systemintegrityprotectionenabled",
            "required": false
        }
    ]
}