{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ReduceMotionEnabled",
        "Apple Accessibility"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleAccessibilityPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appleaccessibility_singleton_reducemotionenabled",
    "rootDefinitionId": "apple_deviceinventory_appleaccessibility_singleton",
    "categoryId": "5f73326b-4995-43b8-90e4-2fd12e2a5381",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appleaccessibility_singleton_reducemotionenabled",
    "description": null,
    "helpText": null,
    "name": "ReduceMotionEnabled",
    "displayName": "Reduce Motion Enabled",
    "defaultOptionId": "apple_deviceinventory_appleaccessibility_singleton_reducemotionenabled_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_appleaccessibility_singleton_reducemotionenabled_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_appleaccessibility_singleton",
                    "parentSettingId": "apple_deviceinventory_appleaccessibility_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}