{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DataRoamingEnabled",
        "Cellular"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.CellularPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_cellular_singleton_dataroamingenabled",
    "rootDefinitionId": "apple_deviceinventory_cellular_singleton",
    "categoryId": "cd0677c6-dc57-4c96-968c-44e010da1a46",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_cellular_singleton_dataroamingenabled",
    "description": null,
    "helpText": null,
    "name": "DataRoamingEnabled",
    "displayName": "Data Roaming Enabled",
    "defaultOptionId": "apple_deviceinventory_cellular_singleton_dataroamingenabled_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_cellular_singleton_dataroamingenabled_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_cellular_singleton",
                    "parentSettingId": "apple_deviceinventory_cellular_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}