{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceStorage",
        "Device Storage"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.DeviceStoragePolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_devicestorage_singleton",
    "rootDefinitionId": "apple_deviceinventory_devicestorage_singleton",
    "categoryId": "c9a7fc3c-2063-4a39-b09c-9d3e22ab7f2a",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_devicestorage_singleton",
    "description": null,
    "helpText": null,
    "name": "DeviceStorage",
    "displayName": "DeviceStorage",
    "childIds": [
        "apple_deviceinventory_devicestorage_singleton_devicecapacitybytes"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_devicestorage_singleton_devicecapacitybytes",
            "required": false
        }
    ]
}