{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Time"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.TimePolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_time_singleton",
    "rootDefinitionId": "apple_deviceinventory_time_singleton",
    "categoryId": "ba931cf1-bc49-4fa4-bc9d-33673384ec92",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_time_singleton",
    "description": null,
    "helpText": null,
    "name": "Time",
    "displayName": "Time",
    "childIds": [
        "apple_deviceinventory_time_singleton_timezone"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_time_singleton_timezone",
            "required": false
        }
    ]
}