{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Identifier",
        "Network Adapter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.NetworkAdapterPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_networkadapter_identifier_identifier",
    "rootDefinitionId": "apple_deviceinventory_networkadapter_identifier",
    "categoryId": "55c55954-44a0-4b69-ac26-1c980b9b36af",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_networkadapter_identifier_identifier",
    "description": null,
    "helpText": null,
    "name": "Identifier",
    "displayName": "Identifier",
    "defaultOptionId": "apple_deviceinventory_networkadapter_identifier_identifier_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_networkadapter_identifier_identifier_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_networkadapter_identifier",
                    "parentSettingId": "apple_deviceinventory_networkadapter_identifier"
                }
            ],
            "dependedOnBy": []
        }
    ]
}