{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "SharedIPad",
        "Shared I Pad"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.SharedIPadPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_sharedipad_singleton",
    "rootDefinitionId": "apple_deviceinventory_sharedipad_singleton",
    "categoryId": "280b445b-04a3-48e4-8fff-2bf8effd7d58",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_sharedipad_singleton",
    "description": null,
    "helpText": null,
    "name": "SharedIPad",
    "displayName": "SharedIPad",
    "childIds": [
        "apple_deviceinventory_sharedipad_singleton_estimatedresidentuserscount",
        "apple_deviceinventory_sharedipad_singleton_ismultiuser",
        "apple_deviceinventory_sharedipad_singleton_istemporarysessiononly",
        "apple_deviceinventory_sharedipad_singleton_managedappleiddefaultdomains",
        "apple_deviceinventory_sharedipad_singleton_onlineauthenticationgraceperioddays",
        "apple_deviceinventory_sharedipad_singleton_quotasizebytes",
        "apple_deviceinventory_sharedipad_singleton_residentuserscount",
        "apple_deviceinventory_sharedipad_singleton_skiplanguageandlocalesetupfornewusers",
        "apple_deviceinventory_sharedipad_singleton_temporarysessiontimeoutseconds",
        "apple_deviceinventory_sharedipad_singleton_usersessiontimeoutseconds"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_estimatedresidentuserscount",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_ismultiuser",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_istemporarysessiononly",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_managedappleiddefaultdomains",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_onlineauthenticationgraceperioddays",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_quotasizebytes",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_residentuserscount",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_skiplanguageandlocalesetupfornewusers",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_temporarysessiontimeoutseconds",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_sharedipad_singleton_usersessiontimeoutseconds",
            "required": false
        }
    ]
}