{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "InstanceName",
        "Battery"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.BatteryPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_battery_instancename_instancename",
    "rootDefinitionId": "apple_deviceinventory_battery_instancename",
    "categoryId": "aa4ab968-c4d6-4bc3-b208-505a31173629",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_battery_instancename_instancename",
    "description": null,
    "helpText": null,
    "name": "InstanceName",
    "displayName": "Instance Name",
    "defaultOptionId": "apple_deviceinventory_battery_instancename_instancename_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_battery_instancename_instancename_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_battery_instancename",
                    "parentSettingId": "apple_deviceinventory_battery_instancename"
                }
            ],
            "dependedOnBy": []
        }
    ]
}