{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "AppleUpdateSettings",
        "Apple Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleUpdateSettingsPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appleupdatesettings_singleton",
    "rootDefinitionId": "apple_deviceinventory_appleupdatesettings_singleton",
    "categoryId": "249f1611-67ae-4b2e-9ea4-581c7eb6a3ae",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appleupdatesettings_singleton",
    "description": null,
    "helpText": null,
    "name": "AppleUpdateSettings",
    "displayName": "Apple Update Settings",
    "childIds": [
        "apple_deviceinventory_appleupdatesettings_singleton_autocheckenabled",
        "apple_deviceinventory_appleupdatesettings_singleton_automaticappinstallationenabled",
        "apple_deviceinventory_appleupdatesettings_singleton_automaticosinstallationenabled",
        "apple_deviceinventory_appleupdatesettings_singleton_automaticsecurityupdatesenabled",
        "apple_deviceinventory_appleupdatesettings_singleton_backgrounddownloadenabled",
        "apple_deviceinventory_appleupdatesettings_singleton_catalogurl",
        "apple_deviceinventory_appleupdatesettings_singleton_isdefaultcatalog",
        "apple_deviceinventory_appleupdatesettings_singleton_performperiodiccheck",
        "apple_deviceinventory_appleupdatesettings_singleton_previousscandatetime",
        "apple_deviceinventory_appleupdatesettings_singleton_previousscanresult"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_autocheckenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_automaticappinstallationenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_automaticosinstallationenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_automaticsecurityupdatesenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_backgrounddownloadenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_catalogurl",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_isdefaultcatalog",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_performperiodiccheck",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_previousscandatetime",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_appleupdatesettings_singleton_previousscanresult",
            "required": false
        }
    ]
}