{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.CellularPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_cellular_singleton",
    "rootDefinitionId": "apple_deviceinventory_cellular_singleton",
    "categoryId": "cd0677c6-dc57-4c96-968c-44e010da1a46",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_cellular_singleton",
    "description": null,
    "helpText": null,
    "name": "Cellular",
    "displayName": "Cellular",
    "childIds": [
        "apple_deviceinventory_cellular_singleton_cellulartechnology",
        "apple_deviceinventory_cellular_singleton_dataroamingenabled",
        "apple_deviceinventory_cellular_singleton_hotspotenabled",
        "apple_deviceinventory_cellular_singleton_modemfirmwareversion",
        "apple_deviceinventory_cellular_singleton_networktethered"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "apple_deviceinventory_cellular_singleton_cellulartechnology",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_cellular_singleton_dataroamingenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_cellular_singleton_hotspotenabled",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_cellular_singleton_modemfirmwareversion",
            "required": false
        },
        {
            "dependedOnBy": "apple_deviceinventory_cellular_singleton_networktethered",
            "required": false
        }
    ]
}