{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TimeZone",
        "Time"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.TimePolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_time_singleton_timezone",
    "rootDefinitionId": "apple_deviceinventory_time_singleton",
    "categoryId": "ba931cf1-bc49-4fa4-bc9d-33673384ec92",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_time_singleton_timezone",
    "description": null,
    "helpText": null,
    "name": "TimeZone",
    "displayName": "Time Zone",
    "defaultOptionId": "apple_deviceinventory_time_singleton_timezone_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_time_singleton_timezone_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_time_singleton",
                    "parentSettingId": "apple_deviceinventory_time_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}