{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EraseAllContentAndSettingsPreFlight",
        "Apple Device States"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.AppleDeviceStatesPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_appledevicestates_singleton_eraseallcontentandsettingspreflight",
    "rootDefinitionId": "apple_deviceinventory_appledevicestates_singleton",
    "categoryId": "acbbf3e8-17f6-4a51-b520-d4d729893092",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_appledevicestates_singleton_eraseallcontentandsettingspreflight",
    "description": null,
    "helpText": null,
    "name": "EraseAllContentAndSettingsPreFlight",
    "displayName": "Erase All Content And Settings Pre Flight",
    "defaultOptionId": "apple_deviceinventory_appledevicestates_singleton_eraseallcontentandsettingspreflight_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_appledevicestates_singleton_eraseallcontentandsettingspreflight_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_appledevicestates_singleton",
                    "parentSettingId": "apple_deviceinventory_appledevicestates_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}