{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ResidentUsersCount",
        "Shared I Pad"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.SharedIPadPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_sharedipad_singleton_residentuserscount",
    "rootDefinitionId": "apple_deviceinventory_sharedipad_singleton",
    "categoryId": "280b445b-04a3-48e4-8fff-2bf8effd7d58",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_sharedipad_singleton_residentuserscount",
    "description": null,
    "helpText": null,
    "name": "ResidentUsersCount",
    "displayName": "Resident Users Count",
    "defaultOptionId": "apple_deviceinventory_sharedipad_singleton_residentuserscount_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_sharedipad_singleton_residentuserscount_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_sharedipad_singleton",
                    "parentSettingId": "apple_deviceinventory_sharedipad_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}