{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ComputerName",
        "System Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.Apple.SystemInfoPolicy/",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/apple_deviceinventory_systeminfo_singleton_computername",
    "rootDefinitionId": "apple_deviceinventory_systeminfo_singleton",
    "categoryId": "527fa0bb-876a-4a9d-a0ea-313b48941fb0",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "apple_deviceinventory_systeminfo_singleton_computername",
    "description": null,
    "helpText": null,
    "name": "ComputerName",
    "displayName": "Computer Name",
    "defaultOptionId": "apple_deviceinventory_systeminfo_singleton_computername_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "apple_deviceinventory_systeminfo_singleton_computername_0",
            "description": "",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "apple_deviceinventory_systeminfo_singleton",
                    "parentSettingId": "apple_deviceinventory_systeminfo_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}