{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Encryptable Volume"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_encryptablevolume_volumeid",
    "rootDefinitionId": "windows_deviceinventory_encryptablevolume_volumeid",
    "categoryId": "5d4c25cb-4e9f-4a64-91e9-2ea270b49b02",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_encryptablevolume_volumeid",
    "description": null,
    "helpText": null,
    "name": "EncryptableVolume",
    "displayName": "Encryptable Volume",
    "childIds": [
        "windows_deviceinventory_encryptablevolume_volumeid_encryptionmethod",
        "windows_deviceinventory_encryptablevolume_volumeid_encryptionpercentage",
        "windows_deviceinventory_encryptablevolume_volumeid_locked",
        "windows_deviceinventory_encryptablevolume_volumeid_persistentvolumeid",
        "windows_deviceinventory_encryptablevolume_volumeid_protectionstatus",
        "windows_deviceinventory_encryptablevolume_volumeid_volumeid",
        "windows_deviceinventory_encryptablevolume_volumeid_windowsdriveletter"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_encryptablevolume_volumeid_encryptionmethod",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_encryptablevolume_volumeid_encryptionpercentage",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_encryptablevolume_volumeid_locked",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_encryptablevolume_volumeid_persistentvolumeid",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_encryptablevolume_volumeid_protectionstatus",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_encryptablevolume_volumeid_volumeid",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_encryptablevolume_volumeid_windowsdriveletter",
            "required": false
        }
    ]
}