{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "OS Version"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_osversion_singleton",
    "rootDefinitionId": "windows_deviceinventory_osversion_singleton",
    "categoryId": "0a2068a7-488e-4d02-beda-547071f9be20",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_osversion_singleton",
    "description": null,
    "helpText": null,
    "name": "OsVersion",
    "displayName": "OS Version",
    "childIds": [
        "windows_deviceinventory_osversion_singleton_architecture",
        "windows_deviceinventory_osversion_singleton_buildversion",
        "windows_deviceinventory_osversion_singleton_installdatetime",
        "windows_deviceinventory_osversion_singleton_majorversion",
        "windows_deviceinventory_osversion_singleton_minorversion",
        "windows_deviceinventory_osversion_singleton_osname",
        "windows_deviceinventory_osversion_singleton_osversion",
        "windows_deviceinventory_osversion_singleton_patchversion"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_architecture",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_buildversion",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_installdatetime",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_majorversion",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_minorversion",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_osname",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_osversion",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_osversion_singleton_patchversion",
            "required": false
        }
    ]
}