{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "SimInfo",
        "Sim Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_siminfo_windowsesimid",
    "rootDefinitionId": "windows_deviceinventory_siminfo_windowsesimid",
    "categoryId": "c55f9df1-6bbe-4e4f-90b9-d64305a899f8",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_siminfo_windowsesimid",
    "description": null,
    "helpText": null,
    "name": "SimInfo",
    "displayName": "SimInfo",
    "childIds": [
        "windows_deviceinventory_siminfo_windowsesimid_eid",
        "windows_deviceinventory_siminfo_windowsesimid_isactive",
        "windows_deviceinventory_siminfo_windowsesimid_windowsesimid"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_siminfo_windowsesimid_eid",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_siminfo_windowsesimid_isactive",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_siminfo_windowsesimid_windowsesimid",
            "required": true
        }
    ]
}