{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Memory Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_memoryinfo_singleton",
    "rootDefinitionId": "windows_deviceinventory_memoryinfo_singleton",
    "categoryId": "9837d02f-9f1c-47af-b561-665286833706",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_memoryinfo_singleton",
    "description": null,
    "helpText": null,
    "name": "MemoryInfo",
    "displayName": "Memory Info",
    "childIds": [
        "windows_deviceinventory_memoryinfo_singleton_physicalmemorytotalbytes",
        "windows_deviceinventory_memoryinfo_singleton_virtualmemorytotalbytes"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_memoryinfo_singleton_physicalmemorytotalbytes",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_memoryinfo_singleton_virtualmemorytotalbytes",
            "required": false
        }
    ]
}