{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Tpm"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_tpm_singleton",
    "rootDefinitionId": "windows_deviceinventory_tpm_singleton",
    "categoryId": "b25aefe8-f310-465d-8fb6-4d0a106b429a",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_tpm_singleton",
    "description": null,
    "helpText": null,
    "name": "Tpm",
    "displayName": "TPM",
    "childIds": [
        "windows_deviceinventory_tpm_singleton_activated",
        "windows_deviceinventory_tpm_singleton_enabled",
        "windows_deviceinventory_tpm_singleton_manufacturer",
        "windows_deviceinventory_tpm_singleton_manufacturerid",
        "windows_deviceinventory_tpm_singleton_manufacturerversion",
        "windows_deviceinventory_tpm_singleton_owned",
        "windows_deviceinventory_tpm_singleton_physicalpresenceversion",
        "windows_deviceinventory_tpm_singleton_productname",
        "windows_deviceinventory_tpm_singleton_specversion"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_activated",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_enabled",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_manufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_manufacturerid",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_manufacturerversion",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_owned",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_physicalpresenceversion",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_productname",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_tpm_singleton_specversion",
            "required": false
        }
    ]
}