{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Bios Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_biosinfo_composite",
    "rootDefinitionId": "windows_deviceinventory_biosinfo_composite",
    "categoryId": "049fe7fc-2614-4ff7-a666-3ccf2fa2968c",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_biosinfo_composite",
    "description": null,
    "helpText": null,
    "name": "BiosInfo",
    "displayName": "Bios Info",
    "childIds": [
        "windows_deviceinventory_biosinfo_composite_biosname",
        "windows_deviceinventory_biosinfo_composite_manufacturer",
        "windows_deviceinventory_biosinfo_composite_releasedatetime",
        "windows_deviceinventory_biosinfo_composite_serialnumber",
        "windows_deviceinventory_biosinfo_composite_smbiosversion",
        "windows_deviceinventory_biosinfo_composite_softwareelementid",
        "windows_deviceinventory_biosinfo_composite_softwareelementstate",
        "windows_deviceinventory_biosinfo_composite_targetoperatingsystem"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_biosname",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_manufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_releasedatetime",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_serialnumber",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_smbiosversion",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_softwareelementid",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_softwareelementstate",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_biosinfo_composite_targetoperatingsystem",
            "required": true
        }
    ]
}