{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Enclosure"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_systemenclosure_serialnumber",
    "rootDefinitionId": "windows_deviceinventory_systemenclosure_serialnumber",
    "categoryId": "1759e7f5-4d10-431e-8073-0f400d5daf15",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_systemenclosure_serialnumber",
    "description": null,
    "helpText": null,
    "name": "SystemEnclosure",
    "displayName": "System Enclosure",
    "childIds": [
        "windows_deviceinventory_systemenclosure_serialnumber_audiblealarmequipped",
        "windows_deviceinventory_systemenclosure_serialnumber_breachdescription",
        "windows_deviceinventory_systemenclosure_serialnumber_chassistypes",
        "windows_deviceinventory_systemenclosure_serialnumber_extendeddescription",
        "windows_deviceinventory_systemenclosure_serialnumber_lockequipped",
        "windows_deviceinventory_systemenclosure_serialnumber_manufacturer",
        "windows_deviceinventory_systemenclosure_serialnumber_model",
        "windows_deviceinventory_systemenclosure_serialnumber_securitybreach",
        "windows_deviceinventory_systemenclosure_serialnumber_serialnumber",
        "windows_deviceinventory_systemenclosure_serialnumber_sku",
        "windows_deviceinventory_systemenclosure_serialnumber_smbiosassettag",
        "windows_deviceinventory_systemenclosure_serialnumber_status",
        "windows_deviceinventory_systemenclosure_serialnumber_visiblealarmequipped"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_audiblealarmequipped",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_breachdescription",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_chassistypes",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_extendeddescription",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_lockequipped",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_manufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_model",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_securitybreach",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_serialnumber",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_sku",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_smbiosassettag",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_status",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systemenclosure_serialnumber_visiblealarmequipped",
            "required": false
        }
    ]
}