{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Disk Drive"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_diskdrive_driveid",
    "rootDefinitionId": "windows_deviceinventory_diskdrive_driveid",
    "categoryId": "c1812282-d637-4565-9105-6ccad9166f98",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_diskdrive_driveid",
    "description": null,
    "helpText": null,
    "name": "DiskDrive",
    "displayName": "Disk Drive",
    "childIds": [
        "windows_deviceinventory_diskdrive_driveid_description",
        "windows_deviceinventory_diskdrive_driveid_diskname",
        "windows_deviceinventory_diskdrive_driveid_driveid",
        "windows_deviceinventory_diskdrive_driveid_driveindex",
        "windows_deviceinventory_diskdrive_driveid_interfacetype",
        "windows_deviceinventory_diskdrive_driveid_manufacturer",
        "windows_deviceinventory_diskdrive_driveid_model",
        "windows_deviceinventory_diskdrive_driveid_partitioncount",
        "windows_deviceinventory_diskdrive_driveid_pnpdeviceid",
        "windows_deviceinventory_diskdrive_driveid_serialnumber",
        "windows_deviceinventory_diskdrive_driveid_sizebytes"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_description",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_diskname",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_driveid",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_driveindex",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_interfacetype",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_manufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_model",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_partitioncount",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_pnpdeviceid",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_serialnumber",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_diskdrive_driveid_sizebytes",
            "required": false
        }
    ]
}