{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Windows Qfe"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_windowsqfe_hotfixid",
    "rootDefinitionId": "windows_deviceinventory_windowsqfe_hotfixid",
    "categoryId": "04f195b2-9165-4b54-9963-7aeb9b2a548a",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_windowsqfe_hotfixid",
    "description": null,
    "helpText": null,
    "name": "WindowsQfe",
    "displayName": "Windows QFE",
    "childIds": [
        "windows_deviceinventory_windowsqfe_hotfixid_caption",
        "windows_deviceinventory_windowsqfe_hotfixid_computername",
        "windows_deviceinventory_windowsqfe_hotfixid_fixcomments",
        "windows_deviceinventory_windowsqfe_hotfixid_hotfixid",
        "windows_deviceinventory_windowsqfe_hotfixid_installedbyuseraccount",
        "windows_deviceinventory_windowsqfe_hotfixid_installeddate",
        "windows_deviceinventory_windowsqfe_hotfixid_qfedescription"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_windowsqfe_hotfixid_caption",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_windowsqfe_hotfixid_computername",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_windowsqfe_hotfixid_fixcomments",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_windowsqfe_hotfixid_hotfixid",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_windowsqfe_hotfixid_installedbyuseraccount",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_windowsqfe_hotfixid_installeddate",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_windowsqfe_hotfixid_qfedescription",
            "required": false
        }
    ]
}