{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cpu"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_cpu_processorid",
    "rootDefinitionId": "windows_deviceinventory_cpu_processorid",
    "categoryId": "fb57a834-ff26-470c-b5cc-120ed73baadf",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_cpu_processorid",
    "description": null,
    "helpText": null,
    "name": "Cpu",
    "displayName": "CPU",
    "childIds": [
        "windows_deviceinventory_cpu_processorid_addresswidth",
        "windows_deviceinventory_cpu_processorid_architecture",
        "windows_deviceinventory_cpu_processorid_corecount",
        "windows_deviceinventory_cpu_processorid_cpustatus",
        "windows_deviceinventory_cpu_processorid_logicalprocessorcount",
        "windows_deviceinventory_cpu_processorid_manufacturer",
        "windows_deviceinventory_cpu_processorid_maxclockspeed",
        "windows_deviceinventory_cpu_processorid_model",
        "windows_deviceinventory_cpu_processorid_processorid",
        "windows_deviceinventory_cpu_processorid_processortype",
        "windows_deviceinventory_cpu_processorid_socketdesignation"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_addresswidth",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_architecture",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_corecount",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_cpustatus",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_logicalprocessorcount",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_manufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_maxclockspeed",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_model",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_processorid",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_processortype",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_cpu_processorid_socketdesignation",
            "required": false
        }
    ]
}