{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Battery"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_battery_instancename",
    "rootDefinitionId": "windows_deviceinventory_battery_instancename",
    "categoryId": "aa4ab968-c4d6-4bc3-b208-505a31173629",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_battery_instancename",
    "description": null,
    "helpText": null,
    "name": "Battery",
    "displayName": "Battery",
    "childIds": [
        "windows_deviceinventory_battery_instancename_cyclecount",
        "windows_deviceinventory_battery_instancename_designedcapacity",
        "windows_deviceinventory_battery_instancename_fullchargedcapacity",
        "windows_deviceinventory_battery_instancename_instancename",
        "windows_deviceinventory_battery_instancename_manufacturer",
        "windows_deviceinventory_battery_instancename_model",
        "windows_deviceinventory_battery_instancename_serialnumber"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_battery_instancename_cyclecount",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_battery_instancename_designedcapacity",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_battery_instancename_fullchargedcapacity",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_battery_instancename_instancename",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_battery_instancename_manufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_battery_instancename_model",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_battery_instancename_serialnumber",
            "required": false
        }
    ]
}