{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Adapter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_networkadapter_identifier",
    "rootDefinitionId": "windows_deviceinventory_networkadapter_identifier",
    "categoryId": "55c55954-44a0-4b69-ac26-1c980b9b36af",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_networkadapter_identifier",
    "description": null,
    "helpText": null,
    "name": "NetworkAdapter",
    "displayName": "Network Adapter",
    "childIds": [
        "windows_deviceinventory_networkadapter_identifier_identifier",
        "windows_deviceinventory_networkadapter_identifier_manufacturer",
        "windows_deviceinventory_networkadapter_identifier_type"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_networkadapter_identifier_identifier",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_networkadapter_identifier_manufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_networkadapter_identifier_type",
            "required": false
        }
    ]
}