{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_systeminfo_singleton",
    "rootDefinitionId": "windows_deviceinventory_systeminfo_singleton",
    "categoryId": "527fa0bb-876a-4a9d-a0ea-313b48941fb0",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_systeminfo_singleton",
    "description": null,
    "helpText": null,
    "name": "SystemInfo",
    "displayName": "System Info",
    "childIds": [
        "windows_deviceinventory_systeminfo_singleton_computername",
        "windows_deviceinventory_systeminfo_singleton_dnsdomain",
        "windows_deviceinventory_systeminfo_singleton_fqdnhostname",
        "windows_deviceinventory_systeminfo_singleton_hardwaremanufacturer",
        "windows_deviceinventory_systeminfo_singleton_hardwaremodel",
        "windows_deviceinventory_systeminfo_singleton_hardwareserialnumber",
        "windows_deviceinventory_systeminfo_singleton_hostname",
        "windows_deviceinventory_systeminfo_singleton_physicalprocessorcount",
        "windows_deviceinventory_systeminfo_singleton_processorarchitecture",
        "windows_deviceinventory_systeminfo_singleton_uuid",
        "windows_deviceinventory_systeminfo_singleton_windowsdomain",
        "windows_deviceinventory_systeminfo_singleton_windowsdomainrole"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_computername",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_dnsdomain",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_fqdnhostname",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_hardwaremanufacturer",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_hardwaremodel",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_hardwareserialnumber",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_hostname",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_physicalprocessorcount",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_processorarchitecture",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_uuid",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_windowsdomain",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_systeminfo_singleton_windowsdomainrole",
            "required": false
        }
    ]
}