{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Logical Drive"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_logicaldrive_driveidentifier",
    "rootDefinitionId": "windows_deviceinventory_logicaldrive_driveidentifier",
    "categoryId": "abfa98bf-0e1a-42c6-beac-727f1f7825a3",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_logicaldrive_driveidentifier",
    "description": null,
    "helpText": null,
    "name": "LogicalDrive",
    "displayName": "Logical Drive",
    "childIds": [
        "windows_deviceinventory_logicaldrive_driveidentifier_diskdescription",
        "windows_deviceinventory_logicaldrive_driveidentifier_disksizebytes",
        "windows_deviceinventory_logicaldrive_driveidentifier_driveidentifier",
        "windows_deviceinventory_logicaldrive_driveidentifier_drivetype",
        "windows_deviceinventory_logicaldrive_driveidentifier_filesystem"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_logicaldrive_driveidentifier_diskdescription",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_logicaldrive_driveidentifier_disksizebytes",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_logicaldrive_driveidentifier_driveidentifier",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_logicaldrive_driveidentifier_drivetype",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_logicaldrive_driveidentifier_filesystem",
            "required": false
        }
    ]
}