{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Video Controller"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_videocontroller_identifier",
    "rootDefinitionId": "windows_deviceinventory_videocontroller_identifier",
    "categoryId": "121d1f53-6ef5-4cf9-b85d-a5f4bf825f85",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_videocontroller_identifier",
    "description": null,
    "helpText": null,
    "name": "VideoController",
    "displayName": "Video Controller",
    "childIds": [
        "windows_deviceinventory_videocontroller_identifier_adapterdactype",
        "windows_deviceinventory_videocontroller_identifier_adapterrambytes",
        "windows_deviceinventory_videocontroller_identifier_currentscanmode",
        "windows_deviceinventory_videocontroller_identifier_graphicscardmodel",
        "windows_deviceinventory_videocontroller_identifier_identifier",
        "windows_deviceinventory_videocontroller_identifier_videomodedescription"
    ],
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "windows_deviceinventory_videocontroller_identifier_adapterdactype",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_videocontroller_identifier_adapterrambytes",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_videocontroller_identifier_currentscanmode",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_videocontroller_identifier_graphicscardmodel",
            "required": false
        },
        {
            "dependedOnBy": "windows_deviceinventory_videocontroller_identifier_identifier",
            "required": true
        },
        {
            "dependedOnBy": "windows_deviceinventory_videocontroller_identifier_videomodedescription",
            "required": false
        }
    ]
}