{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DnsDomain",
        "System Info"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/OpenExtensibilitySettings/InventoryAdaptor/windows_deviceinventory_systeminfo_singleton_dnsdomain",
    "rootDefinitionId": "windows_deviceinventory_systeminfo_singleton",
    "categoryId": "527fa0bb-876a-4a9d-a0ea-313b48941fb0",
    "settingUsage": "inventory",
    "uxBehavior": "default",
    "visibility": "inventoryCatalog",
    "riskLevel": "low",
    "id": "windows_deviceinventory_systeminfo_singleton_dnsdomain",
    "description": null,
    "helpText": null,
    "name": "DnsDomain",
    "displayName": "Dns Domain",
    "defaultOptionId": "windows_deviceinventory_systeminfo_singleton_dnsdomain_24",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "extensibility",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "windows_deviceinventory_systeminfo_singleton_dnsdomain_24",
            "description": "",
            "helpText": null,
            "name": "Refresh_Rate_24_Hours",
            "displayName": "Refresh every 24 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [
                {
                    "dependentOn": "windows_deviceinventory_systeminfo_singleton",
                    "parentSettingId": "windows_deviceinventory_systeminfo_singleton"
                }
            ],
            "dependedOnBy": []
        }
    ]
}