[
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "0090f8cd-60d5-4e58-9ceb-b3860b71872b",
        "changeItemService": "other",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/microsoft-identity-manager/mim-azure-monitor-reporting"
        ],
        "shortDescription": "",
        "title": "Deprecation of Microsoft Identity Manager (MIM) hybrid reporting to Microsoft Entra audit log feature",
        "description": "The MIM hybrid reporting feature, introduced with Microsoft Identity Manager (MIM) 2016, is being deprecated. This feature allowed the MIM hybrid reporting agent to send event logs from the MIM service to Microsoft Entra, enabling reports for password reset using self-service password reset (SSPR) and self-service group management (SSGM) in the Microsoft Entra audit log. This is replaced by using Azure Arc agent to send those event logs to Azure Monitor as this allows more flexible reports. As of November 2025, the cloud endpoints used by the MIM hybrid reporting agent will no longer be available, and customers should transition to Azure Monitor or similar. Other MIM and Entra ID Connect Health capabilities are unaffected by this deprecation.",
        "announcementDateTime": "2024-11-19T01:00:00Z",
        "targetDateTime": "2025-11-01T23:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "0146c01e-02c1-47a7-ad5b-8458a9351f95",
        "changeItemService": "reporting",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://entra.microsoft.com/#view/Microsoft_AAD_DXP/ScenarioHealthSummary.ReactView"
        ],
        "shortDescription": "",
        "title": "SLA Attainment Report at Tenant Level",
        "description": "In addition to providing global SLA performance, Microsoft Entra ID reports tenant-level SLA performance for organizations with at least 5,000 monthly active users. This feature entered general availability in May 2024. The Service Level Agreement (SLA) sets a minimum bar of 99.99% for the availability of Microsoft Entra ID user authentication, reported on a monthly basis in the Microsoft Entra admin center. For more information, see Learn about Microsoft Entra Health - Microsoft Entra ID | Microsoft Learn .",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "monitoringReporting",
        "publishedDateTime": "2024-06-24T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "01d1ef67-c06b-44df-85c0-923db2350070",
        "changeItemService": "msGraph",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://aka.ms/entrapsdocs"
        ],
        "shortDescription": "Helps you manage and automate Microsoft Entra product family resources programmatically",
        "title": "Microsoft Entra PowerShell Module",
        "description": "The Microsoft Entra PowerShell module is a a new high-quality and scenario-focused command-line tool that allows administrators to manage and automate Microsoft Entra product family resources programmatically. This includes efficiently managing users, groups, applications, service principals, policies, and more. The module builds upon and is part of the Microsoft Graph PowerShell SDK and is fully interoperable with all cmdlets in the Microsoft Graph PowerShell SDK, enabling you to perform complex operations with simple, well documented commands. The module also offers a backward compatibility option with the deprecated AzureAD Module to accelerate migration. Entra PowerShell supports PowerShell version 5.1 and version 7+.",
        "changeItemState": "comingSoon",
        "deliveryStage": "publicPreview",
        "category": "developerExperience",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "01ec4ab4-e288-4e1c-8f8c-d5b0bc68b866",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/important-update-azure-ad-graph-api-retirement/ba-p/4090534"
        ],
        "shortDescription": "Latest update on migrating your applications from Azure AD Graph to Microsoft Graph",
        "title": "Migrate your apps to Microsoft Graph API",
        "description": "In June of 2023, we shared an update on completion of a three-year notice period for the deprecation of the Azure AD Graph API service. The service is now in the retirement cycle and retirement (shut down) will be done with incremental stages. In the first stage of this retirement cycle, applications that are created after June 30, 2024, will receive an error (HTTP 403) for any requests to Azure AD Graph APIs ( https://graph.windows.net ). \n \n We understand that some apps may not have fully completed migration to Microsoft Graph. We are providing an optional configuration that will allow an application created after June 30, 2024, to resume use of Azure AD Graph APIs through June 2025. If you develop or distribute software that requires applications to be created as part of the installation or setup, and these applications will need to access Azure AD Graph APIs, you must prepare now to avoid interruption. \n \n We have recently begun rollout of Microsoft Entra recommendations to help monitor the status of your tenant, plus provide information about applications and service principals that are using Azure AD Graph APIs in your tenant. These new recommendations provide information to support your efforts to migrate the impacted applications and service principals to Microsoft Graph. \n \n For more information on Azure AD Graph retirement, the new recommendations for Azure AD Graph, and configuring applications created after June 30, 2024, for an extension of Azure AD Graph APIs, please click 'Learn more' below.",
        "announcementDateTime": "2020-06-23T00:00:00Z",
        "targetDateTime": "2024-06-30T00:00:00Z",
        "impactLink": null,
        "changeType": "retirement",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "04434d47-c952-4a38-9589-ee98ca935a90",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/customers/how-to-custom-oidc-federation-customers"
        ],
        "shortDescription": "",
        "title": "Custom OIDC External Identity Provider Support in Microsoft Entra External ID",
        "description": "By setting up federation with a custom-configured OpenID Connect (OIDC) identity provider, you enable users to sign up and sign in to your applications using their existing accounts from the federated external provider. This OIDC federation allows authentication with various providers that adhere to the OpenID Connect protocol.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "b2BB2C",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "05434667-2abe-41e5-b800-91380999bcee",
        "changeItemService": "conditionalAccess",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/devices/concept-device-registration"
        ],
        "shortDescription": "",
        "title": "Device based conditional access to M365/Azure resources on Red Hat Enterprise Linux",
        "description": "Since October of 2022, users on Ubuntu Desktop 20.04 LTS & Ubuntu 22.04 LTS with Microsoft Edge browser could register their devices with Entra ID, enroll into Intune management, and securely access corporate resources using device-based Conditional Access policies. \n \n This release extends support to Red Hat Enterprise Linux 8.x and 9.x (LTS) which makes these capabilities possible: \n \n - Entra ID registration & enrollment of RedHat LTS (8/9) desktops. \n \n - Conditional Access policies protecting web applications via Microsoft Edge. \n \n - Provides SSO for native & web applications (ex: Azure CLI, Edge Browser, Teams PWA, etc.) to access M365/Azure protected resources. \n \n - Standard Intune compliance policies. \n \n - Support for Bash scripts with custom compliance policies. \n \n - Package Manager now supports RHEL \"RPM\" packages in addition to Debian \"DEB\" packages.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "sso",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "06f6bbba-e494-494d-a13e-0e1da1dbcadd",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/app-service/scenario-secure-app-authentication-app-service?toc=%2fentra%2fexternal-id%2ftoc.json&amp;bc=%2fentra%2fexternal-id%2fbreadcrumb%2ftoc.json&amp;tabs=external-configuration"
        ],
        "shortDescription": "",
        "title": "Easy authentication with Azure App Service and Microsoft Entra External ID",
        "description": "An improved experience when using Microsoft Entra External ID as an identity provider for Azure App Service’s built-in authentication, simplifying the process of configuring authentication and authorization for external-facing apps. You can complete initial configuration directly from the App Service authentication setup without switching into the external tenant.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "b2BB2C",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "07b14b21-7ea4-40d0-a366-748ce4f857f5",
        "changeItemService": "reporting",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://entra.microsoft.com/#view/Microsoft_AAD_DXP/ScenarioHealthSummary.ReactView"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra Health Monitoring Signals in General Availability (GA)",
        "description": "Microsoft Entra health monitoring, available from the Health blade, includes a set of low-latency pre-computed health metrics that can be used to monitor the health of critical user scenarios in your tenant. The first set of health scenarios includes MFA, CA-compliant devices, CA-managed devices, and SAML authentications. This set of monitorable scenarios will grow over time.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "monitoringReporting",
        "publishedDateTime": "2024-11-19T23:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "084a229a-5e12-4920-949a-c462ed0fad3c",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/tutorial-mover-custom-workflow-portal"
        ],
        "shortDescription": "",
        "title": "Configure custom workflows to run mover tasks when a user's job profile changes",
        "description": "Lifecycle Workflows now supports the ability to trigger workflows based on job change events like changes to an employee's department, job role, or location and see them executed on the workflow schedule. With this feature, customers can leverage new workflow triggers to create custom workflows for their executing tasks associated with employees moving within the organization including: \n -Trigger workflows when a specified attribute changes. \n -Triggering workflows when a user is added or removed from a group's membership. \n -Tasks to notify a user's manager about a move. \n -Task to assign licenses or remove selected licenses from a user.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identityGovernance",
        "publishedDateTime": "2024-04-27T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "08a8a373-df56-4c8c-b0ca-7f2a63ca3e46",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/workload-id/workload-identities-flexible-federated-identity-credentials?tabs=github"
        ],
        "shortDescription": "",
        "title": "Flexible Federated Identity Credentials",
        "description": "Flexible Federated Identity Credentials (FIC) extend the existing Federated Identity Credential model by providing the ability to use wildcard matching against certain claims. Currently available for GitHub, GitLab, and Terraform Cloud scenarios, this functionality can be used to lower the total number of FIC's required to managed similar scenarios.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "developerExperience",
        "publishedDateTime": "2025-02-03T10:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "0a016919-eabb-4512-8bf5-6a8d33c6f573",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/manage-workflow-custom-security-attribute"
        ],
        "shortDescription": "",
        "title": "Configure Lifecycle Workflow Scope Using Custom Security Attributes",
        "description": "Now customers can leverage their confidential HR data stored in custom security attributes in addition to other attributes to define the scope of their workflows in Lifecycle Workflows for automating joiner, mover, and leaver scenarios.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-08-29T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "0c3aca82-2e2c-41f4-acda-5af5b2dca7d1",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [
            "entra_change_announcements_90days"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/migrate-azure-ad-graph-overview"
        ],
        "shortDescription": "",
        "title": "Important Update: Azure AD Graph Retirement - Sept 2024",
        "description": "The retirement of the Azure AD Graph API service began on 1 September 2024 and will eventually impact both new and existing applications. As we deploy the phase starting over the coming weeks, new applications will not be able to use Azure AD Graph APIs unless they are configured for extended access. Microsoft Graph is the replacement for Azure AD Graph APIs, and we strongly recommend immediately migrating use of Azure AD Graph APIs to Microsoft Graph and limiting any further development using Azure AD Graph APIs. \n \n Required action - To avoid service disruptions, please follow our instructions to migrate applications to Microsoft Graph APIs. \n   \n If you need to extend Azure AD Graph access for an app to July 2025  \n \n If you have not fully completed app migrations to Microsoft Graph, you can extend this retirement. If you set the blockAzureADGraphAccess attribute to false in the application’s authenticationBehaviors configuration, the application will be able to use Azure AD Graph APIs through June 30, 2025. Further documentation can be found here.   \n \n New applications will receive a 403 error when attempting to access Azure AD Graph APIs unless this setting is set to false. For existing applications that will not complete migration to Microsoft Graph in 2024, you should plan to set this configuration now. \n \n If you need to find Applications in your tenant using Azure AD Graph APIs  \n \n The Microsoft Entra recommendations feature provides recommendations to put your tenant in a secure and healthy state, while also helping you maximize the value of the features available in Entra ID.     \n \n We’ve provided two Entra recommendations that show information about applications and service principals that are actively using Azure AD Graph APIs in your tenant. These new recommendations can support your efforts to identify and migrate the impacted applications and service principals to Microsoft Graph.",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2025-07-01T00:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "0d17a065-f34c-4954-9a0a-2f9b45c5c166",
        "changeItemService": "entitlementManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/permissions-reference#organizational-branding-administrator"
        ],
        "shortDescription": "",
        "title": "Organizational Branding role for Entra ID Company Branding",
        "description": "The new Organizational Branding Administrator privileges are limited to branding, allowing you to adhere to the principle of least privilege by eliminating the need for the Global Administrator role to configure branding.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "accessControl",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "0e39b277-7440-4c8c-ae03-9bdc6d6fddf4",
        "changeItemService": "rbac",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/role-based-access-control/elevate-access-global-admin?tabs=azure-portal%2centra-audit-logs#view-elevate-access-log-entries"
        ],
        "shortDescription": "",
        "title": "Elevate Access events are now exportable via Entra Audit Logs ",
        "description": "This feature enables administrators to export and stream Elevate Access events to both first-party and third-party SIEM solutions via Entra Audit logs. It enhances detection and improves logging capabilities, allowing visibility into who in their tenant has utilized Elevate Access.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "monitoringReporting",
        "publishedDateTime": "2025-02-03T10:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "0f67ab5c-0a5c-4ad5-ae3d-13c42bb0427d",
        "changeItemService": "reporting",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/monitoring-health/concept-sign-ins"
        ],
        "shortDescription": "",
        "title": "General Availability - Improving visibility into downstream tenant sign-ins",
        "description": "Microsoft Security wants to ensure that all customers are aware of how to notice when a partner is accessing a downstream tenant's resources. Interactive sign-in logs currently provide a list of login events, but there is no clear indication of which logins are from partners accessing downstream tenant resources. For example, when reviewing the logs, you may see a series of events, but without any additional context, it’s difficult to tell whether these logins are from a partner accessing another tenant’s data. \n \n Here is a list of steps that one can take to clarify which logins are associated with partner tenants: \n \n 1. Take note of the \"ServiceProvider\" value in the CrossTenantAccessType column: \n -This filter can be applied to refine the log data. When activated, it will immediately isolate events related to partner logins. \n 2. Utilize the \"Home Tenant ID\" and \"Resource Tenant ID\" Columns: \n -These two columns will directly identify logins coming from the partner’s tenant to a downstream tenant. \n \n \n After seeing a partner logging into a downstream tenant’s resources, an important follow-up activity to perform is to validate the activities that might have occurred in the downstream environment. \n Some examples of logs to look at are Entra Audit logs for Entra ID events, M365 Unified Audit Log (UAL) for M365 and Entra ID events, and/or the Azure Monitor activity log for Azure events. By following these steps, you will be able to clearly identify when a partner is logging into a downstream tenant’s resources and subsequent activity in the environment, enhancing your ability to manage and monitor cross-tenant access efficiently. \n \n To increase visibility into the aforementioned columns, Entra will begin enabling these columns to display by default when loading the sign-in logs UX starting on 3/7/25",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "monitoringReporting",
        "publishedDateTime": "2025-02-07T11:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "1110ddc9-28eb-4a75-bc15-26026728af15",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/lifecycle-workflow-insights"
        ],
        "shortDescription": "",
        "title": "Workflow History Insights in Lifecycle Workflows",
        "description": "With this feature, you can now monitor workflow health and get insights across all your workflows in Lifecycle Workflows including viewing workflow processing data across workflows, tasks, and workflow categories.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-08-29T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "12957100-928c-49dd-b20c-8be97b8d1dfa",
        "changeItemService": "groupManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/users/groups-dynamic-membership#rule-builder-in-the-azure-portal"
        ],
        "shortDescription": "",
        "title": "Changes to Dynamic Group Rule Builder",
        "description": "To encourage efficient dynamic group rules, the dynamic group rule builder UX in both Entra and Intune Admin Centers has been updated. As of July 2024, the 'match' and 'notMatch' operators have been removed from the rule builder because they are less efficient and should only be used when absolutely necessary. However, we want to assure you that these operators are still supported by the API and can be written into rules via the text box in both admin centers.",
        "announcementDateTime": "2024-03-31T23:00:00Z",
        "targetDateTime": "2024-07-01T07:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "14ac6a36-8eda-4186-a17c-594e92c5f685",
        "changeItemService": "other",
        "tags": [
            "Network Access/ SSE"
        ],
        "systemTags": [
            "entra_change_announcements_90days"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/global-secure-access/overview-what-is-global-secure-access#licensing-overview"
        ],
        "shortDescription": "",
        "title": "Upcoming license enforcement for Microsoft Entra Internet Access and Microsoft Entra Private Access",
        "description": "Starting early October 2024, license enforcement will begin in the Microsoft Entra admin center, for Microsoft Entra Internet Access and Microsoft Entra Private Access. This is following a 90-day notification period, starting with the General Availability of Internet Access and Private Access, which began in June 2024.",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2024-10-02T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "155b9fb4-ca53-4ff2-8b1d-bd49968b9460",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/permissions-management/"
        ],
        "shortDescription": "",
        "title": "Support for PIM enabled Groups in Microsoft Entra Permissions Management",
        "description": "Privileged Identity Management (PIM) for Groups in Microsoft Entra ID allows admins to grant users just-in-time membership and ownership of a security group or a Microsoft 365 group. Nested groups are also supported by PIM. For example, if a user is an active member of Group A, and Group A is an eligible member of Group B, the user can activate their membership in Group B. PIM provides a powerful mechanism to manage access and enhance security by granting just-in-time access to critical resources. \n \n Microsoft Entra Permissions Management adds the support to read the just-in-time membership along with existing support for direct group membership. It solves the challenge of having visibility into who has access to what resource with eligible and direct role assignments. The feature enables the complete visibility into RBAC permissions assigned to the identities in different ways and potential impact on Permissions Creep Index (PCI). A complete list of RBAC role assignments which are provisioned directly, via the group membership, or by an eligible group member can be seen per identity under the Analytics tab.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "permissionsManagement",
        "publishedDateTime": "2024-06-03T01:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "16e91380-43b0-4126-8aff-c399ab20b6bc",
        "changeItemService": "microsoftAuthenticatorApp",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-enable-authenticator-passkey"
        ],
        "shortDescription": "",
        "title": "Enablement of Passkeys in Authenticator for passkey (FIDO2) organizations with no key restrictions",
        "description": "Beginning mid-January 2025, after the General Availability of passkeys in the Microsoft Authenticator app, organizations with the passkey (FIDO2) authentication methods policy enabled with no key restrictions will be enabled for passkeys in the Microsoft Authenticator app in addition to FIDO2 security keys. This update aligns with the broader availability of passkeys in Entra ID, extending from device-bound passkeys on security keys to device-bound passkeys also on user devices. Users who navigate to aka.ms/MySecurityInfo will see \"Passkey in Microsoft Authenticator\" as an authentication method they can add. Additionally, when Conditional Access (CA) authentication strengths policy is used to enforce passkey authentication, users who don't yet have any passkey will be prompted inline to register passkeys in Authenticator to meet the CA requirements. If an organization prefers not to enable this change for their users, they can work around it by enabling key restrictions in the passkey (FIDO2) policy. This change will not impact organizations with existing key restrictions or organizations that have not enabled the passkey (FIDO2) policy. \n \n When will this happen? \n \n Rollout will happen mid-January 2025. \n \n How will this affect your organization? \n \n Who will be impacted? \n \n Organizations with the passkey (FIDO2) authentication methods policy enabled with no key restrictions set. \n \n Who will not be impacted? \n \n Organizations that do not have the passkey (FIDO2) authentication methods policy enabled and organizations that have the passkey (FIDO2) authentication methods policy enabled and have key restrictions set. \n \n What you need to do to prepare? \n \n This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.",
        "announcementDateTime": "2024-10-30T00:00:00Z",
        "targetDateTime": "2025-01-16T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "189a4447-6075-45be-bf22-3150fce214db",
        "changeItemService": "mfA",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/entra/identity/authentication/howto-authentication-temporary-access-pass"
        ],
        "shortDescription": "",
        "title": "Temporary Access Pass (TAP) support for internal guest users",
        "description": "Entra ID now supports issuing Temporary Access Passes (TAP) to internal guest users. TAPs can be issued to internal guests just like normal members, through the Entra ID admin center or natively through Microsoft Graph. With this enhancement internal guests can now seamlessly onboard and recover their accounts with time-bound temporary credentials.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "195865c8-7929-420a-9903-fdc84325d18e",
        "changeItemService": "mfA",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/howto-mfa-userstates"
        ],
        "shortDescription": "",
        "title": "MS Graph support for per-user MFA",
        "description": "We are releasing the capability to manage user status (Enforced, Enabled, Disabled) for per-user multifactor authentication through MS Graph API. \n Please be aware that the recommended approach to protect users with Microsoft Entra multifactor authentication is Conditional Access (for licensed organizations) and security defaults (for unlicensed organizations).",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-07-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "19d74986-dbfd-4b3e-8472-adb4aa79edee",
        "changeItemService": "msGraph",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/api/resources/federatedtokenvalidationpolicy?view=graph-rest-beta"
        ],
        "shortDescription": "",
        "title": "Federated Token Validation Policy",
        "description": "We're excited to announce the public preview of Federated Token Validation Policy. The new validation will block federated tokens (deny sign-in request) from asserting to managed accounts or accounts belonging to a different federated domain in the same tenant. \n With this policy you will be able to secure accounts by validating whether the domain in the mapped Entra ID account matches the token issuer domain. The new policy will confirm that the domain in Entra ID associated with the federated IdP matches with the root domain of the mapped Entra ID account. Admins will be able to apply this policy to all or specific verified federated or managed root domains registered in their Entra ID tenant.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "1aea6383-aec7-44c3-a6b9-c644ba7b5801",
        "changeItemService": "mfA",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-phone-options"
        ],
        "shortDescription": "",
        "title": "Entra ID: Expansion of WhatsApp as an MFA one-time passcode delivery channel",
        "description": "In late 2023, Microsoft Entra started leveraging WhatsApp as an alternate channel to deliver multifactor authentication (MFA) one-time passcodes (OTPs) to users in India and Indonesia. We saw improved deliverability, completion rates, and satisfaction when leveraging the channel in both countries. The channel was temporarily disabled in India in early 2024. Starting early December 2024, we will be re-enabling the channel in India and expanding its use to additional countries. \n \n When will this happen? \n \n Starting December 2024, users in India and other countries may start receiving MFA text messages via WhatsApp. Only users that are enabled to receive MFA text messages as an authentication method and already have WhatsApp on their phone will get this experience. If a user with WhatsApp on their device is unreachable or doesn’t have internet connectivity, they will quickly fall back to the regular SMS channel. In addition, users receiving OTPs via WhatsApp for the first time will be notified of the change in behavior via SMS text message. \n \n How will this affect your organization? \n \n If you’re a Microsoft Entra workforce customer and currently leverage the text-message authentication method, we recommend you notify your helpdesk about this upcoming change. Additionally, if you don’t want your users to receive MFA text messages through WhatsApp, you may disable text messages as an authentication method in your organization. Please note that we highly encourage organizations move to using more modern, secure methods like Microsoft Authenticator and passkeys in favor of telecom and messaging app methods. This feature update is available by default. \n \n This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.",
        "announcementDateTime": "2024-11-05T00:00:00Z",
        "targetDateTime": "2024-12-02T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "1b10e521-86d0-4ee5-8cba-b83d19f240c8",
        "changeItemService": "microsoftAuthenticatorApp",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-authenticator-app#fips-140-compliant-for-microsoft-entra-authentication"
        ],
        "shortDescription": "",
        "title": "Microsoft Authenticator on Android is FIPS 140 compliant for Entra authentication",
        "description": "General Availability - Authenticator on Android is FIPS 140 compliant \n \n \n eginning with version 6.2408.5807 , Microsoft Authenticator for Android is compliant with Federal Information Processing Standard (FIPS 140-3) for all Microsoft Entra authentications, including phishing-resistant device-bound passkeys, push multi-factor authentication (MFA), passwordless phone sign-in (PSI) and time-based one-time passcodes (TOTP). No changes in configuration are required in Microsoft Authenticator or Microsoft Entra ID Admin Portal to enable this capability. Microsoft Authenticator on iOS is already FIPS 140 compliant, as announced last year.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "1b13362a-448e-41cc-bf2f-c5930ae1f801",
        "changeItemService": "entitlementManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/my-access-portal-overview#approve-or-deny-a-request"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra ID Governance: Approvers can revoke access in MyAccess",
        "description": "For Entra ID Governance users, approvers of access package requests can now revoke their decision in MyAccess. Only the person who took the approve action will be able to revoke access. To opt into this feature, admins can go to the Identity Governance settings page and enable the feature.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identityGovernance",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "1c37a3bb-af98-4571-9e5f-b6f9c41ab3ab",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/fundamentals/copilot-security-entra-investigate-risky-apps"
        ],
        "shortDescription": "",
        "title": "Assess application risks using Microsoft Security Copilot in Microsoft Entra",
        "description": "App risk skills allow identity admins and security analysts who manage applications or workload identities in Microsoft Entra to identify and understand risks through natural language prompts. By using prompts like, \"List risky app details for my tenant\", the analyst gets a better picture of the risk from application identities and can discover other application details in Microsoft Entra - including permissions granted (especially those that might be considered high privileged), unused apps in their tenant, and apps from outside their tenant. Security Copilot then uses prompt context to respond, such as with a list of apps or permissions, then surface links to the Microsoft Entra admin center so that admins can see a full list and take the appropriate remediation actions for their risky apps. IT admins and security operations center (SOC) analysts can use these skills and others to gain the right context to help investigate and remediate identity-based incidents using natural language prompts.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "1f8b477b-5c00-4b41-8211-66b61fef89c6",
        "changeItemService": "enterpriseApps",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/restore-application?tabs=http&amp;pivots=aad-powershell"
        ],
        "shortDescription": "Recovery of deleted application and service principals",
        "title": "Recovery of deleted application and service principals",
        "description": "Restore a soft deleted enterprise application in your Microsoft Entra tenant. Soft deleted enterprise applications can be restored from the recycle bin within the first 30 days after their deletion. After the 30-day window, the enterprise application is permanently deleted and can't be restored.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityLifecycleManagement",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "2195e930-cce4-4166-896a-01f19ad54052",
        "changeItemService": "rbac",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/role-based-access-control/pim-integration"
        ],
        "shortDescription": "",
        "title": "Eligible and time-bound role assignments in Azure RBAC",
        "description": "If you have Privileged Identity Management (PIM), you can create eligible and time-bound role assignments using the Access control (IAM) page in the Azure portal. You can create eligible role assignments for users, but you can't create eligible role assignments for applications, service principals, or managed identities because they can't perform the activation steps. On the Access control (IAM) page, you can create eligible role assignments at management group, subscription, and resource group scope, but not at resource scope.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "accessControl",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "21bcb8ed-55e6-408a-93b4-32b1c48c96fb",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/permissions-management/how-to-configure-aws-iam"
        ],
        "shortDescription": "",
        "title": "Okta and AWS IAM Identity Center identity provider integration with Microsoft Entra Permissions Management",
        "description": "You can now configure Okta/ AWS IAM Identity Center identity provider integration with Microsoft Entra Permissions Management. By getting the insight into single sign-on data regarding permissions assignment to cloud environments, Permissions Management can provide more accurate analytics. By reading role assignments and user data from IdP side, Permissions Management can effectively calculate permissions granted and as a result precise permissions creep.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "permissionsManagement",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "2417af4b-e5cf-4ec9-88a5-d2aa3ab2ff42",
        "changeItemService": "provisioning",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/app-provisioning/provision-custom-security-attributes"
        ],
        "shortDescription": "",
        "title": "Provision custom security attributes from HR sources",
        "description": "With this feature, customers can automatically provision \"custom security attributes\" in Microsoft Entra ID from authoritative HR sources. In the current release, this capability is only available in the \"HR-driven cloud provisioning apps\" - Workday to Entra ID, SuccessFactors to Entra ID and API-driven provisioning to Entra ID.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identityGovernance",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "2526daa6-6f5f-4fc7-8e7f-5b27a966c4d5",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/important-update-deprecation-of-azure-ad-powershell-and-msonline/ba-p/4094536"
        ],
        "shortDescription": "",
        "title": "Important Update: AzureAD PowerShell and MSOnline PowerShell retirement ",
        "description": "As of March 30, 2024, the legacy Azure AD PowerShell, Azure AD PowerShell Preview, and MS Online modules are deprecated. These modules will continue to function through March 30, 2025, after which they will be retired and stop functioning. Microsoft Graph PowerShell SDK is the replacement for these modules and you should migrate your scripts to Microsoft Graph PowerShell SDK as soon as possible. \n \n To help you identify usage of Azure AD PowerShell in your tenant, you can use the Entra Recommendation titled Migrate Service Principals from the retiring Azure AD Graph APIs to Microsoft Graph. This recommendation will show vendor applications that are using Azure AD Graph APIs in your tenant, including AzureAD PowerShell. \n \n We are making substantial new and future investments in the PowerShell experience for managing Entra, with the recent Public Preview launch of the Microsoft Entra PowerShell module. This new module builds upon the Microsoft Graph PowerShell SDK and brings scenario-focused cmdlets. It’s fully interoperable with all cmdlets in the Microsoft Graph PowerShell SDK, enabling you to perform complex operations with simple, well documented commands. The module also offers a backward compatibility option to simplify migration from the deprecated AzureAD Module. \n \n Microsoft Graph APIs were recently made available to read and configure Per-user MFA settings for users, and availability in Microsoft Graph PowerShell SDK cmdlets is soon to follow.",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2025-04-01T00:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "274f4674-da3f-4bb9-b54f-e3f641456b33",
        "changeItemService": "other",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/important-update-deprecation-of-azure-ad-powershell-and-msonline/ba-p/4094536"
        ],
        "shortDescription": "Update on Azure AD Graph Powershell Module Deprecation",
        "title": "Important update: Azure AD PowerShell and MS Online PowerShell modules are deprecated",
        "description": "In 2021, we described our plans to invest in Microsoft Graph PowerShell SDK as the PowerShell experience for Entra going forward, and that we would wind-down investment in Azure AD and MS Online PowerShell modules. In June of 2023, we announced that the planned deprecation of Azure AD and MS Online PowerShell modules would be deferred to March 30, 2024. We have since made substantial progress closing remaining parity gaps in Microsoft Graph PowerShell SDK. \n \n As of March 30, 2024, these PowerShell modules are deprecated : \n - Azure AD PowerShell (AzureAD) \n - Azure AD PowerShell Preview (AzureADPreview) \n - MS Online (MSOnline) \n \n Microsoft Graph PowerShell SDK is the replacement for these modules and you should migrate your scripts to Microsoft Graph PowerShell SDK as soon as possible. Information about the retirement of these modules can be found below. Azure AD PowerShell, Azure AD PowerShell Preview, and MS Online will continue to function through March 30, 2025, when they are retired. Note: MS Online versions before 1.1.166.0 (2017) can no longer be maintained and use of these versions may experience disruptions after June 30, 2024. \n \n We are making substantial new and future investments in the PowerShell experience for managing Entra. Please continue to watch this space as we announce exciting improvements in the coming months.",
        "announcementDateTime": "2020-06-22T07:00:00Z",
        "targetDateTime": "2024-03-30T07:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "2913355d-9f21-4435-ac23-68adccc0d7e6",
        "changeItemService": "identityProtection",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks"
        ],
        "shortDescription": "Microsoft Defender for Office alerts now in ID Protection",
        "title": "Microsoft Defender for Office alerts now in ID Protection",
        "description": "Suspicious sending patterns: This risk detection type is discovered using information provided by Microsoft Defender for Office (MDO). This alert is generated when someone in your organization has sent suspicious email and is either at risk of being restricted from sending email or has already been restricted from sending email. This detection moves users to medium risk and only fires in organizations that have deployed MDO.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-04-13T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "2b0bc2cd-5edb-407c-90c4-f95e5b589475",
        "changeItemService": "mfA",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/active-directory/authentication/how-to-mfa-authenticator-lite"
        ],
        "shortDescription": "Support for Authenticator Lite in legacy, per-user MFA policy",
        "title": "Support for Authenticator Lite in legacy, per-user MFA policy",
        "description": "Authenticator Lite is a relatively new feature that brings authentication push notifications, similar to Microsoft Authenticator, into 1st party applications – the first of which is Outlook. It's a great alternative for users who can't or aren't willing to download another ‘work’ app on their phone but already have Outlook mobile set up. Currently, this method is only available to organizations who manage Microsoft Authenticator in the converged authentication methods policy. We're now also making it available as a part of the &quot;Notifications through mobile app&quot; method in the per-user MFA policy. Starting mid-September 2023, we'll update the &quot;Notification through mobile app&quot; method such that if it's enabled, then Authenticator Lite is also enabled.",
        "announcementDateTime": "2023-09-18T00:00:00Z",
        "targetDateTime": "2023-09-18T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "2dd87886-c65a-4bac-91eb-82a06162e704",
        "changeItemService": "conditionalAccess",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/conditional-access/concept-conditional-access-cloud-apps"
        ],
        "shortDescription": "",
        "title": "Updates to 'Target resources' in Microsoft Entra Conditional Access",
        "description": "Starting in September 2024, the Microsoft Entra Conditional Access 'Target resources' assignment will consolidate the 'Cloud apps' and 'Global Secure Access' options under a new name 'Resources'. \n \n Customers will be able to target 'All internet resources with Global Secure Access', All resources (formerly 'all cloud apps') or select specific resources (formerly 'select apps'). Some of the Global Secure Access attributes in the Conditional Access API will be deprecated. \n \n This change will start in September 2024 and will occur automatically, admins won’t need to take any action. There are no changes in the behavior of existing Conditional Access policies.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-09-02T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "351b4c9c-c7d3-4173-b0ee-ba23e7efbbd7",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/howto-authentication-passwordless-phone"
        ],
        "shortDescription": "",
        "title": "Multiple Passwordless Sign-in for Android devices",
        "description": "End users can now enable passwordless phone sign-in for multiple accounts in the Microsoft Authenticator App on any supported Android device. Consultants, students, and others with multiple accounts in Entra ID can add each account to Microsoft Authenticator and use passwordless phone sign-in for all of them from the same Android device. The Entra ID accounts can be in the same tenant or different tenants. Guest accounts are not supported for multiple account sign-in from one device.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-06-04T01:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "358bbad7-757b-4f4f-ab20-28315dfa22f0",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://entra.microsoft.com/#view/Microsoft_AAD_DXP/ScenarioHealthSummary.ReactView"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra Health Monitoring Alerts available in Entra Admin Center",
        "description": "Intelligent alerts in Microsoft Entra health monitoring notify tenant admins and security engineers whenever a monitored scenario breaks from its typical pattern. Microsoft Entra's alerting capability watches the low-latency health signals of each scenario and fires a notification in the event of an anomaly. The set of alert-ready health signals and scenarios will grow over time.",
        "changeItemState": "comingSoon",
        "deliveryStage": "publicPreview",
        "category": "monitoringReporting",
        "publishedDateTime": "2025-02-03T10:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "36baab82-3559-4475-9d2c-cc48932e58f0",
        "changeItemService": "groupManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/what-s-new-in-microsoft-entra/ba-p/3796391"
        ],
        "shortDescription": "",
        "title": "Change password in My Security Info replacing legacy change password experience",
        "description": "As communicated earlier, the capability to manage and change passwords in the My Security Info management portal is now Generally Available. As part of ongoing service improvements, we're replacing the legacy Change Password page with the new, modernized My Security Info experience beginning March 2023. From March to June, through a phased rollout, traffic from the legacy change password experience will redirect users to My Sign Ins. No additional action is required, and this change will occur automatically. The legacy Change Password page will no longer be available after June 2023.",
        "announcementDateTime": "2024-03-31T23:00:00Z",
        "targetDateTime": "2024-03-31T23:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "3771a3bf-f199-49e5-842f-1653218e2780",
        "changeItemService": "rbac",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/admin-units-members-dynamic"
        ],
        "shortDescription": "",
        "title": "Dynamic Administrative Units is now available",
        "description": "Dynamic membership for users and devices in Administrative Units is now Generally Available. Instead of manually assigning users and devices to administrative units, tenant admins can set up a query for the administrative unit. The membership will be automatically maintained by Entra ID.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "authZAccessDelegation",
        "publishedDateTime": "2024-12-04T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "40a6eedc-f9fb-4c65-9046-f716c953a804",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-certificate-based-authentication#step-4-configure-username-binding-policy"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra certificate-based authentication adds support for more username bindings",
        "description": "Microsoft Entra certificate-based authentication adds support for three remaining username bindings and is now at parity with on-premises Active Directory. \n The following new bindings are supported now, \n IssuerAndSerialNumber, IssuerAndSubject and Subject.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-07-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "421ee69d-cd1b-4f76-bd58-f906eeacfb07",
        "changeItemService": "mfA",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [],
        "shortDescription": "",
        "title": "MS Graph API support for per-user multifactor authentication",
        "description": "Starting June 2024, we are releasing the capability to manage user status (Enforced, Enabled, Disabled) for per-user multifactor authentication through MS Graph API. This will replace the legacy MS Online PowerShell module that is being retired. Please be aware that the recommended approach to protect users with Microsoft Entra multifactor authentication is Conditional Access (for licensed organizations) and security defaults (for unlicensed organizations).",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-07-01T00:00:00Z",
        "impactLink": "https://learn.microsoft.com/entra/identity/authentication/howto-mfa-userstates",
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "44985454-e473-4255-8863-8ada0aa92bc3",
        "changeItemService": "enterpriseApps",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity-platform/claims-customization-custom-claims-policy"
        ],
        "shortDescription": "",
        "title": "Custom Claims API for Claims Configuration of Enterprise Apps",
        "description": "Custom Claims API allows admins to manage and update additional claims for their Enterprise Applications seamlessly through MS Graph. The Custom Claims API offers a simplified and user friendly API experience for claims management for our customers. With the introduction of Custom Claims API, we achieved UX and API interoperability. Admins can now use Entra Portal and MS Graph API interchangeably to manage claims configurations for their Enterprise Applications. It facilitates admins to execute their automations using the API while allowing the flexibility to update claims on the Entra Portal as required on the same policy object.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "sso",
        "publishedDateTime": "2024-10-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "46dc5f1e-1e80-443f-bb6e-dd0dcbd14dc8",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/manage-workflow-on-premises"
        ],
        "shortDescription": "",
        "title": "Enable, Disable and Delete synchronized users accounts with Lifecycle Workflows",
        "description": "Lifecycle Workflows is now able to enable, disable and delete user accounts which are synchronized from Active Directory Domain Services (AD DS) to Microsoft Entra. This allows you to complete the employee offboarding process by deleting the user account after a retention period.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identityGovernance",
        "publishedDateTime": "2024-06-02T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "4a1b7b93-992a-40d6-a189-f5787c26cedf",
        "changeItemService": "directoryManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/collaborate-across-m365-tenants-with-entra-id-multi-tenant/ba-p/4120309"
        ],
        "shortDescription": "",
        "title": "Multi-tenant organization capabilities",
        "description": "Multi-tenant organization (MTO) capabilities - now available in Microsoft Entra and Microsoft 365. MTO simplifies the process for organizations to arrange tenants as secure, autonomous entities connected by common policies and foundational services. MTO provides new streamlined collaboration across tenants, new ways for employees and leaders to connect using Viva Engage, manage incidents across tenants with Microsoft Defender XDR, and simplified multi-tenant management in Microsoft Entra.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "collaboration",
        "publishedDateTime": "2024-04-27T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "4a2bda5d-0cdd-4d41-bd3c-27e00ee0107d",
        "changeItemService": "enterpriseApps",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/what-s-new-in-microsoft-entra/ba-p/3796391"
        ],
        "shortDescription": "",
        "title": "My Apps Secure Sign-in Extension",
        "description": "In June 2024, users using unsupported versions of the My Apps Secure Sign-in Extension will experience breakages. If you are utilizing Microsoft Edge and Chrome extensions, you will experience no change in functionality. If you are using the unsupported Firefox versions of this extension, all functionalities will stop working in June 2024 (please note, Firefox support ceased in September 2021). Our recommendation is to use the Edge or Chrome versions of this extension.",
        "announcementDateTime": "2024-04-01T00:00:00Z",
        "targetDateTime": "2024-06-01T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "4d25883a-1d34-41eb-8428-fb19db51319c",
        "changeItemService": "audit",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/fundamentals/custom-security-attributes-manage?tabs=admin-center#changes-to-audit-logs-behavior"
        ],
        "shortDescription": "Changes to audit logs behavior for custom security attributes",
        "title": "Changes to audit logs behavior for custom security attributes",
        "description": "Beginning in October 2023, changes were made to custom security attribute audit logs for general availability that might impact your daily operations. If you’ve been using custom security attribute audit logs during the preview, here are the actions you must take before February 2024 to ensure your audit log operations aren't disrupted: Use new audit logs location. Assign Attribute Log roles to view audit logs. Create new diagnostic settings to export audit logs.",
        "announcementDateTime": "2023-11-30T08:00:00Z",
        "targetDateTime": "2024-02-29T08:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "4d38c42c-79b0-4e15-9b1b-6a05cd2ade49",
        "changeItemService": "b2B",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/active-directory/external-identities/what-is-b2b"
        ],
        "shortDescription": "Cross-tenant sign-ins will always show home tenant branding instead of resource tenant branding.",
        "title": "Cross-tenant sign-ins will always show home tenant branding instead of resource tenant branding",
        "description": "When using B2B collaboration and performing a sign-in to a resource tenant, users will notice that they will always see their home tenant branding (whether customized or default branding) instead of continuing to be shown the resource tenant's branding. This will make it clearer for users signing in that they are performing a sign-in against their home tenant and not directly authenticating with the resource tenant.",
        "announcementDateTime": "2023-09-30T00:00:00Z",
        "targetDateTime": "2023-09-30T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "4ecc1fb1-04e3-449d-a238-e6a714c851c3",
        "changeItemService": "conditionalAccess",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-strength-advanced-options"
        ],
        "shortDescription": "",
        "title": "Granular Certificate-Based Authentication Configuration in Conditional Access",
        "description": "With the authentication strength capability in Conditional Access, you can create a custom authentication strength policy, with advanced certificate-based authentication (CBA) options to allow access based on certificate issuer or policy OIDs. For external users whose MFA is trusted from partners' Entra ID tenant, access can also be restricted based on these properties.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-07-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "53367df7-2c72-4fa6-9bfe-15ea06bb1314",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/customers/concept-native-authentication"
        ],
        "shortDescription": "",
        "title": "Native Authentication for Microsoft Entra External ID",
        "description": "Native Authentication for Microsoft Entra External ID is now Generally Available. Native Authentication empowers you to take complete control over the design of the login experience. It allows you to craft stunning, pixel-perfect authentication screens that are seamlessly integrated into your mobile apps, removing the need to redirect users to an external browser.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "developerExperience",
        "publishedDateTime": "2024-11-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "535341ba-ab41-4794-b0c9-57d88c267b81",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/devices/macos-psso"
        ],
        "shortDescription": "",
        "title": "Platform SSO for macOS with Entra ID",
        "description": "Platform SSO for macOS is now available in public preview with Microsoft Entra ID. Platform SSO is an enhancement to the Microsoft Enterprise SSO plug-in for Apple Devices that makes usage and management of Mac devices more seamless and secure than ever. At the start of public preview, Platform SSO will work with Microsoft Intune. Other Mobile Device Management (MDM) providers will be coming soon. Please contact your MDM provider for more information on support and availability.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2024-05-10T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "53a4d50c-4670-4eac-b20b-2afb0ce3a69a",
        "changeItemService": "accessReviews",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-authentication-sms-signin"
        ],
        "shortDescription": "",
        "title": "Optimized OTP delivery via WhatsApp",
        "description": "Today, Entra ID (Azure AD) MFA supports delivering OTPs via text message (traditional SMS). These texts get sent to the default messaging app on a user's phone depending on the phone's operating system. In many countries though, these default apps aren't users' primary messaging apps. To help deliver OTPs to users on their preferred messaging platforms, we will be running an experiment to deliver OTPs via WhatsApp in the following countries: India, Indonesia and New Zealand. Starting mid-September 2023, some users in the listed countries may start receiving MFA text messages via WhatsApp. Users that fit the following criteria are subject (but not guaranteed) to receive the updated experience: - Enabled for text messages / SMS as an authentication method - Already use WhatsApp - Have a phone number with a country code in one of the listed countries",
        "announcementDateTime": "2023-09-18T00:00:00Z",
        "targetDateTime": "2023-09-18T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "55c05bb4-baeb-4d02-b54e-f4604fa8c6e0",
        "changeItemService": "groupManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/users/groups-self-service-management#make-a-group-available-for-user-self-service"
        ],
        "shortDescription": "",
        "title": "Deferred Changes to My Groups Admin Controls",
        "description": "In October 2023 we shared that starting June 2024 the existing Self Service Group Management setting in the Microsoft Entra Admin Center which states \"restrict user ability to access groups features in My Groups\" would be retired. These changes are under review and will not take place as originally planned. A new deprecation date will be announced in the future.",
        "announcementDateTime": "2024-08-20T00:00:00Z",
        "targetDateTime": "2024-08-20T00:00:00Z",
        "impactLink": null,
        "changeType": "retirement",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "56915402-8331-4ff1-b454-a8cd886e59c9",
        "changeItemService": "mfA",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-migrate-mfa-server-to-azure-mfa"
        ],
        "shortDescription": "",
        "title": "Azure MFA Server retirement",
        "description": "Beginning September 30, 2024 , Azure Multi-Factor Authentication Server deployments will no longer service multi-factor authentication (MFA) requests, which could cause authentications to fail for your organization. MFA Server will have limited SLA and MFA Activity Report in the Azure Portal will no longer be available. To ensure uninterrupted authentication services and to remain in a supported state, organizations should migrate their users’ authentication data to the cloud-based Azure MFA service using the latest Migration Utility included in the most recent Azure MFA Server update .",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-10-01T00:00:00Z",
        "impactLink": null,
        "changeType": "retirement",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "56c2739e-8041-451b-beb7-54faadedffd0",
        "changeItemService": "mfA",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-gb/entra/identity/authentication/how-to-authentication-external-method-manage"
        ],
        "shortDescription": "Choose an external provider to meet multifactor authentication (MFA) requirements when they sign to Microsoft Entra ID",
        "title": "Manage an external authentication method in Microsoft Entra ID",
        "description": "External authentication method (EAM) – Enables organizations to use an external authentication\nprovider for their users to satisfy the second\nfactor of Entra ID MFA requirements.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2024-07-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "571caf90-dbe5-417a-9a17-a7da8a2a1d08",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://aka.ms/pkicastore"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra new store for certificate-based authentication",
        "description": "Microsoft Entra is has a new scalable PKI (Public Key Infrastructure) based CA (Certificate Authorities) store with higher limits for the number of CAs and the size of each CA file. PKI based CA store allows CAs within each different PKI to be in its own container object allowing administrators to move away from one flat list of CAs to more efficient PKI container based CAs. PKI-based CA store now supports up to 250CAs, 8KB size for each CA and also supports issuers hints attribute for each CA. Administrators can also upload the entire PKI and all the CAs using the \"Upload CBA PKI\" feature or create a PKI container and upload CAs individually. For more information, see How to configure the certificate authorities with PKI-based trust store.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2024-12-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "574c06a6-5a06-46bd-a2e7-9a9555cbba9e",
        "changeItemService": "identityProtection",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-protection/howto-identity-protection-remediate-unblock"
        ],
        "shortDescription": "",
        "title": "On-premises password reset remediates user risk",
        "description": "Organisations who have enabled password hash synchronisation can now allow password changes on-premises to remediate user risk. You can also use this to save hybrid users time and maintain their productivity with automatic self-service remediation in risk-based Conditional Access policies.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-04-23T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "58dcef64-302a-4f45-b5f7-2b955b17fa09",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-certificate-based-authentication-technical-deep-dive"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra certificate-based authentication improvements",
        "description": "We have introduced the following new enhancements in Microsoft Entra certificate-based authentication, \n \n \n CBA Affinity Binding allows admins to set affinity binding at the tenant level, as well as create custom rules to use high affinity or low affinity mapping for covering many potential scenarios our customers have in use today. \n \n CBA Authentication policy rules help determine the strength of authentication as either single-factor or multifactor. Multiple custom authentication binding rules can be created to assign default protection level for certificates based on the certificate attributes (Issuer or Policy Object Identifiers (OID) or by combining the Issuer and OID).",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-07-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "59f3907e-4c23-461a-b824-6be387b75792",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/howto-mfa-userdevicesettings"
        ],
        "shortDescription": "",
        "title": "Retirement of legacy user authentication methods management experience in Entra Portal",
        "description": "Starting October 31 st , 2024 , we will retire the ability to manage user authentication methods in the Entra Portal via the legacy user interface (UI) . Instead, we will only surface the modern UI which has full parity with the legacy experience in addition to the ability to manage modern methods ( e.g. Temporary Access Pass, Passkeys, QR+Pin , etc.) and settings . This will not impact how end users can manage their own authentication methods or their ability to sign-in to Entra.",
        "announcementDateTime": "2024-11-02T00:00:00Z",
        "targetDateTime": "2024-11-01T00:00:00Z",
        "impactLink": null,
        "changeType": "retirement",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "5ac523ca-5aa2-471c-9d2c-bfeae5c51264",
        "changeItemService": "other",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/microsoft-365/admin/manage/assign-licenses-to-users?view=o365-worldwide"
        ],
        "shortDescription": "",
        "title": "License assignment modifications will no longer be supported in the Microsoft Entra Admin Center",
        "description": "Starting on September 1st, 2024, the Microsoft Entra Admin Center and the Microsoft Azure Admin Portal will no longer support the modification of user and group license assignments. You will have read only access for license assignments in these portals moving forward. \n If you want to modify user and group license assignments via user interface, you will need to visit the Microsoft 365 Admin Center (https://admin.microsoft.com). \n Please note, this change will not impact our API and PowerShell modules.",
        "announcementDateTime": "2024-08-08T00:00:00Z",
        "targetDateTime": "2024-09-01T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "5bf8d587-5105-4665-8915-d12968219397",
        "changeItemService": "conditionalAccess",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/active-directory/conditional-access/concept-filter-for-applications"
        ],
        "shortDescription": "Conditional Access: Filter for applications",
        "title": "Conditional Access: Filter for applications",
        "description": "Filters for apps in Conditional Access simplify policy management by allowing admins to tag applications with custom security attributes and target them in Conditional Access policies, instead of using direct assignments. With this feature customers can scale up their policies and protect any number of apps",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-04-13T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "5ec1f2c3-8893-4192-8422-5c7196697a58",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-plan-prerequisites-phishing-resistant-passwordless-authentication"
        ],
        "shortDescription": "Now Generally Available with improved registration and sign-in experiences",
        "title": "Support for device-bound passkey in Microsoft Authenticator for iOS and Android",
        "description": "Attackers have responded to the rise in multifactor authentication (MFA) adoption by ramping up AitM phishing and social engineering techniques to steal user credentials. Passkeys counter these advanced attacks, as well as password attacks, while simplifying secure sign-ins. \n \n A passkey is a strong, phishing-resistant authentication method you can use to sign in to any internet resource that supports the W3C WebAuthn standard. Passkeys represent the continuing evolution of the FIDO2 standard. \n \n Passkeys in Microsoft Authenticator offer a cost-effective, phishing-resistant credential that users can access directly from their mobile devices, reducing the need to provision and purchase separate security keys. Today, we’re thrilled to share that device-bound passkey support in Microsoft Authenticator for iOS and Android is now Generally Available with improved registration and sign-in experiences, as well as attestation support that verifies the legitimacy of the Microsoft Authenticator app on the user's device before registering the passkey.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-11-19T21:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "6234d34b-c0de-4e85-ba59-36bdcef38c7f",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/security/fundamentals/azure-ca-details?tabs=root-and-subordinate-cas-list"
        ],
        "shortDescription": "",
        "title": "New Certificate Authorities for login.microsoftonline.com: Action required from customers who only trust DigiCert certificates",
        "description": "Microsoft Entra ID is introducing new Certificate Authorities (CAs) for server certificates for the domain login.microsoftonline.com. At present, connections to login.microsoftonline.com are exclusively presented with DigiCert certificates. Starting on October 1, 2024, you may also encounter certificates issued by Microsoft Azure CAs. This update is designed to enhance security and improve the resilience of Entra ID. This could impact customers who do not trust Microsoft Azure CAs or have pinned client-side to DigiCert certificates, as they may experience authentication failures. \n \n Recommended Action: \n \n To prevent potential issues, we recommend trusting all Root and Subordinate CAs listed in the Azure Certificate public documentation (click Learn more below). This documentation has included Microsoft Azure CAs for over a year. If you are an Entra ID user who utilizes the login.microsoftonline.com domain, it is crucial to remove any client-side pinning to DigiCert and trust the new Azure CAs for a seamless transition.",
        "announcementDateTime": "2024-08-26T00:00:00Z",
        "targetDateTime": "2024-10-02T00:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "62c275dc-3bb0-4740-83a3-d8365c2d96f8",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/active-directory/conditional-access/concept-continuous-access-evaluation-strict-enforcement"
        ],
        "shortDescription": "Strict Location Enforcement for Continuous Access Evaluation",
        "title": "Strict Location Enforcement for Continuous Access Evaluation",
        "description": "Strictly enforce location policies is a new enforcement mode for continuous access evaluation (CAE), used in Conditional Access policies. This new mode provides protection for resources, immediately stopping access if the IP address detected by the resource provider isn't allowed by Conditional Access policy.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "accessControl",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "630a356c-eca4-4ab1-a39d-4cea7b7a3684",
        "changeItemService": "mfA",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-registration-mfa-sspr-combined"
        ],
        "shortDescription": "",
        "title": "My Security-Info Add sign-in method picker user interface update",
        "description": "Starting late August 2024, the \"add sign-in method\" dialog on the My Security-Info page will be updated with improved sign-in method descriptions and a modern look and feel. With this change when users click \"add sign-in method\" they will initially be recommended to register the strongest method available to them which is allowed by organizational authentication method policy. Users will have the ability to click \"show more options\" and choose from all available sign-in methods allowed by their policy. \n This change will occur automatically, and admins won't need to take any action.",
        "announcementDateTime": "2024-07-31T00:00:00Z",
        "targetDateTime": "2024-09-06T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "63481585-17c4-4789-9acc-bb7095a53a81",
        "changeItemService": "privilegedIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/privileged-identity-management/pim-resource-roles-activate-your-roles#activate-pim-roles-using-the-azure-mobile-app"
        ],
        "shortDescription": "",
        "title": "PIM approvals and activations on the Azure mobile app (iOS and Android) are available now",
        "description": "PIM is now available on the Azure mobile app in both iOS and Android. Customers can now approve or deny incoming PIM activation requests, in addition to activating Entra ID and Azure resource role assignments, directly from the app on their phone.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "privilegedIdentityManagement",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "66cb8f34-4b2d-43b0-8cf2-8c3e834c7892",
        "changeItemService": "userManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/users/convert-external-users-internal"
        ],
        "shortDescription": "",
        "title": "Convert external users to internal member users",
        "description": "External user conversion enables customers to convert external users to internal members without needing to delete and create new user objects. Maintaining the same underlying object ensures the user’s account and access to resources isn’t disrupted and that their history of activities remains intact as their relationship with the host organization changes. The external to internal user conversion feature includes the ability to convert on-premises synchronized users as well.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userManagement",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "68757354-d621-4d77-adfb-cb088acb96b5",
        "changeItemService": "other",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/copilot-for-microsoft-365/updates-to-microsoft-copilot-to-bring-enterprise-data-protection/ba-p/4217152"
        ],
        "shortDescription": "",
        "title": "Microsoft Copilot to update to enterprise data protection",
        "description": "Next month, we are making several updates to the free Microsoft Copilot service for users with a Microsoft Entra account to enhance data security, privacy, and compliance and simplify the user experience. For users signed in with an Entra account, Microsoft Copilot will offer enterprise data protection (EDP) and redirect users to a new simplified, ad-free user interface designed for work and education. \n \n With EDP in Microsoft Copilot, your data is private, it isn’t used to train foundation models, and we help protect it at rest and in transit with encryption. For more details on EDP, please see here (https://aka.ms/EDPLearn). \n \n If you or your users have a Microsoft 365 subscription in addition to an Entra account, you can enable in-app access by pinning Microsoft Copilot. If you elect to pin Microsoft Copilot for your users, it will appear in the Microsoft 365 app starting mid-September, and it will be coming soon to Microsoft Teams and Outlook. Additional functionality in Microsoft Copilot like chat history is also available for users with a Microsoft 365 subscription. \n \n For additional information about these changes, whether you or your users have a Microsoft 365 subscription or not, please visit our blog (https://aka.ms/MsftCopilot-MTCBlog) and FAQ (https://aka.ms/MsftCopilot-BlogFAQ). \n \n We hope you are as excited as we are for these updates to Microsoft Copilot. If you would like to try Microsoft Copilot updated with enterprise data protection prior to mid-September, a private preview is available (space limited). To apply, please visit here: https://aka.ms/CopilotPreviewSignup",
        "announcementDateTime": "2024-08-28T00:00:00Z",
        "targetDateTime": "2024-09-16T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "68888459-b25d-4299-abfd-474853738d73",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/monitoring-health/overview-recommendations"
        ],
        "shortDescription": "",
        "title": "Email notifications for new recommendations",
        "description": "Microsoft Entra Recommendations email notifications – Proactive notification capability which informs the relevant members within your organization via email whenever a new recommendation becomes available to improve your security, compliance, and productivity posture.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "monitoringReporting",
        "publishedDateTime": "2024-11-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "6d143c5c-8d3e-494f-93fe-71ee07487d72",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/virtual-desktop/configure-single-sign-on"
        ],
        "shortDescription": "Configure single sign-on for Azure Virtual Desktop using Microsoft Entra ID authentication.",
        "title": "SSO and Passwordless authentication for AVD and Windows 365",
        "description": "Configure single sign-on (SSO) for Azure Virtual Desktop using Microsoft Entra ID authentication. When you enable single sign-on, users authenticate to Windows using a Microsoft Entra ID token. This token enables the use of passwordless authentication and third-party identity providers that federate with Microsoft Entra ID when connecting to a session host. Single sign-on using Microsoft Entra ID authentication also provides a seamless experience for Microsoft Entra ID-based resources inside the session.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "sso",
        "publishedDateTime": "2024-04-13T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "6d674d4f-2090-434b-b1ed-3ae27a874f5b",
        "changeItemService": "audit",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/introducing-microsoft-entra-license-utilization-insights/ba-p/3796393"
        ],
        "shortDescription": "Optimize your license utilization to get the most out of your Microsoft Entra ID Premium licenses.",
        "title": "Introducing Microsoft Entra license utilization insights",
        "description": "The Entra ID License utilization portal allows you to see how many Entra ID P1 and P2 licenses you have and the usage of the key features corresponding to the license type. We're thrilled that Conditional Access and risk-based Conditional Access usage are available as part of the public preview, but this would be expanded to include usage of other SKUs and corresponding features at general availability. This perspective is an initial stride towards empowering you to comprehend your license count and the value you extract from your Entra license. It also aids in addressing any over-usage issues that might emerge in your tenants.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "monitoringReporting",
        "publishedDateTime": "2024-04-27T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "6fc2a888-2a01-4998-b5c0-e07de1e15d29",
        "changeItemService": "msGraph",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/templates/?branch=main"
        ],
        "shortDescription": "",
        "title": "Bicep templates for Microsoft Graph resources",
        "description": "The Microsoft Graph Bicep Provider allows you to author, deploy and manage a limited set of Microsoft Graph resources (mostly Microsoft Entra ID resources) using Bicep template files, alongside Azure resources. \n - Existing Azure customers can now use familiar tools to deploy Azure resources and the Microsoft Entra resources they depend on, such as applications and service principals, using Infrastructure-as-Code (IaC) and DevOps practices. \n - It also opens the door for existing Microsoft Entra customers to use Bicep templates and IaC practices to deploy and manage their tenant's Entra resources.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "developerExperience",
        "publishedDateTime": "2024-05-25T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "7128e79c-2ff7-412a-a62d-3b5b9ddab47a",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/tutorial-mover-custom-workflow-portal"
        ],
        "shortDescription": "",
        "title": "Configure custom workflows to run mover tasks when a user's job profile changes",
        "description": "Lifecycle Workflows now supports the ability to trigger workflows based on job change events like changes to an employee's department, job role, or location and see them executed on the workflow schedule. With this feature, customers can leverage new workflow triggers to create custom workflows for their executing tasks associated with employees moving within the organization including: Trigger workflows when a specified a ttribute changes Triggering workflows when a user is added or removed from a group's membership Tasks to notify a user's manager about a move Task to assign licenses or remove selected licenses from a user",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-08-29T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "73c4b756-fd77-4ab9-b9c0-f2ab01d5211f",
        "changeItemService": "b2B",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/b2b-sponsors"
        ],
        "shortDescription": "",
        "title": "B2B Sponsors as an Attribute and Approvers in Entitlement Management",
        "description": "As we continue to design governance features to help our customers stay ahead of the evolving threat landscape, today we are thrilled to announce the general availability of B2B Sponsors. Sponsors are responsible to manage and monitor the lifecycle of users and ensure they have access to the right resources driving accountability of guest users for our customers. Setting Sponsors as an attribute is a part of B2B offering. Sponsors as approvers in Entitlement Management is our very first experience in leveraging this attribute where access requests made by guests can be directed to Sponsors for approval. This capability is a part of Microsoft Entra ID Governance SKU . Sponsors are a building block to many such exciting enablement’s that we are working towards.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "b2BB2C",
        "publishedDateTime": "2024-06-03T03:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "75053539-68b4-4ffc-8e6a-6c8adb2d991d",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/move-to-cloud-authentication-with-the-ad-fs-migration-tool/ba-p/4174841"
        ],
        "shortDescription": "",
        "title": "AD FS application migration wizard",
        "description": "The Active Directory Federation Services (AD FS) application migration wizard allows users to quickly identify which AD FS relying party applications are compatible with being migrated to Microsoft Entra ID. The tool shows the migration readiness of each application, highlights issues and suggests actions to remediate them, and guides users through preparing individual applications for migration and configuring their new Microsoft Entra applications.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "platform",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "787581a9-2cac-4d35-b5ca-9dce1be35248",
        "changeItemService": "conditionalAccess",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/microsoft-entra-change-announcements-march-2023-train/ba-p/2967448"
        ],
        "shortDescription": "Deprecation of Require approved client app condition in Conditional Access Grant",
        "title": "Deprecation of Require approved client app condition in Conditional Access Grant",
        "description": "On March 31, 2026 , the Require approved client app control in Microsoft Entra ID Conditional Access will be retired and no longer enforced. Before that date, you’ll need to transition and start using the Require app protection policy control. We encourage you to make the switch sooner to gain the richer benefits of the Require app protection policy control, which has all the same capabilities, plus: It verifies the corresponding Intune policy. It’s applied before a user is granted access. It has a strengthened security posture. To avoid any disruptions in service , transition to using the ‘Require app protection policy’ control in Conditional Access by March 31, 2026 .",
        "announcementDateTime": "2023-03-31T07:00:00Z",
        "targetDateTime": "2026-03-31T07:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "78c17be7-8ba5-4c2c-8501-2fe739b9ef57",
        "changeItemService": "groupManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/users/directory-service-limits-restrictions"
        ],
        "shortDescription": "",
        "title": "Dynamic Groups quota increased to 15000",
        "description": "Microsoft Entra organizations could previously have a maximum of 5,000 dynamic groups and dynamic administrative units combined. \n \n We have increased this quota to 15000. For example, you can now have 5,000 dynamic groups and 10,000 dynamic AUs (or any other combination that adds up to 15k). You don't need to do anything to take advantage of this change - it's available right now.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "directory",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "84f74794-64f8-404c-a612-f14ed115830d",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity-platform/custom-extension-overview"
        ],
        "shortDescription": "",
        "title": "Custom Claims Providers enable token claim augmentation from external data sources",
        "description": "Custom authentication extensions allow you to customize the Microsoft Entra authentication experience by integrating with external systems. A custom claims provider is a type of custom authentication extension that calls a REST API to fetch claims from external systems. A custom claims provider maps claims from external systems into tokens and can be assigned to one or many applications in your directory.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "extensibility",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "856bf90e-1c41-4bb9-936e-4993d038eca0",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://marketplace.visualstudio.com/items?itemName=ms-azuretools.ms-entra"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra External ID extension for Visual Studio Code",
        "description": "The Microsoft Entra External ID extension for Visual Studio Code helps you integrate customer identity and access management (CIAM) into applications without leaving the IDE. The extension offers a seamless, guided experience to set up a customized, branded sign-in experience for external users and enables you to configure a sample External ID application, all within the development environment.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "b2BB2C",
        "publishedDateTime": "2024-10-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "85b94f20-dd24-4c73-88fd-620b389df2a7",
        "changeItemService": "identityProtection",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks"
        ],
        "shortDescription": "",
        "title": "Attacker in the Middle detection in Identity Protection",
        "description": "The Attacker in the Middle detection is now generally available for users in Identity Protection. \n \n This high-precision detection will be triggered on a user account that has been compromised by an adversary who has intercepted the user's credentials, including tokens issued to the user. The risk is identified through Microsoft 365 Defender and will elevate the user to high risk, triggering the configured Conditional Access policy.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "87555d90-af3b-483e-93d6-3898d66b8a1f",
        "changeItemService": "privilegedIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/saas-apps/aws-single-sign-on-provisioning-tutorial#just-in-time-jit-application-access-with-pim-for-groups-preview"
        ],
        "shortDescription": "Just-in-time application access with PIM for Groups",
        "title": "Just-in-time application access with PIM for Groups",
        "description": "Provide just-in-time access to non-Microsoft applications such as AWS & GCP. This capability integrates PIM for groups and application provisioning to reduce the activation time from 40+ minutes to roughly 2 minutes when requesting just-in-time access to a role in a non-Microsoft app.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "privilegedIdentityManagement",
        "publishedDateTime": "2024-04-13T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "8b26994e-5b9e-4cbf-9e7a-d7c6252df11c",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/templates/how-to-migrate-to-dynamic-types"
        ],
        "shortDescription": "",
        "title": "Dynamic type versioning in Bicep templates for Microsoft Graph",
        "description": "In October 2024, we're introducing an update to the Bicep templates for Microsoft Graph public preview. The dynamic types feature enables semantic versioning for Microsoft Graph Bicep types for both beta and v1.0. During Bicep file authoring, you specify a Microsoft Graph Bicep type version referenced from the Microsoft artifact registry, instead of using a built-in Nuget package which is the current experience. Using dynamic types will allow for future breaking changes in existing Microsoft Graph Bicep resource types without impacting deployment of your existing Bicep files that use older versions of those resource types. \n \n Built-in types are deprecated and will be retired on January 24, 2025. Until the retirement date, built-in types will coexist with the new dynamic types. Any Microsoft Graph Bicep type changes will only be available through new versions of the dynamic types. \n \n Action required: \n \n Switch to the new dynamic types before 24th January 2025 to avoid Bicep template deployment failures. The switch will involve making some minor updates to your bicepconfig.json and main Bicep files. Additionally, to take advantage of any updated or new Microsoft Graph resource types, you will need to update the type version that your Bicep files use.",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2025-01-25T01:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "8c23f914-f843-4cdd-a99e-c2c77862b58d",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-fido2-compatibility"
        ],
        "shortDescription": "",
        "title": "FIDO2 authentication in Android web browsers",
        "description": "Users can now sign in with a FIDO2 security key in Chrome and Edge on Android. This change is applicable to all users who are in scope for the FIDO2 authentication method. FIDO2 registration in Android web browsers is not available yet.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "8deee3fe-cacc-440d-b6a1-b3b2e1686671",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/customers/concept-multifactor-authentication-customers"
        ],
        "shortDescription": "",
        "title": "SMS as an MFA method in Entra External ID",
        "description": "Announcing general availability of SMS as an MFA method in Microsoft Entra External ID with built in telecom fraud protection through integrations with the Phone Reputation Platform. \n \n What's new? \n - SMS sign-in experience that maintains the look and feel of the application users are accessing. \n - SMS is an add-on feature. We will apply an additional charge per SMS sent to the user which will include the built-in fraud protection services. \n - Built-in fraud protection against telephony fraud through our integration with the Phone Reputation platform. This platform processes telephony activity in real-time and returns an - \"Allow\", \"Block\" or \"Challenge\" based on risk and a series of heuristics.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "b2BB2C",
        "publishedDateTime": "2024-11-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "8eb23d98-e534-436e-8198-99296aa20af7",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-authenticator-app"
        ],
        "shortDescription": "",
        "title": "UX update to Microsoft Authenticator app sign-in flow",
        "description": "To improve usability, we are adding a new message: \"Didn't get a sign-in request? Tap the menu icon in Authenticator and select Check for Notifications\" to the Authenticator App sign-in flow. This change involves only the addition of this message, with no admin action required. The rollout will begin automatically in early March 2025. You may want to update any relevant documentation to reflect the refreshed UX as appropriate.",
        "announcementDateTime": "2024-11-19T00:00:00Z",
        "targetDateTime": "2025-03-04T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "9034e3e3-01d0-41fa-ae89-b2a34b101388",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/migrate-azure-ad-graph-overview"
        ],
        "shortDescription": "",
        "title": "Important Update: Azure AD Graph Retirement",
        "description": "As of June 2023 , the Azure AD Graph API service is in a retirement cycle and will be retired (shut down) in incremental stages. In the first stage of this retirement cycle, newly-created applications will receive an error (HTTP 403) for any requests to Azure AD Graph APIs (https://graph.windows.net). We are revising the date for this first stage from June 30 to August 31, so only applications created after August 31, 2024 will be impacted . The second stage of the Azure AD Graph service retirement cycle will begin after January 31, 2025 . At this point, all applications that are using Azure AD Graph APIs will receive an error when making requests to the AAD Graph service. Azure AD Graph will be completely retired (and stop working) after June 30, 2025 . \n \n We understand that some apps may not have fully completed migration to Microsoft Graph. We are providing an optional configuration (through the authenticationBehaviors setting) that will allow an application to continue use of Azure AD Graph APIs through March 30, 2025 .  If you develop or distribute software that still uses Azure AD Graph APIs, you must act now to avoid interruption. You will either need to migrate your applications to Microsoft Graph (highly recommended) or configure the application for an extension, and ensure that your customers are prepared for the change.  \n To identify applications that are using Azure AD Graph APIs, we have provided two Entra recommendations with information about applications and service principals that are actively using Azure AD Graph APIs in your tenant. \n \n \n For more information, refer the documentation.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-09-01T00:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "90950226-c1da-445d-9df0-220a7fc5e940",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/decommission-connect-sync-v1"
        ],
        "shortDescription": "",
        "title": "Important Update: AzureAD and MSOnline PowerShell retirement",
        "description": "As of March 30, 2024, the legacy Azure AD PowerShell, Azure AD PowerShell Preview, and MS Online modules are deprecated. These modules will continue to function through March 30, 2025, when they are retired and stop functioning. Microsoft Graph PowerShell SDK is the replacement for these modules and you should migrate your scripts to Microsoft Graph PowerShell SDK as soon as possible. \n \n Note: as indicated in our April update, MS Online with 'Legacy Auth' will stop functioning in the weeks after June 30, 2024. Legacy Auth is typically associated with versions before 1.1.166.0, and involves use of MS Online PowerShell with the Microsoft Online Sign-In Assistant package installed. If you are using MS Online versions before 1.1.166.0 or MS Online with Legacy Auth, you should immediately migrate to Microsoft Graph PowerShell SDK or update the MS Online version to the latest version (1.1.183.81). \n \n To help you identify usage of Azure AD PowerShell in your tenant, you can use the Entra Recommendation titled Migrate Service Principals from the retiring Azure AD Graph APIs to Microsoft Graph. This recommendation will show vendor applications that are using Azure AD Graph APIs in your tenant, including AzureAD PowerShell. \n \n We are making substantial new and future investments in the PowerShell experience for managing Entra, with the recent Public Preview launch of the Microsoft Entra PowerShell module. This new module builds upon and is part of the Microsoft Graph PowerShell SDK. It is fully interoperable with all cmdlets in the Microsoft Graph PowerShell SDK, enabling you to perform complex operations with simple, well documented commands. The module also offers a backward compatibility option to simplify migration from the deprecated AzureAD Module. Additionally, we are aware that some of our customers were unable to fully migrate to scripts that managed Per-user MFA from MSOnline to Microsoft Graph PowerShell. Microsoft Graph APIs were recently made available to read and configure Per-user MFA settings for users, and availability in Microsoft Graph PowerShell SDK cmdlets is soon to follow. Read and configure Per-user MFA settings for users, and availability in Microsoft Graph PowerShell SDK cmdlets is coming soon.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2025-03-31T00:00:00Z",
        "impactLink": null,
        "changeType": "retirement",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "92272430-2b94-4150-b5cf-1e220ae0ee0f",
        "changeItemService": "groupManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/invitation-email-elements"
        ],
        "shortDescription": "",
        "title": "Upcoming changes to B2B Invitation Email",
        "description": "Starting June 2024 in the invitation from an organization, the footer will no longer contain an option to block future invitations. A guest user who had unsubscribed before will be subscribed moving forward as we roll out this change. User's will no longer be added to the unsubscribed list which was maintained here in the past: https://invitations.microsoft.com/unsubscribe/manage. \n \n This change will occur automatically—admins and users won’t need to take any action. Here’s more details: \n \n - Email will not have unsubscribe link moving forward. \n - The link in already sent email will not work. \n - Customer who has already unsubscribed would become subscribed.",
        "announcementDateTime": "2024-03-31T23:00:00Z",
        "targetDateTime": "2024-06-01T07:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "942388bf-a425-4ccb-8ef1-53c8f1eb98c5",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/evolve-your-ciam-strategy-with-external-id/ba-p/3627348"
        ],
        "shortDescription": "Integrate secure, customizable, user-friendly identity management for customers with Microsoft Entra External ID.",
        "title": "Microsoft Entra External ID",
        "description": "We're thrilled to announce the general availability (GA) of Microsoft Entra External ID , our next-generation, developer-friendly customer identity access management (CIAM) solution. Whether you're building applications for partners, business customers or consumers, External ID makes secure and customizable CIAM simple. \n \n Microsoft Entra External ID enables you to: \n 1. Secure all identities with a single solution. \n 2. Streamline secure collaboration. \n 3. Create frictionless end user experiences. \n 4. Accelerate the development of secure applications.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "b2BB2C",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "9457bf0d-9099-4115-b21f-f09ffb4be250",
        "changeItemService": "mfA",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-oath-tokens#hardware-oath-tokens-preview"
        ],
        "shortDescription": "",
        "title": "Public preview refresh for Hardware OATH tokens",
        "description": "On November 14th, we launched a new version of the Hardware OATH tokens public preview. This update supports end-user self-assignment, activation, and delegated admin access. For more details, refer to the public documentation. \n \n To take advantage of this update, create tokens using the MS Graph API. The new experience will run alongside the legacy version until its deprecation, which will be announced through ‘What's new in Microsoft Entra?’ (aka.ms/entra/whatsnew) and M365 Message Center posts. \n \n To migrate now, remove tokens from the old system and recreate them in the new one using MS Graph. At General Availability, an MS Graph API will be available for per-user token migration without user disruption.",
        "announcementDateTime": "2024-11-21T00:00:00Z",
        "targetDateTime": "2025-03-31T23:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "98a21df8-3a85-461c-b786-f61c76d24a4c",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/education/windows/federated-sign-in?tabs=intune"
        ],
        "shortDescription": "Web Sign-In for Windows is now available!",
        "title": "Web Sign-In for Windows",
        "description": "Starting in Windows 11, version 22H2 with KB5030310, you can enable a web-based sign-in experience on Microsoft Entra joined devices, unlocking new sign-in options and capabilities. This feature is called Web sign-in. \n \n Web sign-in is a credential provider, and it was initially introduced in Windows 10 with support for Temporary Access Pass (TAP) only. With the release of Windows 11, the supported scenarios and capabilities of Web sign-in are expanded. \n For example, you can sign in with the Microsoft Authenticator app or with a SAML-P federated identity.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "9bc685b8-43b8-4ead-8a59-ebb8081763c8",
        "changeItemService": "conditionalAccess",
        "tags": [
            ""
        ],
        "systemTags": [
            "entra_roadmap_new_features_30days"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/protected-actions-overview"
        ],
        "shortDescription": "",
        "title": "Protected actions for hard deletions",
        "description": "Customers can now configure Conditional Access policies to protect against early hard deletions. Protected action for hard deletion protects hard deletion of users, Microsoft 365 groups, and applications.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2025-02-03T10:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "9de71f68-05b1-4575-8c0c-19cad44a8b82",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/my-access-portal-overview"
        ],
        "shortDescription": "",
        "title": "Overview page in the My Access portal",
        "description": "The new Overview page in My Access provides a more relevant place for users to land. The Overview page points them to the tasks they need to complete and helps familiarize users with how to complete tasks in My Access.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-11-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "9f6b613c-a791-4932-b898-a8b09598ac53",
        "changeItemService": "conditionalAccess",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://www.microsoft.com/en-us/security/blog/2023/11/06/automatic-conditional-access-policies-in-microsoft-entra-streamline-identity-protection/"
        ],
        "shortDescription": "",
        "title": "Auto-rollout of Conditional Access policies",
        "description": "Earlier in November 2023, we announced the auto-rollout of Microsoft Entra Conditional Access policies to automatically protect tenants based on risk signals, licensing, and usage. This is to remind you that Microsoft will begin automatically protecting customers with Microsoft-managed Conditional Access policies. We’ll begin a gradual rollout of these policies to all eligible tenants and notify in advance. Once the policies are visible in your tenant, you’ll have 90 days to review and customize or disable them before we turn them on. For those 90 days, the policies will be in report-only mode, which means Conditional Access will log the policy results without enforcing them.",
        "announcementDateTime": "2023-11-07T01:00:00Z",
        "targetDateTime": "2024-02-01T08:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "a0ea49ab-71b8-4097-a0b2-70c9c74637e4",
        "changeItemService": "entitlementManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [
            "entra_change_announcements_90days"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/entitlement-management-access-package-edit"
        ],
        "shortDescription": "",
        "title": "Moving from a browse-based to a search-based solution for access package discovery",
        "description": "We're excited to introduce a new feature in My Access: a curated list of recommended access packages. This will allow users to quickly view the most relevant access packages without scrolling through a long list. The final tab will be a complete, searchable list of all visible access packages in the tenant. \n \n We will deploy this to all customers as an opt-in preview by the end of October, with in-product messaging to highlight the change. By the end of November, it will transition to an opt-out preview, with general availability (GA) planned for December.",
        "announcementDateTime": "2024-09-13T00:00:00Z",
        "targetDateTime": "2024-10-30T23:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "a1a53d24-845e-4771-b349-f61942d8e99d",
        "changeItemService": "userAccessManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/azure/role-based-access-control/custom-roles"
        ],
        "shortDescription": "",
        "title": "Define Azure custom roles with data actions at Management Group scope",
        "description": "You can create custom roles containing Data Actions at the Management Group level and assign these roles at the subscription scope or below. This allows centralized management of custom roles , significantly reducing administrative overhead by eliminating the need to manage duplicate role definitions across multiple subscriptions.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "authZAccessDelegation",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "a3a83714-bc46-4d81-9457-c318478254bf",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/customers/concept-custom-url-domain"
        ],
        "shortDescription": "",
        "title": "Support for Custom URL Domains in Microsoft Entra External ID",
        "description": "A custom URL domain lets you use your verified custom URL domain names as your applications' sign-in authentication endpoints. When you add a new custom URL domain name, you can associate it with a custom URL domain. Then a reverse proxy service, such as Azure Front Door, can use the custom URL domain to direct sign-ins to your application.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "b2BB2C",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "a5bb0720-21d9-4629-8397-a7773dd825e9",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity-platform/custom-extension-email-otp-get-started"
        ],
        "shortDescription": "",
        "title": "Bring your own 3rd party email OTP provider for Microsoft Entra External ID",
        "description": "Bring your own favorite email provider for email OTPs of sign-in and sign-up flows to Microsoft Entra External ID. You can use Azure Communication Service (ACS) or true 3rd party of choice making your authentication experiences consistently branded.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "b2BB2C",
        "publishedDateTime": "2024-12-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "a66a5483-0771-4333-a3ee-b61dfccfb10d",
        "changeItemService": "provisioning",
        "tags": [
            ""
        ],
        "systemTags": [
            "entra_roadmap_new_features_30days"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/connect/reference-connect-version-history#241290"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra Connect Version 2.4.129.0 is now available",
        "description": "On January 15, 2025, we released Microsoft Entra Connect Sync Version 2.4.129.0 that supports auditing administrator events. More details are available in the release notes. We will autoupgrade eligible customers to this latest version of Entra Connect in February 2025. For customers who wish to be auto-upgraded, ensure that you have auto-upgrade configured.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2025-02-03T10:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "a6c5d63b-6a73-430a-bd3c-2392cc69019f",
        "changeItemService": "mfA",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/update-to-security-defaults/ba-p/4044868"
        ],
        "shortDescription": "",
        "title": "Update to security defaults",
        "description": "As part of the Secure Future Initiative, we’ve evolved our security approach to align with three security principles: secure by design, secure by default, and secure operations. Secure by default means security protections are enabled and enforced by default. In Microsoft Entra, security defaults are an example demonstrating our secure by default approach. Security defaults are enabled for every new tenant. This provides a baseline level of protection for your Entra identities and resources. To make sure that organizations relying on security defaults are well protected, we’re updating a requirement for authentication method registration to help improve your security posture. \n We’re removing the option to skip multifactor authentication (MFA) registration for 14 days when security defaults are enabled. This means all users will be required to register for MFA on their first login after security defaults are turned on. This will help reduce the risk of account compromise during the 14-day window, as MFA can block over 99.2% of identity-based attacks. This change affects newly created tenants starting on December 2nd, 2024 and will be rolled out to existing tenants starting in January 2025. \n This update is part of our ongoing effort to provide you with a secure and reliable identity service. We recommend that you enable security defaults for your organization if you are not using Conditional Access, as security defaults offer a simple and effective way to protect your users and resources from common threats.",
        "announcementDateTime": "2024-10-31T00:00:00Z",
        "targetDateTime": "2024-12-03T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "a6e0ee0c-b1a3-416c-8801-8da391fa1c24",
        "changeItemService": "conditionalAccess",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/what-s-new-in-microsoft-entra/ba-p/3796391"
        ],
        "shortDescription": "Conditional Access location condition is moving up.",
        "title": "Conditional Access location condition is moving up",
        "description": "Starting mid-April 2024, the Conditional Access ‘Locations’ condition is moving up. Locations will become the 'Network' assignment, with the new Global Secure Access assignment - 'All compliant network locations'. This change will occur automatically, admins won’t need to take any action. \n \n More details: \n \n - The familiar ‘Locations’ condition is unchanged, updating the policy in the ‘Locations’ condition will be reflected in the ‘Network’ assignment and vice versa. \n - No functionality changes, existing policies will continue to work without changes.",
        "announcementDateTime": "2024-03-31T00:00:00Z",
        "targetDateTime": "2024-04-15T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "a86eeaa4-7c10-4df2-806a-b9c4c3c9418d",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/manage-workflow-on-premises"
        ],
        "shortDescription": "",
        "title": "Enable, Disable and Delete synchronized user accounts with Lifecycle workflows",
        "description": "Lifecycle Workflows is now able to enable, disable and delete user accounts which are synchronized from Active Directory Domain Services (AD DS) to Microsoft Entra. This allows you to complete the employee offboarding process by deleting the user account after a retention period.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-08-29T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "a8e985eb-fd9e-4764-ac18-4376623d8b65",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [
            "entra_roadmap_highlight_product_news"
        ],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/blog/identity/security-copilot-is-now-embedded-in-microsoft-entra/4289387"
        ],
        "shortDescription": "Security Copilot is now integrated into the Microsoft Entra admin center for easy access to identity skills.",
        "title": "Security Copilot is now embedded in Microsoft Entra",
        "description": "Today we’ve announced the public preview of Microsoft Security Copilot embedded in the Microsoft Entra admin center. This integration brings all identity skills previously made generally available for the Security Copilot standalone experience in April 2024, along with new identity capabilities for admins and security analysts to use directly within the Microsoft Entra admin center. We've also added brand new skills to help improve identity-related risk investigation. In December, we will broaden the scope even further to include a set of skills specifically for App Risk Management in both standalone and embedded experiences of Security Copilot and Microsoft Entra. These capabilities allow identity admins and security analysts better identify, understand, and remediate the risks impacting applications and workload identities registered in Microsoft Entra. \n \n With Security Copilot now embedded in Microsoft Entra, identity admins get AI-driven, natural-language summaries of identity context and insights tailored for handling security incidents, equipping them to better protect against identity compromise. The embedded experience also accelerates troubleshooting tasks like resolving identity-related risks and sign-in issues, without ever leaving the admin center.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-11-19T21:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "a9aa0b74-f82b-4b87-9e3a-98633f5f167b",
        "changeItemService": "reporting",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/api/resources/healthmonitoring-overview?view=graph-rest-beta&amp;source=docs"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra Health Monitoring Alerts Available in MS Graph API ",
        "description": "Intelligent alerts in Microsoft Entra health monitoring notify tenant admins and security engineers whenever a monitored scenario breaks from its typical pattern. Microsoft Entra's alerting capability watches the low-latency health signals of each scenario and fires a notification in the event of an anomaly. The set of alert-ready health signals and scenarios will grow over time. This feature will be available first in MS Graph API, with availability in Microsoft Entra admin center to follow.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "monitoringReporting",
        "publishedDateTime": "2024-12-02T20:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "adbe99ad-f366-4e69-8e30-df841f0d8b0b",
        "changeItemService": "userManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/fundamentals/how-to-manage-user-profile-info"
        ],
        "shortDescription": "",
        "title": "Enhanced user management in Admin Center user interface",
        "description": "Admins will now be able to multi-select and edit users at once through the Entra admin center. With this new capability, admins can bulk edit user properties, add users to groups, edit account status, and more. This UX enhancement will significantly improve efficiency for user management tasks in the admin center.",
        "changeItemState": "comingSoon",
        "deliveryStage": "publicPreview",
        "category": "userManagement",
        "publishedDateTime": "2025-02-26T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "aeda45fe-e193-4e1a-addf-594002a2a1ae",
        "changeItemService": "entitlementManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/entitlement-management-external-users#manage-the-lifecycle-of-external-users"
        ],
        "shortDescription": "",
        "title": "Grace period support for entitlement management-managed guest users ",
        "description": "We are excited to announce general availability of grace period setting in Entitlement Management. With this new feature the administrator can now configure a grace period so that the guests who lose their last access package assignment will be deleted after a set number of days if they do not get a new assignment.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "entitlementManagement",
        "publishedDateTime": "2024-08-29T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "afdddab0-c273-442f-9ead-3ad9b323d8a8",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://entra.microsoft.com/"
        ],
        "shortDescription": "",
        "title": "New Microsoft Entra Home page",
        "description": "We redesigned the Microsoft Entra admin center's homepage to help you do the following: Learn about the product suite Identify opportunities to maximize feature value Stay up to date with recent announcements and new features And more!",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "directory",
        "publishedDateTime": "2024-01-31T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "b09654ad-677a-4e04-bc1b-a9e871d0155d",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity-platform/howto-configure-app-instance-property-locks"
        ],
        "shortDescription": "",
        "title": "Enabling app instance lock by default",
        "description": "Starting March 2024, new applications created using Microsoft Graph application API will have “App instance lock” enabled by default. The capability called App instance lock for workload identities was launched in September 2023. This feature allows app developers to protect their multi-tenant apps from attackers tampering with critical properties. Applications created using Entra ID portal already have the setting enabled by default, and going forward, it will be enabled for other app creation surface areas such as MS Graph, PowerShell, and SDKs",
        "announcementDateTime": "2023-06-30T07:00:00Z",
        "targetDateTime": "2024-03-01T08:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "b4f06d0e-ffba-4347-8811-dda6c073e46e",
        "changeItemService": "enterpriseApps",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://devblogs.microsoft.com/identity/access-tokens-and-id-tokens/?ocid=identity_eml_tnp_autoid51_title"
        ],
        "shortDescription": "",
        "title": "Encrypted Access Tokens for Microsoft APIs",
        "description": "As of October 2024, Microsoft is gradually enabling encrypted access tokens across more of its APIs. This change alters the format of access tokens for Microsoft-owned APIs. \n \n Action Required: Client applications should treat access tokens as opaque strings, meaning they should not attempt to read, inspect, or parse them. Only the web APIs that are the intended recipients of the access tokens should be parsing and validating them. \n \n Why This Matters: If applications rely on specific token formats (e.g., expecting a URI in the ‘aud’ claim rather than a GUID), these assumptions may cause functionality issues as token formats change. \n \n If your client application currently parses access tokens, please review and update your code in line with best practices outlined on the Microsoft Identity Platform documentation.",
        "announcementDateTime": "2024-11-01T00:00:00Z",
        "targetDateTime": "2024-10-31T23:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "b4f9387f-4107-42d2-9919-8ff6e9afc049",
        "changeItemService": "mfA",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-azure-ad-blog/microsoft-entra-change-announcements-march-2023-train/ba-p/2967448"
        ],
        "shortDescription": "Updated retirement date for managing authentication methods in legacy MFA and SSPR policies",
        "title": "Updated retirement date for managing authentication methods in legacy MFA and SSPR policies",
        "description": "In March 2023, we publicly announced the retirement date for managing authentication methods in the legacy MFA and SSPR policies (https://techcommunity.microsoft.com/t5/microsoft-entra-azure-ad-blog/microsoft-entra-change-announcements-march-2023-train/ba-p/2967448). Due to some internal engineering funding updates, we need to update the retirement date from September 2024 to September 2025.",
        "announcementDateTime": "2023-09-15T00:00:00Z",
        "targetDateTime": "2023-12-13T12:48:16.900903Z",
        "impactLink": null,
        "changeType": "retirement",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "b58e12e6-ee2e-4e96-bff1-40e762d5d7fb",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/fundamentals/frontline-worker-management"
        ],
        "shortDescription": "",
        "title": "Private Preview - QR code sign-in, a new authentication method for Frontline Workers",
        "description": "We are introducing a new simple way for Frontline Workers to authenticate in Microsoft Entra ID with a QR code and PIN, eliminating the need to enter long UPNs and alphanumeric passwords multiple times during their shift. \n With the private preview release of this feature in August 2024, all users in your tenant will see a new link ‘Sign in with QR code’ on navigating to https://login.microsoftonline.com > ‘Sign-in options’ > ‘Sign in to an organization’ page. This new link, ‘Sign in with QR code’, will be visible only on mobile devices (Android/iOS/iPadOS). If you are not participating in the private preview, users from your tenant will not be able to sign-in through this method while we are still in private preview. They will receive an error message if they try to sign-in. \n \n \n The feature will have a ‘preview’ tag until it is generally available. Your organization needs to be enabled to test this feature. Broad testing will be available in public preview, which we will announce later. While the feature is in private preview, no technical support will be provided.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-08-02T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "bb2820d2-b318-43b3-8961-7856f54342d9",
        "changeItemService": "provisioning",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/cloud-sync/migrate-group-writeback"
        ],
        "shortDescription": "",
        "title": "Decommissioning of Group Writeback V2 (Public Preview) in Entra Connect Sync - Reminder ",
        "description": "The public preview of Group Writeback V2 (GWB) in Entra Connect Sync is no longer be available and Connect Sync will no longer support provisioning cloud security groups to Active Directory. \n \n \n Another similar functionality is offered in Entra Cloud Sync, called “ Group Provision to AD ”, that maybe used instead of GWB V2 for provisioning cloud security groups to AD. Enhanced functionality in Cloud Sync, along with other new features, are being developed. \n \n Customers who use this preview feature in Connect Sync should  switch their configuration from Connect Sync to Cloud Sync . Customers can choose to move all their hybrid sync to Cloud Sync (if it supports their needs) or Cloud Sync can be run side-by-side and move only cloud security group provisioning to AD onto Cloud Sync. Customers who provision Microsoft 365 groups to AD can continue using GWB V1 for this capability.",
        "announcementDateTime": "2023-11-02T00:00:00Z",
        "targetDateTime": "2024-07-01T00:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "bd31be5b-c5cb-4ed1-a5e9-41d13e7a5799",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/msal/java/getting-started/device-code-flow"
        ],
        "shortDescription": "",
        "title": "Upcoming Improvements to Entra ID Device Code Flow ",
        "description": "As part of our ongoing commitment to security, we are announcing upcoming enhancements to the Entra ID device code flow. These improvements aim to provide a more secure and efficient authentication experience. \n \n \n \n We've refined the messaging and included app details within the device code flow to ensure a more secure and precise user experience. Specifically, we've adjusted headers and calls to action to help your users recognize and respond to security threats more effectively. These changes are designed to help your users make more informed decisions and prevent phishing attacks. \n \n These changes will be gradually introduced starting in July 2024 and are expected to be fully implemented by August 30, 2024. No action required from you.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-08-31T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "bdc0cc5b-b797-4010-ab8b-2fb0516aff36",
        "changeItemService": "mfA",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/howto-mfa-mfasettings#phone-call-settings"
        ],
        "shortDescription": "",
        "title": "Changes to phone call settings: custom greetings and caller ID",
        "description": "Starting September 2024, phone call settings (custom greetings and caller ID) under Entra's multifactor authentication blade will be moved under the voice authentication method in the authentication method policy. Instead of accessing these settings through the Entra ID or Azure portal, they will be accessible through MS Graph API. If your organization is using custom greetings and/or caller ID, please make sure to check the public documentation once we release the new experience to learn how to manage these settings through MS Graph.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-09-02T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "c2bb2608-1e9f-4c83-89f3-3ca51f4730aa",
        "changeItemService": "mfA",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-system-preferred-multifactor-authentication"
        ],
        "shortDescription": "",
        "title": "External Auth Methods support for system preferred MFA",
        "description": "Support for EAM as a supported method will begin rolling out at the beginning of March 2025. When this is live in a tenant where system preferred is enabled and users are in scope of an EAM policy, those users will be prompted for their external authentication method if their most secure registered method is Microsoft Authenticator notification. External Authentication Method will appear as third in the list of most secure methods. If the user has a Temporary Access Pass (TAP) or Passkey (FIDO2) device registered, they will be prompted for those In addition, users in the scope of an EAM policy will have the ability to delete all registered second factor methods from their account, even if the method being deleted is specified as the default sign in method or is system preferred.",
        "changeItemState": "comingSoon",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2025-02-26T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "c3875e41-dcc3-459d-8849-1f7679d0cfe1",
        "changeItemService": "provisioning",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/connect/reference-connect-version-history#24270"
        ],
        "shortDescription": "",
        "title": "Entra Connect Sync Version 2.4.27.0",
        "description": "On November 14, 2025, we released Entra Connect Sync Version 2.4.27.0 that uses the OLE DB version 18.7.4 that further hardens our service. \n Action required: Upgrade to this latest version of connect sync to improve your security.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-12-03T20:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "c4d0f161-6ee6-4cfe-b058-09fe80d1eafc",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-certificate-based-authentication-technical-deep-dive#understanding-crl-validation-preview"
        ],
        "shortDescription": "",
        "title": "Certificate-based authentication improvments",
        "description": "A CRL is a record of digital certificates that have been revoked before the end of their validity period by a certificate authority (CA). When CAs are uploaded to the Microsoft Entra trust store, a CRL, or more specifically the CrlDistributionPoint attribute, isn't required. A CA can be uploaded without a CRL endpoint, and certificate-based authentication won't fail if an issuing CA doesn't have a CRL specified. \n To strengthen security and avoid misconfigurations, an Authentication Policy Administrator can require CBA authentication to fail if no CRL is configured for a CA that issues an end user certificate.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2024-10-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "c5994b22-9a75-4846-8490-a7acbbe31897",
        "changeItemService": "mfA",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/entra/identity/authentication/how-to-enable-passkey-fido2#provision-fido2-security-keys-using-microsoft-graph-api-preview"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra ID FIDO2 provisioning APIs",
        "description": "Microsoft Entra ID now supports FIDO2 provisioning via API, allowing organizations to pre-provision security keys (passkeys) for users. These new APIs can simplify user onboarding and provide seamless phishing-resistant authentication on day one for employees.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-08-29T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "c8850cce-54d8-4239-a156-e4418d01603a",
        "changeItemService": "msGraph",
        "tags": [
            ""
        ],
        "systemTags": [
            "entra_roadmap_highlight_new_feature"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/powershell/entra-powershell/?view=entra-powershell"
        ],
        "shortDescription": "A command-line tool to manage and automate Microsoft Entra resources programmatically.",
        "title": "Microsoft Entra PowerShell is now generally available",
        "description": "We’re thrilled to announce the general availability (GA) of the Microsoft Entra PowerShell module, a new scenario-focused PowerShell module designed to streamline management and automation for Microsoft Entra.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "developerExperience",
        "publishedDateTime": "2025-02-03T11:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "cb7479c4-de4a-4d2d-bf3a-b5cf45602842",
        "changeItemService": "identityProtection",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-protection/overview-identity-protection"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra ID Protection now detects password spray attacks in real-time",
        "description": "Traditionally, security admins comb through logs to identify password spray attack patterns. Now, we’ve enhanced Microsoft Entra ID Protection to detect password spray attacks in real-time. It reduces remediation from hours to seconds by interrupting attacks during the sign-in flow. \n \n Risk-based Conditional Access can automatically respond to this new signal by raising session risk, immediately challenging the next risky sign-in attempt, and stopping password spray attempts in their tracks. This cutting-edge detection, coming soon to public preview, works alongside existing detections for advanced attacks such as Adversary-in-the-Middle (AitM) phishing and token theft, to ensure comprehensive coverage against modern attacks.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-11-19T21:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "cd572975-b201-44c8-8a5e-a5a49a9eae1d",
        "changeItemService": "deviceAccessManagement",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/devices/device-registration-how-it-works"
        ],
        "shortDescription": "",
        "title": "Deprecating Enable Browser Access (EBA) UI ",
        "description": "EBA is a feature in Android broker apps (such as Company Portal and Authenticator) that enables duplicating the Entra ID device registration certificate to a global keychain location on the Android device. This allows browsers that are not integrated with brokers, such as Chrome, to access the certificate for device authentication, which is required to comply with Entra device compliance policies. \n \n As part of our overall security hardening efforts, we're migrating Entra ID device registration certificates and Android device identities to be hardware-bound. This will enable token protection policies in the future and protect against bypassing device compliance policies. Since the device identity will be hardware-bound, the EBA UI will no longer be able to duplicate and export keys on demand. We plan to deprecate the Enable Browser Access (EBA) UI in the Authenticator and Company Portal apps, and browser access (e.g., Chrome) will automatically be enabled during device registration. \n \n This capability already exists for Intune MDM users. The change extends it to non-Intune users, such as those using VMWare and Jamf mobile device management (MDM) software. This will apply to all customers in the first half of the 2025 calendar year . No action is required from customers at this time .",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2025-03-31T23:00:00Z",
        "impactLink": null,
        "changeType": "deprecation",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "ce4d594b-b763-4deb-831a-6e91a14c696f",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-33781"
        ],
        "shortDescription": "",
        "title": "Security update to Entra ID affecting clients which are running old, unpatched builds of Windows",
        "description": "We are making a security update to Entra ID such that use of older unpatched version of Windows which still use the less secure Key Derivation Function v1 (KDFv1) will no longer be supported. Once the update is rolled out, unsupported and unpatched Windows 10 and 11 clients will no longer be able to sign in to Entra ID. Globally, more than 99% of Windows clients signing in to Entra ID have the required security patches. \n \n Action required: \n \n If your Windows devices have Security Patches after July 2021 no action is required. If your Windows devices do not have security updates after July 2021, update Windows to the latest build of your currently supported Windows version to maintain access to Entra ID. All currently supported versions of Windows have the required patch. We recommend you keep Windows up to date with Security Updates. \n \n Background: \n \n A Security Update to Windows CVE-2021-33781 was issued in July 2021 to address a vulnerability where Primary Refresh Tokens were not stored sufficiently securely in the client. Once patched, Windows clients used the stronger KDFv2 algorithm. All versions of Windows released since that time have the update and handle the token securely. \n \n A small percentage of Windows devices have not yet been updated and are still using the older v1 key derivation function. To improve security of the system, unpatched devices using the KDFv1 algorithm will no longer be able to sign in to Entra ID using Primary Refresh Tokens. \n \n What is the user experience on unsupported Windows devices when this change is rolled out? \n \n Users of Windows devices which haven’t been updated with patches since July 2021 may experience sign in failures with their Entra ID user accounts on joined or hybrid joined Windows device. \n \n How do I diagnose this situation? \n \n The error code, which will show in sign in logs, is 'AADSTS5000611: Symmetric Key Derivation Function version 'KDFV1' is invalid. Update the device for the latest updates.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-08-01T00:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "cf9b7e0b-7f9f-4fc4-b856-6189deb28c0b",
        "changeItemService": "entitlementManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/entitlement-management-roles"
        ],
        "shortDescription": "",
        "title": "Entitlement management directory roles can be included in an access package",
        "description": "By assigning Microsoft Entra roles to employees, and guests, using Entitlement Management, you can look at a user's entitlements to quickly determine which roles are assigned to that user. When you include a Microsoft Entra role as a resource in an access package, you can also specify whether that role assignment is “eligible” or “active”. \n \n Assigning Microsoft Entra roles through access packages helps to efficiently manage role assignments at scale and improves the role assignment lifecycle.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "entitlementManagement",
        "publishedDateTime": "2024-05-06T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "cfd31b6d-46e3-4461-b3ce-4cc1cf239d92",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/permissions-management/permissions-management-for-defender-for-cloud"
        ],
        "shortDescription": "",
        "title": "Integration of Microsoft Entra Permissions Management with Microsoft Defender for Cloud (MDC)",
        "description": "Microsoft Defender for Cloud's integration with Microsoft Entra Permissions Management (Permissions Management) provides a Cloud Infrastructure Entitlement Management (CIEM) security model that helps organizations manage and control user access and entitlements in their cloud infrastructure. CIEM is a critical component of the Cloud Native Application Protection Platform (CNAPP) solution that provides visibility into who or what has access to specific resources. CIEM ensures that access rights adhere to the principle of least privilege (PoLP), where users or workload identities, such as apps and services, receive only the minimum levels of access necessary to perform their tasks. CIEM also helps organizations to monitor and manage permissions across multiple cloud environments, including Azure, AWS, and GCP. \n \n Integrating Permissions Management with Defender for Cloud (CNAPP) strengthens cloud security by preventing security breaches caused by excessive permissions or misconfigurations. Permissions Management continuously monitors and manages cloud entitlements, helping to discover attack surfaces, detect threats, right-size access permissions, and maintain compliance. This integration enhances the capabilities of Defender for Cloud in securing cloud-native applications and protecting sensitive data.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "permissionsManagement",
        "publishedDateTime": "2024-05-25T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "d0a61ff0-5849-4944-944c-229b3a70e2ff",
        "changeItemService": "groupManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/connect/reference-connect-version-history#retiring-microsoft-entra-connect-2x-versions"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra Connect 2.x version retirement ",
        "description": "In March of 2023, Microsoft started retiring past versions of Microsoft Entra Connect Sync 2.x 12 months from the date they were superseded by a newer version. Currently only builds 2.1.20.0 (release November 9, 2022) or later are supported.",
        "announcementDateTime": "2024-03-31T23:00:00Z",
        "targetDateTime": "2024-04-01T07:00:00Z",
        "impactLink": null,
        "changeType": "endOfSupport",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "d1f24d06-211b-41fd-b94c-bf137379b6c1",
        "changeItemService": "other",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/connect/security-updates-pks"
        ],
        "shortDescription": "",
        "title": "Upgrade to the latest version of Microsoft Entra Connect by September 23, 2024",
        "description": "Since September 2023, we have been auto-upgrading Microsoft Entra Connect Sync and Microsoft Entra Connect Health to an updated build as part of a precautionary security-related service change. For customers who have previously opted out of auto-upgrade or for whom auto-upgrade failed, we strongly recommend that you upgrade to the latest versions by September 23, 2024 . \n Please click learn more for details.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-09-24T00:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "d2359867-c410-4990-9b87-bd2a4767bcae",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/api/resources/application?view=graph-rest-1.0#signinaudience-values"
        ],
        "shortDescription": "Changing sign-in audience for new applications",
        "title": "Changing sign-in audience for new applications",
        "description": "Starting March 2024, new applications created using Microsoft Graph application API will change the default value of 'signInAudience' property in app registration from ' AzureADandPersonalMicrosoftAccount ' to ' AzureADMyOrg '. Our analysis shows that most new applications do not ever support users outside the application tenant. This will improve latency and security of apps.",
        "announcementDateTime": "2023-06-30T07:00:00Z",
        "targetDateTime": "2024-03-01T08:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "d6834c48-1820-4adc-9e57-2aa44c928c89",
        "changeItemService": "provisioning",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/cloud-sync/how-to-configure-entra-to-active-directory"
        ],
        "shortDescription": "",
        "title": "Security group provisioning to AD using Microsoft Entra cloud sync",
        "description": "Security groups provisioning to AD (aka Group Writeback) is now generally available through Microsoft Entra Cloud Sync in Azure Global and Azure Government clouds. With this new capability, you can easily govern AD based on-premises applications (Kerberos based apps) using Microsoft Entra Governance.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-04-27T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "d72e3a52-bd42-4757-970a-146413bcebf7",
        "changeItemService": "groupManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/microsoft-identity-manager/migrate-from-the-fim-connector-for-azure-active-directory"
        ],
        "shortDescription": "",
        "title": "Windows Azure Active Directory Connector for Forefront Identity Manager (FIM WAAD Connector)",
        "description": "The Windows Azure Active Directory Connector for Forefront Identity Manager (FIM WAAD Connector) from 2014 was deprecated in 2021. The standard support for this connector will end in April 2024. Customers should remove this connector from their MIM sync deployment, and instead use an alternative provisioning mechanism.",
        "announcementDateTime": "2024-03-31T23:00:00Z",
        "targetDateTime": "2024-04-30T00:00:00Z",
        "impactLink": null,
        "changeType": "endOfSupport",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "d7d6e62a-b0c4-4601-bd7c-ef7388bfba92",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [
            "entra_roadmap_new_features_30days"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/fundamentals/copilot-entra-lifecycle-workflow"
        ],
        "shortDescription": "",
        "title": "Manage Lifecycle Workflows with Microsoft Security CoPilot in Entra",
        "description": "Now customers can manage and customize Lifecycle Workflows using natural language with Microsoft Security CoPilot in Entra. Our Lifecycle Workflows (LCW) Copilot solution provides step-by-step guidance to perform key workflow configuration and execution tasks using natural language. It allows customers to quickly get rich insights to help monitor and troubleshoot workflows for compliance.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identityGovernance",
        "publishedDateTime": "2025-02-03T10:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "da36dd6b-959c-494c-8943-e635617a4af6",
        "changeItemService": "identityProtection",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/what-s-new-in-microsoft-entra/ba-p/3796391"
        ],
        "shortDescription": "",
        "title": "Use Entra Conditional Access to create and manage risk-based policies",
        "description": "As announced in October 2023, we invite customers to upgrade your legacy Entra ID Protection User risk policy and Sign-in risk policy to modern risk-based policies in Conditional Access. The legacy risk policies are being retired. \n \n Starting May 1, 2024, no new legacy User risk policy or Sign-in risk policy can be created in Entra ID Protection. To create and enable new risk-based policies, please go to Conditional Access. \n \n Starting July 1, 2024, existing legacy User risk policy or Sign-in risk policy in Entra ID Protection will not be editable anymore.",
        "announcementDateTime": "2024-04-01T00:00:00Z",
        "targetDateTime": "2024-07-02T07:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "db19946d-152e-4f2a-a9a9-e2dfb689ac42",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/verified-id/how-use-vcnetwork"
        ],
        "shortDescription": "",
        "title": "Enabling public publishing of custom credentials via the admin portal UI",
        "description": "The Verified ID Admin portal now supports public publishing of custom credentials (in addition to VerifiedEmployee) to the VC network via the Admin portal UI. For any given Verifiable Credential, the Admin can now select \"Publish credential to Verified ID network\" checkbox from the \"Issue a credential\" page to enable this. \n \n Once enabled, customers using Entitlement Management with Verified ID can use Access Packages to ask for identity verification by selecting the required custom VC using the VC Network picker.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "dcf4eab8-101b-4260-81eb-b582aa53a33d",
        "changeItemService": "conditionalAccess",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/conditional-access/how-to-policy-insider-risk"
        ],
        "shortDescription": "",
        "title": "Insider Risk condition in Conditional Access is GA",
        "description": "Insider Risk condition in Conditional Access is a new feature that leverages signals from Microsoft Purview's Adaptive Protection capability to enhance the detection and automatic mitigation of Insider threats. This integration allows organizations to more effectively manage and respond to potential insider risks by using advanced analytics and real-time data. \n \n For example, if Purview detects unusual activity from a user, Conditional Access can enforce additional security measures such as requiring multi-factor authentication (MFA) or blocking access. This is a premium feature and requires Entra ID P2 license.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-07-13T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "ddde9e3b-7ee4-4066-a62e-fb1fc5fb87a1",
        "changeItemService": "mfA",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [
            "entra_roadmap_highlight_change_announcement"
        ],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-mandatory-multifactor-authentication"
        ],
        "shortDescription": "Learn how multifactor authentication (MFA) can protect your data and identity and get ready for upcoming MFA requirement.",
        "title": "Upcoming MFA Enforcement on Microsoft Entra admin center",
        "description": "As part of our commitment to providing our customers with the highest level of security, we previously announced that Microsoft will require multi-factor authentication (MFA) for users signing into Azure. We would like to share an update that the scope of MFA enforcement includes Microsoft Entra admin center in addition to the Azure portal and Intune admin center. This change will be rolled out in phases, allowing organizations time to plan their implementation: \n Phase 1: Starting in the second half of the calendar year 2024, MFA will be required to sign in to the Entra admin center, Azure portal, and Intune admin center. The enforcement will gradually roll out to all tenants worldwide. This phase will not impact other Azure clients such as the Azure Command Line Interface, Azure PowerShell, Azure mobile app, and Infrastructure as Code (IaC) tools. \n Phase 2: Beginning in early 2025, gradual enforcement of MFA at sign-in for the Azure CLI, Azure PowerShell, Azure mobile app, and Infrastructure as Code (IaC) tools will commence. \n Microsoft will send a 60-day advance notice to all Entra global admins by email and through Azure Service Health Notifications to notify them of the start date of enforcement and required actions. Additional notifications will be sent through the Azure portal, Entra admin center, and the M365 message center. \n We understand that some customers may need additional time to prepare for this MFA requirement. Therefore, Microsoft will allow extended time for customers with complex environments or technical barriers. The notification from us will also include details about how customers can postpone the start date of enforcement for their tenants, the duration of the postponement, and a link to apply.",
        "announcementDateTime": "2024-08-16T00:00:00Z",
        "targetDateTime": "2024-08-16T00:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "de5a0fde-314f-42dd-ad9a-b8e2dfd29da9",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://review.learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-qr-code?branch=main&amp;branchFallbackFrom=pr-en-us-6285"
        ],
        "shortDescription": "",
        "title": "QR code authentication, a simple and fast authentication method for Frontline Workers",
        "description": "We are thrilled to announce public preview of QR code authentication in Entra ID, providing an efficient and simple authentication method for frontline workers. \n \n You will see a new authentication method ‘QR code’ in Entra ID Authentication method Policies. You can enable and add QR code for your frontline workers via Entra ID, My Staff, or MS Graph APIs. All users in your tenant will see a new link Sign in with QR code on navigating to https://login.microsoftonline.com > Sign-in options > Sign in to an organization page. This new link will be visible only on mobile devices (Android/iOS/iPadOS). Users can use this auth method only if you have added and provided a QR code to them. QR code auth is also available in BlueFletch and Jamf.",
        "changeItemState": "comingSoon",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2025-02-26T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "e2646ba1-a196-40b9-b61a-f556b67a81ea",
        "changeItemService": "provisioning",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/identity-governance-overview"
        ],
        "shortDescription": "",
        "title": "Provisioning UX modernization",
        "description": "We’re modernizing the current application/HR provisioning and cross-tenant sync UX. This includes a new overview page, user experience to configure connectivity to your application, scoping, and attribute mappings experience. The new experience includes all functionality available to customers today, and no customer action required. The new experience will start rolling out at the end of October 2024, but customers can still use the existing experience through January 2025.",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2025-02-01T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "e3512726-4429-4602-b155-9b10bdbb4a51",
        "changeItemService": "other",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/howto-mfa-userstates"
        ],
        "shortDescription": "",
        "title": "Visual enhancements to the per-user MFA admin configuration experience",
        "description": "As part of ongoing service improvements, we are making updates to the per-user MFA admin configuration experience to align with the look and feel of Entra ID. This change does not include any changes to the core functionality and will only include visual improvements. Starting in August 2024, you will be redirected to the new experience both from the Entra admin center and Azure portal. There will be a banner present ed for the first 30 days to switch back to the old experience, after which you can only use the new experience.",
        "announcementDateTime": "2024-07-01T00:00:00Z",
        "targetDateTime": "2024-08-02T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "e5793726-9c6d-405d-8f41-7348e5f03595",
        "changeItemService": "other",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://aka.ms/DSAAPIDefinition"
        ],
        "shortDescription": "",
        "title": "Restricted permissions on Directory Synchronization Accounts (DSA) role in Microsoft Entra Connect Sync and Cloud Sync",
        "description": "As part of ongoing security hardening, we have removed unused permissions from the privileged \"Directory Synchronization Accounts\" role. This role is exclusively used by Connect Sync and Cloud Sync to synchronize Active Directory objects with Entra ID. \n There is no action required by customers to benefit from this hardening. Please refer the documentation for details on the revised role permissions.",
        "announcementDateTime": "2024-08-08T00:00:00Z",
        "targetDateTime": "2024-08-08T00:00:00Z",
        "impactLink": null,
        "changeType": "retirement",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "e5d2e7dd-212b-4359-bc99-0cdab88ff0ae",
        "changeItemService": "mfA",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/how-to-authentication-methods-manage"
        ],
        "shortDescription": "",
        "title": "Authentication methods migration wizard",
        "description": "The authentication methods migration guide (preview) in the Microsoft Entra Admin center lets you automatically migrate method management from the legacy MFA and SSPR policies to the converged authentication methods policy. Back in 2023, it was announced that the ability to manage authentication methods in the legacy MFA and SSPR policies would be retired in September 2025. Until now, organizations have had to manually migrate methods themselves by leveraging the migration toggle in the converged policy. Now, you can migrate in just a few clicks by leveraging the migration guide. The guide evaluates what your organization currently has enabled in both legacy policies and generates a recommended converged policy configuration for you to review and edit as needed. From there, simply confirm the configuration and we'll set it up for you and mark your migration as complete.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "userAuthentication",
        "publishedDateTime": "2024-11-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "e6c2bd39-23e5-42ba-a18b-ad3119dd0607",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/mem/intune/user-help/sso-dialog-faqs"
        ],
        "shortDescription": "",
        "title": "Upcoming Improvements to the SSO enrollment dialog",
        "description": "We are making some improvements to the end user experience when users add their account to a Windows device. We've refined the messaging in the SSO enrollment dialog (consent) to make it easier for end users to understand the choice(s) they can make and the impact of their choice(s). The changes also include a 'Learn more' link on the screen. The link points to a Microsoft Learn article that provides users with more information that will further enable them to make informed choice(s). Please note, the new SSO enrollment dialog will be gradually introduced starting in October 2024.",
        "announcementDateTime": "2024-09-13T00:00:00Z",
        "targetDateTime": "2024-10-02T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "eacd08cd-b56c-4c94-8095-57c46f6b5015",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/microsoft-security-service-edge-now-generally-available/ba-p/3847828"
        ],
        "shortDescription": "Secure access to any app or resource, from anywhere, with an identity-centric Security Service Edge (SSE) solution.",
        "title": "Microsoft Security Service Edge now generally available",
        "description": "Microsoft’s Security Service Edge (SSE) solution, Microsoft Entra Private Access and Microsoft Entra Internet Access are now generally available. These two products coupled with our SaaS security-focused CASB—Microsoft Defender for Cloud apps—comprise Microsoft's Security Service Edge solution, a cloud-delivered, identity-centric networking model that transforms the way you secure access. \n \n Microsoft’s SSE solution is all about helping you eliminate security gaps in your defenses, extending Conditional Access and continuous access evaluation to all your applications and resources, whether they’re on-premises or in any cloud.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "accessControl",
        "publishedDateTime": "2024-08-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "ee37638d-d0f4-42e5-bd06-b6c2c81bec20",
        "changeItemService": "provisioning",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/multi-tenant-organizations/cross-tenant-synchronization-overview#attributes"
        ],
        "shortDescription": "",
        "title": "Cross-tenant manager synchronization",
        "description": "Cross-tenant synchronization now supports synchronizing the manager attribute across tenants.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "identityGovernance",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "ef8bb488-fa8a-4acc-af2e-da2dc8b2751f",
        "changeItemService": "other",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/hybrid/connect/how-to-upgrade-previous-version"
        ],
        "shortDescription": "",
        "title": "Upgrade to the latest version of Microsoft Entra Connect by April 2, 2025",
        "description": "In early October 2024, we will release a new version of Microsoft Entra Connect Sync that contains a back-end service change that further hardens our services. To avoid service disruptions, customers are required to upgrade to that version (2.4.XX.0) by early April 2025 (exact deadline to be announced upon version release). \n \n Review our roadmap for a timeline of upcoming releases, so that you can plan your upgrade accordingly. We will auto-upgrade customers where supported, alongside an early 2025 release of Connect Sync. For customers who wish to be auto-upgraded, ensure that you have auto-upgrade configured. \n \n For a list of minimum requirements and expected impacts of the service change, please refer to this article. For upgrade-related guidance, check out our docs.",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2025-04-02T00:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "f0b46357-f56e-431c-9c44-7333612f2a69",
        "changeItemService": "other",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/graph/microsoft-graph-activity-logs-overview"
        ],
        "shortDescription": "",
        "title": "Microsoft Graph Activity Logs",
        "description": "The Microsoft Graph activity logs is now generally available! Microsoft Graph activity logs give you visibility into HTTP requests made to the Microsoft Graph service in your tenant. With rapidly growing security threats and an increasing number of attacks, this log data source allows you to perform security analysis, threat hunting, and monitor application activity in your tenant.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "monitoringReporting",
        "publishedDateTime": "2024-04-13T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "f0e0e6a1-4849-4c12-a6b8-bed8411b8d4f",
        "changeItemService": "other",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity-platform/access-token-claims-reference"
        ],
        "shortDescription": "",
        "title": "Changing default accepted token version for new applications",
        "description": "Starting August 2024, new Microsoft Entra applications created using any interface (including the Entra portal, Azure portal, Powershell/CLI, or the Microsoft Graph application API) will have the default value of the 'requestedAccessTokenVersion' property in the app registration set to '2'; this is a change from the previous default of 'null' (meaning '1'). This means that new resource applications will receive v2 access tokens instead of v1 by default. This will improve the security of apps.",
        "announcementDateTime": "2024-05-30T00:00:00Z",
        "targetDateTime": "2024-08-30T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "f23478a4-e400-47cb-ae42-433ebd708853",
        "changeItemService": "identityProtection",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-protection/concept-workload-identity-risk"
        ],
        "shortDescription": "",
        "title": "Suspicious API Traffic detection for Workload Identities",
        "description": "Suspicious API Traffic for service principals - This offline risk detection is reported when abnormal GraphAPI traffic or directory enumeration of a service principal is observed. The Suspicious API Traffic for service principals' detection may indicate abnormal reconnaissance or data exfiltration.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-11-03T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "f277b31c-fa74-4e31-954f-6ade5664d393",
        "changeItemService": "authenticationsLogins",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity-platform/apple-sso-plugin#upcoming-changes-to-device-identity-key-storage"
        ],
        "shortDescription": "",
        "title": "Date change announcement: Deprecation of keychain-backed device identity for Apple devices",
        "description": "Earlier this year, we announced the upcoming deprecation of keychain-backed device identity for Apple devices on the Microsoft Entra ID platform. The previously announced deprecation date of June 2026 has been accelerated to June 2025 as part of our commitment to secure design and defaults. This change is being made to enhance device security and better protect your data.   \n Once in effect, this deprecation will ensure that newly registered Apple devices managed by Microsoft Entra ID use strong, hardware-bound cryptographic secrets, backed by Apple’s Secure Enclave. To learn more, we encourage you to review our updated documentation on this deprecation. We advise both consumers and vendors of applications to test their software for compatibility with this new datastore.",
        "announcementDateTime": "2024-10-02T00:00:00Z",
        "targetDateTime": "2025-07-02T00:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "f2eb76a0-5297-4219-945b-efcb1ef97b3c",
        "changeItemService": "entitlementManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/entitlement-management-request-behalf"
        ],
        "shortDescription": "",
        "title": "Request access package on-behalf-of other users",
        "description": "Entitlement Management enables admins to create access packages to manage their organization’s resources. Admins can either directly assign users to an access package or configure an access package policy that allows users and groups to request access. This option to create self-service processes is useful, especially as organizations scale and hire more employees. However, new employees joining an organization might not always know what they need access to, or how they can request access. In this case, a new employee would likely rely on their manager to guide them through the access request process. \n \n Instead of having new employees navigate the request process, managers can request access packages for their employees, making onboarding faster and more seamless. To enable this functionality for managers, admins can select an option when setting up an access package policy that allows managers to request access on their employees' behalf. \n \n Expanding self-service request flows to allow requests on behalf of employees ensures that users have timely access to necessary resources and increases productivity.",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "entitlementManagement",
        "publishedDateTime": "2024-10-01T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "f401ed9a-54c2-4f2d-9cb1-87417b6649f7",
        "changeItemService": "groupManagement",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks"
        ],
        "shortDescription": "",
        "title": "Microsoft Entra ID Protection: \"Low\" risk age-out ",
        "description": "As communicated earlier, starting March 31, 2024, all \"low\" risk detections and users in Microsoft Entra ID Identity Protection that are older than 6 months will be automatically aged out and dismissed. This will allow customers to focus on more relevant risks and provide a cleaner investigation environment.",
        "announcementDateTime": "2024-03-31T23:00:00Z",
        "targetDateTime": "2024-04-01T00:00:00Z",
        "impactLink": null,
        "changeType": "featureChange",
        "isCustomerActionRequired": false
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "f55184ac-ce2a-4032-803f-0608514b850e",
        "changeItemService": "lifecycleWorkflows",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-governance/download-workflow-history"
        ],
        "shortDescription": "",
        "title": "Lifecycle Workflows: Export workflow history data to CSV files",
        "description": "In Lifecycle Workflows, IT admins can now export their workflow history data across users, runs, and tasks to CSV files for meeting their organization's reporting and auditing needs.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identityGovernance",
        "publishedDateTime": "2024-04-27T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "f74a11bb-d52a-4232-8980-e5cd5ce31076",
        "changeItemService": "authenticationsLogins",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-certificate-based-authentication-technical-deep-dive#certificate-based-authentication-in-mostrecentlyused-mru-methods"
        ],
        "shortDescription": "",
        "title": "Certificate-based authentication in MostRecentlyUsed (MRU) methods",
        "description": "Once a user authenticates successfully using CBA, the user's MostRecentlyUsed (MRU) authentication method is set to CBA. Next time, when the user enters their UPN and selects Next , the user is taken to the CBA method directly, and need not select Use the certificate or smart card . \n To reset the MRU method, the user needs to cancel the certificate picker, select Other ways to sign in , and select another method available to the user and authenticate successfully.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "userAuthentication",
        "publishedDateTime": "2024-01-30T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "fb1d3c16-df2f-4be3-946d-05d709ee4a31",
        "changeItemService": "identityProtection",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/id-protection/howto-identity-protection-investigate-risk#investigate-microsoft-entra-threat-intelligence-detections"
        ],
        "shortDescription": "Real-time Microsoft Entra threat intelligence detections",
        "title": "Real-time Microsoft Entra threat intelligence detections",
        "description": "To protect customers from emerging identity-based attacks, Entra ID Protection now offers real-time Microsoft Entra threat intelligence detections. When new attack patterns are identified, ID Protection can now rapidly issue new, real-time detections in response to these attacks. These detections will utilize Microsoft’s threat intelligence in real-time – meaning ID Protection will detect identified patterns of compromise during sign in, and customers will be able to leverage risk-based conditional access policies to protect their identities.",
        "changeItemState": "available",
        "deliveryStage": "ga",
        "category": "identitySecurityProtection",
        "publishedDateTime": "2024-04-13T07:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.roadmap",
        "id": "fcb52feb-e48d-47d7-a94b-27b392d8990e",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            ""
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/customers/how-to-apple-federation-customers"
        ],
        "shortDescription": "",
        "title": "Support for Apple as an identity provider in Microsoft Entra External ID",
        "description": "By setting up federation with Apple, you can allow customers to sign in to your applications with their own Apple accounts. After you've added Apple as one of your application's sign-in options, on the sign-in page, customers can sign-in to Microsoft Entra External ID with an Apple account",
        "changeItemState": "available",
        "deliveryStage": "publicPreview",
        "category": "b2BB2C",
        "publishedDateTime": "2025-01-08T08:00:00Z",
        "gotoLink": null
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "ff0b3021-6ede-4889-a0de-a7ed0072638f",
        "changeItemService": "msGraph",
        "tags": [
            "Identity Security"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/identity-platform/access-tokens"
        ],
        "shortDescription": "",
        "title": "Change in format for aud claim in access tokens for Microsoft Graph",
        "description": "Considering our ongoing commitment to security, we are making a minor change to tokens issued for Microsoft Graph after 15 January 2025. In rare cases, this may cause impact to applications if the client application is parsing the access token and expecting a specific format of the aud claim . \n As described in documentation , access tokens should be parsed and validated only by the resource API, and client applications should treat the access token as an opaque string to avoid impact from this or future changes.",
        "announcementDateTime": "2024-11-01T00:00:00Z",
        "targetDateTime": "2025-01-16T00:00:00Z",
        "impactLink": null,
        "changeType": "breakingChange",
        "isCustomerActionRequired": true
    },
    {
        "@odata.type": "#microsoft.graph.announcement",
        "id": "ff426e05-47ce-430e-bd21-5623fc451c2d",
        "changeItemService": "b2CConsumerIdentityManagement",
        "tags": [
            "Identity Modernization"
        ],
        "systemTags": [],
        "documentationUrls": [
            "https://learn.microsoft.com/en-us/entra/external-id/customers/concept-user-attributes"
        ],
        "shortDescription": "",
        "title": "Enhancements to Attribute Collection in Entra External ID",
        "description": "Starting February 2025, we’re excited to announce an important update to the attribute collection page in Entra External ID. When users sign up, they will now see a persistent label next to each input field for both built-in and custom attributes. This enhancement serves two key purposes: \n - Improved Accessibility: The persistent labels will help ensure compliance with accessibility standards, making the sign-up process more user-friendly for all. \n - Enhanced Context: By clearly labeling each attribute collection field with the corresponding user attribute name, users will have better context, especially when values are pre-filled.",
        "announcementDateTime": "2024-11-03T00:00:00Z",
        "targetDateTime": "2025-02-04T00:00:00Z",
        "impactLink": null,
        "changeType": "uxChange",
        "isCustomerActionRequired": false
    }
]