{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Linux - Allowed Distributions",
        "Allowed Distributions"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2210210"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "/Distribution/AllowedDistros/{0}/$type",
    "rootDefinitionId": "linux_distribution_alloweddistros",
    "categoryId": "f2c81665-b10b-4fa2-b177-7781b8650292",
    "settingUsage": "compliance",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_distribution_alloweddistros_item_$type",
    "description": null,
    "helpText": null,
    "name": "AllowedDistros_Item_$type",
    "displayName": "Type",
    "defaultOptionId": "linux_distribution_alloweddistros_item_$type_ubuntu",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_distribution_alloweddistros_item_$type_ubuntu",
            "description": null,
            "helpText": null,
            "name": "Ubuntu",
            "displayName": "Ubuntu",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ubuntu"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_distribution_alloweddistros",
                    "parentSettingId": "linux_distribution_alloweddistros"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_distribution_alloweddistros_item_$type_rhel",
            "description": null,
            "helpText": null,
            "name": "Red Hat Enterprise Linux",
            "displayName": "RHEL",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "rhel"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_distribution_alloweddistros",
                    "parentSettingId": "linux_distribution_alloweddistros"
                }
            ],
            "dependedOnBy": []
        }
    ]
}