{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Require Device Encryption",
        "LUKS",
        "dm-crypt",
        "Device Encryption"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2210012"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "/DeviceEncryption/Required",
    "rootDefinitionId": "linux_deviceencryption_required",
    "categoryId": "2dafc535-d0f1-4c8c-9829-044338deebfa",
    "settingUsage": "compliance",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_deviceencryption_required",
    "description": "Specifies whether device-level encryption is required for writable fixed disks on this computer",
    "helpText": null,
    "name": "RequireDeviceEncryption",
    "displayName": "Require Device Encryption",
    "defaultOptionId": "linux_deviceencryption_required_false",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_deviceencryption_required_false",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_deviceencryption_required_true",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}