{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Maximum OS Version",
        "Linux - Allowed Distributions",
        "Allowed Distributions"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2210210"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "/Distribution/AllowedDistros/{0}/MaximumVersion",
    "rootDefinitionId": "linux_distribution_alloweddistros",
    "categoryId": "f2c81665-b10b-4fa2-b177-7781b8650292",
    "settingUsage": "compliance",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_distribution_alloweddistros_item_maximumversion",
    "description": "",
    "helpText": null,
    "name": "AllowedDistros_Item_MaximumOSVersion",
    "displayName": "Maximum OS Version",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "version",
        "inputValidationSchema": null,
        "maximumLength": 32,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "linux_distribution_alloweddistros",
            "parentSettingId": "linux_distribution_alloweddistros"
        }
    ],
    "dependedOnBy": []
}