{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BasicAuthOverHttpEnabled",
        "Allow Basic authentication for HTTP",
        "\\Microsoft Edge\\HTTP authentication",
        "Microsoft Edge\\HTTP authentication",
        "HTTP authentication"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev88.0.705.23~Policy~microsoft_edge~HTTPAuthentication/BasicAuthOverHttpEnabled",
    "rootDefinitionId": "3~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
    "categoryId": "d17b08e6-de3b-445b-ab14-1d47e62efdcf",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "3~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
    "description": "If you enable this policy or leave it unset, Basic authentication challenges received over non-secure HTTP will be allowed.\r\n\r\nIf you disable this policy,  non-secure HTTP requests from the Basic authentication scheme are blocked, and only secure HTTPS is allowed.",
    "helpText": "",
    "name": "BasicAuthOverHttpEnabled",
    "displayName": "Allow Basic authentication for HTTP (User)",
    "defaultOptionId": "3~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "3~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "3~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}