{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/activateCellularDataChoices",
    "rootDefinitionId": "ade_activatecellulardatachoices",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "id": "ade_activatecellulardatachoices",
    "description": "Activates cellular data plans for devices enabled for eSIM. The carrier must enable activation for devices before you can use this command. You can also activate any time after device enrollment.",
    "helpText": "",
    "name": "ActivateCellularDataChoices",
    "displayName": "Activate cellular data",
    "defaultOptionId": "ade_activatecellulardatachoices_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "ade_activatecellulardatachoices_0",
            "description": null,
            "helpText": null,
            "name": "No",
            "displayName": "No",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "ade_activatecellulardatachoices_1",
            "description": null,
            "helpText": null,
            "name": "Yes",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ade_activatecellulardata",
                    "required": true
                }
            ]
        }
    ]
}