{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/maximumSecondsInactivityUntilTemporarySessionLogsOut",
    "rootDefinitionId": "ade_useraffinity",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "ade_maximumsecondsinactivityuntiltemporarysessionlogsout",
    "description": "Available for devices running iPadOS versions 14.5 and later. Enter a value in seconds. If there isn't any activity after the value you enter, then the temporary session automatically signs out. If you set the value to zero (0), then the temporary session stays signed in. The minimum value is 30 seconds.",
    "helpText": "Enter value",
    "name": "MaximumSecondsInactivityUntilTemporarySessionLogsOut",
    "displayName": "Maximum seconds of inactivity until temporary session logs out",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 14400,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "ade_requiresharedipadtemporarysessiononly_1",
            "parentSettingId": "ade_requiresharedipadtemporarysessiononly"
        }
    ],
    "dependedOnBy": []
}