{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/activateCellularData",
    "rootDefinitionId": "ade_activatecellulardatachoices",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "template",
    "id": "ade_activatecellulardata",
    "description": "",
    "helpText": "http://activation.carrier.net",
    "name": "activateCellularData",
    "displayName": "Carrier activation server URL",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "regEx",
        "inputValidationSchema": "^https?://",
        "maximumLength": 87516,
        "minimumLength": 1,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": "http://activation.carrier.net"
    },
    "dependentOn": [
        {
            "dependentOn": "ade_activatecellulardatachoices_1",
            "parentSettingId": "ade_activatecellulardatachoices"
        }
    ],
    "dependedOnBy": []
}