{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/userAffinity_Basic",
    "rootDefinitionId": "ade_useraffinitybasic",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "ade_useraffinitybasic",
    "description": "User affinity associates devices with users. Users must authenticate to enroll with user affinity.",
    "helpText": "",
    "name": "UserAffinity_Basic",
    "displayName": "User affinity",
    "defaultOptionId": "ade_useraffinitybasic_0",
    "applicability": {
        "description": null,
        "platform": "visionOS,tvOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "ade_useraffinitybasic_0",
            "description": null,
            "helpText": null,
            "name": "EnrollWithoutUserAffinity",
            "displayName": "Enroll without user affinity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}