{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Setup Assistant"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/setupAssistant/onboarding",
    "rootDefinitionId": "ade_setupassistant_onboarding",
    "categoryId": "0d23daec-d948-4eee-8ee5-89ab1c59e440",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "id": "ade_setupassistant_onboarding",
    "description": null,
    "helpText": null,
    "name": "Onboarding",
    "displayName": "Onboarding",
    "defaultOptionId": "ade_setupassistant_onboarding_1",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "ade_setupassistant_onboarding_0",
            "description": null,
            "helpText": null,
            "name": "Hide",
            "displayName": "Hide",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "ade_setupassistant_onboarding_1",
            "description": null,
            "helpText": null,
            "name": "Show",
            "displayName": "Show",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}