{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/requireSharedIPadTemporarySessionOnly",
    "rootDefinitionId": "ade_useraffinity",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "ade_requiresharedipadtemporarysessiononly",
    "description": "Available for devices running iPadOS versions 14.5 and later. When set to Yes, users only see the Guest Welcome pane, and can only sign in as a guest user. Users can't sign in with a Managed Apple ID.",
    "helpText": "",
    "name": "RequireSharedIPadTemporarySessionOnly",
    "displayName": "Require Shared iPad temporary session only",
    "defaultOptionId": "ade_requiresharedipadtemporarysessiononly_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "ade_requiresharedipadtemporarysessiononly_0",
            "description": null,
            "helpText": null,
            "name": "NotConfigured",
            "displayName": "Not configured",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "ade_useraffinity_3",
                    "parentSettingId": "ade_useraffinity"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ade_maximumcachedusers",
                    "required": true
                },
                {
                    "dependedOnBy": "ade_maximumsecondsafterscreenlockbeofrepasswordisrequired",
                    "required": false
                },
                {
                    "dependedOnBy": "ade_maximumsecondsinactivityuntiluserlogsout",
                    "required": true
                }
            ]
        },
        {
            "itemId": "ade_requiresharedipadtemporarysessiononly_1",
            "description": null,
            "helpText": null,
            "name": "Yes",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "ade_useraffinity_3",
                    "parentSettingId": "ade_useraffinity"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ade_maximumsecondsinactivityuntiltemporarysessionlogsout",
                    "required": true
                }
            ]
        }
    ]
}