{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/userAffinity",
    "rootDefinitionId": "ade_useraffinity",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "ade_useraffinity",
    "description": "User affinity associates devices with users. Users must authenticate to enroll with user affinity.",
    "helpText": "",
    "name": "UserAffinity",
    "displayName": "User affinity",
    "defaultOptionId": "ade_useraffinity_1",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "ade_useraffinity_1",
            "description": null,
            "helpText": null,
            "name": "EnrollWithUserAffinity",
            "displayName": "Enroll with user affinity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ade_authenticationmethod",
                    "required": true
                }
            ]
        },
        {
            "itemId": "ade_useraffinity_0",
            "description": null,
            "helpText": null,
            "name": "EnrollWithoutUserAffinity",
            "displayName": "Enroll without user affinity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ade_useraffinity_awaitfinalconfiguration",
                    "required": true
                }
            ]
        },
        {
            "itemId": "ade_useraffinity_2",
            "description": null,
            "helpText": null,
            "name": "EnrollWithAzureADSharedMode",
            "displayName": "Enroll with Microsoft Entra ID shared mode",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ade_useraffinity_awaitfinalconfiguration",
                    "required": true
                }
            ]
        },
        {
            "itemId": "ade_useraffinity_3",
            "description": null,
            "helpText": null,
            "name": "EnrollWithSharedIPad",
            "displayName": "Enroll with Shared iPad",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ade_requiresharedipadtemporarysessiononly",
                    "required": true
                }
            ]
        }
    ]
}