{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Setup Assistant"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/setupAssistant/department",
    "rootDefinitionId": "ade_setupassistant_department",
    "categoryId": "0d23daec-d948-4eee-8ee5-89ab1c59e440",
    "settingUsage": "configuration",
    "uxBehavior": "smallTextBox",
    "visibility": "template",
    "id": "ade_setupassistant_department",
    "description": null,
    "helpText": "Appears to users on About Configuration screen",
    "name": "Department",
    "displayName": "Department",
    "applicability": {
        "description": null,
        "platform": "iOS, visionOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 125,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}