{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Login Window Behavior"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.loginwindow",
    "rootDefinitionId": "com.apple.loginwindow_com.apple.loginwindow",
    "categoryId": "8f831e0a-feb7-4cbb-acc1-2e583f3f4de3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.loginwindow_com.apple.loginwindow",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.loginwindow",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.loginwindow_showfullname",
        "com.apple.loginwindow_hidelocalusers",
        "com.apple.loginwindow_includenetworkuser",
        "com.apple.loginwindow_hideadminusers",
        "com.apple.loginwindow_showotherusers_managed",
        "com.apple.loginwindow_adminhostinfo",
        "com.apple.loginwindow_allowlist",
        "com.apple.loginwindow_denylist",
        "com.apple.loginwindow_hidemobileaccounts",
        "com.apple.loginwindow_shutdowndisabled",
        "com.apple.loginwindow_restartdisabled",
        "com.apple.loginwindow_sleepdisabled",
        "com.apple.loginwindow_disableconsoleaccess",
        "com.apple.loginwindow_loginwindowtext",
        "com.apple.loginwindow_shutdowndisabledwhileloggedin",
        "com.apple.loginwindow_restartdisabledwhileloggedin",
        "com.apple.loginwindow_poweroffdisabledwhileloggedin",
        "com.apple.loginwindow_logoutdisabledwhileloggedin",
        "com.apple.loginwindow_disablescreenlockimmediate",
        "com.apple.loginwindow_showinputmenu",
        "com.apple.loginwindow_autologinusername",
        "com.apple.loginwindow_autologinpassword"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.loginwindow_showfullname",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_hidelocalusers",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_includenetworkuser",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_hideadminusers",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_showotherusers_managed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_adminhostinfo",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_allowlist",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_denylist",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_hidemobileaccounts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_shutdowndisabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_restartdisabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_sleepdisabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_disableconsoleaccess",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_loginwindowtext",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_shutdowndisabledwhileloggedin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_restartdisabledwhileloggedin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_poweroffdisabledwhileloggedin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_logoutdisabledwhileloggedin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_disablescreenlockimmediate",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_showinputmenu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_autologinusername",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.loginwindow_autologinpassword",
            "required": false
        }
    ]
}