{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Carddav"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.carddav.account",
    "rootDefinitionId": "com.apple.carddav.account_com.apple.carddav.account",
    "categoryId": "45fe783f-a80b-42d9-ab3c-8c4081be8d05",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.carddav.account_com.apple.carddav.account",
    "description": "com.apple.carddav.account",
    "helpText": null,
    "name": "com.apple.carddav.account",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.carddav.account_carddavaccountdescription",
        "com.apple.carddav.account_carddavhostname",
        "com.apple.carddav.account_carddavusername",
        "com.apple.carddav.account_carddavpassword",
        "com.apple.carddav.account_carddavprincipalurl",
        "com.apple.carddav.account_carddavusessl",
        "com.apple.carddav.account_carddavport",
        "com.apple.carddav.account_communicationservicerules",
        "com.apple.carddav.account_vpnuuid"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.carddav.account_carddavaccountdescription",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.carddav.account_carddavhostname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.carddav.account_carddavusername",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.carddav.account_carddavpassword",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.carddav.account_carddavprincipalurl",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.carddav.account_carddavusessl",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.carddav.account_carddavport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.carddav.account_communicationservicerules",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.carddav.account_vpnuuid",
            "required": false
        }
    ]
}