{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Global HTTP Proxy"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.proxy.http.global",
    "rootDefinitionId": "com.apple.proxy.http.global_com.apple.proxy.http.global",
    "categoryId": "906df5cd-1d9e-49d0-ab32-cf5c5a041974",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.proxy.http.global_com.apple.proxy.http.global",
    "description": "com.apple.proxy.http.global",
    "helpText": null,
    "name": "com.apple.proxy.http.global",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.proxy.http.global_proxycaptiveloginallowed",
        "com.apple.proxy.http.global_proxypacfallbackallowed",
        "com.apple.proxy.http.global_proxypacurl",
        "com.apple.proxy.http.global_proxypassword",
        "com.apple.proxy.http.global_proxyserver",
        "com.apple.proxy.http.global_proxyserverport",
        "com.apple.proxy.http.global_proxytype",
        "com.apple.proxy.http.global_proxyusername"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxycaptiveloginallowed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxypacfallbackallowed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxypacurl",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxypassword",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxyserver",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxyserverport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxytype",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.proxy.http.global_proxyusername",
            "required": false
        }
    ]
}