{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Notifications"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.notificationsettings",
    "rootDefinitionId": "com.apple.notificationsettings_com.apple.notificationsettings",
    "categoryId": "ff90bf4b-0583-4761-a1c4-5aa4b50c5872",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.notificationsettings_com.apple.notificationsettings",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.notificationsettings",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.notificationsettings_notificationsettings"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings",
            "required": true
        }
    ]
}