{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.mobiledevice.passwordpolicy",
    "rootDefinitionId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "categoryId": "d68abc4d-559a-4339-be48-c41a77a87034",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.mobiledevice.passwordpolicy",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mobiledevice.passwordpolicy_allowsimple",
        "com.apple.mobiledevice.passwordpolicy_forcepin",
        "com.apple.mobiledevice.passwordpolicy_maxfailedattempts",
        "com.apple.mobiledevice.passwordpolicy_maxinactivity",
        "com.apple.mobiledevice.passwordpolicy_maxpinageindays",
        "com.apple.mobiledevice.passwordpolicy_mincomplexchars",
        "com.apple.mobiledevice.passwordpolicy_minlength",
        "com.apple.mobiledevice.passwordpolicy_requirealphanumeric",
        "com.apple.mobiledevice.passwordpolicy_pinhistory",
        "com.apple.mobiledevice.passwordpolicy_maxgraceperiod",
        "com.apple.mobiledevice.passwordpolicy_changeatnextauth",
        "com.apple.mobiledevice.passwordpolicy_customregex",
        "com.apple.mobiledevice.passwordpolicy_minutesuntilfailedloginreset"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_allowsimple",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_forcepin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_maxfailedattempts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_maxinactivity",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_maxpinageindays",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_mincomplexchars",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_minlength",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_requirealphanumeric",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_pinhistory",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_maxgraceperiod",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_changeatnextauth",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_customregex",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_minutesuntilfailedloginreset",
            "required": false
        }
    ]
}