{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Network protection",
        "Network protection"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/networkProtection",
    "offsetUri": "enforcementLevel",
    "rootDefinitionId": "com.apple.managedclient.preferences_enforcementlevel",
    "categoryId": "269c487f-8902-486a-88dd-db9b9b4454b8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.managedclient.preferences_enforcementlevel",
    "description": "Specifies if network protection is disabled, in audit mode, or enforced",
    "helpText": null,
    "name": "enforcementLevel",
    "displayName": "Enforcement level",
    "defaultOptionId": "com.apple.managedclient.preferences_enforcementlevel_1",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_enforcementlevel_0",
            "description": null,
            "helpText": null,
            "name": "disabled",
            "displayName": "disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enforcementlevel_1",
            "description": null,
            "helpText": null,
            "name": "audit",
            "displayName": "audit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "audit"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enforcementlevel_2",
            "description": null,
            "helpText": null,
            "name": "block",
            "displayName": "block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "block"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}