{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Logging"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.system.logging",
    "rootDefinitionId": "com.apple.system.logging_com.apple.system.logging",
    "categoryId": "0d4d90ab-7ad8-4524-ade0-bc01aa7b71a3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.system.logging_com.apple.system.logging",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.system.logging",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.system.logging_system"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.system.logging_system",
            "required": false
        }
    ]
}