{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Application Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.applicationaccess.new",
    "rootDefinitionId": "com.apple.applicationaccess.new_com.apple.applicationaccess.new",
    "categoryId": "f019963f-f4ed-4429-b6e3-babfb24c36a8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.applicationaccess.new_com.apple.applicationaccess.new",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.applicationaccess.new",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.applicationaccess.new_familycontrolsenabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.applicationaccess.new_familycontrolsenabled",
            "required": true
        }
    ]
}