{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.familycontrols.contentfilter",
    "rootDefinitionId": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter",
    "categoryId": "dc270c70-1cf4-4d98-ad26-8c2d441173f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.familycontrols.contentfilter",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.familycontrols.contentfilter_restrictweb",
        "com.apple.familycontrols.contentfilter_usecontentfilter",
        "com.apple.familycontrols.contentfilter_whitelistenabled",
        "com.apple.familycontrols.contentfilter_sitewhitelist",
        "com.apple.familycontrols.contentfilter_filterwhitelist",
        "com.apple.familycontrols.contentfilter_filterblacklist"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_restrictweb",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_usecontentfilter",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_whitelistenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_sitewhitelist",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_filterwhitelist",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_filterblacklist",
            "required": false
        }
    ]
}