{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Policy Control"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.systempolicy.control",
    "rootDefinitionId": "com.apple.systempolicy.control_com.apple.systempolicy.control",
    "categoryId": "763525a0-8456-4336-a8d1-392253e8fdd8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systempolicy.control_com.apple.systempolicy.control",
    "description": "com.apple.systempolicy.control",
    "helpText": null,
    "name": "com.apple.systempolicy.control",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.systempolicy.control_enableassessment",
        "com.apple.systempolicy.control_allowidentifieddevelopers",
        "com.apple.systempolicy.control_enablexprotectmalwareupload"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.systempolicy.control_enableassessment",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systempolicy.control_allowidentifieddevelopers",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systempolicy.control_enablexprotectmalwareupload",
            "required": false
        }
    ]
}