{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "filterWhitelist",
    "rootDefinitionId": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter",
    "categoryId": "dc270c70-1cf4-4d98-ad26-8c2d441173f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.familycontrols.contentfilter_filterwhitelist",
    "description": "The array of URLs that defines an allow list. When Restrict Web and Use Content Filter are enabled, only URLs in the allow list are available to the user.",
    "helpText": null,
    "name": "filterWhitelist",
    "displayName": "Filter Allowlist",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter",
            "parentSettingId": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter"
        }
    ],
    "dependedOnBy": []
}