{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.dnsSettings.managed",
    "rootDefinitionId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "categoryId": "bbe51018-a17d-46c4-9517-ff45c54d8d18",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.dnsSettings.managed",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.dnssettings.managed_dnssettings",
        "com.apple.dnssettings.managed_ondemandrules",
        "com.apple.dnssettings.managed_prohibitdisablement",
        "com.apple.dnssettings.managed_payloadcertificateuuid"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.dnssettings.managed_dnssettings",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_prohibitdisablement",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_payloadcertificateuuid",
            "required": false
        }
    ]
}