{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Managed Menu Extras"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Clock.menu",
    "rootDefinitionId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
    "categoryId": "b6ad9576-be4c-46b9-a3a6-13a03ff1fed7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxmenuextras_clock.menu",
    "description": "If true, enables the Clock menu extra.",
    "helpText": null,
    "name": "Clock.menu",
    "displayName": "Clock",
    "defaultOptionId": "com.apple.mcxmenuextras_clock.menu_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mcxmenuextras_clock.menu_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
                    "parentSettingId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcxmenuextras_clock.menu_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
                    "parentSettingId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras"
                }
            ],
            "dependedOnBy": []
        }
    ]
}