{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Smart Card"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.security.smartcard",
    "rootDefinitionId": "com.apple.security.smartcard_com.apple.security.smartcard",
    "categoryId": "f4a8384f-9e4e-4fc6-9ee2-28fa5260347a",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.security.smartcard_com.apple.security.smartcard",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.security.smartcard",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.security.smartcard_userpairing",
        "com.apple.security.smartcard_allowsmartcard",
        "com.apple.security.smartcard_checkcertificatetrust",
        "com.apple.security.smartcard_onecardperuser",
        "com.apple.security.smartcard_tokenremovalaction",
        "com.apple.security.smartcard_enforcesmartcard"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.security.smartcard_userpairing",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.smartcard_allowsmartcard",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.smartcard_checkcertificatetrust",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.smartcard_onecardperuser",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.smartcard_tokenremovalaction",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.smartcard_enforcesmartcard",
            "required": false
        }
    ]
}