{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Lock Screen Message"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.shareddeviceconfiguration",
    "rootDefinitionId": "com.apple.shareddeviceconfiguration_com.apple.shareddeviceconfiguration",
    "categoryId": "dec8381a-0a61-406b-842b-fc6ae9930795",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.shareddeviceconfiguration_com.apple.shareddeviceconfiguration",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.shareddeviceconfiguration",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.shareddeviceconfiguration_assettaginformation",
        "com.apple.shareddeviceconfiguration_lockscreenfootnote"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.shareddeviceconfiguration_assettaginformation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.shareddeviceconfiguration_lockscreenfootnote",
            "required": false
        }
    ]
}