{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Extensions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.system-extension-policy",
    "rootDefinitionId": "com.apple.system-extension-policy_com.apple.system-extension-policy",
    "categoryId": "cb33668b-933f-4424-8d2d-8bdf0e61bddd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.system-extension-policy_com.apple.system-extension-policy",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.system-extension-policy",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.system-extension-policy_allowuseroverrides",
        "com.apple.system-extension-policy_allowedteamidentifiers",
        "com.apple.system-extension-policy_allowedsystemextensiontypes",
        "com.apple.system-extension-policy_allowedsystemextensions",
        "com.apple.system-extension-policy_removablesystemextensions"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.system-extension-policy_allowuseroverrides",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.system-extension-policy_allowedteamidentifiers",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.system-extension-policy_allowedsystemextensiontypes",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.system-extension-policy_allowedsystemextensions",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.system-extension-policy_removablesystemextensions",
            "required": false
        }
    ]
}