{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver User"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "moduleName",
    "rootDefinitionId": "com.apple.screensaver.user_com.apple.screensaver.user",
    "categoryId": "11c4cf0f-a03d-4309-93b2-011be4c410d5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.screensaver.user_modulename",
    "description": "The module name.",
    "helpText": null,
    "name": "moduleName",
    "displayName": "Module Name",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.screensaver.user_com.apple.screensaver.user",
            "parentSettingId": "com.apple.screensaver.user_com.apple.screensaver.user"
        }
    ],
    "dependedOnBy": []
}