{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.loginitems.managed",
    "rootDefinitionId": "com.apple.loginitems.managed_com.apple.loginitems.managed",
    "categoryId": "6efb8802-223a-46a7-b13f-a68f28f8b2c2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.loginitems.managed_com.apple.loginitems.managed",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.loginitems.managed",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed",
            "required": true
        }
    ]
}