{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "LDAP"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.ldap.account",
    "rootDefinitionId": "com.apple.ldap.account_com.apple.ldap.account",
    "categoryId": "9ba1b877-865a-4104-8376-b43a0c75b04b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.ldap.account_com.apple.ldap.account",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.ldap.account",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.ldap.account_ldapaccountdescription",
        "com.apple.ldap.account_ldapaccounthostname",
        "com.apple.ldap.account_ldapaccountusername",
        "com.apple.ldap.account_ldapaccountpassword",
        "com.apple.ldap.account_ldapaccountusessl",
        "com.apple.ldap.account_ldapsearchsettings",
        "com.apple.ldap.account_vpnuuid"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.ldap.account_ldapaccountdescription",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.ldap.account_ldapaccounthostname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.ldap.account_ldapaccountusername",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.ldap.account_ldapaccountpassword",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.ldap.account_ldapaccountusessl",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.ldap.account_ldapsearchsettings",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.ldap.account_vpnuuid",
            "required": false
        }
    ]
}