{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Time Machine"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.MCX.TimeMachine",
    "rootDefinitionId": "com.apple.mcx.timemachine_com.apple.mcx.timemachine",
    "categoryId": "361859d9-1382-47c3-b9ec-9251a62fbb25",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx.timemachine_com.apple.mcx.timemachine",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.MCX.TimeMachine",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcx.timemachine_autobackup",
        "com.apple.mcx.timemachine_backupallvolumes",
        "com.apple.mcx.timemachine_backupdesturl",
        "com.apple.mcx.timemachine_backupsizemb",
        "com.apple.mcx.timemachine_backupskipsys",
        "com.apple.mcx.timemachine_mobilebackups",
        "com.apple.mcx.timemachine_basepaths",
        "com.apple.mcx.timemachine_skippaths"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx.timemachine_autobackup",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.timemachine_backupallvolumes",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.timemachine_backupdesturl",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.mcx.timemachine_backupsizemb",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.timemachine_backupskipsys",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.timemachine_mobilebackups",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.timemachine_basepaths",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.timemachine_skippaths",
            "required": false
        }
    ]
}