{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "customRegex/passwordContentDescription",
    "rootDefinitionId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "categoryId": "d68abc4d-559a-4339-be48-c41a77a87034",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentdescription",
    "description": "Contains a dictionary of keys for supported OS language IDs (for example, “en-US”), and whose values represent a localized description of the policy enforced by the regular expression. Use the special 'default' key can for languages that aren't contained in the dictionary.",
    "helpText": null,
    "name": "customRegex_passwordContentDescription",
    "displayName": "Password Content Description",
    "childIds": [
        "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentdescription_generickey",
        "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentdescription_generickey_keytobereplaced"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.mobiledevice.passwordpolicy_customregex",
            "parentSettingId": "com.apple.mobiledevice.passwordpolicy_customregex"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentdescription_generickey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentdescription_generickey_keytobereplaced",
            "required": true
        }
    ]
}