{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Font"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.font",
    "rootDefinitionId": "com.apple.font_com.apple.font",
    "categoryId": "5401711f-292a-487a-be18-f99593a0477c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.font_com.apple.font",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.font",
    "displayName": "com.apple.font",
    "childIds": [
        "com.apple.font_name",
        "com.apple.font_font"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.font_name",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.font_font",
            "required": true
        }
    ]
}