{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Identification"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.configurationprofile.identification",
    "rootDefinitionId": "com.apple.configurationprofile.identification_com.apple.configurationprofile.identification",
    "categoryId": "c3fdc01d-0648-4dcb-855d-7afe78bf1d89",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.configurationprofile.identification_com.apple.configurationprofile.identification",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.configurationprofile.identification",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.configurationprofile.identification_payloadidentification"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification",
            "required": true
        }
    ]
}