{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.applicationaccess",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.applicationaccess_com.apple.applicationaccess",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.applicationaccess",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.applicationaccess_allowaccountmodification",
        "com.apple.applicationaccess_allowactivitycontinuation",
        "com.apple.applicationaccess_allowaddinggamecenterfriends",
        "com.apple.applicationaccess_allowairdrop",
        "com.apple.applicationaccess_allowairplayincomingrequests",
        "com.apple.applicationaccess_allowairprint",
        "com.apple.applicationaccess_allowairprintcredentialsstorage",
        "com.apple.applicationaccess_allowairprintibeacondiscovery",
        "com.apple.applicationaccess_allowappcellulardatamodification",
        "com.apple.applicationaccess_allowappclips",
        "com.apple.applicationaccess_allowappinstallation",
        "com.apple.applicationaccess_allowapplepersonalizedadvertising",
        "com.apple.applicationaccess_allowappremoval",
        "com.apple.applicationaccess_allowardremotemanagementmodification",
        "com.apple.applicationaccess_allowassistant",
        "com.apple.applicationaccess_allowassistantusergeneratedcontent",
        "com.apple.applicationaccess_allowassistantwhilelocked",
        "com.apple.applicationaccess_allowautocorrection",
        "com.apple.applicationaccess_allowautomaticappdownloads",
        "com.apple.applicationaccess_allowautomaticscreensaver",
        "com.apple.applicationaccess_allowautounlock",
        "com.apple.applicationaccess_allowbluetoothmodification",
        "com.apple.applicationaccess_allowbluetoothsharingmodification",
        "com.apple.applicationaccess_allowbookstore",
        "com.apple.applicationaccess_allowbookstoreerotica",
        "com.apple.applicationaccess_allowcamera",
        "com.apple.applicationaccess_allowcellularplanmodification",
        "com.apple.applicationaccess_allowchat",
        "com.apple.applicationaccess_allowcloudaddressbook",
        "com.apple.applicationaccess_allowcloudbackup",
        "com.apple.applicationaccess_allowcloudbookmarks",
        "com.apple.applicationaccess_allowcloudcalendar",
        "com.apple.applicationaccess_allowclouddesktopanddocuments",
        "com.apple.applicationaccess_allowclouddocumentsync",
        "com.apple.applicationaccess_allowcloudfreeform",
        "com.apple.applicationaccess_allowcloudkeychainsync",
        "com.apple.applicationaccess_allowcloudmail",
        "com.apple.applicationaccess_allowcloudnotes",
        "com.apple.applicationaccess_allowcloudphotolibrary",
        "com.apple.applicationaccess_allowcloudprivaterelay",
        "com.apple.applicationaccess_allowcloudreminders",
        "com.apple.applicationaccess_allowcontentcaching",
        "com.apple.applicationaccess_allowcontinuouspathkeyboard",
        "com.apple.applicationaccess_allowdefinitionlookup",
        "com.apple.applicationaccess_allowdevicenamemodification",
        "com.apple.applicationaccess_allowdiagnosticsubmission",
        "com.apple.applicationaccess_allowdiagnosticsubmissionmodification",
        "com.apple.applicationaccess_allowdictation",
        "com.apple.applicationaccess_allowenablingrestrictions",
        "com.apple.applicationaccess_allowenterpriseapptrust",
        "com.apple.applicationaccess_allowenterprisebookbackup",
        "com.apple.applicationaccess_allowenterprisebookmetadatasync",
        "com.apple.applicationaccess_allowerasecontentandsettings",
        "com.apple.applicationaccess_allowesimmodification",
        "com.apple.applicationaccess_allowexplicitcontent",
        "com.apple.applicationaccess_allowfilesharingmodification",
        "com.apple.applicationaccess_allowfilesnetworkdriveaccess",
        "com.apple.applicationaccess_allowfilesusbdriveaccess",
        "com.apple.applicationaccess_allowfindmydevice",
        "com.apple.applicationaccess_allowfindmyfriends",
        "com.apple.applicationaccess_allowfindmyfriendsmodification",
        "com.apple.applicationaccess_allowfingerprintforunlock",
        "com.apple.applicationaccess_allowfingerprintmodification",
        "com.apple.applicationaccess_allowgamecenter",
        "com.apple.applicationaccess_allowglobalbackgroundfetchwhenroaming",
        "com.apple.applicationaccess_allowhostpairing",
        "com.apple.applicationaccess_allowinapppurchases",
        "com.apple.applicationaccess_allowinternetsharingmodification",
        "com.apple.applicationaccess_allowiphonewidgetsonmac",
        "com.apple.applicationaccess_allowitunes",
        "com.apple.applicationaccess_allowitunesfilesharing",
        "com.apple.applicationaccess_allowkeyboardshortcuts",
        "com.apple.applicationaccess_allowlistedappbundleids",
        "com.apple.applicationaccess_allowlivevoicemail",
        "com.apple.applicationaccess_allowlocalusercreation",
        "com.apple.applicationaccess_allowlockscreencontrolcenter",
        "com.apple.applicationaccess_allowlockscreennotificationsview",
        "com.apple.applicationaccess_allowlockscreentodayview",
        "com.apple.applicationaccess_allowmailprivacyprotection",
        "com.apple.applicationaccess_allowmanagedappscloudsync",
        "com.apple.applicationaccess_allowmanagedtowriteunmanagedcontacts",
        "com.apple.applicationaccess_allowmultiplayergaming",
        "com.apple.applicationaccess_allowmusicservice",
        "com.apple.applicationaccess_allownews",
        "com.apple.applicationaccess_allownfc",
        "com.apple.applicationaccess_allownotificationsmodification",
        "com.apple.applicationaccess_allowopenfrommanagedtounmanaged",
        "com.apple.applicationaccess_allowopenfromunmanagedtomanaged",
        "com.apple.applicationaccess_allowotapkiupdates",
        "com.apple.applicationaccess_allowpairedwatch",
        "com.apple.applicationaccess_allowpassbookwhilelocked",
        "com.apple.applicationaccess_allowpasscodemodification",
        "com.apple.applicationaccess_allowpasswordautofill",
        "com.apple.applicationaccess_allowpasswordproximityrequests",
        "com.apple.applicationaccess_allowpasswordsharing",
        "com.apple.applicationaccess_allowpersonalhotspotmodification",
        "com.apple.applicationaccess_allowphotostream",
        "com.apple.applicationaccess_allowpodcasts",
        "com.apple.applicationaccess_allowpredictivekeyboard",
        "com.apple.applicationaccess_allowprintersharingmodification",
        "com.apple.applicationaccess_allowproximitysetuptonewdevice",
        "com.apple.applicationaccess_allowradioservice",
        "com.apple.applicationaccess_allowrapidsecurityresponseinstallation",
        "com.apple.applicationaccess_allowrapidsecurityresponseremoval",
        "com.apple.applicationaccess_allowremoteappleeventsmodification",
        "com.apple.applicationaccess_allowremotescreenobservation",
        "com.apple.applicationaccess_allowsafari",
        "com.apple.applicationaccess_allowscreenshot",
        "com.apple.applicationaccess_allowshareddevicetemporarysession",
        "com.apple.applicationaccess_allowsharedstream",
        "com.apple.applicationaccess_allowspellcheck",
        "com.apple.applicationaccess_allowspotlightinternetresults",
        "com.apple.applicationaccess_allowstartupdiskmodification",
        "com.apple.applicationaccess_allowsystemappremoval",
        "com.apple.applicationaccess_allowtimemachinebackup",
        "com.apple.applicationaccess_allowuiappinstallation",
        "com.apple.applicationaccess_allowuiconfigurationprofileinstallation",
        "com.apple.applicationaccess_allowuniversalcontrol",
        "com.apple.applicationaccess_allowunmanagedtoreadmanagedcontacts",
        "com.apple.applicationaccess_allowunpairedexternalboottorecovery",
        "com.apple.applicationaccess_allowuntrustedtlsprompt",
        "com.apple.applicationaccess_allowusbrestrictedmode",
        "com.apple.applicationaccess_allowvideoconferencing",
        "com.apple.applicationaccess_allowvoicedialing",
        "com.apple.applicationaccess_allowvpncreation",
        "com.apple.applicationaccess_allowwallpapermodification",
        "com.apple.applicationaccess_autonomoussingleappmodepermittedappids",
        "com.apple.applicationaccess_blockedappbundleids",
        "com.apple.applicationaccess_enforcedfingerprinttimeout",
        "com.apple.applicationaccess_enforcedsoftwareupdatedelay",
        "com.apple.applicationaccess_enforcedsoftwareupdatemajorosdeferredinstalldelay",
        "com.apple.applicationaccess_enforcedsoftwareupdateminorosdeferredinstalldelay",
        "com.apple.applicationaccess_enforcedsoftwareupdatenonosdeferredinstalldelay",
        "com.apple.applicationaccess_forceairdropunmanaged",
        "com.apple.applicationaccess_forceairplayoutgoingrequestspairingpassword",
        "com.apple.applicationaccess_forceairprinttrustedtlsrequirement",
        "com.apple.applicationaccess_forceassistantprofanityfilter",
        "com.apple.applicationaccess_forceauthenticationbeforeautofill",
        "com.apple.applicationaccess_forceautomaticdateandtime",
        "com.apple.applicationaccess_forceclassroomautomaticallyjoinclasses",
        "com.apple.applicationaccess_forceclassroomrequestpermissiontoleaveclasses",
        "com.apple.applicationaccess_forceclassroomunpromptedappanddevicelock",
        "com.apple.applicationaccess_forceclassroomunpromptedscreenobservation",
        "com.apple.applicationaccess_forcedelayedappsoftwareupdates",
        "com.apple.applicationaccess_forcedelayedmajorsoftwareupdates",
        "com.apple.applicationaccess_forcedelayedsoftwareupdates",
        "com.apple.applicationaccess_forceencryptedbackup",
        "com.apple.applicationaccess_forceitunesstorepasswordentry",
        "com.apple.applicationaccess_forcelimitadtracking",
        "com.apple.applicationaccess_forceondeviceonlydictation",
        "com.apple.applicationaccess_forceondeviceonlytranslation",
        "com.apple.applicationaccess_forcepreserveesimonerase",
        "com.apple.applicationaccess_forcewatchwristdetection",
        "com.apple.applicationaccess_forcewifipoweron",
        "com.apple.applicationaccess_forcewifitoallowednetworksonly",
        "com.apple.applicationaccess_forcewifiwhitelisting",
        "com.apple.applicationaccess_ratingregion",
        "com.apple.applicationaccess_requiremanagedpasteboard",
        "com.apple.applicationaccess_safariacceptcookies",
        "com.apple.applicationaccess_safariallowautofill",
        "com.apple.applicationaccess_safariallowjavascript",
        "com.apple.applicationaccess_safariallowpopups",
        "com.apple.applicationaccess_safariforcefraudwarning"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.applicationaccess_allowaccountmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowactivitycontinuation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowaddinggamecenterfriends",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowairdrop",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowairplayincomingrequests",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowairprint",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowairprintcredentialsstorage",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowairprintibeacondiscovery",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowappcellulardatamodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowappclips",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowappinstallation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowapplepersonalizedadvertising",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowappremoval",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowardremotemanagementmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowassistant",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowassistantusergeneratedcontent",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowassistantwhilelocked",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowautocorrection",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowautomaticappdownloads",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowautomaticscreensaver",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowautounlock",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowbluetoothmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowbluetoothsharingmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowbookstore",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowbookstoreerotica",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcamera",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcellularplanmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowchat",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudaddressbook",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudbackup",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudbookmarks",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudcalendar",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowclouddesktopanddocuments",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowclouddocumentsync",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudfreeform",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudkeychainsync",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudmail",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudnotes",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudphotolibrary",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudprivaterelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcloudreminders",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcontentcaching",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowcontinuouspathkeyboard",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowdefinitionlookup",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowdevicenamemodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowdiagnosticsubmission",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowdiagnosticsubmissionmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowdictation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowenablingrestrictions",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowenterpriseapptrust",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowenterprisebookbackup",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowenterprisebookmetadatasync",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowerasecontentandsettings",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowesimmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowexplicitcontent",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfilesharingmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfilesnetworkdriveaccess",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfilesusbdriveaccess",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfindmydevice",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfindmyfriends",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfindmyfriendsmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfingerprintforunlock",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowfingerprintmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowgamecenter",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowglobalbackgroundfetchwhenroaming",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowhostpairing",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowinapppurchases",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowinternetsharingmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowiphonewidgetsonmac",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowitunes",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowitunesfilesharing",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowkeyboardshortcuts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowlistedappbundleids",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowlivevoicemail",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowlocalusercreation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowlockscreencontrolcenter",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowlockscreennotificationsview",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowlockscreentodayview",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowmailprivacyprotection",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowmanagedappscloudsync",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowmanagedtowriteunmanagedcontacts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowmultiplayergaming",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowmusicservice",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allownews",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allownfc",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allownotificationsmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowopenfrommanagedtounmanaged",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowopenfromunmanagedtomanaged",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowotapkiupdates",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpairedwatch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpassbookwhilelocked",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpasscodemodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpasswordautofill",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpasswordproximityrequests",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpasswordsharing",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpersonalhotspotmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowphotostream",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpodcasts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowpredictivekeyboard",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowprintersharingmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowproximitysetuptonewdevice",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowradioservice",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowrapidsecurityresponseinstallation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowrapidsecurityresponseremoval",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowremoteappleeventsmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowremotescreenobservation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowsafari",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowscreenshot",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowshareddevicetemporarysession",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowsharedstream",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowspellcheck",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowspotlightinternetresults",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowstartupdiskmodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowsystemappremoval",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowtimemachinebackup",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowuiappinstallation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowuiconfigurationprofileinstallation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowuniversalcontrol",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowunmanagedtoreadmanagedcontacts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowunpairedexternalboottorecovery",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowuntrustedtlsprompt",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowusbrestrictedmode",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowvideoconferencing",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowvoicedialing",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowvpncreation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_allowwallpapermodification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_autonomoussingleappmodepermittedappids",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_blockedappbundleids",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_enforcedfingerprinttimeout",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_enforcedsoftwareupdatedelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_enforcedsoftwareupdatemajorosdeferredinstalldelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_enforcedsoftwareupdateminorosdeferredinstalldelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_enforcedsoftwareupdatenonosdeferredinstalldelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceairdropunmanaged",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceairplayoutgoingrequestspairingpassword",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceairprinttrustedtlsrequirement",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceassistantprofanityfilter",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceauthenticationbeforeautofill",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceautomaticdateandtime",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceclassroomautomaticallyjoinclasses",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceclassroomrequestpermissiontoleaveclasses",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceclassroomunpromptedappanddevicelock",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceclassroomunpromptedscreenobservation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcedelayedappsoftwareupdates",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcedelayedmajorsoftwareupdates",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcedelayedsoftwareupdates",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceencryptedbackup",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceitunesstorepasswordentry",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcelimitadtracking",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceondeviceonlydictation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forceondeviceonlytranslation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcepreserveesimonerase",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcewatchwristdetection",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcewifipoweron",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcewifitoallowednetworksonly",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_forcewifiwhitelisting",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_ratingregion",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_requiremanagedpasteboard",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_safariacceptcookies",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_safariallowautofill",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_safariallowjavascript",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_safariallowpopups",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.applicationaccess_safariforcefraudwarning",
            "required": false
        }
    ]
}