{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Provider"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.fileproviderd",
    "rootDefinitionId": "com.apple.fileproviderd_com.apple.fileproviderd",
    "categoryId": "768d9aa4-7407-4ed9-b97f-2385b8cadb47",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.fileproviderd_com.apple.fileproviderd",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.fileproviderd",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.fileproviderd_allowmanagedfileproviderstorequestattribution"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.fileproviderd_allowmanagedfileproviderstorequestattribution",
            "required": false
        }
    ]
}