{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Mobile Accounts"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.MCX",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-mobileaccounts",
    "categoryId": "ccea1cb0-55cd-4597-bfb1-e2d38b8a53ac",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.mcx_com.apple.mcx-mobileaccounts",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.MCX",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcx_com.apple.cachedaccounts.createatlogin",
        "com.apple.mcx_com.apple.cachedaccounts.warnoncreate",
        "com.apple.mcx_cachedaccounts.warnoncreate.allownever",
        "com.apple.mcx_cachedaccounts.expiry.delete.disusedseconds",
        "com.apple.mcx_cachedaccounts.askforsecuretokenauthbypass"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx_com.apple.cachedaccounts.createatlogin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.cachedaccounts.warnoncreate",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_cachedaccounts.warnoncreate.allownever",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_cachedaccounts.expiry.delete.disusedseconds",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_cachedaccounts.askforsecuretokenauthbypass",
            "required": false
        }
    ]
}