{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Caldav"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CalDAVPrincipalURL",
    "rootDefinitionId": "com.apple.caldav.account_com.apple.caldav.account",
    "categoryId": "831dcaee-a6fa-4893-a32d-e13fdf7d3777",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.caldav.account_caldavprincipalurl",
    "description": "The base URL to the user’s calendar.",
    "helpText": null,
    "name": "CalDAVPrincipalURL",
    "displayName": "Cal DAV Principal URL",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.caldav.account_com.apple.caldav.account",
            "parentSettingId": "com.apple.caldav.account_com.apple.caldav.account"
        }
    ],
    "dependedOnBy": []
}