{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.systempreferences",
    "rootDefinitionId": "com.apple.systempreferences_com.apple.systempreferences",
    "categoryId": "c7c1ed5a-a2ec-4237-bbf1-d5723f94d033",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.systempreferences_com.apple.systempreferences",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.systempreferences",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.systempreferences_disabledpreferencepanes",
        "com.apple.systempreferences_enabledpreferencepanes"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.systempreferences_disabledpreferencepanes",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systempreferences_enabledpreferencepanes",
            "required": false
        }
    ]
}