{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Vault Recovery Key Escrow",
        "FileVault Recovery Key Escrow"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DeviceKey",
    "rootDefinitionId": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
    "categoryId": "bd5533e1-f1ee-4994-8a79-cffe02b12d5c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.security.fderecoverykeyescrow_devicekey",
    "description": "The string that's included in help text if the user appears to have forgotten the password. Site admins can use this key to look up the escrowed key for the particular computer. This key replaces the Record Number key used in the previous escrow mechanism. If the key is missing, the device serial number is used instead.",
    "helpText": null,
    "name": "DeviceKey",
    "displayName": "Device Key",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
            "parentSettingId": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow"
        }
    ],
    "dependedOnBy": []
}