{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ApplicationsSystem//Applications/Microsoft Edge.app/Application ID",
    "rootDefinitionId": "com.apple.managedclient.preferences_applicationssystem",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft edge.app_application id",
    "description": null,
    "helpText": null,
    "name": "ApplicationsSystem_Applications_Microsoft Edge.app_Application ID",
    "displayName": "Microsoft Edge Application ID",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": "EDGE01"
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft edge.app",
            "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft edge.app"
        }
    ],
    "dependedOnBy": []
}