{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On Kerberos"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.extensiblesso",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
    "categoryId": "f35cc803-3a06-4262-b38b-a5295321f756",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.extensiblesso",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.extensiblesso_extensionidentifier_kerberos",
        "com.apple.extensiblesso_teamidentifier_kerberos",
        "com.apple.extensiblesso_type_kerberos",
        "com.apple.extensiblesso_realm_kerberos",
        "com.apple.extensiblesso_extensiondata_kerberos",
        "com.apple.extensiblesso_hosts_kerberos"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.extensiblesso_extensionidentifier_kerberos",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_teamidentifier_kerberos",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_type_kerberos",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_realm_kerberos",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_hosts_kerberos",
            "required": false
        }
    ]
}