{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Enforce Latest"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "DDM-LatestSoftwareUpdate",
    "offsetUri": "EnforceLatestSoftwareUpdateVersion",
    "rootDefinitionId": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate",
    "categoryId": "15be55d8-7477-4274-9b09-b775bce68416",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion",
    "description": "If true, devices will upgrade to the latest OS version that is available for that device model. This uses the Software Update Enforcement configuration and will force devices to restart and install the update after the deadline passes.",
    "helpText": null,
    "name": "EnforceLatestSoftwareUpdateVersion",
    "displayName": "Enforce Latest Software Update Version",
    "defaultOptionId": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion_0",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "True"
            },
            "dependentOn": [
                {
                    "dependentOn": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate",
                    "parentSettingId": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "ddm-latestsoftwareupdate_delayindays",
                    "required": true
                },
                {
                    "dependedOnBy": "ddm-latestsoftwareupdate_installtime",
                    "required": true
                }
            ]
        }
    ]
}