{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Enforce Latest"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "DDM-LatestSoftwareUpdate",
    "offsetUri": "DelayInDays",
    "rootDefinitionId": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate",
    "categoryId": "15be55d8-7477-4274-9b09-b775bce68416",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "ddm-latestsoftwareupdate_delayindays",
    "description": "Specify the number of days that should pass before a deadline is enforced after a new update is released by Apple.",
    "helpText": null,
    "name": "DelayInDays",
    "displayName": "Delay In Days",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 30,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion_0",
            "parentSettingId": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion"
        }
    ],
    "dependedOnBy": []
}