{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Enforce Latest"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "DDM-LatestSoftwareUpdate",
    "offsetUri": "InstallTime",
    "rootDefinitionId": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate",
    "categoryId": "15be55d8-7477-4274-9b09-b775bce68416",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "ddm-latestsoftwareupdate_installtime",
    "description": "Specify the local device time for when updates are enforced. This setting uses the 24-hour clock format where midnight is 00:00 and 11:59pm is 23:59. Ensure that you include the leading 0 on single digit hours. For example, 01:00, 02:00, 03:00.",
    "helpText": null,
    "name": "InstallTime",
    "displayName": "Install Time",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "regEx",
        "inputValidationSchema": "^(0[0-9]|1[0-9]|2[0-3]):[0-5][0-9]$",
        "maximumLength": 20,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion_0",
            "parentSettingId": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion"
        }
    ],
    "dependedOnBy": []
}