{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Randomize ScheduleTaskTimes",
        "Defender"
    ],
    "infoUrls": [],
    "baseUri": "./Device",
    "offsetUri": "/Defender/RandomizeScheduleTaskTimes",
    "rootDefinitionId": "defender_randomizescheduletasktimes",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "defender_randomizescheduletasktimes",
    "description": "This setting allows you to enable or disable randomization of the scheduled scan start time and the scheduled definition update start time. This setting is used to distribute the resource impact of scanning. For example, it could be used in guest virtual machines sharing a host, to prevent multiple guest virtual machines from undertaking a disk-intensive operation at the same time.",
    "helpText": null,
    "name": "RandomizeScheduleTaskTimes",
    "displayName": "Randomize scheduled scan and security intelligence update start times",
    "defaultOptionId": "defender_randomizescheduletasktimes_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "configManager",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "defender_randomizescheduletasktimes_0",
            "description": null,
            "helpText": null,
            "name": "No",
            "displayName": "No",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "defender_randomizescheduletasktimes_1",
            "description": null,
            "helpText": null,
            "name": "Yes",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}