{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ScriptedDiagnosticsSecurityPolicy",
        "Configure Security Policy for Scripted Diagnostics",
        "\\System\\Troubleshooting and Diagnostics\\Scripted Diagnostics",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\Scripted Diagnostics",
        "Scripted Diagnostics"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-sdiageng#admx-sdiageng-scripteddiagnosticssecuritypolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_sdiageng/ScriptedDiagnosticsSecurityPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_sdiageng_scripteddiagnosticssecuritypolicy",
    "categoryId": "78b3d753-d84d-496b-a93c-d577ab5865bd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_sdiageng_scripteddiagnosticssecuritypolicy",
    "description": "This policy setting determines whether scripted diagnostics will execute diagnostic packages that are signed by untrusted publishers.\r\n\r\nIf you enable this policy setting, the scripted diagnostics execution engine validates the signer of any diagnostic package and runs only those signed by trusted publishers.\r\n\r\nIf you disable or do not configure this policy setting, the scripted diagnostics execution engine runs all digitally signed packages.\r\n ",
    "helpText": "",
    "name": "ScriptedDiagnosticsSecurityPolicy",
    "displayName": "Configure Security Policy for Scripted Diagnostics",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_sdiageng_scripteddiagnosticssecuritypolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_sdiageng_scripteddiagnosticssecuritypolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_sdiageng_scripteddiagnosticssecuritypolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}