{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Cellular Data Roaming",
        "Connectivity"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#allowcellulardataroaming"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Connectivity/AllowCellularDataRoaming",
    "rootDefinitionId": "device_vendor_msft_policy_config_connectivity_allowcellulardataroaming",
    "categoryId": "f03f9f2f-f8ba-4c94-ad5f-95ada256c8c6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_connectivity_allowcellulardataroaming",
    "description": "Allows or disallows cellular data roaming on the device. Device reboot is not required to enforce the policy. Most restricted value is 0.",
    "helpText": "",
    "name": "AllowCellularDataRoaming",
    "displayName": "Allow Cellular Data Roaming",
    "defaultOptionId": "device_vendor_msft_policy_config_connectivity_allowcellulardataroaming_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_connectivity_allowcellulardataroaming_0",
            "description": "Do not allow cellular data roaming. The user cannot turn it on. This value is not supported in Windows 10, version 1511.",
            "helpText": null,
            "name": "Do not allow cellular data roaming. The user cannot turn it on. This value is not supported in Windows 10, version 1511.",
            "displayName": "Do not allow cellular data roaming. The user cannot turn it on. This value is not supported in Windows 10, version 1511.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_connectivity_allowcellulardataroaming_1",
            "description": "Allow cellular data roaming.",
            "helpText": null,
            "name": "Allow cellular data roaming.",
            "displayName": "Allow cellular data roaming.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_connectivity_allowcellulardataroaming_2",
            "description": "Allow cellular data roaming on. The user cannot turn it off.",
            "helpText": null,
            "name": "Allow cellular data roaming on. The user cannot turn it off.",
            "displayName": "Allow cellular data roaming on. The user cannot turn it off.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}