{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_CustomGoOfflineActions_2",
        "Non-default server disconnect actions",
        "\\Network\\Offline Files",
        "Administrative Templates\\Network\\Offline Files",
        "Offline Files"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_OfflineFiles/Pol_CustomGoOfflineActions_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2",
    "categoryId": "82a9c23f-2c09-4479-9cd3-e7f185d7676f",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2_lbl_customgoofflineactionslist",
    "description": null,
    "helpText": "",
    "name": "Lbl_CustomGoOfflineActionsList",
    "displayName": "Customize actions: (Device)",
    "childIds": [
        "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2_lbl_customgoofflineactionslist_key",
        "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2_lbl_customgoofflineactionslist_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2_lbl_customgoofflineactionslist_key",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_offlinefiles_pol_customgoofflineactions_2_lbl_customgoofflineactionslist_value",
            "required": true
        }
    ]
}