{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Shutdown Allow System To Be Shut Down Without Having To Log On",
        "Local Policies Security Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#localpoliciessecurityoptions-shutdown-allowsystemtobeshutdownwithouthavingtologon"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/LocalPoliciesSecurityOptions/Shutdown_AllowSystemToBeShutDownWithoutHavingToLogOn",
    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_shutdown_allowsystemtobeshutdownwithouthavingtologon",
    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_shutdown_allowsystemtobeshutdownwithouthavingtologon",
    "description": "Shutdown: Allow system to be shut down without having to log on  This security setting determines whether a computer can be shut down without having to log on to Windows.  When this policy is enabled, the Shut Down command is available on the Windows logon screen.  When this policy is disabled, the option to shut down the computer does not appear on the Windows logon screen. In this case, users must be able to log on to the computer successfully and have the Shut down the system user right before they can perform a system shutdown.  Default on workstations: Enabled. Default on servers: Disabled.",
    "helpText": "",
    "name": "Shutdown_AllowSystemToBeShutDownWithoutHavingToLogOn",
    "displayName": "Shutdown Allow System To Be Shut Down Without Having To Log On",
    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_shutdown_allowsystemtobeshutdownwithouthavingtologon_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_shutdown_allowsystemtobeshutdownwithouthavingtologon_0",
            "description": "Disabled",
            "helpText": null,
            "name": "disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_shutdown_allowsystemtobeshutdownwithouthavingtologon_1",
            "description": "Enabled (Allow system to be shut down without having to log on)",
            "helpText": null,
            "name": "enabled (allow system to be shut down without having to log on)",
            "displayName": "Enabled (Allow system to be shut down without having to log on)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}