{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Automatic Account Management Enabled",
        "LAPS"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/LAPS-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/LAPS",
    "offsetUri": "/Policies/AutomaticAccountManagementEnabled",
    "rootDefinitionId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled",
    "categoryId": "f1dcf7b6-2d89-41bf-b5eb-02a879c6db5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled",
    "description": "Use this setting to specify whether automatic account management is enabled.\n\nIf this setting is enabled, the target account will be automatically managed.\n\nIf this setting is disabled, the target account will not be automatically managed.\n\nIf not specified, this setting defaults to False.",
    "helpText": "",
    "name": "AutomaticAccountManagementEnabled",
    "displayName": "Automatic Account Management Enabled",
    "defaultOptionId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_false",
            "description": "The target account will not be automatically managed",
            "helpText": null,
            "name": "The target account will not be automatically managed",
            "displayName": "The target account will not be automatically managed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_true",
            "description": "The target account will be automatically managed",
            "helpText": null,
            "name": "The target account will be automatically managed",
            "displayName": "The target account will be automatically managed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_laps_policies_automaticaccountmanagementtarget",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_laps_policies_automaticaccountmanagementnameorprefix",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_laps_policies_automaticaccountmanagementenableaccount",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_laps_policies_automaticaccountmanagementrandomizename",
                    "required": false
                }
            ]
        }
    ]
}