{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CPL_Personalization_NoChangingStartMenuBackground",
        "Prevent changing start menu background",
        "\\Control Panel\\Personalization",
        "Administrative Templates\\Control Panel\\Personalization",
        "Personalization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-controlpaneldisplay#admx-controlpaneldisplay-cpl-personalization-nochangingstartmenubackground"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ControlPanelDisplay/CPL_Personalization_NoChangingStartMenuBackground",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_nochangingstartmenubackground",
    "categoryId": "e6231142-3d39-44a7-9522-6a3357bd439f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_nochangingstartmenubackground",
    "description": "Prevents users from changing the look of their start menu background, such as its color or accent.\r\n\r\nBy default, users can change the look of their start menu background, such as its color or accent.\r\n\r\nIf you enable this setting, the user will be assigned the default start menu background and colors and will not be allowed to change them.\r\n\r\nIf the \"Force a specific background and accent color\" policy is also set on a supported version of Windows, then those colors take precedence over this policy.\r\n\r\nIf the \"Force a specific Start background\" policy is also set on a supported version of Windows, then that background takes precedence over this policy.\r\n\n ",
    "helpText": "",
    "name": "CPL_Personalization_NoChangingStartMenuBackground",
    "displayName": "Prevent changing start menu background",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_nochangingstartmenubackground_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_nochangingstartmenubackground_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_nochangingstartmenubackground_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}