{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_AllowInstallationMicrosoftEdgeCanary",
        "Allow installation",
        "\\Microsoft Edge Update\\Applications\\Microsoft Edge Canary",
        "Microsoft Edge Update\\Applications\\Microsoft Edge Canary",
        "Microsoft Edge Canary"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/update~Policy~Cat_Google~Cat_GoogleUpdate~Cat_Applications~Cat_MicrosoftEdgeCanary/Pol_AllowInstallationMicrosoftEdgeCanary",
    "rootDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_allowinstallationmicrosoftedgecanary",
    "categoryId": "797ac384-f48e-4567-b931-33a6ce923b94",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_allowinstallationmicrosoftedgecanary",
    "description": "Specifies whether a Microsoft Edge channel can be installed using Microsoft Edge Update.\r\n\r\n  If you enable this policy for a channel, users can install that channel of Microsoft Edge through Microsoft Edge Update.\r\n\r\n  If you disable this policy for a channel, users cannot install that channel of Microsoft Edge through Microsoft Edge Update.\r\n\r\n  If you don't configure this policy for a channel, the 'Allow installation default' policy configuration determines whether users can install that channel of Microsoft Edge through Microsoft Edge Update.",
    "helpText": "",
    "name": "Pol_AllowInstallationMicrosoftEdgeCanary",
    "displayName": "Allow installation",
    "defaultOptionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_allowinstallationmicrosoftedgecanary_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_allowinstallationmicrosoftedgecanary_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_allowinstallationmicrosoftedgecanary_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}