{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableScripts",
        "Turn on Script Execution",
        "\\Windows Components\\Windows PowerShell",
        "Administrative Templates\\Windows Components\\Windows PowerShell",
        "Windows PowerShell"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-powershellexecutionpolicy#admx-powershellexecutionpolicy-enablescripts"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PowerShellExecutionPolicy/EnableScripts",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts",
    "categoryId": "5a92aaed-3c64-4074-bacf-91dc1896d6f1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts",
    "description": "This policy setting lets you configure the script execution policy, controlling which scripts are allowed to run.\r\n\r\nIf you enable this policy setting, the scripts selected in the drop-down list are allowed to run.\r\n\r\nThe \"Allow only signed scripts\" policy setting allows scripts to execute only if they are signed by a trusted publisher.\r\n\r\nThe \"Allow local scripts and remote signed scripts\" policy setting allows any local scrips to run; scripts that originate from the Internet must be signed by a trusted publisher.\r\n\r\nThe \"Allow all scripts\" policy setting allows all scripts to run.\r\n\r\nIf you disable this policy setting, no scripts are allowed to run.\r\n\r\nNote: This policy setting exists under both \"Computer Configuration\" and \"User Configuration\" in the Local Group Policy Editor. The \"Computer Configuration\" has precedence over \"User Configuration.\"\r\n\r\nIf you disable or do not configure this policy setting, it reverts to a per-machine preference setting; the default if that is not configured is \"No scripts allowed.\"\r\n ",
    "helpText": "",
    "name": "EnableScripts",
    "displayName": "Turn on Script Execution",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_executionpolicy",
                    "required": true
                }
            ]
        }
    ]
}