{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "SR_DisableSR",
        "Turn off System Restore",
        "\\System\\System Restore",
        "Administrative Templates\\System\\System Restore",
        "System Restore"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-system#system-disablesystemrestore"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/System/DisableSystemRestore",
    "rootDefinitionId": "device_vendor_msft_policy_config_system_disablesystemrestore",
    "categoryId": "394b2dfb-3404-4668-94af-5acc825fcf51",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_system_disablesystemrestore",
    "description": "Allows you to disable System Restore.\r\n\r\nThis policy setting allows you to turn off System Restore.\r\n\r\nSystem Restore enables users, in the event of a problem, to restore their computers to a previous state without losing personal data files. By default, System Restore is turned on for the boot volume.\r\n\r\nIf you enable this policy setting, System Restore is turned off, and the System Restore Wizard cannot be accessed. The option to configure System Restore or create a restore point through System Protection is also disabled.\r\n\r\nIf you disable or do not configure this policy setting, users can perform System Restore and configure System Restore settings through System Protection.\r\n\r\nAlso, see the \"Turn off System Restore configuration\" policy setting. If the \"Turn off System Restore\" policy setting is disabled or not configured, the \"Turn off System Restore configuration\" policy setting is used to determine whether the option to configure System Restore is available.",
    "helpText": "",
    "name": "SR_DisableSR",
    "displayName": "Turn off System Restore",
    "defaultOptionId": "device_vendor_msft_policy_config_system_disablesystemrestore_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_system_disablesystemrestore_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_system_disablesystemrestore_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}