{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcNumberSessionVHDsToKeep",
        "Number Session VHD(s) To Keep",
        "\\FSLogix\\ODFC Containers",
        "Administrative Templates\\FSLogix\\ODFC Containers",
        "ODFC Containers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC/OdfcNumberSessionVHDsToKeep",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcnumbersessionvhdstokeep",
    "categoryId": "5c645a3e-bc39-44e9-8786-4c82e0553d22",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcnumbersessionvhdstokeep",
    "description": "This setting is used when VHDAccessMode is set to '3'. This controls the number of session VHD(x) containers that are persisted. For example, if this is set to '2' and the user creates a 3rd session, a new session VHD(x) will be created and used and it will be deleted when the 3rd session ends. Th default value is 2 sessions which is the same as \"Not Configured\"\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\Policies\\FSLogix\\ODFC\\NumSessionVHDsToKeep\r\nType:  DWORD\r\nValues:  Min = 0, Max = 10",
    "helpText": "",
    "name": "OdfcNumberSessionVHDsToKeep",
    "displayName": "Number Session VHD(s) To Keep",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcnumbersessionvhdstokeep_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcnumbersessionvhdstokeep_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcnumbersessionvhdstokeep_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcnumbersessionvhdstokeep_odfcnumbersessionvhdstokeep",
                    "required": true
                }
            ]
        }
    ]
}