{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SCPnPNotification",
        "Notify user of successful smart card driver installation",
        "\\Windows Components\\Smart Card",
        "Administrative Templates\\Windows Components\\Smart Card",
        "Smart Card"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-smartcard#admx-smartcard-scpnpnotification"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Smartcard/SCPnPNotification",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_smartcard_scpnpnotification",
    "categoryId": "4fc4d2f3-35ee-43ec-a033-ef78da571e70",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_smartcard_scpnpnotification",
    "description": "This policy setting allows you to control whether a confirmation message is displayed when a smart card device driver is installed.\r\n\r\nIf you enable or do not configure this policy setting, a confirmation message will be displayed when a smart card device driver is installed.\r\n\r\nIf you disable this policy setting, a confirmation message will not be displayed when a smart card device driver is installed.\r\n\r\nNote: This policy setting is applied only for smart cards that have passed the Windows Hardware Quality Labs (WHQL) testing process.\r\n ",
    "helpText": "",
    "name": "SCPnPNotification",
    "displayName": "Notify user of successful smart card driver installation",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_smartcard_scpnpnotification_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_smartcard_scpnpnotification_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_smartcard_scpnpnotification_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}