{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BITS_MaxBandwidthV2_Maintenance",
        "Set up a maintenance schedule to limit the maximum network bandwidth used for BITS background transfers",
        "\\Network\\Background Intelligent Transfer Service (BITS)",
        "Administrative Templates\\Network\\Background Intelligent Transfer Service (BITS)",
        "Background Intelligent Transfer Service (BITS)"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Bits/BITS_MaxBandwidthV2_Maintenance",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance",
    "categoryId": "f2345e03-bcd9-48fc-9c52-11ae06ba625a",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom",
    "description": null,
    "helpText": "",
    "name": "BITS_MaintenanceHoursFrom",
    "displayName": "From (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_20",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_0",
            "description": null,
            "helpText": null,
            "name": "12 AM",
            "displayName": "12 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_1",
            "description": null,
            "helpText": null,
            "name": "1 AM",
            "displayName": "1 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_2",
            "description": null,
            "helpText": null,
            "name": "2 AM",
            "displayName": "2 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_3",
            "description": null,
            "helpText": null,
            "name": "3 AM",
            "displayName": "3 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_4",
            "description": null,
            "helpText": null,
            "name": "4 AM",
            "displayName": "4 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_5",
            "description": null,
            "helpText": null,
            "name": "5 AM",
            "displayName": "5 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_6",
            "description": null,
            "helpText": null,
            "name": "6 AM",
            "displayName": "6 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_7",
            "description": null,
            "helpText": null,
            "name": "7 AM",
            "displayName": "7 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_8",
            "description": null,
            "helpText": null,
            "name": "8 AM",
            "displayName": "8 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_9",
            "description": null,
            "helpText": null,
            "name": "9 AM",
            "displayName": "9 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "9"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_10",
            "description": null,
            "helpText": null,
            "name": "10 AM",
            "displayName": "10 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_11",
            "description": null,
            "helpText": null,
            "name": "11 AM",
            "displayName": "11 AM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "11"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_12",
            "description": null,
            "helpText": null,
            "name": "12 PM",
            "displayName": "12 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "12"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_13",
            "description": null,
            "helpText": null,
            "name": "1 PM",
            "displayName": "1 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "13"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_14",
            "description": null,
            "helpText": null,
            "name": "2 PM",
            "displayName": "2 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "14"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_15",
            "description": null,
            "helpText": null,
            "name": "3 PM",
            "displayName": "3 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "15"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_16",
            "description": null,
            "helpText": null,
            "name": "4 PM",
            "displayName": "4 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "16"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_17",
            "description": null,
            "helpText": null,
            "name": "5 PM",
            "displayName": "5 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "17"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_18",
            "description": null,
            "helpText": null,
            "name": "6 PM",
            "displayName": "6 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "18"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_19",
            "description": null,
            "helpText": null,
            "name": "7 PM",
            "displayName": "7 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "19"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_20",
            "description": null,
            "helpText": null,
            "name": "8 PM",
            "displayName": "8 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "20"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_21",
            "description": null,
            "helpText": null,
            "name": "9 PM",
            "displayName": "9 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "21"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_22",
            "description": null,
            "helpText": null,
            "name": "10 PM",
            "displayName": "10 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "22"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom_23",
            "description": null,
            "helpText": null,
            "name": "11 PM",
            "displayName": "11 PM",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "23"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance"
                }
            ],
            "dependedOnBy": []
        }
    ]
}