{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Let Apps Access Cellular Data",
        "Cellular"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Cellular#cellular-letappsaccesscellulardata"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Cellular/LetAppsAccessCellularData",
    "rootDefinitionId": "device_vendor_msft_policy_config_cellular_letappsaccesscellulardata",
    "categoryId": "d5d99ca9-9995-4724-bc46-fd07f362898c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_cellular_letappsaccesscellulardata",
    "description": "This policy setting specifies whether Windows apps can access cellular data.",
    "helpText": "",
    "name": "LetAppsAccessCellularData",
    "displayName": "Let Apps Access Cellular Data",
    "defaultOptionId": "device_vendor_msft_policy_config_cellular_letappsaccesscellulardata_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_cellular_letappsaccesscellulardata_0",
            "description": "User is in control",
            "helpText": null,
            "name": "User is in control",
            "displayName": "User is in control",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_cellular_letappsaccesscellulardata_1",
            "description": "Force Allow",
            "helpText": null,
            "name": "Force Allow",
            "displayName": "Force Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_cellular_letappsaccesscellulardata_2",
            "description": "Force Deny",
            "helpText": null,
            "name": "Force Deny",
            "displayName": "Force Deny",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}