{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisplayCapturePermissionsPolicyEnabled",
        "Specifies whether the display-capture permissions-policy is checked or skipped",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev95~Policy~microsoft_edge/DisplayCapturePermissionsPolicyEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_displaycapturepermissionspolicyenabled",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_displaycapturepermissionspolicyenabled",
    "description": "OBSOLETE: This policy is obsolete and doesn't work after Microsoft Edge 109.\r\n\r\nThis policy is obsolete. The policy was a temporary workaround for non-spec-compliant enterprise applications.\r\n\r\nThis policy stopped working in Microsoft Edge 107 and was obsoleted in Microsoft Edge 110.\r\n\r\nThe display-capture permissions-policy gates access to getDisplayMedia(),\r\nas per this spec:\r\nhttps://www.w3.org/TR/screen-capture/#feature-policy-integration\r\nHowever, if this policy is Disabled, this requirement is not enforced,\r\nand getDisplayMedia() is allowed from contexts that would otherwise be\r\nforbidden.\r\n\r\nIf you enable or don't configure this policy, sites can only call getDisplayMedia() from\r\ncontexts which are allowlisted by the display-capture permissions-policy.\r\n\r\nIf you disable this policy, sites can call getDisplayMedia() even from contexts\r\nwhich are not allowlisted by the display-capture permissions policy.\r\nNote that other restrictions may still apply.",
    "helpText": "",
    "name": "DisplayCapturePermissionsPolicyEnabled",
    "displayName": "Specifies whether the display-capture permissions-policy is checked or skipped (obsolete)",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_displaycapturepermissionspolicyenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_displaycapturepermissionspolicyenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_displaycapturepermissionspolicyenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}