{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Reporting_CriticalFailureTimeout",
        "Configure time out for detections in critically failed state",
        "\\Windows Components\\Microsoft Defender Antivirus\\Reporting",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Reporting",
        "Reporting"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/Reporting_CriticalFailureTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_reporting_criticalfailuretimeout",
    "categoryId": "eb5baf57-86c8-4bfa-ac3a-53025686e37c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_reporting_criticalfailuretimeout_reporting_criticalfailuretimeout",
    "description": null,
    "helpText": "",
    "name": "Reporting_CriticalFailureTimeout",
    "displayName": "Configure time out for detections in critically failed state (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4294967295,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 10080
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_reporting_criticalfailuretimeout_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_reporting_criticalfailuretimeout"
        }
    ],
    "dependedOnBy": []
}