{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RandomDelayPolicy",
        "Automatic Maintenance Random Delay",
        "\\Windows Components\\Maintenance Scheduler",
        "Administrative Templates\\Windows Components\\Maintenance Scheduler",
        "Maintenance Scheduler"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-msched#admx-msched-randomdelaypolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_msched/RandomDelayPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_msched_randomdelaypolicy",
    "categoryId": "c20ba4a5-483d-417c-bd96-de3cd83303e1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_msched_randomdelaypolicy",
    "description": "\r\n          This policy setting allows you to configure Automatic Maintenance activation random delay.\r\n\r\n          The maintenance random delay is the amount of time up to which Automatic Maintenance will delay starting from its Activation Boundary.\r\n\r\n          If you enable this policy setting, Automatic Maintenance will delay starting from its Activation Boundary, by upto this time.\r\n\r\n          If you do not configure this policy setting, 4 hour random delay will be applied to Automatic Maintenance.\r\n\r\n          If you disable this policy setting, no random delay will be applied to Automatic Maintenance.\r\n      \r\n ",
    "helpText": "",
    "name": "RandomDelayPolicy",
    "displayName": "Automatic Maintenance Random Delay",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_msched_randomdelaypolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_msched_randomdelaypolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_msched_randomdelaypolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_msched_randomdelaypolicy_randomdelay",
                    "required": true
                }
            ]
        }
    ]
}