{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableWindowsBranchCache_Hosted",
        "Set BranchCache Hosted Cache mode",
        "\\Network\\BranchCache",
        "Administrative Templates\\Network\\BranchCache",
        "BranchCache"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PeerToPeerCaching/EnableWindowsBranchCache_Hosted",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hosted",
    "categoryId": "1cda8821-d9e2-485e-8d78-1829593d41ca",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hosted_wbc_cache_textbox",
    "description": null,
    "helpText": "",
    "name": "WBC_Cache_TextBox",
    "displayName": "Type the name of the hosted cache server (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hosted_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hosted"
        }
    ],
    "dependedOnBy": []
}