{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PCH_ConfigureReport",
        "Configure Error Reporting",
        "\\Windows Components\\Windows Error Reporting",
        "Administrative Templates\\Windows Components\\Windows Error Reporting",
        "Windows Error Reporting"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-errorreporting#admx-errorreporting-pch-configurereport"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ErrorReporting/PCH_ConfigureReport",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport",
    "categoryId": "d9b7efad-fe18-4c98-925b-c4a5db0f2815",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport",
    "description": "This policy setting configures how errors are reported to Microsoft, and what information is sent when Windows Error Reporting is enabled.\r\n\r\nThis policy setting does not enable or disable Windows Error Reporting. To turn Windows Error Reporting on or off, see the Turn off Windows Error Reporting policy setting in Computer Configuration/Administrative Templates/System/Internet Communication Management/Internet Communication settings.\r\n\r\nImportant: If the Turn off Windows Error Reporting policy setting is not configured, then Control Panel settings for Windows Error Reporting override this policy setting.\r\n\r\nIf you enable this policy setting, the setting overrides any user changes made to Windows Error Reporting settings in Control Panel, and default values are applied for any Windows Error Reporting policy settings that are not configured (even if users have changed settings by using Control Panel). If you enable this policy setting, you can configure the following settings in the policy setting:\r\n\r\n- \"Do not display links to any Microsoft ‘More information’ websites\": Select this option if you do not want error dialog boxes to display links to Microsoft websites.\r\n\r\n- \"Do not collect additional files\": Select this option if you do not want additional files to be collected and included in error reports.\r\n\r\n- \"Do not collect additional computer data\": Select this if you do not want additional information about the computer to be collected and included in error reports.\r\n\r\n- \"Force queue mode for application errors\": Select this option if you do not want users to report errors. When this option is selected, errors are stored in a queue directory, and the next administrator to log on to the computer can send the error reports to Microsoft.\r\n\r\n- \"Corporate file path\": Type a UNC path to enable Corporate Error Reporting.  All errors are stored at the specified location instead of being sent directly to Microsoft, and the next administrator to log onto the computer can send the error reports to Microsoft.\r\n\r\n- \"Replace instances of the word ‘Microsoft’ with\":  You can specify text with which to customize your error report dialog boxes.  The word \"Microsoft\" is replaced with the specified text.\r\n\r\nIf you do not configure this policy setting, users can change Windows Error Reporting settings in Control Panel. By default, these settings are Enable Reporting on computers that are running Windows XP, and Report to Queue on computers that are running Windows Server 2003.\r\n\r\nIf you disable this policy setting, configuration settings in the policy setting are left blank.\r\n\r\nSee related policy settings Display Error Notification (same folder as this policy setting), and Turn off Windows Error Reporting in Computer Configuration/Administrative Templates/System/Internet Communication Management/Internet Communication settings.\r\n ",
    "helpText": "",
    "name": "PCH_ConfigureReport",
    "displayName": "Configure Error Reporting",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_noexternalurl_chk",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_nofilecollect_chk",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_noleveltwo_chk",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_forceq_chk",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_dumppath_edit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_companytext_edit",
                    "required": true
                }
            ]
        }
    ]
}