{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PruningInterval",
        "Directory pruning interval",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing2/PruningInterval",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle",
    "description": null,
    "helpText": "",
    "name": "PruningIntervalTitle",
    "displayName": "Interval: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_480",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_0",
            "description": null,
            "helpText": null,
            "name": "Continuous",
            "displayName": "Continuous",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_10",
            "description": null,
            "helpText": null,
            "name": "10 Minutes",
            "displayName": "10 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_30",
            "description": null,
            "helpText": null,
            "name": "30 Minutes",
            "displayName": "30 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "30"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_60",
            "description": null,
            "helpText": null,
            "name": "1 Hour",
            "displayName": "1 Hour",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "60"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_240",
            "description": null,
            "helpText": null,
            "name": "4 Hours",
            "displayName": "4 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "240"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_480",
            "description": null,
            "helpText": null,
            "name": "8 Hours",
            "displayName": "8 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "480"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_720",
            "description": null,
            "helpText": null,
            "name": "12 Hours",
            "displayName": "12 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "720"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_1440",
            "description": null,
            "helpText": null,
            "name": "1 Day",
            "displayName": "1 Day",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1440"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_2880",
            "description": null,
            "helpText": null,
            "name": "2 Days",
            "displayName": "2 Days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2880"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_4320",
            "description": null,
            "helpText": null,
            "name": "3 Days",
            "displayName": "3 Days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4320"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_5760",
            "description": null,
            "helpText": null,
            "name": "4 Days",
            "displayName": "4 Days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5760"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_7200",
            "description": null,
            "helpText": null,
            "name": "5 Days",
            "displayName": "5 Days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7200"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_8640",
            "description": null,
            "helpText": null,
            "name": "6 Days",
            "displayName": "6 Days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8640"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_10080",
            "description": null,
            "helpText": null,
            "name": "1 Week",
            "displayName": "1 Week",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10080"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_20160",
            "description": null,
            "helpText": null,
            "name": "2 Weeks",
            "displayName": "2 Weeks",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "20160"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_30240",
            "description": null,
            "helpText": null,
            "name": "3 Weeks",
            "displayName": "3 Weeks",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "30240"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_40320",
            "description": null,
            "helpText": null,
            "name": "4 Weeks",
            "displayName": "4 Weeks",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "40320"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_50400",
            "description": null,
            "helpText": null,
            "name": "5 Weeks",
            "displayName": "5 Weeks",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "50400"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_60480",
            "description": null,
            "helpText": null,
            "name": "6 Weeks",
            "displayName": "6 Weeks",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "60480"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_70560",
            "description": null,
            "helpText": null,
            "name": "7 Weeks",
            "displayName": "7 Weeks",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "70560"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_pruningintervaltitle_4294967295",
            "description": null,
            "helpText": null,
            "name": "Infinite",
            "displayName": "Infinite",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4294967295"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruninginterval_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruninginterval"
                }
            ],
            "dependedOnBy": []
        }
    ]
}