{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_CipherSuiteOrder",
        "Cipher suite order",
        "\\Network\\Lanman Workstation",
        "Administrative Templates\\Network\\Lanman Workstation",
        "Lanman Workstation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-lanmanworkstation#admx-lanmanworkstation-pol-ciphersuiteorder"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LanmanWorkstation/Pol_CipherSuiteOrder",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder",
    "categoryId": "c95a5920-ad56-4668-a6ad-19c3eb428557",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder",
    "description": "This policy setting determines the cipher suites used by the SMB client.\r\n\r\nIf you enable this policy setting, cipher suites are prioritized in the order specified.\r\n\r\nIf you enable this policy setting and do not specify at least one supported cipher suite, or if you disable or do not configure this policy setting, the default cipher suite order is used.\r\n\r\nSMB 3.11 cipher suites:\r\n\r\nAES_128_GCM\r\nAES_128_CCM\r\n\r\nSMB 3.0 and 3.02 cipher suites:\r\n\r\nAES_128_CCM\r\n\r\nHow to modify this setting:\r\n\r\nArrange the desired cipher suites in the edit box, one cipher suite per line, in order from most to least preferred, with the most preferred cipher suite at the top. Remove any cipher suites you don't want to use.\r\n\r\nNote: When configuring this security setting, changes will not take effect until you restart Windows.\r\n ",
    "helpText": "",
    "name": "Pol_CipherSuiteOrder",
    "displayName": "Cipher suite order",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder_multitext_ciphersuiteorder",
                    "required": true
                }
            ]
        }
    ]
}