{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Publishing_Server1_Policy",
        "Publishing Server 1 Settings",
        "\\System\\App-V\\Publishing",
        "AppVirtualization",
        "App Virtualization",
        "Publishing"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/PublishingAllowServer1",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1",
    "categoryId": "ea812d2c-1cf9-4132-9b33-12bb7ac17dbd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1_user_refresh_unit_options",
    "description": "",
    "helpText": "",
    "name": "User_Refresh_Unit_Options",
    "displayName": "User Publishing Refresh Interval Unit",
    "defaultOptionId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1_user_refresh_unit_options_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1_user_refresh_unit_options_0",
            "description": null,
            "helpText": null,
            "name": "Hour",
            "displayName": "Hour",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1_1",
                    "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1_user_refresh_unit_options_1",
            "description": null,
            "helpText": null,
            "name": "Day",
            "displayName": "Day",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1_1",
                    "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver1"
                }
            ],
            "dependedOnBy": []
        }
    ]
}