{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WdiDpsScenarioDataSizeLimitPolicy",
        "Diagnostics: Configure scenario retention",
        "\\System\\Troubleshooting and Diagnostics",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics",
        "Troubleshooting and Diagnostics"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WDI/WdiDpsScenarioDataSizeLimitPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenariodatasizelimitpolicy",
    "categoryId": "424a0e73-8002-42e3-b47d-2062fc17c3b3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenariodatasizelimitpolicy_wdidpsscenariodatasizelimitpolicyvalue",
    "description": null,
    "helpText": "",
    "name": "WdiDpsScenarioDataSizeLimitPolicyValue",
    "displayName": "Scenario data size limit (in MB) (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 9999,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 128
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenariodatasizelimitpolicy_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenariodatasizelimitpolicy"
        }
    ],
    "dependedOnBy": []
}