{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Skip Calibration During Setup",
        "Mixed Reality"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-MixedReality#skipcalibrationduringsetup"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/MixedReality/SkipCalibrationDuringSetup",
    "rootDefinitionId": "device_vendor_msft_policy_config_mixedreality_skipcalibrationduringsetup",
    "categoryId": "f10138ba-123a-43bc-8031-4458ba327374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_mixedreality_skipcalibrationduringsetup",
    "description": "This policy configures whether the device will take the user through the eye tracking calibration process during device setup and first time user setup. If this policy is enabled, the device will not show the eye tracking calibration process during device setup and first time user setup. Note that until the user goes through the calibration process, eye tracking will not work on the device. If an app requires eye tracking and the user has not gone through the calibration process, the user will be prompted to do so.",
    "helpText": "",
    "name": "SkipCalibrationDuringSetup",
    "displayName": "Skip Calibration During Setup",
    "defaultOptionId": "device_vendor_msft_policy_config_mixedreality_skipcalibrationduringsetup_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.20348",
        "windowsSkus": [
            "holographicForBusiness"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_skipcalibrationduringsetup_0",
            "description": "Eye tracking calibration process will be shown during device setup and first time user setup.",
            "helpText": null,
            "name": "Eye tracking calibration process will be shown during device setup and first time user setup.",
            "displayName": "Eye tracking calibration process will be shown during device setup and first time user setup.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_skipcalibrationduringsetup_1",
            "description": "Eye tracking calibration process will not be shown during device setup and first time user setup.",
            "helpText": null,
            "name": "Eye tracking calibration process will not be shown during device setup and first time user setup.",
            "displayName": "Eye tracking calibration process will not be shown during device setup and first time user setup.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}