{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "USER_HOME",
        "Set user home folder",
        "\\System\\User Profiles",
        "Administrative Templates\\System\\User Profiles",
        "User Profiles"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserProfiles/USER_HOME",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_userprofiles_user_home",
    "categoryId": "b49cb414-bdfb-49d4-af5d-176ded4f9591",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_userprofiles_user_home_user_home_location",
    "description": null,
    "helpText": "",
    "name": "USER_HOME_LOCATION",
    "displayName": "Location: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_user_home_location_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_user_home_location_1",
            "description": null,
            "helpText": null,
            "name": "On the network",
            "displayName": "On the network",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_user_home_location_0",
            "description": null,
            "helpText": null,
            "name": "On the local computer",
            "displayName": "On the local computer",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        }
    ]
}