{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Select Sleep Button Action On Battery",
        "Power"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Power#selectsleepbuttonactiononbattery"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Power/SelectSleepButtonActionOnBattery",
    "rootDefinitionId": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery",
    "categoryId": "e9cd3225-7b0e-485e-99f8-7ec8dd3977a1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery",
    "description": "This policy setting specifies the action that Windows takes when a user presses the sleep button.  Possible actions include: 0 - Take no action 1 - Sleep 2 - Hibernate 3 - Shut down  If you enable this policy setting, you must select the desired action.  If you disable this policy setting or do not configure it, users can see and change this setting.",
    "helpText": "",
    "name": "SelectSleepButtonActionOnBattery",
    "displayName": "Select Sleep Button Action On Battery",
    "defaultOptionId": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery_0",
            "description": "Take no action",
            "helpText": null,
            "name": "Take no action",
            "displayName": "Take no action",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery_1",
            "description": "Sleep",
            "helpText": null,
            "name": "Sleep",
            "displayName": "Sleep",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery_2",
            "description": "System hibernate sleep state",
            "helpText": null,
            "name": "System hibernate sleep state",
            "displayName": "System hibernate sleep state",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery_3",
            "description": "System shutdown",
            "helpText": null,
            "name": "System shutdown",
            "displayName": "System shutdown",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}