{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "POL_AdmPwd",
        "Password Settings",
        "\\LAPS",
        "Administrative Templates\\LAPS",
        "LAPS"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AdmPwd/POL_AdmPwd",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd",
    "categoryId": "b3b2fc04-4b88-4a1c-8370-04573019eebe",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_elm_admpwd_passwordlength",
    "description": "",
    "helpText": "",
    "name": "ELM_AdmPwd_PasswordLength",
    "displayName": "Password Length (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 64,
        "minimumValue": 8
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 14
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd"
        }
    ],
    "dependedOnBy": []
}