{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Trusted Certificate",
        "Certificate File"
    ],
    "infoUrls": [],
    "baseUri": "./device/vendor/msft/trustedcertificate",
    "offsetUri": "/certificatefile",
    "rootDefinitionId": "device_vendor_msft_trustedcertificate_certificatefile",
    "categoryId": "dd9e4ae2-a432-4c48-a73a-52c75c3e5279",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_trustedcertificate_certificatefile",
    "description": null,
    "helpText": "",
    "name": "certificatefile",
    "displayName": "Certificate file",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10TrustedCertificate/policyJourneyState/0",
    "redirectMessage": "Create a Trusted Certificate policy",
    "redirectReason": "The \"Trusted Certificate\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}