{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SNMP_Communities",
        "Specify communities",
        "\\Network\\SNMP",
        "Administrative Templates\\Network\\SNMP",
        "SNMP"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-snmp#admx-snmp-snmp-communities"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Snmp/SNMP_Communities",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_snmp_snmp_communities",
    "categoryId": "b13e38a0-6ad6-4a1f-b53f-d8ca94847586",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_snmp_snmp_communities",
    "description": "This policy setting configures a list of the communities defined to the Simple Network Management Protocol (SNMP) service.\r\n\r\nSNMP is a protocol designed to give a user the capability to remotely manage a computer network, by polling and setting terminal values and monitoring network events.\r\n\r\nA valid community is a community recognized by the SNMP service, while a community is a group of hosts (servers, workstations, hubs, and routers) that are administered together by SNMP. The SNMP service is a managed network node that receives SNMP packets from the network.\r\n\r\nIf you enable this policy setting, the SNMP agent only accepts requests from management systems within the communities it recognizes, and only SNMP Read operation is allowed for the community.\r\n\r\nIf you disable or do not configure this policy setting, the SNMP service takes the Valid Communities configured on the local computer instead.\r\n\r\nBest practice: For security purposes, it is recommended to restrict the HKLM\\SOFTWARE\\Policies\\SNMP\\Parameters\\ValidCommunities key to allow only the local admin group full control.\r\n\r\nNote: It is good practice to use a cryptic community name.\r\n\r\nNote: This policy setting has no effect if the SNMP agent is not installed on the client computer.\r\n\r\nAlso, see the other two SNMP settings: \"Specify permitted managers\" and \"Specify trap configuration\".\r\n ",
    "helpText": "",
    "name": "SNMP_Communities",
    "displayName": "Specify communities",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_snmp_snmp_communities_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_snmp_snmp_communities_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_snmp_snmp_communities_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_snmp_snmp_communities_snmp_communitieslistbox",
                    "required": true
                }
            ]
        }
    ]
}