{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Deletion Policy",
        "Account Management"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/AccountManagement-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/AccountManagement",
    "offsetUri": "/UserProfileManagement/DeletionPolicy",
    "rootDefinitionId": "device_vendor_msft_accountmanagement_userprofilemanagement_deletionpolicy",
    "categoryId": "3b384fc5-5906-4dc4-bc48-a52b52fb054b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_accountmanagement_userprofilemanagement_deletionpolicy",
    "description": "Configures when profiles will be deleted. Allowed values: 0 (delete immediately upon device returning to a state with no currently active users); 1 (delete at storage capacity threshold); 2 (delete at both storage capacity threshold and profile inactivity threshold).",
    "helpText": "",
    "name": "DeletionPolicy",
    "displayName": "Deletion Policy",
    "defaultOptionId": "device_vendor_msft_accountmanagement_userprofilemanagement_deletionpolicy_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "holographicForBusiness"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_accountmanagement_userprofilemanagement_deletionpolicy_0",
            "description": "Delete immediately upon device returning to a state with no currently active users)",
            "helpText": null,
            "name": "Delete immediately upon device returning to a state with no currently active users)",
            "displayName": "Delete immediately upon device returning to a state with no currently active users)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_accountmanagement_userprofilemanagement_deletionpolicy_1",
            "description": "Delete at storage capacity threshold",
            "helpText": null,
            "name": "Delete at storage capacity threshold",
            "displayName": "Delete at storage capacity threshold",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_accountmanagement_userprofilemanagement_deletionpolicy_2",
            "description": "Delete at both storage capacity threshold and profile inactivity threshold",
            "helpText": null,
            "name": "Delete at both storage capacity threshold and profile inactivity threshold",
            "displayName": "Delete at both storage capacity threshold and profile inactivity threshold",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}