{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceInstall_Instance_IDs_Allow",
        "Allow installation of devices that match any of these device instance IDs",
        "\\System\\Device Installation\\Device Installation Restrictions",
        "Administrative Templates\\System\\Device Installation\\Device Installation Restrictions",
        "Device Installation Restrictions"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-deviceinstallation#deviceinstallation-allowinstallationofmatchingdeviceinstanceids"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeviceInstallation/AllowInstallationOfMatchingDeviceInstanceIDs",
    "rootDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids",
    "categoryId": "979412d7-6716-440c-9a64-5889026d73da",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids",
    "description": "This policy setting allows you to specify a list of Plug and Play device instance IDs for devices that Windows is allowed to install. This policy setting is intended to be used only when the \"Apply layered order of evaluation for Allow and Prevent device installation policies across all device match criteria\" policy setting is enabled, however it may also be used with the \"Prevent installation of devices not described by other policy settings\" policy setting for legacy policy definitions.\r\n\r\nWhen this policy setting is enabled together with the \"Apply layered order of evaluation for Allow and Prevent device installation policies across all device match criteria\" policy setting, Windows is allowed to install or update any device whose Plug and Play device instance ID appears in the list you create, unless another policy setting at the same or higher layer in the hierarchy specifically prevents that installation, such as the following policy settings:\r\n- Prevent installation of devices that match any of these device instance IDs\r\nIf the \"Apply layered order of evaluation for Allow and Prevent device installation policies across all device match criteria\" policy setting is not enabled with this policy setting, then any other policy settings specifically preventing installation will take precedence.\r\n\r\nNOTE: The \"Prevent installation of devices not described by other policy settings\" policy setting has been replaced by the \"Apply layered order of evaluation for Allow and Prevent device installation policies across all device match criteria\" policy setting for supported target Windows 10 versions. It is recommended that you use the \"Apply layered order of evaluation for Allow and Prevent device installation policies across all device match criteria\" policy setting when possible.\r\n\r\nAlternatively, if this policy setting is enabled together with the \"Prevent installation of devices not described by other policy settings\" policy setting, Windows is allowed to install or update any device whose Plug and Play device instance ID appears in the list you create, unless another policy setting specifically prevents that installation (for example, the \"Prevent installation of devices that match any of these device IDs\" policy setting, the \"Prevent installation of devices for these device classes\" policy setting, the \"Prevent installation of devices that match any of these device instance IDs\" policy setting, or the \"Prevent installation of removable devices\" policy setting).\r\n\r\nIf you enable this policy setting on a remote desktop server, the policy setting affects redirection of the specified devices from a remote desktop client to the remote desktop server.\r\n\r\nIf you disable or do not configure this policy setting, and no other policy setting describes the device, the \"Prevent installation of devices not described by other policy settings\" policy setting determines whether the device can be installed.",
    "helpText": "",
    "name": "DeviceInstall_Instance_IDs_Allow",
    "displayName": "Allow installation of devices that match any of these device instance IDs",
    "defaultOptionId": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids_deviceinstall_instance_ids_allow_list",
                    "required": true
                }
            ]
        }
    ]
}