{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_RemoteDesktopVirtualGraphics",
        "Optimize visual experience when using RemoteFX",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment\\RemoteFX for Windows Server 2008 R2",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment\\RemoteFX for Windows Server 2008 R2",
        "RemoteFX for Windows Server 2008 R2"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_RemoteDesktopVirtualGraphics",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics",
    "categoryId": "a33fb618-0ad1-40a3-b94b-49c90c49ea03",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_ts_remotedesktopvirtualgraphics_screencapturerate",
    "description": null,
    "helpText": "",
    "name": "TS_RemoteDesktopVirtualGraphics_ScreenCaptureRate",
    "displayName": "Screen capture rate (frames per second): (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_ts_remotedesktopvirtualgraphics_screencapturerate_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_ts_remotedesktopvirtualgraphics_screencapturerate_1",
            "description": null,
            "helpText": null,
            "name": "Highest (best quality)",
            "displayName": "Highest (best quality)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_ts_remotedesktopvirtualgraphics_screencapturerate_2",
            "description": null,
            "helpText": null,
            "name": "Medium (default)",
            "displayName": "Medium (default)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_ts_remotedesktopvirtualgraphics_screencapturerate_3",
            "description": null,
            "helpText": null,
            "name": "Lowest",
            "displayName": "Lowest",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_remotedesktopvirtualgraphics"
                }
            ],
            "dependedOnBy": []
        }
    ]
}