{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_ProxyPacUrl",
        "URL to a proxy .pac file",
        "\\Microsoft Edge Update\\Proxy Server",
        "Microsoft Edge Update\\Proxy Server",
        "Proxy Server"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/update~Policy~Cat_Google~Cat_GoogleUpdate~Cat_ProxyServer/Pol_ProxyPacUrl",
    "rootDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxypacurl",
    "categoryId": "ff543267-540e-4e37-a1e9-daf6a5e16ba7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxypacurl_part_proxypacurl",
    "description": "",
    "helpText": "",
    "name": "Part_ProxyPacUrl",
    "displayName": "URL to a proxy .pac file (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxypacurl_1",
            "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxypacurl"
        }
    ],
    "dependedOnBy": []
}