{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OnlineRepair",
        "Online Repair",
        "\\Microsoft Office 2016 (Machine)\\Updates",
        "Microsoft Office 2016 (Machine)\\Updates",
        "Updates"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_Updates/L_OnlineRepair",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_onlinerepair",
    "categoryId": "86dae9f9-7eb1-4566-8558-b63fa2e20fee",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_onlinerepair",
    "description": "\r\nThis policy setting controls whether users can run an online repair for an Office client, such as Office 365 ProPlus, that comes with an Office 365 plan. You can also control whether the online repair only uses a local source and doesn't use the Office Content Delivery Network (CDN) on the Internet.\r\n\r\nNote: Users must have administrative privileges on the local computer to run an online repair.\r\n\r\nIf you enable or don't configure this policy setting, users can run an online repair from \"Programs and Features\" or \"Add/Remove Programs\" in Control Panel.\r\n\r\nThe online repair downloads and reinstalls Office from the Office CDN or from a local source, such a network share, depending on how Office is configured to get updates. If you aren't using the Office CDN, the local source must contain all the required files, including language files, to perform the repair.\r\n\r\nSelect \"Use Office CDN (if needed)\" if you want to use the Office CDN as an alternative location for the repair if the local source isn't available or doesn't contain all the necessary files.\r\n\r\nYou can also use a local copy of the Office Deployment Tool (setup.exe) for the repair by entering a local path for the Office Deployment Tool. This path can be a network share. If setup.exe can't be found in the local path specified, and \"Use Office CDN (if needed)\" is selected, then the online repair downloads a copy of setup.exe from the Office CDN. Otherwise, the online repair will fail.\r\n\r\nThe repair maintains all configuration settings, including products, languages, excluded applications, and update settings.\r\n\r\nIf you disable this policy setting, users can't run an online repair, but they can still run a quick repair.\r\n\r\nImportant: This policy setting only applies to Office clients, such as Office 365 ProPlus, that come with an Office 365 plan. This policy setting also applies to Visio and Project products that come with an Office 365 plan. This policy has no effect on Office products that are installed by using Windows Installer (MSI).\r\n      ",
    "helpText": "",
    "name": "L_OnlineRepair",
    "displayName": "Online Repair",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_onlinerepair_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_onlinerepair_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_onlinerepair_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_onlinerepair_l_fallbacktocdn",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_onlinerepair_l_localodtpath",
                    "required": true
                }
            ]
        }
    ]
}