{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CentralClassificationList",
        "File Classification Infrastructure: Specify classification properties list",
        "\\System\\File Classification Infrastructure",
        "Administrative Templates\\System\\File Classification Infrastructure",
        "File Classification Infrastructure"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-srmfci#admx-srmfci-centralclassificationlist"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_srmfci/CentralClassificationList",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist",
    "categoryId": "5c3d081f-6f7c-4650-8a40-200f44eb4794",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist",
    "description": "This policy setting controls which set of properties is available for classifying files on affected computers.\r\n\r\nAdministrators can define the properties for the organization by using Active Directory Domain Services (AD DS), and then group these properties into lists. Administrators can supplement these properties on individual file servers by using File Classification Infrastructure, which is part of the File Server Resource Manager role service.\r\n\r\nIf you enable this policy setting, you can select which list of properties is available for classification on the affected computers. \r\n\r\nIf you disable or do not configure this policy setting, the Global Resource Property List in AD DS provides the default set of properties.\r\n ",
    "helpText": "",
    "name": "CentralClassificationList",
    "displayName": "File Classification Infrastructure: Specify classification properties list",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist_centralclassificationlisttextelement",
                    "required": true
                }
            ]
        }
    ]
}