{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Schedule Imminent Restart Warning",
        "Update",
        "Windows Update For Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Update#scheduleimminentrestartwarning"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Update/ScheduleImminentRestartWarning",
    "rootDefinitionId": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_v2",
    "categoryId": "0e6c9053-73d6-4c56-9147-53513f6eefd8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_v2",
    "description": "Allows the IT Admin to specify the period for auto-restart imminent warning notifications. The default value is 15 (minutes).",
    "helpText": "",
    "name": "ScheduleImminentRestartWarning",
    "displayName": "Schedule Imminent Restart Warning",
    "defaultOptionId": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_15",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_15",
            "description": "15 Minutes",
            "helpText": null,
            "name": "15 Minutes",
            "displayName": "15 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 15
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_30",
            "description": "30 Minutes",
            "helpText": null,
            "name": "30 Minutes",
            "displayName": "30 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 30
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_60",
            "description": "60 Minutes",
            "helpText": null,
            "name": "60 Minutes",
            "displayName": "60 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 60
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}