{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "OSRecoveryUsage_Name",
        "Choose how BitLocker-protected operating system drives can be recovered",
        "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
        "Operating System Drives"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/SystemDrivesRecoveryOptions",
    "rootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
    "categoryId": "27e0674a-ea53-4f63-9c2e-fe76aa1021d0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
    "description": "",
    "helpText": "",
    "name": "OSActiveDirectoryBackupDropDown_Name",
    "displayName": "Configure storage of BitLocker recovery information to AD DS:",
    "defaultOptionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
            "description": null,
            "helpText": null,
            "name": "Store recovery passwords and key packages",
            "displayName": "Store recovery passwords and key packages",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_2",
            "description": null,
            "helpText": null,
            "name": "Store recovery passwords only",
            "displayName": "Store recovery passwords only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}