{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_EncryptProtocol",
        "Allow or Disallow use of encryption to protect the RPC protocol messages between File Share Shadow Copy Provider running on application server and File Share Shadow Copy Agent running on the file servers.",
        "\\System\\File Share Shadow Copy Provider",
        "Administrative Templates\\System\\File Share Shadow Copy Provider",
        "File Share Shadow Copy Provider"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-fileservervssprovider#admx-fileservervssprovider-pol-encryptprotocol"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FileServerVSSProvider/Pol_EncryptProtocol",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_fileservervssprovider_pol_encryptprotocol",
    "categoryId": "2d842579-300e-4a24-bc42-7c39af62c468",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_fileservervssprovider_pol_encryptprotocol",
    "description": "Determines whether the RPC protocol messagese used by VSS for SMB2 File Shares feature is enabled.\r\n\r\nVSS for SMB2 File Shares feature enables VSS aware backup applications to perform application consistent backup and restore of VSS aware applications storing data on SMB2 File Shares.\r\n\r\nBy default, the RPC protocol message between File Server VSS provider and File Server VSS Agent is signed but not encrypted. \r\n\r\nNote: To make changes to this setting effective, you must restart Volume Shadow Copy (VSS) Service .\r\n ",
    "helpText": "",
    "name": "Pol_EncryptProtocol",
    "displayName": "Allow or Disallow use of encryption to protect the RPC protocol messages between File Share Shadow Copy Provider running on application server and File Share Shadow Copy Agent running on the file servers.",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_fileservervssprovider_pol_encryptprotocol_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_fileservervssprovider_pol_encryptprotocol_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_fileservervssprovider_pol_encryptprotocol_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}