{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IdleTimeout",
        "Delay before running idle actions",
        "\\Microsoft Edge\\Idle Browser Actions",
        "Microsoft Edge\\Idle Browser Actions",
        "Idle Browser Actions"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev134~Policy~microsoft_edge~BrowserIdle/IdleTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeout",
    "categoryId": "526e363a-84db-4256-a13c-e01c8c646e26",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeout",
    "description": "Triggers an action when the computer is idle.\r\n\r\nIf you set this policy, it specifies the length of time without user input (in minutes) before the browser runs actions configured via the IdleTimeoutActions policy.\r\n\r\nIf you not set this policy, no action will be ran.\r\n\r\nThe minimum threshold is 1 minute.\r\n\r\n\"User input\" is defined by Operating System APIs, and includes things like moving the mouse or typing on the keyboard.",
    "helpText": "",
    "name": "IdleTimeout",
    "displayName": "Delay before running idle actions",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeout_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeout_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeout_idletimeout",
                    "required": true
                }
            ]
        }
    ]
}