{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_SERVER_PROFILE",
        "Configure RemoteFX Adaptive Graphics",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment",
        "Remote Session Environment"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_SERVER_PROFILE",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile",
    "categoryId": "ce572b49-4d47-47b6-b787-ac1252753581",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_ts_server_profile_levels",
    "description": null,
    "helpText": "",
    "name": "TS_SERVER_PROFILE_LEVELS",
    "displayName": "RDP experience: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_ts_server_profile_levels_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_ts_server_profile_levels_2",
            "description": null,
            "helpText": null,
            "name": "Let the system choose experience for network condition",
            "displayName": "Let the system choose experience for network condition",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_ts_server_profile_levels_1",
            "description": null,
            "helpText": null,
            "name": "Optimize for server scalability",
            "displayName": "Optimize for server scalability",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_ts_server_profile_levels_3",
            "description": null,
            "helpText": null,
            "name": "Optimize for minimum bandwidth usage",
            "displayName": "Optimize for minimum bandwidth usage",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_profile"
                }
            ],
            "dependedOnBy": []
        }
    ]
}