{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PruningPriority",
        "Directory pruning priority",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing2/PruningPriority",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_prioritylevel",
    "description": null,
    "helpText": "",
    "name": "PriorityLevel",
    "displayName": "Priority level: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_prioritylevel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_prioritylevel_4294967294",
            "description": null,
            "helpText": null,
            "name": "Lowest",
            "displayName": "Lowest",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4294967294"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_prioritylevel_4294967295",
            "description": null,
            "helpText": null,
            "name": "Below Normal",
            "displayName": "Below Normal",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4294967295"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_prioritylevel_0",
            "description": null,
            "helpText": null,
            "name": "Normal",
            "displayName": "Normal",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_prioritylevel_1",
            "description": null,
            "helpText": null,
            "name": "Above Normal",
            "displayName": "Above Normal",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_prioritylevel_2",
            "description": null,
            "helpText": null,
            "name": "Highest",
            "displayName": "Highest",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningpriority_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningpriority"
                }
            ],
            "dependedOnBy": []
        }
    ]
}