{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ServiceWorkerToControlSrcdocIframeEnabled",
        "Allow ServiceWorker to control srcdoc iframes",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev134~Policy~microsoft_edge/ServiceWorkerToControlSrcdocIframeEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_serviceworkertocontrolsrcdociframeenabled",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_serviceworkertocontrolsrcdociframeenabled",
    "description": "https://github.com/w3c/ServiceWorker/issues/765 asks srcdoc iframe with the \"allow-same-origin\" sandbox attribute to be under ServiceWorker control.\r\n\r\nBy default (if left unset) or when set to Enabled, Microsoft Edge makes srcdoc iframes with \"allow-same-origin\" sandbox attributes to be under ServiceWorker control.\r\n\r\nSetting the policy to Disabled prevents ServiceWorker control over srcdoc iframes.\r\n\r\nThis policy is temporary and planned for deprecation in 2026.",
    "helpText": "",
    "name": "ServiceWorkerToControlSrcdocIframeEnabled",
    "displayName": "Allow ServiceWorker to control srcdoc iframes",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_serviceworkertocontrolsrcdociframeenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_serviceworkertocontrolsrcdociframeenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_serviceworkertocontrolsrcdociframeenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}