{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Recovery Environment Authentication",
        "Security"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Security#recoveryenvironmentauthentication"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Security/RecoveryEnvironmentAuthentication",
    "rootDefinitionId": "device_vendor_msft_policy_config_security_recoveryenvironmentauthentication",
    "categoryId": "62cb63bd-d3ef-4cff-9b4a-e7bbf4657173",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_security_recoveryenvironmentauthentication",
    "description": "This policy controls the requirement of Admin Authentication in RecoveryEnvironment.",
    "helpText": "",
    "name": "RecoveryEnvironmentAuthentication",
    "displayName": "Recovery Environment Authentication",
    "defaultOptionId": "device_vendor_msft_policy_config_security_recoveryenvironmentauthentication_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_security_recoveryenvironmentauthentication_0",
            "description": "current) behavior",
            "helpText": null,
            "name": "current) behavior",
            "displayName": "current) behavior",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_security_recoveryenvironmentauthentication_1",
            "description": "RequireAuthentication: Admin Authentication is always required for components in RecoveryEnvironment",
            "helpText": null,
            "name": "RequireAuthentication: Admin Authentication is always required for components in RecoveryEnvironment",
            "displayName": "RequireAuthentication: Admin Authentication is always required for components in RecoveryEnvironment",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_security_recoveryenvironmentauthentication_2",
            "description": "NoRequireAuthentication: Admin Authentication is not required for components in RecoveryEnvironment",
            "helpText": null,
            "name": "NoRequireAuthentication: Admin Authentication is not required for components in RecoveryEnvironment",
            "displayName": "NoRequireAuthentication: Admin Authentication is not required for components in RecoveryEnvironment",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}