{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AllowSignatureOnlyKeys",
        "Allow signature keys valid for Logon",
        "\\Windows Components\\Smart Card",
        "Administrative Templates\\Windows Components\\Smart Card",
        "Smart Card"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-smartcard#admx-smartcard-allowsignatureonlykeys"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Smartcard/AllowSignatureOnlyKeys",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_smartcard_allowsignatureonlykeys",
    "categoryId": "4fc4d2f3-35ee-43ec-a033-ef78da571e70",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_smartcard_allowsignatureonlykeys",
    "description": "This policy setting lets you allow signature key-based certificates to be enumerated and available for logon.\r\n\r\nIf you enable this policy setting then any certificates available on the smart card with a signature only key will be listed on the logon screen.\r\n\r\nIf you disable or do not configure this policy setting, any available smart card signature key-based certificates will not be listed on the logon screen.\r\n ",
    "helpText": "",
    "name": "AllowSignatureOnlyKeys",
    "displayName": "Allow signature keys valid for Logon",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_smartcard_allowsignatureonlykeys_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_smartcard_allowsignatureonlykeys_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_smartcard_allowsignatureonlykeys_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}