{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DCOMActivationSecurityCheckAllowLocalList",
        "Allow local activation security check exemptions",
        "\\System\\Distributed COM\\Application Compatibility Settings",
        "Administrative Templates\\System\\Distributed COM\\Application Compatibility Settings",
        "Application Compatibility Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-dcom#admx-dcom-dcomactivationsecuritycheckallowlocallist"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DCOM/DCOMActivationSecurityCheckAllowLocalList",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckallowlocallist",
    "categoryId": "8e19ed1e-e870-4769-bd6f-321f6f47023b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckallowlocallist",
    "description": "Allows you to specify that local computer administrators can supplement the \"Define Activation Security Check exemptions\" list.\r\n\r\nIf you enable this policy setting, and DCOM does not find an explicit entry for a DCOM server application id (appid) in the \"Define Activation Security Check exemptions\" policy (if enabled), DCOM will look for an entry in the locally configured list.\r\n\r\nIf you disable this policy setting, DCOM will not look in the locally configured DCOM activation security check exemption list.\r\n\r\nIf you do not configure this policy setting, DCOM will only look in the locally configured exemption list if the \"Define Activation Security Check exemptions\" policy is not configured.\r\n\r\n ",
    "helpText": "",
    "name": "DCOMActivationSecurityCheckAllowLocalList",
    "displayName": "Allow local activation security check exemptions",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckallowlocallist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckallowlocallist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckallowlocallist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}