{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ACStartMenuButtonAction_2",
        "Select the Start menu Power button action (plugged in)",
        "\\System\\Power Management\\Button Settings",
        "Administrative Templates\\System\\Power Management\\Button Settings",
        "Button Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-power#admx-power-acstartmenubuttonaction-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/ACStartMenuButtonAction_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2",
    "categoryId": "17f0fdd3-e292-4ecb-ab5f-e4848e9cae1a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2",
    "description": "This policy setting specifies the action that Windows takes when a user presses the Start menu Power button.\r\n\r\nIf you enable this policy setting, select one of the following actions:\r\n-Sleep\r\n-Hibernate\r\n-Shut down\r\n\r\nIf you disable this policy or do not configure this policy setting, users control this setting.\r\n ",
    "helpText": "",
    "name": "ACStartMenuButtonAction_2",
    "displayName": "Select the Start menu Power button action (plugged in)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_selectacstartmenubuttonaction",
                    "required": true
                }
            ]
        }
    ]
}