{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Windows Passwords",
        "Security"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Security#configurewindowspasswords"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Security/ConfigureWindowsPasswords",
    "rootDefinitionId": "device_vendor_msft_policy_config_security_configurewindowspasswords",
    "categoryId": "62cb63bd-d3ef-4cff-9b4a-e7bbf4657173",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_security_configurewindowspasswords",
    "description": "Configures the use of passwords for Windows features",
    "helpText": "",
    "name": "ConfigureWindowsPasswords",
    "displayName": "Configure Windows Passwords",
    "defaultOptionId": "device_vendor_msft_policy_config_security_configurewindowspasswords_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_security_configurewindowspasswords_0",
            "description": "-Disallow passwords (Asymmetric credentials will be promoted to replace passwords on Windows features)",
            "helpText": null,
            "name": "-Disallow passwords (Asymmetric credentials will be promoted to replace passwords on Windows features)",
            "displayName": "-Disallow passwords (Asymmetric credentials will be promoted to replace passwords on Windows features)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_security_configurewindowspasswords_1",
            "description": "Allow passwords (Passwords continue to be allowed to be used for Windows features)",
            "helpText": null,
            "name": "Allow passwords (Passwords continue to be allowed to be used for Windows features)",
            "displayName": "Allow passwords (Passwords continue to be allowed to be used for Windows features)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_security_configurewindowspasswords_2",
            "description": "as per SKU and device capabilities. Windows 10 S devices will exhibit \"Disallow passwords\" default, and all other devices will default to \"Allow passwords\")",
            "helpText": null,
            "name": "as per SKU and device capabilities. Windows 10 S devices will exhibit \"Disallow passwords\" default, and all other devices will default to \"Allow passwords\")",
            "displayName": "as per SKU and device capabilities. Windows 10 S devices will exhibit \"Disallow passwords\" default, and all other devices will default to \"Allow passwords\")",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}