{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "KeepIntranetSitesInInternetExplorer",
        "Keep all intranet sites in Internet Explorer",
        "\\Windows Components\\Internet Explorer",
        "Administrative Templates\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-keepintranetsitesininternetexplorer"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/KeepIntranetSitesInInternetExplorer",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_keepintranetsitesininternetexplorer",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_internetexplorer_keepintranetsitesininternetexplorer",
    "description": "Prevents intranet sites from being opened in any browser except Internet Explorer. But note that If the ‘Send all sites not included in the Enterprise Mode Site List to Microsoft Edge’ (‘RestrictIE’) policy isn’t enabled, this policy has no effect.\r\n\r\nIf you enable this policy, all intranet sites are opened in Internet Explorer 11. The only exceptions are sites listed in your Enterprise Mode Site List.\r\n\r\nIf you disable or don’t configure this policy, all intranet sites are automatically opened in Microsoft Edge.\r\n\r\nWe strongly recommend keeping this policy in sync with the ‘Send all intranet sites to Internet Explorer’ (‘SendIntranetToInternetExplorer’) policy. Additionally, it’s best to enable this policy only if your intranet sites have known compatibility problems with Microsoft Edge.\r\n\r\nRelated policies:\r\n- Send all intranet sites to Internet Explorer (‘SendIntranetToInternetExplorer’)\r\n- Send all sites not included in the Enterprise Mode Site List to Microsoft Edge (‘RestrictIE’)\r\n\r\nFor more info about how to use this policy together with other related policies to create the optimal configuration for your organization, see https://go.microsoft.com/fwlink/?linkid=2094210.",
    "helpText": "",
    "name": "KeepIntranetSitesInInternetExplorer",
    "displayName": "Keep all intranet sites in Internet Explorer",
    "defaultOptionId": "device_vendor_msft_policy_config_internetexplorer_keepintranetsitesininternetexplorer_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362.1350",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_keepintranetsitesininternetexplorer_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_keepintranetsitesininternetexplorer_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}