{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "USER_HOME",
        "Set user home folder",
        "\\System\\User Profiles",
        "Administrative Templates\\System\\User Profiles",
        "User Profiles"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-userprofiles#admx-userprofiles-user-home"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserProfiles/USER_HOME",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_userprofiles_user_home",
    "categoryId": "b49cb414-bdfb-49d4-af5d-176ded4f9591",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_userprofiles_user_home",
    "description": "This policy setting allows you to specify the location and root (file share or local path) of a user's home folder for a logon session.\r\n\r\nIf you enable this policy setting, the user's home folder is configured to the specified local or network location, creating a new folder for each user name.\r\n\r\nTo use this policy setting, in the Location list, choose the location for the home folder. If you choose “On the network,” enter the path to a file share in the Path box (for example, \\\\ComputerName\\ShareName), and then choose the drive letter to assign to the file share. If you choose “On the local computer,” enter a local path (for example, C:\\HomeFolder) in the Path box.\r\n\r\nDo not specify environment variables or ellipses in the path. Also, do not specify a placeholder for the user name because the user name will be appended at logon.\r\n\r\nNote: The Drive letter box is ignored if you choose “On the local computer” from the Location list. If you choose “On the local computer” and enter a file share, the user's home folder will be placed in the network location without mapping the file share to a drive letter.\r\n\r\nIf you disable or do not configure this policy setting, the user's home folder is configured as specified in the user's Active Directory Domain Services account.\r\n\r\nIf the \"Set Remote Desktop Services User Home Directory\" policy setting is enabled, the “Set user home folder” policy setting has no effect.\r\n ",
    "helpText": "",
    "name": "USER_HOME",
    "displayName": "Set user home folder",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_userprofiles_user_home_user_home_location",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_userprofiles_user_home_home_path",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter",
                    "required": true
                }
            ]
        }
    ]
}