{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoMoreProgramsList",
        "Remove All Programs list from the Start menu",
        "\\Start Menu and Taskbar",
        "Administrative Templates\\Start Menu and Taskbar",
        "Start Menu and Taskbar"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-startmenu#admx-startmenu-nomoreprogramslist"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_StartMenu/NoMoreProgramsList",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist",
    "categoryId": "5161db41-7947-49ea-b9b3-dd92539e6783",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist",
    "description": "If you enable this setting, the Start Menu will either collapse or remove the all apps list from the Start menu.\r\n\r\nSelecting \"Collapse\" will not display the app list next to the pinned tiles in Start. An \"All apps\" button will be displayed on Start to open the all apps list. This is equivalent to setting the \"Show app list in Start\" in Settings to Off.\r\n\r\nSelecting \"Collapse and disable setting\" will do the same as the collapse option and disable the \"Show app list in Start menu\" in Settings, so users cannot turn it to On.\r\n\r\nSelecting \"Remove and disable setting\" will remove the all apps list from Start and disable the \"Show app list in Start menu\" in Settings, so users cannot turn it to On. Select this option for compatibility with earlier versions of Windows.\r\n\r\nIf you disable or do not configure this setting, the all apps list will be visible by default, and the user can change \"Show app list in Start\" in Settings.\r\n ",
    "helpText": "",
    "name": "NoMoreProgramsList",
    "displayName": "Remove All Programs list from the Start menu",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_nomoreprogramslistdropdown",
                    "required": true
                }
            ]
        }
    ]
}