{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "W32TIME_POLICY_CONFIG",
        "Global Configuration Settings",
        "\\System\\Windows Time Service",
        "Administrative Templates\\System\\Windows Time Service",
        "Windows Time Service"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-w32time#admx-w32time-w32time-policy-config"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_W32Time/W32TIME_POLICY_CONFIG",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config",
    "categoryId": "bd04d2ce-3275-496c-8cc1-e17ab19888a3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config",
    "description": "This policy setting allows you to specify Clock discipline and General values for the Windows Time service (W32time) for domain controllers including RODCs.\r\n\r\nIf this policy setting is enabled, W32time Service on target machines use the settings provided here. Otherwise, the service on target machines use locally configured settings values.\r\n\r\nFor more details on individual parameters, combinations of parameter values as well as definitions of flags, see https://go.microsoft.com/fwlink/?linkid=847809.\r\n\r\n        FrequencyCorrectRate\r\nThis parameter controls the rate at which the W32time corrects the local clock's frequency. Lower values cause slower corrections; larger values cause more frequent corrections. Default: 4 (scalar).\r\n\r\n        HoldPeriod\r\nThis parameter indicates how many consistent time samples the client computer must receive in a series before subsequent time samples are evaluated as potential spikes. Default: 5\r\n\r\n        LargePhaseOffset\r\nIf a time sample differs from the client computer's local clock by more than LargePhaseOffset, the local clock is deemed to have drifted considerably, or in other words, spiked. Default: 50,000,000 100-nanosecond units (ns) or 5 seconds.\r\n\r\n        MaxAllowedPhaseOffset\r\nIf a response is received that has a time variation that is larger than this parameter value, W32time sets the client computer's local clock immediately to the time that is accepted as accurate from the Network Time Protocol (NTP) server. If the time variation is less than this value, the client computer's local clock is corrected gradually. Default: 300 seconds.\r\n\r\n        MaxNegPhaseCorrection\r\nIf a time sample is received that indicates a time in the past (as compared to the client computer's local clock) that has a time difference that is greater than the MaxNegPhaseCorrection value, the time sample is discarded. Default: 172,800 seconds.\r\n\r\n        MaxPosPhaseCorrection\r\nIf a time sample is received that indicates a time in the future (as compared to the client computer's local clock) that has a time difference greater than the MaxPosPhaseCorrection value, the time sample is discarded. Default: 172,800 seconds.\r\n\r\n        PhaseCorrectRate\r\nThis parameter controls how quickly W32time corrects the client computer's local clock difference to match time samples that are accepted as accurate from the NTP server. Lower values cause the clock to correct more slowly; larger values cause the clock to correct more quickly. Default: 7 (scalar).\r\n\r\n        PollAdjustFactor\r\nThis parameter controls how quickly W32time changes polling intervals. When responses are considered to be accurate, the polling interval lengthens automatically. When responses are considered to be inaccurate, the polling interval shortens automatically. Default: 5 (scalar).\r\n\r\n        SpikeWatchPeriod\r\nThis parameter specifies the amount of time that samples with time offset larger than LargePhaseOffset are received before these samples are accepted as accurate. SpikeWatchPeriod is used in conjunction with HoldPeriod to help eliminate sporadic, inaccurate time samples that are returned from a peer. Default: 900 seconds.\r\n\r\n        UpdateInterval\r\nThis parameter specifies the amount of time that W32time waits between corrections when the clock is being corrected gradually. When it makes a gradual correction, the service adjusts the clock slightly, waits this amount of time, and then checks to see if another adjustment is needed, until the correction is finished. Default: 100 1/100th second units, or 1 second.\r\n\r\n        General parameters:\r\n\r\n        AnnounceFlags\r\nThis parameter is a bitmask value that controls how time service availability is advertised through NetLogon. Default: 0x0a hexadecimal\r\n\r\n        EventLogFlags\r\nThis parameter controls special events that may be logged to the Event Viewer System log. Default: 0x02 hexadecimal bitmask.\r\n\r\n        LocalClockDispersion\r\nThis parameter indicates the maximum error in seconds that is reported by the NTP server to clients that are requesting a time sample. (Applies only when the NTP server is using the time of the local CMOS clock.) Default: 10 seconds.\r\n\r\n        MaxPollInterval\r\nThis parameter controls the maximum polling interval, which defines the maximum amount of time between polls of a peer. Default: 10 in log base-2, or 1024 seconds. (Should not be set higher than 15.)\r\n\r\n        MinPollInterval\r\nThis parameter controls the minimum polling interval that defines the minimum amount of time between polls of a peer. Default: 6 in log base-2, or 64 seconds.\r\n\r\n        ClockHoldoverPeriod\r\nThis parameter indicates the maximum number of seconds a system clock can nominally hold its accuracy without synchronizing with a time source. If this period of time passes without W32time obtaining new samples from any of its input providers, W32time initiates a rediscovery of time sources. Default: 7800 seconds.\r\n\r\n        RequireSecureTimeSyncRequests\r\nThis parameter controls whether or not the DC will respond to time sync requests that use older authentication protocols. If enabled (set to 1), the DC will not respond to requests using such protocols. Default: 0 Boolean.\r\n\r\n        UtilizeSslTimeData\r\nThis parameter controls whether W32time will use time data computed from SSL traffic on the machine as an additional input for correcting the local clock.  Default: 1 (enabled) Boolean\r\n\r\n        ClockAdjustmentAuditLimit\r\nThis parameter specifies the smallest local clock adjustments that may be logged to the W32time service event log on the target machine. Default: 800 Parts per million (PPM).\r\n\r\n        RODC parameters:\r\n\r\n        ChainEntryTimeout\r\nThis parameter specifies the maximum amount of time that an entry can remain in the chaining table before the entry is considered to be expired. Expired entries may be removed when the next request or response is processed. Default: 16 seconds.\r\n\r\n        ChainMaxEntries\r\nThis parameter controls the maximum number of entries that are allowed in the chaining table. If the chaining table is full and no expired entries can be removed, any incoming requests are discarded. Default: 128 entries.\r\n\r\n        ChainMaxHostEntries\r\nThis parameter controls the maximum number of entries that are allowed in the chaining table for a particular host. Default: 4 entries.\r\n\r\n        ChainDisable\r\nThis parameter controls whether or not the chaining mechanism is disabled. If chaining is disabled (set to 0), the RODC can synchronize with any domain controller, but hosts that do not have their passwords cached on the RODC will not be able to synchronize with the RODC. Default: 0 Boolean.\r\n\r\n        ChainLoggingRate\r\nThis parameter controls the frequency at which an event that indicates the number of successful and unsuccessful chaining attempts is logged to the System log in Event Viewer. Default: 30 minutes.\r\n      \r\n ",
    "helpText": "",
    "name": "W32TIME_POLICY_CONFIG",
    "displayName": "Global Configuration Settings",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_frequencycorrectrate",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_holdperiod",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_largephaseoffset",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_maxallowedphaseoffset",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_maxnegphasecorrection",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_maxposphasecorrection",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_phasecorrectrate",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_polladjustfactor",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_spikewatchperiod",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_updateinterval",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_announceflags",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_eventlogflags",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_localclockdispersion",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_maxpollinterval",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_minpollinterval",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_clockholdoverperiod",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_requiresecuretimesyncrequests",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_utilizessltimedata",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_clockadjustmentauditlimit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_chainentrytimeout",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_chainmaxentries",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_chainmaxhostentries",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_chaindisable",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_config_w32time_chainloggingrate",
                    "required": true
                }
            ]
        }
    ]
}