{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Show Lock On User Tile",
        "Experience"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Experience#experience-showlockonusertile"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Experience/ShowLockOnUserTile",
    "rootDefinitionId": "device_vendor_msft_policy_config_experience_showlockonusertile",
    "categoryId": "139974ad-f615-442b-b3dc-84a44e3ec663",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_experience_showlockonusertile",
    "description": "Shows or hides lock from the user tile menu. If you enable this policy setting, the lock option will be shown in the User Tile menu.  If you disable this policy setting, the lock option will never be shown in the User Tile menu.  If you do not configure this policy setting, users will be able to choose whether they want lock to show through the Power Options Control Panel.",
    "helpText": "",
    "name": "ShowLockOnUserTile",
    "displayName": "Show Lock On User Tile",
    "defaultOptionId": "device_vendor_msft_policy_config_experience_showlockonusertile_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_experience_showlockonusertile_0",
            "description": "The lock option is not displayed in the User Tile menu.",
            "helpText": null,
            "name": "The lock option is not displayed in the User Tile menu.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_experience_showlockonusertile_1",
            "description": "The lock option is displayed in the User Tile menu.",
            "helpText": null,
            "name": "The lock option is displayed in the User Tile menu.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}