{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "ApprovedSilos",
        "Configure list of IEEE 1667 silos usable on your computer",
        "\\System\\Enhanced Storage Access",
        "Administrative Templates\\System\\Enhanced Storage Access",
        "Enhanced Storage Access"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EnhancedStorage/ApprovedSilos",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedsilos",
    "categoryId": "71f349a7-1ca3-4945-8c7d-fd68df3759ac",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedsilos_approvedsilos_list",
    "description": null,
    "helpText": "",
    "name": "ApprovedSilos_List",
    "displayName": "Usable IEEE 1667 Silo Type Identifiers: (Device)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedsilos_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedsilos"
        }
    ],
    "dependedOnBy": []
}