{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Offline Maps Auto Update",
        "Maps"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Maps#maps-enableofflinemapsautoupdate"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Maps/EnableOfflineMapsAutoUpdate",
    "rootDefinitionId": "device_vendor_msft_policy_config_maps_enableofflinemapsautoupdate",
    "categoryId": "9a7843b4-6ec1-47c4-906b-75b8866e97c2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_maps_enableofflinemapsautoupdate",
    "description": "Disables the automatic download and update of map data. After the policy is applied, you can verify the settings in the user interface in System > Offline Maps.",
    "helpText": "",
    "name": "EnableOfflineMapsAutoUpdate",
    "displayName": "Enable Offline Maps Auto Update",
    "defaultOptionId": "device_vendor_msft_policy_config_maps_enableofflinemapsautoupdate_65535",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_maps_enableofflinemapsautoupdate_0",
            "description": "Disabled. Force off auto-update.",
            "helpText": null,
            "name": "Disabled. Force off auto-update.",
            "displayName": "Disabled. Force off auto-update.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_maps_enableofflinemapsautoupdate_1",
            "description": "Enabled. Force on auto-update.",
            "helpText": null,
            "name": "Enabled. Force on auto-update.",
            "displayName": "Enabled. Force on auto-update.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_maps_enableofflinemapsautoupdate_65535",
            "description": "Not configured. User's choice.",
            "helpText": null,
            "name": "Not configured. User's choice.",
            "displayName": "Not configured. User's choice.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 65535
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}