{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Certificate",
        "Elevation",
        "Privilege Management"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/PrivilegeManagement/ElevationRules/{0}/SignatureSource",
    "rootDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
    "categoryId": "4f3a6fca-a74c-448d-95b1-9d6d7a5d4449",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_signaturesource",
    "description": "",
    "helpText": null,
    "name": "SignatureSource",
    "displayName": "Signature source",
    "defaultOptionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_signaturesource_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "endpointPrivilegeManagement",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19042",
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_signaturesource_0",
            "description": null,
            "helpText": null,
            "name": "ReusableCertificate",
            "displayName": "Use a certificate file in reusable settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
                    "parentSettingId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_certificatepayloadwithreusablesetting",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_certificatetype",
                    "required": true
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_signaturesource_1",
            "description": null,
            "helpText": null,
            "name": "NewCertificate",
            "displayName": "Upload a certificate file",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
                    "parentSettingId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_certificatefileupload",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_certificatetype",
                    "required": true
                }
            ]
        }
    ]
}