{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "SCEP Certificate",
        "Root Certificate"
    ],
    "infoUrls": [],
    "baseUri": "./device/vendor/msft/scepcertificate",
    "offsetUri": "/rootcertificate",
    "rootDefinitionId": "device_vendor_msft_scepcertificate_rootcertificate",
    "categoryId": "66c92e07-234b-4992-a081-9afe4c113ba3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_scepcertificate_rootcertificate",
    "description": "Choose a previously configured and assigned root CA certificate profile. The CA certificate must match the root certificate of the CA that is issuing the certificate for this profile (the one you are currently configuring).",
    "helpText": "",
    "name": "rootcertificate",
    "displayName": "Root Certificate",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10SCEP/policyJourneyState/0",
    "redirectMessage": "Create a SCEP certificate policy",
    "redirectReason": "The \"SCEP certificate\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}