{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceInstall_InstallTimeout",
        "Configure device installation time-out",
        "\\System\\Device Installation",
        "Administrative Templates\\System\\Device Installation",
        "Device Installation"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DeviceInstallation/DeviceInstall_InstallTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout",
    "categoryId": "486dc66e-960c-4622-b3cb-3ff9a2d434eb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout_deviceinstall_installtimeout_time",
    "description": null,
    "helpText": "",
    "name": "DeviceInstall_InstallTimeout_Time",
    "displayName": "Device Installation Timeout (in seconds) (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4294968,
        "minimumValue": 240
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 300
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout"
        }
    ],
    "dependedOnBy": []
}