{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Remediation_Scan_ScheduleTime",
        "Specify the time of day to run a scheduled full scan to complete remediation",
        "\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Remediation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-microsoftdefenderantivirus#admx-microsoftdefenderantivirus-remediation-scan-scheduletime"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/Remediation_Scan_ScheduleTime",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime",
    "categoryId": "c4665793-15ea-44c9-bd0a-d542b3915fe0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime",
    "description": "This policy setting allows you to specify the time of day at which to perform a scheduled full scan in order to complete remediation. The time value is represented as the number of minutes past midnight (00:00).  For example, 120 (0x78) is equivalent to 02:00 AM.  The schedule is based on local time on the computer where the scan is executing.\r\n\r\n    If you enable this setting, a scheduled full scan to complete remediation will run at the time of day specified.\r\n\r\n    If you disable or do not configure this setting, a scheduled full scan to complete remediation will run at a default time.\r\n ",
    "helpText": "",
    "name": "Remediation_Scan_ScheduleTime",
    "displayName": "Specify the time of day to run a scheduled full scan to complete remediation",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime_remediation_scan_scheduletime",
                    "required": true
                }
            ]
        }
    ]
}