{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SetDataCacheEntryMaxAge",
        "Set age for segments in the data cache",
        "\\Network\\BranchCache",
        "Administrative Templates\\Network\\BranchCache",
        "BranchCache"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PeerToPeerCaching/SetDataCacheEntryMaxAge",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdatacacheentrymaxage",
    "categoryId": "1cda8821-d9e2-485e-8d78-1829593d41ca",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_peertopeercaching_setdatacacheentrymaxage_wbc_cache_maxage_dctxtbox",
    "description": null,
    "helpText": "",
    "name": "WBC_Cache_MaxAge_dctxtbox",
    "displayName": "\r\nSpecify the age in days for which segments in the data cache are valid\r\n",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 9999,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 28
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_peertopeercaching_setdatacacheentrymaxage_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdatacacheentrymaxage"
        }
    ],
    "dependedOnBy": []
}