{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PreventWMPDeskTopShortcut",
        "Prevent Desktop Shortcut Creation",
        "\\Windows Components\\Windows Media Player",
        "Administrative Templates\\Windows Components\\Windows Media Player",
        "Windows Media Player"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsmediaplayer#admx-windowsmediaplayer-preventwmpdesktopshortcut"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/PreventWMPDeskTopShortcut",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventwmpdesktopshortcut",
    "categoryId": "22ebd92b-80b6-493d-99d8-3c72f1a0827e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventwmpdesktopshortcut",
    "description": "This policy setting allows you to prevent a shortcut icon for the Player from being added to the user's desktop.\r\n\r\nIf you enable this policy setting, users cannot add the Player shortcut icon to their desktops.\r\n\r\nIf you disable or do not configure this policy setting, users can choose whether to add the Player shortcut icon to their desktops.\r\n ",
    "helpText": "",
    "name": "PreventWMPDeskTopShortcut",
    "displayName": "Prevent Desktop Shortcut Creation",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventwmpdesktopshortcut_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventwmpdesktopshortcut_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventwmpdesktopshortcut_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}