{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableSnippingTool_2",
        "Do not allow Snipping Tool to run",
        "\\Windows Components\\Tablet PC\\Accessories",
        "Administrative Templates\\Windows Components\\Tablet PC\\Accessories",
        "Accessories"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-tabletshell#admx-tabletshell-disablesnippingtool-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TabletShell/DisableSnippingTool_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_tabletshell_disablesnippingtool_2",
    "categoryId": "2ea4b701-fcb8-46b2-a83f-c792b861f5ad",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_tabletshell_disablesnippingtool_2",
    "description": "Prevents the snipping tool from running.\r\n\r\nIf you enable this policy setting, the Snipping Tool will not run.\r\n\r\nIf you disable this policy setting, the Snipping Tool will run.\r\n\r\nIf you do not configure this policy setting, the Snipping Tool will run.\r\n ",
    "helpText": "",
    "name": "DisableSnippingTool_2",
    "displayName": "Do not allow Snipping Tool to run",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_tabletshell_disablesnippingtool_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_tabletshell_disablesnippingtool_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_tabletshell_disablesnippingtool_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}