{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SearchCompanion_DisableFileUpdates",
        "Turn off Search Companion content file updates",
        "\\System\\Internet Communication Management\\Internet Communication settings",
        "Administrative Templates\\System\\Internet Communication Management\\Internet Communication settings",
        "Internet Communication settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-icm#admx-icm-searchcompanion-disablefileupdates"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ICM/SearchCompanion_DisableFileUpdates",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_icm_searchcompanion_disablefileupdates",
    "categoryId": "72dfdba4-e7bb-4f09-862c-e003ea763452",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_icm_searchcompanion_disablefileupdates",
    "description": "This policy setting specifies whether Search Companion should automatically download content updates during local and Internet searches.\r\n\r\nWhen users search the local computer or the Internet, Search Companion occasionally connects to Microsoft to download an updated privacy policy and additional content files used to format and display results.\r\n\r\nIf you enable this policy setting, Search Companion does not download content updates during searches.\r\n\r\nIf you disable or do not configure this policy setting, Search Companion downloads content updates unless the user is using Classic Search.\r\n\r\nNote: Internet searches still send the search text and information about the search to Microsoft and the chosen search provider. Choosing Classic Search turns off the Search Companion feature completely.\r\n ",
    "helpText": "",
    "name": "SearchCompanion_DisableFileUpdates",
    "displayName": "Turn off Search Companion content file updates",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_icm_searchcompanion_disablefileupdates_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_icm_searchcompanion_disablefileupdates_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_icm_searchcompanion_disablefileupdates_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}