{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "SCEP Certificate",
        "Subject Name Format"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/mem/intune/protect/certificates-profile-scep"
    ],
    "baseUri": "./device/vendor/msft/scepcertificate",
    "offsetUri": "/subjectnameformat",
    "rootDefinitionId": "device_vendor_msft_scepcertificate_subjectnameformat",
    "categoryId": "66c92e07-234b-4992-a081-9afe4c113ba3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_scepcertificate_subjectnameformat",
    "description": "Select how Intune automatically creates the subject name in the certificate request. If the certificate is for a user, you can also include the user's email address in the subject name.Please review subject name documentation on how to best use the Subject name format field.",
    "helpText": "",
    "name": "subjectnameformat",
    "displayName": "Subject name format",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10SCEP/policyJourneyState/0",
    "redirectMessage": "Create a SCEP certificate policy",
    "redirectReason": "The \"SCEP certificate\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}