{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IdentificationField_Name",
        "Provide the unique identifiers for your organization",
        "\\Windows Components\\BitLocker Drive Encryption",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption",
        "BitLocker Drive Encryption"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/IdentificationField",
    "rootDefinitionId": "device_vendor_msft_bitlocker_identificationfield",
    "categoryId": "0101d1d0-1e54-47b0-a749-62c6bd7ab3da",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_bitlocker_identificationfield_identificationfield",
    "description": "",
    "helpText": "",
    "name": "IdentificationField",
    "displayName": "BitLocker identification field: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 260,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_bitlocker_identificationfield_1",
            "parentSettingId": "device_vendor_msft_bitlocker_identificationfield"
        }
    ],
    "dependedOnBy": []
}