{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Force Lock Timeout",
        "Human Presence"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-HumanPresence#humanpresence-forcelocktimeout"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/HumanPresence/ForceLockTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout",
    "categoryId": "a77e6e83-a02e-4a51-a27e-6437ea42aeb5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout",
    "description": "Determines the timeout for Lock on Leave forced by the MDM policy. The user will be unable to change this setting and the toggle in the UI will be greyed out.",
    "helpText": "",
    "name": "ForceLockTimeout",
    "displayName": "Force Lock Timeout",
    "defaultOptionId": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout_120",
            "description": "TwoMinutes",
            "helpText": null,
            "name": "TwoMinutes",
            "displayName": "Two Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 120
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout_30",
            "description": "ThirtySeconds.",
            "helpText": null,
            "name": "ThirtySeconds.",
            "displayName": "Thirty Seconds.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 30
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout_10",
            "description": "TenSeconds.",
            "helpText": null,
            "name": "TenSeconds.",
            "displayName": "Ten Seconds.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 10
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout_1",
            "description": "Immediate.",
            "helpText": null,
            "name": "Immediate.",
            "displayName": "Immediate.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forcelocktimeout_0",
            "description": "DefaultToUserChoice.",
            "helpText": null,
            "name": "DefaultToUserChoice.",
            "displayName": "Default To User Choice.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}