{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceInstall_Instance_IDs_Deny",
        "Prevent installation of devices that match any of these device instance IDs",
        "\\System\\Device Installation\\Device Installation Restrictions",
        "Administrative Templates\\System\\Device Installation\\Device Installation Restrictions",
        "Device Installation Restrictions"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-deviceinstallation#deviceinstallation-preventinstallationofmatchingdeviceinstanceids"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeviceInstallation/PreventInstallationOfMatchingDeviceInstanceIDs",
    "rootDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdeviceinstanceids",
    "categoryId": "979412d7-6716-440c-9a64-5889026d73da",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdeviceinstanceids",
    "description": "This policy setting allows you to specify a list of Plug and Play device instance IDs for devices that Windows is prevented from installing. This policy setting takes precedence over any other policy setting that allows Windows to install a device.\r\n\r\nIf you enable this policy setting, Windows is prevented from installing a device whose device instance ID appears in the list you create. If you enable this policy setting on a remote desktop server, the policy setting affects redirection of the specified devices from a remote desktop client to the remote desktop server.\r\n\r\nIf you disable or do not configure this policy setting, devices can be installed and updated as allowed or prevented by other policy settings.",
    "helpText": "",
    "name": "DeviceInstall_Instance_IDs_Deny",
    "displayName": "Prevent installation of devices that match any of these device instance IDs",
    "defaultOptionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdeviceinstanceids_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdeviceinstanceids_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdeviceinstanceids_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdeviceinstanceids_deviceinstall_instance_ids_deny_list",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdeviceinstanceids_deviceinstall_instance_ids_deny_retroactive",
                    "required": true
                }
            ]
        }
    ]
}