{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "NewTabAction",
        "Specify default behavior for a new tab",
        "\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/NewTabDefaultPage",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_newtabactionoptions",
    "description": "",
    "helpText": "",
    "name": "NewTabActionOptions",
    "displayName": "New tab behavior",
    "defaultOptionId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_newtabactionoptions_3",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_newtabactionoptions_3",
            "description": null,
            "helpText": null,
            "name": "New tab page with my news feed",
            "displayName": "New tab page with my news feed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_newtabactionoptions_0",
            "description": null,
            "helpText": null,
            "name": "about:blank",
            "displayName": "about:blank",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_newtabactionoptions_2",
            "description": null,
            "helpText": null,
            "name": "New tab page",
            "displayName": "New tab page",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_newtabactionoptions_1",
            "description": null,
            "helpText": null,
            "name": "Home page",
            "displayName": "Home page",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_newtabdefaultpage"
                }
            ],
            "dependedOnBy": []
        }
    ]
}