{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ScratchOut_2",
        "Turn off tolerant and Z-shaped scratch-out gestures",
        "\\Windows Components\\Tablet PC\\Input Panel",
        "Administrative Templates\\Windows Components\\Tablet PC\\Input Panel",
        "Input Panel"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TabletPCInputPanel/ScratchOut_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2",
    "categoryId": "575369a6-17a2-435e-81d4-71772e7d55b5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_scratchout",
    "description": null,
    "helpText": "",
    "name": "ScratchOut",
    "displayName": "Turn off tolerant and Z-shaped scratch-out gestures (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_scratchout_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_scratchout_1",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_scratchout_2",
            "description": null,
            "helpText": null,
            "name": "Tolerant",
            "displayName": "Tolerant",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_scratchout_3",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tabletpcinputpanel_scratchout_2"
                }
            ],
            "dependedOnBy": []
        }
    ]
}