{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SetCost",
        "Set Cost",
        "\\Network\\WLAN Service\\WLAN Media Cost",
        "Administrative Templates\\Network\\WLAN Service\\WLAN Media Cost",
        "WLAN Media Cost"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_wlansvc/SetCost",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wlansvc_setcost",
    "categoryId": "b1393de2-587f-4516-a35d-58098f2be3c9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_wlansvc_setcost_cost_dropdownlist",
    "description": null,
    "helpText": "",
    "name": "Cost_Dropdownlist",
    "displayName": "Please select a wlan connection cost value to set: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_wlansvc_setcost_cost_dropdownlist_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_wlansvc_setcost_cost_dropdownlist_1",
            "description": null,
            "helpText": null,
            "name": "Unrestricted",
            "displayName": "Unrestricted",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wlansvc_setcost_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wlansvc_setcost"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wlansvc_setcost_cost_dropdownlist_2",
            "description": null,
            "helpText": null,
            "name": "Fixed",
            "displayName": "Fixed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wlansvc_setcost_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wlansvc_setcost"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wlansvc_setcost_cost_dropdownlist_3",
            "description": null,
            "helpText": null,
            "name": "Variable",
            "displayName": "Variable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wlansvc_setcost_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wlansvc_setcost"
                }
            ],
            "dependedOnBy": []
        }
    ]
}