{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Multiple Display Mode",
        "Display"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Display#configuremultipledisplaymode"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Display/ConfigureMultipleDisplayMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_display_configuremultipledisplaymode",
    "categoryId": "7f22e772-942b-4eeb-82b9-eac9265a3d6e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_display_configuremultipledisplaymode",
    "description": "This policy sets the default display arrangement to pick between clone, extend, internalOnly, externalOnly or default settings.",
    "helpText": "",
    "name": "ConfigureMultipleDisplayMode",
    "displayName": "Configure Multiple Display Mode",
    "defaultOptionId": "device_vendor_msft_policy_config_display_configuremultipledisplaymode_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_display_configuremultipledisplaymode_0",
            "description": "Default.",
            "helpText": null,
            "name": "Default.",
            "displayName": "Default.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_display_configuremultipledisplaymode_1",
            "description": "InternalOnly.",
            "helpText": null,
            "name": "InternalOnly.",
            "displayName": "Internal Only.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_display_configuremultipledisplaymode_2",
            "description": "ExternalOnly.",
            "helpText": null,
            "name": "ExternalOnly.",
            "displayName": "External Only.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_display_configuremultipledisplaymode_3",
            "description": "Clone.",
            "helpText": null,
            "name": "Clone.",
            "displayName": "Clone.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_display_configuremultipledisplaymode_4",
            "description": "Extend.",
            "helpText": null,
            "name": "Extend.",
            "displayName": "Extend.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}