{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ShowAppCellularAccessUI",
        "Set Per-App Cellular Access UI Visibility",
        "\\Network\\WWAN Service\\WWAN UI Settings",
        "Administrative Templates\\Network\\WWAN Service\\WWAN UI Settings",
        "WWAN UI Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Cellular/ShowAppCellularAccessUI",
    "rootDefinitionId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui",
    "categoryId": "a51a8665-045d-482d-b68b-2128959c8b31",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_showappcellularaccessui_option",
    "description": "",
    "helpText": "",
    "name": "ShowAppCellularAccessUI_Option",
    "displayName": "Please select one option to set: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_showappcellularaccessui_option_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_showappcellularaccessui_option_0",
            "description": null,
            "helpText": null,
            "name": "Hide",
            "displayName": "Hide",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_1",
                    "parentSettingId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_showappcellularaccessui_option_1",
            "description": null,
            "helpText": null,
            "name": "Show",
            "displayName": "Show",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_1",
                    "parentSettingId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui"
                }
            ],
            "dependedOnBy": []
        }
    ]
}