{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SamNGCKeyROCAValidation",
        "Configure validation of ROCA-vulnerable WHfB keys during authentication",
        "\\System\\Security Account Manager",
        "Administrative Templates\\System\\Security Account Manager",
        "Security Account Manager"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-sam#admx-sam-samngckeyrocavalidation"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_sam/SamNGCKeyROCAValidation",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_sam_samngckeyrocavalidation",
    "categoryId": "65873bfe-2798-42fc-ae33-02295b23b3d3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_sam_samngckeyrocavalidation",
    "description": "This policy setting allows you to configure how domain controllers handle Windows Hello for Business (WHfB) keys that are vulnerable to the \"Return of Coppersmith's attack\" (ROCA) vulnerability.\r\n\r\nFor more information on the ROCA vulnerability, please see:\r\n\r\nhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-15361\r\n\r\nhttps://en.wikipedia.org/wiki/ROCA_vulnerability\r\n\r\nIf you enable this policy setting the following options are supported:\r\n\r\nIgnore: during authentication the domain controller will not probe any WHfB keys for the ROCA vulnerability.\r\n\r\nAudit: during authentication the domain controller will emit audit events for WHfB keys that are subject to the ROCA vulnerability (authentications will still succeed).\r\n\r\nBlock: during authentication the domain controller will block the use of WHfB keys that are subject to the ROCA vulnerability (authentications will fail).\r\n\r\nThis setting only takes effect on domain controllers.\r\n\r\nIf not configured, domain controllers will default to using their local configuration. The default local configuration is Audit.\r\n\r\nA reboot is not required for changes to this setting to take effect.\r\n\r\nNote: to avoid unexpected disruptions this setting should not be set to Block until appropriate mitigations have been performed, for example patching of vulnerable TPMs.\r\n\r\nMore information is available at https://go.microsoft.com/fwlink/?linkid=2116430.\r\n",
    "helpText": "",
    "name": "SamNGCKeyROCAValidation",
    "displayName": "Configure validation of ROCA-vulnerable WHfB keys during authentication",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_sam_samngckeyrocavalidation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_sam_samngckeyrocavalidation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_sam_samngckeyrocavalidation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_sam_samngckeyrocavalidation_samngckeyrocavalidation_settings",
                    "required": true
                }
            ]
        }
    ]
}