{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_MSS_SynAttackProtect",
        "MSS: (SynAttackProtect) Syn attack protection level (protects against DoS)",
        "\\MSS (Legacy)",
        "Administrative Templates\\MSS (Legacy)",
        "MSS (Legacy)"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MSS-legacy/Pol_MSS_SynAttackProtect",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect",
    "categoryId": "e00ff1f8-a2d1-4d3b-bb07-f58b38b8d5d7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect_synattackprotect",
    "description": null,
    "helpText": "",
    "name": "SynAttackProtect",
    "displayName": "SynAttackProtect (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect_synattackprotect_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect_synattackprotect_0",
            "description": null,
            "helpText": null,
            "name": "No additional protection, use default settings",
            "displayName": "No additional protection, use default settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect_synattackprotect_1",
            "description": null,
            "helpText": null,
            "name": "Connections time out sooner if a SYN attack is detected",
            "displayName": "Connections time out sooner if a SYN attack is detected",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_synattackprotect"
                }
            ],
            "dependedOnBy": []
        }
    ]
}