{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ConfigureDriverValidationLevel",
        "Manage Print Driver signature validation",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Printers/ConfigureDriverValidationLevel",
    "rootDefinitionId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum",
    "description": "",
    "helpText": "",
    "name": "DriverValidationLevel_Enum",
    "displayName": "Select the driver signature mechanism for this computer: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum_4",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum_0",
            "description": null,
            "helpText": null,
            "name": "Require inbox signed drivers",
            "displayName": "Require inbox signed drivers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum_1",
            "description": null,
            "helpText": null,
            "name": "Allow inbox and Print Drivers Trusted Store signed drivers",
            "displayName": "Allow inbox and Print Drivers Trusted Store signed drivers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum_2",
            "description": null,
            "helpText": null,
            "name": "Allow inbox, Print Drivers Trusted Store, and WHQL signed drivers",
            "displayName": "Allow inbox, Print Drivers Trusted Store, and WHQL signed drivers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum_3",
            "description": null,
            "helpText": null,
            "name": "Allow inbox, Print Drivers Trusted Store, WHQL, and Trusted Publisher Store signed drivers",
            "displayName": "Allow inbox, Print Drivers Trusted Store, WHQL, and Trusted Publisher Store signed drivers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum_4",
            "description": null,
            "helpText": null,
            "name": "Allow all validly signed drivers",
            "displayName": "Allow all validly signed drivers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel"
                }
            ],
            "dependedOnBy": []
        }
    ]
}