{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Web Sign In",
        "Authentication"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Authentication#authentication-enablewebsignin"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Authentication/EnableWebSignIn",
    "rootDefinitionId": "device_vendor_msft_policy_config_authentication_enablewebsignin",
    "categoryId": "a79b2d36-7dea-4a84-81ef-27f99296bccf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_authentication_enablewebsignin",
    "description": "Specifies whether web-based sign-in is allowed for signing in to Windows",
    "helpText": "",
    "name": "EnableWebSignIn",
    "displayName": "Enable Web Sign In",
    "defaultOptionId": "device_vendor_msft_policy_config_authentication_enablewebsignin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablewebsignin_0",
            "description": "The feature defaults to the existing SKU and device capabilities.",
            "helpText": null,
            "name": "The feature defaults to the existing SKU and device capabilities.",
            "displayName": "The feature defaults to the existing SKU and device capabilities.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablewebsignin_1",
            "description": "Enabled. Web Sign-in will be enabled for signing in to Windows",
            "helpText": null,
            "name": "Enabled. Web Sign-in will be enabled for signing in to Windows",
            "displayName": "Enabled. Web Sign-in will be enabled for signing in to Windows",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablewebsignin_2",
            "description": "Disabled. Web Sign-in will not be enabled for signing in to Windows",
            "helpText": null,
            "name": "Disabled. Web Sign-in will not be enabled for signing in to Windows",
            "displayName": "Disabled. Web Sign-in will not be enabled for signing in to Windows",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}