{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Netlogon_DnsSrvRecordUseLowerCaseHostNames",
        "Use lowercase DNS host names when registering domain controller SRV records",
        "\\System\\Net Logon\\DC Locator DNS Records",
        "Administrative Templates\\System\\Net Logon\\DC Locator DNS Records",
        "DC Locator DNS Records"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-netlogon#admx-netlogon-netlogon-dnssrvrecorduselowercasehostnames"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Netlogon/Netlogon_DnsSrvRecordUseLowerCaseHostNames",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnssrvrecorduselowercasehostnames",
    "categoryId": "7f4d325e-bff8-4d91-8313-614243e55e6d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnssrvrecorduselowercasehostnames",
    "description": "This policy setting configures whether the domain controllers to which this setting is applied will lowercase their DNS host name when registering SRV records.\r\n\r\nIf enabled, domain controllers will lowercase their DNS host name when registering domain controller SRV records. A best-effort attempt will be made to delete any previously registered SRV records that contain mixed-case DNS host names. For more information and potential manual cleanup procedures, see the link below.\r\n\r\nIf disabled, domain controllers will use their configured DNS host name as-is when registering domain controller SRV records.\r\n\r\nIf not configured, domain controllers will default to using their local configuration.\r\n\r\nThe default local configuration is enabled.\r\n\r\nA reboot is not required for changes to this setting to take effect.\r\n\r\nMore information is available at https://aka.ms/lowercasehostnamesrvrecord\r\n      \r\n ",
    "helpText": "",
    "name": "Netlogon_DnsSrvRecordUseLowerCaseHostNames",
    "displayName": "Use lowercase DNS host names when registering domain controller SRV records",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnssrvrecorduselowercasehostnames_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnssrvrecorduselowercasehostnames_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnssrvrecorduselowercasehostnames_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}