{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "VerifyPublishedState",
        "Check published state",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing2/VerifyPublishedState",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle",
    "description": null,
    "helpText": "",
    "name": "VerifyPublishedStateTitle",
    "displayName": "Published State Check Interval: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_4294967295",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_30",
            "description": null,
            "helpText": null,
            "name": "30 Minutes",
            "displayName": "30 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "30"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_60",
            "description": null,
            "helpText": null,
            "name": "1 Hour",
            "displayName": "1 Hour",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "60"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_240",
            "description": null,
            "helpText": null,
            "name": "4 Hours",
            "displayName": "4 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "240"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_480",
            "description": null,
            "helpText": null,
            "name": "8 Hours",
            "displayName": "8 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "480"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_720",
            "description": null,
            "helpText": null,
            "name": "12 Hours",
            "displayName": "12 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "720"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_1440",
            "description": null,
            "helpText": null,
            "name": "1 Day",
            "displayName": "1 Day",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1440"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_verifypublishedstatetitle_4294967295",
            "description": null,
            "helpText": null,
            "name": "Never",
            "displayName": "Never",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4294967295"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_verifypublishedstate"
                }
            ],
            "dependedOnBy": []
        }
    ]
}