{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DCOMActivationSecurityCheckExemptionList",
        "Define Activation Security Check exemptions",
        "\\System\\Distributed COM\\Application Compatibility Settings",
        "Administrative Templates\\System\\Distributed COM\\Application Compatibility Settings",
        "Application Compatibility Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DCOM/DCOMActivationSecurityCheckExemptionList",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist",
    "categoryId": "8e19ed1e-e870-4769-bd6f-321f6f47023b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist_dcom_lbl_actseccheckexemptionlist",
    "description": null,
    "helpText": "",
    "name": "DCOM_Lbl_ActSecCheckExemptionList",
    "displayName": "Add\\remove DCOM servers to the exemption list: (Device)",
    "childIds": [
        "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist_dcom_lbl_actseccheckexemptionlist_key",
        "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist_dcom_lbl_actseccheckexemptionlist_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist_dcom_lbl_actseccheckexemptionlist_key",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_dcom_dcomactivationsecuritycheckexemptionlist_dcom_lbl_actseccheckexemptionlist_value",
            "required": true
        }
    ]
}