{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Touch Keyboard Split Mode Availability",
        "Text Input"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-TextInput#touchkeyboardsplitmodeavailability"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/TextInput/TouchKeyboardSplitModeAvailability",
    "rootDefinitionId": "device_vendor_msft_policy_config_textinput_touchkeyboardsplitmodeavailability",
    "categoryId": "cb8e8500-0336-4277-b3d9-9177cc967dcf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_textinput_touchkeyboardsplitmodeavailability",
    "description": "Specifies whether the split keyboard mode is enabled or disabled for the touch keyboard. When this policy is set to disabled, the split keyboard mode for touch keyboard is disabled.",
    "helpText": "",
    "name": "TouchKeyboardSplitModeAvailability",
    "displayName": "Touch Keyboard Split Mode Availability",
    "defaultOptionId": "device_vendor_msft_policy_config_textinput_touchkeyboardsplitmodeavailability_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_textinput_touchkeyboardsplitmodeavailability_0",
            "description": "The OS determines when it's most appropriate to be available.",
            "helpText": null,
            "name": "The OS determines when it's most appropriate to be available.",
            "displayName": "The OS determines when it's most appropriate to be available.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_textinput_touchkeyboardsplitmodeavailability_1",
            "description": "Split keyboard is always available.",
            "helpText": null,
            "name": "Split keyboard is always available.",
            "displayName": "Split keyboard is always available.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_textinput_touchkeyboardsplitmodeavailability_2",
            "description": "Split keyboard is always disabled.",
            "helpText": null,
            "name": "Split keyboard is always disabled.",
            "displayName": "Split keyboard is always disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}