{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RDVEncryptionType_Name",
        "Enforce drive encryption type on removable data drives",
        "\\Windows Components\\BitLocker Drive Encryption\\Removable Data Drives",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Removable Data Drives",
        "Removable Data Drives"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/RemovableDrivesEncryptionType",
    "rootDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
    "categoryId": "949a5b32-bbe6-40f6-9d73-99cf9fafe75f",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
    "description": "",
    "helpText": "",
    "name": "RDVEncryptionTypeDropDown_Name",
    "displayName": "Select the encryption type: (Device)",
    "defaultOptionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_0",
            "description": null,
            "helpText": null,
            "name": "Allow user to choose (default)",
            "displayName": "Allow user to choose (default)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_1",
            "description": null,
            "helpText": null,
            "name": "Full encryption",
            "displayName": "Full encryption",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_2",
            "description": null,
            "helpText": null,
            "name": "Used Space Only encryption",
            "displayName": "Used Space Only encryption",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype"
                }
            ],
            "dependedOnBy": []
        }
    ]
}