{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_COLORDEPTH",
        "Limit maximum color depth",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment",
        "Remote Session Environment"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_COLORDEPTH",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth",
    "categoryId": "ce572b49-4d47-47b6-b787-ac1252753581",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_ts_color_depth",
    "description": null,
    "helpText": "",
    "name": "TS_Color_Depth",
    "displayName": "Color Depth (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_ts_color_depth_999",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_ts_color_depth_999",
            "description": null,
            "helpText": null,
            "name": "Client Compatible",
            "displayName": "Client Compatible",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "999"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_ts_color_depth_2",
            "description": null,
            "helpText": null,
            "name": "15 bit",
            "displayName": "15 bit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_ts_color_depth_3",
            "description": null,
            "helpText": null,
            "name": "16 bit",
            "displayName": "16 bit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_ts_color_depth_4",
            "description": null,
            "helpText": null,
            "name": "24 bit",
            "displayName": "24 bit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_ts_color_depth_5",
            "description": null,
            "helpText": null,
            "name": "32 bit",
            "displayName": "32 bit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_colordepth"
                }
            ],
            "dependedOnBy": []
        }
    ]
}