{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_RemoveDesktopShortcutMicrosoftEdge",
        "Remove Desktop Shortcuts upon update",
        "\\Microsoft Edge Update\\Applications\\Microsoft Edge",
        "Microsoft Edge Update\\Applications\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev127~Policy~Cat_EdgeUpdate~Cat_Applications~Cat_MicrosoftEdge/Pol_RemoveDesktopShortcutMicrosoftEdge",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge",
    "categoryId": "3bb9ca38-645e-479c-ac5f-01959aec9c30",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_part_removedesktopshortcut",
    "description": "",
    "helpText": "",
    "name": "Part_RemoveDesktopShortcut",
    "displayName": "",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_part_removedesktopshortcut_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_part_removedesktopshortcut_1",
            "description": null,
            "helpText": null,
            "name": "Force delete system-level Desktop Shortcuts",
            "displayName": "Force delete system-level Desktop Shortcuts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_part_removedesktopshortcut_2",
            "description": null,
            "helpText": null,
            "name": "Force delete system-level and user-level Desktop Shortcuts",
            "displayName": "Force delete system-level and user-level Desktop Shortcuts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_part_removedesktopshortcut_0",
            "description": null,
            "helpText": null,
            "name": "Prevent Desktop Shortcut creation on install",
            "displayName": "Prevent Desktop Shortcut creation on install",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_removedesktopshortcutmicrosoftedge"
                }
            ],
            "dependedOnBy": []
        }
    ]
}