{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DevDriveAttachPolicy",
        "Dev drive filter attach policy",
        "\\System\\Filesystem",
        "Administrative Templates\\System\\Filesystem",
        "Filesystem"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FileSystem/DevDriveAttachPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_filesystem_devdriveattachpolicy",
    "categoryId": "50fb9f56-84f1-4fa9-83f5-0aa0bca8ff49",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_filesystem_devdriveattachpolicy_devdriveattachpolicy",
    "description": "",
    "helpText": "",
    "name": "DevDriveAttachPolicy",
    "displayName": "Filter list (Device)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621.2338",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_filesystem_devdriveattachpolicy_1",
            "parentSettingId": "device_vendor_msft_policy_config_filesystem_devdriveattachpolicy"
        }
    ],
    "dependedOnBy": []
}