{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PCH_AllOrNoneDef",
        "Default application reporting settings",
        "\\Windows Components\\Windows Error Reporting\\Advanced Error Reporting Settings",
        "Administrative Templates\\Windows Components\\Windows Error Reporting\\Advanced Error Reporting Settings",
        "Advanced Error Reporting Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-errorreporting#admx-errorreporting-pch-allornonedef"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ErrorReporting/PCH_AllOrNoneDef",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef",
    "categoryId": "23e93393-4a75-44e6-9693-208eedb06976",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef",
    "description": "This policy setting controls whether errors in general applications are included in reports when Windows Error Reporting is enabled.\r\n\r\nIf you enable this policy setting, you can instruct Windows Error Reporting in the Default pull-down menu to report either all application errors (the default setting), or no application errors.\r\n\r\nIf the Report all errors in Microsoft applications check box is filled, all errors in Microsoft applications are reported, regardless of the setting in the Default pull-down menu. When the Report all errors in Windows check box is filled, all errors in Windows applications are reported, regardless of the setting in the Default dropdown list. The Windows applications category is a subset of Microsoft applications.\r\n\r\nIf you disable or do not configure this policy setting, users can enable or disable Windows Error Reporting in Control Panel. The default setting in Control Panel is Upload all applications.\r\n\r\nThis policy setting is ignored if the Configure Error Reporting policy setting is disabled or not configured.\r\n\r\nFor related information, see the Configure Error Reporting and Report Operating System Errors policy settings.\r\n ",
    "helpText": "",
    "name": "PCH_AllOrNoneDef",
    "displayName": "Default application reporting settings",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef_pch_allornonedef_list",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef_pch_allornoneincms_chk",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_errorreporting_pch_allornonedef_pch_allornonewincomp_chk",
                    "required": true
                }
            ]
        }
    ]
}