{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Profile Inactivity Threshold",
        "Account Management"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/AccountManagement-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/AccountManagement",
    "offsetUri": "/UserProfileManagement/ProfileInactivityThreshold",
    "rootDefinitionId": "device_vendor_msft_accountmanagement_userprofilemanagement_profileinactivitythreshold",
    "categoryId": "3b384fc5-5906-4dc4-bc48-a52b52fb054b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_accountmanagement_userprofilemanagement_profileinactivitythreshold",
    "description": "Start deleting profiles when they have not been logged on during the specified period, given as number of days.",
    "helpText": "",
    "name": "ProfileInactivityThreshold",
    "displayName": "Profile Inactivity Threshold",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "holographicForBusiness"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 30
    },
    "dependentOn": [],
    "dependedOnBy": []
}