{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SetPINPreferred",
        "Prefer PIN pairing",
        "\\Network\\Wireless Display",
        "Administrative Templates\\Network\\Wireless Display",
        "Wireless Display"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-wlansvc#admx-wlansvc-setpinpreferred"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_wlansvc/SetPINPreferred",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wlansvc_setpinpreferred",
    "categoryId": "1b1be733-8615-4738-8797-c159d4d484be",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_wlansvc_setpinpreferred",
    "description": "This policy applies to Wireless Display connections. This policy changes the preference order of the pairing methods.\r\n\r\nWhen enabled, it makes the connections to prefer a PIN for pairing to Wireless Display devices over the Push Button pairing method.\r\n\r\nIf this policy setting is disabled or is not configured, by default Push Button pairing is preferred (if allowed by other policies).\r\n      \r\n ",
    "helpText": "",
    "name": "SetPINPreferred",
    "displayName": "Prefer PIN pairing",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_wlansvc_setpinpreferred_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_wlansvc_setpinpreferred_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wlansvc_setpinpreferred_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}