{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ForwarderResourceUsage",
        "Configure forwarder resource usage",
        "\\Windows Components\\Event Forwarding",
        "Administrative Templates\\Windows Components\\Event Forwarding",
        "Event Forwarding"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventForwarding/ForwarderResourceUsage",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage",
    "categoryId": "d11e32cf-ac55-401a-a81a-232adc304afc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage_maxforwardingrate",
    "description": null,
    "helpText": "",
    "name": "MaxForwardingRate",
    "displayName": "The maximum forwarding rate ( events/sec ) allowed for the forwarder: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 9999,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage"
        }
    ],
    "dependedOnBy": []
}