{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_RemoveDesktopShortcutMicrosoftEdgeBeta",
        "Remove Desktop Shortcuts upon update",
        "\\Microsoft Edge Update\\Applications\\Microsoft Edge Beta",
        "Microsoft Edge Update\\Applications\\Microsoft Edge Beta",
        "Microsoft Edge Beta"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev127~Policy~Cat_EdgeUpdate~Cat_Applications~Cat_MicrosoftEdgeBeta/Pol_RemoveDesktopShortcutMicrosoftEdgeBeta",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_removedesktopshortcutmicrosoftedgebeta",
    "categoryId": "7b91ab31-7ed5-4de9-bd49-d04303fd3c74",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_removedesktopshortcutmicrosoftedgebeta",
    "description": "If you set this policy to \"Force delete system-level Desktop Shortcuts\" (1), any existing system-level Microsoft Edge desktop shortcuts will be deleted when the browser updates or the machine reboots.\r\n  If you set this policy to \"Force delete system-level and user-level Desktop Shortcuts\" (2), any existing system-level Microsoft Edge desktop shortcuts will be deleted when the browser updates or the machine reboots and any existing user-level desktop shortcuts will be deleted when the browser updates. This includes user-level desktop shortcuts that users might have made themselves.\r\n  If you don't configure this policy or disable it (0), nothing will happen to existing Microsoft Edge desktop shortcuts.\r\n\r\n  If you don't configure this policy for a channel, the 'Remove Desktop Shortcuts upon update default' policy configuration determines desktop shortcut removal.",
    "helpText": "",
    "name": "Pol_RemoveDesktopShortcutMicrosoftEdgeBeta",
    "displayName": "Remove Desktop Shortcuts upon update",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_removedesktopshortcutmicrosoftedgebeta_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_removedesktopshortcutmicrosoftedgebeta_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_removedesktopshortcutmicrosoftedgebeta_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_removedesktopshortcutmicrosoftedgebeta_part_removedesktopshortcut",
                    "required": true
                }
            ]
        }
    ]
}