{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "IZ_PolicyJavaPermissions_7",
        "Java permissions",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Restricted Sites Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Restricted Sites Zone",
        "Restricted Sites Zone"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/RestrictedSitesZoneJavaPermissions",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions",
    "categoryId": "a4bffc2b-76af-48d3-acdf-8566e51ef163",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00",
    "description": "",
    "helpText": "",
    "name": "IZ_Partname1C00",
    "displayName": "Java permissions",
    "defaultOptionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00_65536",
            "description": null,
            "helpText": null,
            "name": "High safety",
            "displayName": "High safety",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "65536"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00_131072",
            "description": null,
            "helpText": null,
            "name": "Medium safety",
            "displayName": "Medium safety",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "131072"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00_196608",
            "description": null,
            "helpText": null,
            "name": "Low safety",
            "displayName": "Low safety",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "196608"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00_8388608",
            "description": null,
            "helpText": null,
            "name": "Custom",
            "displayName": "Custom",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8388608"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00_0",
            "description": null,
            "helpText": null,
            "name": "Disable Java",
            "displayName": "Disable Java",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}