{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "CBTHardeningLevel_1",
        "Specify channel binding token hardening level",
        "\\Windows Components\\Windows Remote Management (WinRM)\\WinRM Service",
        "Administrative Templates\\Windows Components\\Windows Remote Management (WinRM)\\WinRM Service",
        "WinRM Service"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteManagement/SpecifyChannelBindingTokenHardeningLevel",
    "rootDefinitionId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel",
    "categoryId": "023116df-a32c-43b0-a384-d6fe7ad9fabe",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_hardeninglevelcombo",
    "description": "",
    "helpText": "",
    "name": "HardeningLevelCombo",
    "displayName": "Hardening Level: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_hardeninglevelcombo_relaxed",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_hardeninglevelcombo_none",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "None"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_hardeninglevelcombo_relaxed",
            "description": null,
            "helpText": null,
            "name": "Relaxed",
            "displayName": "Relaxed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Relaxed"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_hardeninglevelcombo_strict",
            "description": null,
            "helpText": null,
            "name": "Strict",
            "displayName": "Strict",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Strict"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_remotemanagement_specifychannelbindingtokenhardeninglevel"
                }
            ],
            "dependedOnBy": []
        }
    ]
}