{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CustomizedSupportUrl",
        "Custom support URL in the Printers folder's left pane",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-printing#admx-printing-customizedsupporturl"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing/CustomizedSupportUrl",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing_customizedsupporturl",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_printing_customizedsupporturl",
    "description": "By default, the Printers folder includes a link to the Microsoft Support Web page called \"Get help with printing\". It can also include a link to a Web page supplied by the vendor of the currently selected printer.\r\n\r\n          If you enable this policy setting, you replace the \"Get help with printing\" default link with a link to a Web page customized for your enterprise.\r\n\r\n          If you disable this setting or do not configure it, or if you do not enter an alternate Internet address, the default link will appear in the Printers folder.\r\n\r\n          Note: Web pages links only appear in the Printers folder when Web view is enabled. If Web view is disabled, the setting has no effect. (To enable Web view, open the Printers folder, and, on the Tools menu, click Folder Options, click the General tab, and then click \"Enable Web content in folders.\")\r\n\r\n          Also, see the \"Activate Internet printing\" setting in this setting folder and the \"Browse a common web site to find printers\" setting in User Configuration\\Administrative Templates\\Control Panel\\Printers.\r\n\r\n          Web view is affected by the \"Turn on Classic Shell\" and \"Do not allow Folder Options to be opened from the Options button on the View tab of the ribbon\" settings in User Configuration\\Administrative Templates\\Windows Components\\Windows Explorer, and by the \"Enable Active Desktop\" setting in User Configuration\\Administrative Templates\\Desktop\\Active Desktop.\r\n ",
    "helpText": "",
    "name": "CustomizedSupportUrl",
    "displayName": "Custom support URL in the Printers folder's left pane",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing_customizedsupporturl_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_customizedsupporturl_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_customizedsupporturl_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_customizedsupporturl_customizedsupporturl_link",
                    "required": true
                }
            ]
        }
    ]
}