{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_USB_REDIRECTION_DISABLE",
        "Allow RDP redirection of other supported RemoteFX USB devices from this computer",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Connection Client\\RemoteFX USB Device Redirection",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Connection Client\\RemoteFX USB Device Redirection",
        "RemoteFX USB Device Redirection"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_USB_REDIRECTION_DISABLE",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable",
    "categoryId": "728890f5-bddd-4b69-a1b6-efb221d902d4",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable_usbaccessright",
    "description": null,
    "helpText": "",
    "name": "UsbAccessRight",
    "displayName": "RemoteFX USB Redirection Access Rights (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable_usbaccessright_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable_usbaccessright_1",
            "description": null,
            "helpText": null,
            "name": "Adminstrators Only",
            "displayName": "Adminstrators Only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable_usbaccessright_2",
            "description": null,
            "helpText": null,
            "name": "Adminstrators and Users",
            "displayName": "Adminstrators and Users",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_usb_redirection_disable"
                }
            ],
            "dependedOnBy": []
        }
    ]
}