{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "QosMaxOutstandingSends",
        "Limit outstanding packets",
        "\\Network\\QoS Packet Scheduler",
        "Administrative Templates\\Network\\QoS Packet Scheduler",
        "QoS Packet Scheduler"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_QOS/QosMaxOutstandingSends",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_qos_qosmaxoutstandingsends",
    "categoryId": "01f2fac4-fdab-4391-bebe-ebdf6d8fcc77",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_qos_qosmaxoutstandingsends_qosmaxoutstandingsends_box",
    "description": null,
    "helpText": "",
    "name": "QosMaxOutstandingSends_Box",
    "displayName": "Number of packets: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4000000000,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 65535
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_qos_qosmaxoutstandingsends_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_qos_qosmaxoutstandingsends"
        }
    ],
    "dependedOnBy": []
}