{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_MapChartITAdminOptIn",
        "Allow Map Charts to send geographic data to Bing",
        "\\Microsoft Office 2016\\Graph settings",
        "Microsoft Office 2016\\Graph settings",
        "Graph settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v12~Policy~L_MicrosoftOfficeSystem~L_Graphsettings/L_MapChartITAdminOptIn",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v12~policy~l_microsoftofficesystem~l_graphsettings_l_mapchartitadminoptin",
    "categoryId": "a40e47b0-5b27-4e4d-b2ef-42f20540e812",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v12~policy~l_microsoftofficesystem~l_graphsettings_l_mapchartitadminoptin",
    "description": "This policy setting controls whether Map Charts can send geographic data to Bing.  For more information about Map Charts, see https://go.microsoft.com/fwlink/?linkid=2194000.\r\n\r\nIf you enable this policy setting, when a user adds geographic data to a new or existing map chart, that data will be sent to Bing and the map chart will be updated to include any new locations.\r\n\r\nIf you disable this policy setting, when a user adds geographic data to a new or existing map chart, the geographic data won’t be sent to Bing and the map chart won’t be updated to include any new locations. Also, the user will see a message letting them know that their map chart can’t be created.\r\n\r\nIf you don’t configure this policy setting, when a user adds geographic data to a new or existing map chart, that data will be sent to Bing and the map chart will be updated to include any new locations.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise.",
    "helpText": "",
    "name": "L_MapChartITAdminOptIn",
    "displayName": "Allow Map Charts to send geographic data to Bing",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v12~policy~l_microsoftofficesystem~l_graphsettings_l_mapchartitadminoptin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v12~policy~l_microsoftofficesystem~l_graphsettings_l_mapchartitadminoptin_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v12~policy~l_microsoftofficesystem~l_graphsettings_l_mapchartitadminoptin_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}