{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_externalConverterAsDefaultForFileExtensionPPT",
        "Turn on an external converter as the default for a file extension",
        "\\Microsoft PowerPoint 2016 (Machine)\\Converters",
        "Microsoft PowerPoint 2016 (Machine)\\Converters",
        "Converters"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ppt16v2~Policy~L_MicrosoftOfficePowerPointMachine~L_ConvertersMachinePPT/L_externalConverterAsDefaultForFileExtensionPPT",
    "rootDefinitionId": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt",
    "categoryId": "686ae3dd-a663-4484-854e-8f8d578fe3b8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt",
    "description": "This policy setting allows you to enable an external file format converter as the default for a particular file extension on a computer.  To set this policy you need to specify the file extension (e.g. \"odp\") for Value Name and the external file format converter via the converter's classname (e.g. \"TestConverter\") for Value.\r\n\r\nIf you enable this policy setting for a particular file extension, the file format converter specified for that extension is used as the default converter for loading the files.\r\n\r\nIf you do not configure this policy setting for a particular file extension, Microsoft PowerPoint processes files with that extension in an application defined manner.\r\n\r\nNote: This policy can only be specified once per file extension.",
    "helpText": "",
    "name": "L_externalConverterAsDefaultForFileExtensionPPT",
    "displayName": "Turn on an external converter as the default for a file extension",
    "defaultOptionId": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_l_listofexternalconvertersppt",
                    "required": true
                }
            ]
        }
    ]
}