{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Virtualization_JITVAllowList",
        "Virtual Component Process Allow List",
        "\\System\\App-V\\Virtualization",
        "AppVirtualization",
        "App Virtualization",
        "Virtualization"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/VirtualComponentsAllowList",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_virtualcomponentsallowlist",
    "categoryId": "1f5d8243-cb7e-4b52-a12f-5f0e070d2769",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_virtualcomponentsallowlist_virtualization_jitvallowlist_prompt",
    "description": "",
    "helpText": "",
    "name": "Virtualization_JITVAllowList_Prompt",
    "displayName": "Virtual Component Process Allow List",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_appvirtualization_virtualcomponentsallowlist_1",
            "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_virtualcomponentsallowlist"
        }
    ],
    "dependedOnBy": []
}