{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IntranetRedirectBehavior",
        "Intranet Redirection Behavior",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev88~Policy~microsoft_edge/IntranetRedirectBehavior",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_intranetredirectbehavior",
    "description": "",
    "helpText": "",
    "name": "IntranetRedirectBehavior",
    "displayName": "Intranet Redirection Behavior (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_intranetredirectbehavior_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_intranetredirectbehavior_0",
            "description": null,
            "helpText": null,
            "name": "Use default browser behavior.",
            "displayName": "Use default browser behavior.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_1",
                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_intranetredirectbehavior_1",
            "description": null,
            "helpText": null,
            "name": "Disable DNS interception checks and did-you-mean \"http://intranetsite/\" infobars.",
            "displayName": "Disable DNS interception checks and did-you-mean \"http://intranetsite/\" infobars.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_1",
                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_intranetredirectbehavior_2",
            "description": null,
            "helpText": null,
            "name": "Disable DNS interception checks; allow did-you-mean \"http://intranetsite/\" infobars.",
            "displayName": "Disable DNS interception checks; allow did-you-mean \"http://intranetsite/\" infobars.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_1",
                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_intranetredirectbehavior_3",
            "description": null,
            "helpText": null,
            "name": "Allow DNS interception checks and did-you-mean \"http://intranetsite/\" infobars.",
            "displayName": "Allow DNS interception checks and did-you-mean \"http://intranetsite/\" infobars.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior_1",
                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_intranetredirectbehavior"
                }
            ],
            "dependedOnBy": []
        }
    ]
}