{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_USER_HOME",
        "Set Remote Desktop Services User Home Directory",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Profiles",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Profiles",
        "Profiles"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_USER_HOME",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home",
    "categoryId": "b237a91d-a442-4a7e-8169-1bd6c798f490",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home_ts_user_home_location",
    "description": null,
    "helpText": "",
    "name": "TS_USER_HOME_LOCATION",
    "displayName": "Location: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home_ts_user_home_location_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home_ts_user_home_location_1",
            "description": null,
            "helpText": null,
            "name": "On the Network",
            "displayName": "On the Network",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home_ts_user_home_location_0",
            "description": null,
            "helpText": null,
            "name": "On the Local machine",
            "displayName": "On the Local machine",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_home"
                }
            ],
            "dependedOnBy": []
        }
    ]
}