{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Soundrec_DiableApplication_TitleText_2",
        "Do not allow Sound Recorder to run",
        "\\Windows Components\\Sound Recorder",
        "Administrative Templates\\Windows Components\\Sound Recorder",
        "Sound Recorder"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-soundrec#admx-soundrec-soundrec-diableapplication-titletext-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_SoundRec/Soundrec_DiableApplication_TitleText_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_soundrec_soundrec_diableapplication_titletext_2",
    "categoryId": "3181c361-f4f0-44ff-82cc-24aac8075843",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_soundrec_soundrec_diableapplication_titletext_2",
    "description": "Specifies whether Sound Recorder can run.\r\n\r\nSound Recorder is a feature of Microsoft Windows Vista that can be used to record sound from an audio input device where the recorded sound is encoded and saved as an audio file.\r\n\r\nIf you enable this policy setting, Sound Recorder will not run.\r\n\r\nIf you disable or do not configure this policy setting, Sound Recorder can be run.\r\n ",
    "helpText": "",
    "name": "Soundrec_DiableApplication_TitleText_2",
    "displayName": "Do not allow Sound Recorder to run",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_soundrec_soundrec_diableapplication_titletext_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_soundrec_soundrec_diableapplication_titletext_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_soundrec_soundrec_diableapplication_titletext_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}