{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "DO Max Download Bandwidth (Device)",
        "DeliveryOptimization",
        "Delivery Optimization"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeliveryOptimization/DOMaxDownloadBandwidth",
    "rootDefinitionId": "device_vendor_msft_policy_config_deliveryoptimization_domaxdownloadbandwidth",
    "categoryId": "e2ec9af6-6143-4cd8-952c-1b3e849ee0dc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_deliveryoptimization_domaxdownloadbandwidth",
    "description": "This policy specifies the maximum foreground download bandwidth in KiloBytes/second that the device can use across all concurrent download activities using Delivery Optimization.\\r\\nThe default value 0 (zero) means that Delivery Optimization dynamically adjusts to use the available bandwidth for downloads.",
    "helpText": null,
    "name": "DOMaxDownloadBandwidth",
    "displayName": "DO Max Download Bandwidth",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4294967295,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}