{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceInstall_InstallTimeout",
        "Configure device installation time-out",
        "\\System\\Device Installation",
        "Administrative Templates\\System\\Device Installation",
        "Device Installation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-deviceinstallation#admx-deviceinstallation-deviceinstall-installtimeout"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DeviceInstallation/DeviceInstall_InstallTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout",
    "categoryId": "486dc66e-960c-4622-b3cb-3ff9a2d434eb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout",
    "description": "This policy setting allows you to configure the number of seconds Windows waits for a device installation task to complete. \r\n\r\nIf you enable this policy setting, Windows waits for the number of seconds you specify before terminating the installation.\r\n\r\nIf you disable or do not configure this policy setting, Windows waits 240 seconds for a device installation task to complete before terminating the installation.\r\n ",
    "helpText": "",
    "name": "DeviceInstall_InstallTimeout",
    "displayName": "Configure device installation time-out",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_installtimeout_deviceinstall_installtimeout_time",
                    "required": true
                }
            ]
        }
    ]
}