{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "trv2_payload",
        "Cloud Policy Details",
        "\\Windows Components\\Tenant Restrictions",
        "Administrative Templates\\Windows Components\\Tenant Restrictions",
        "Tenant Restrictions"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/TenantRestrictions/ConfigureTenantRestrictions",
    "rootDefinitionId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions",
    "categoryId": "1638d9ec-63d5-4d6b-b1b6-4b0402268e36",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_payloadcloudid",
    "description": "",
    "helpText": "",
    "name": "PayloadCloudId",
    "displayName": "Cloud ID (optional): (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1320",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_1",
            "parentSettingId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions"
        }
    ],
    "dependedOnBy": []
}