{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Integration_Roaming_File_Exclusions",
        "Roaming File Exclusions",
        "\\System\\App-V\\Integration",
        "AppVirtualization",
        "App Virtualization",
        "Integration"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/AllowRoamingFileExclusions",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_allowroamingfileexclusions",
    "categoryId": "0ef80736-8b59-4c6a-8bdc-e2b246b30e92",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_allowroamingfileexclusions_integration_roaming_file_exclusions_prompt",
    "description": "",
    "helpText": "",
    "name": "Integration_Roaming_File_Exclusions_Prompt",
    "displayName": "Roaming Registry Exclusions",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_appvirtualization_allowroamingfileexclusions_1",
            "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_allowroamingfileexclusions"
        }
    ],
    "dependedOnBy": []
}