{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcReattachInterval",
        "Reattach Interval",
        "\\FSLogix\\ODFC Containers",
        "Administrative Templates\\FSLogix\\ODFC Containers",
        "ODFC Containers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC/OdfcReattachInterval",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval",
    "categoryId": "5c645a3e-bc39-44e9-8786-4c82e0553d22",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval_odfcreattachinterval",
    "description": "",
    "helpText": "",
    "name": "OdfcReattachInterval",
    "displayName": "Reattach Interval (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 60,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 10
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval_1",
            "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval"
        }
    ],
    "dependedOnBy": []
}