{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_SERVER_VISEXP",
        "Optimize visual experience for Remote Desktop Service Sessions",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment\\RemoteFX for Windows Server 2008 R2",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment\\RemoteFX for Windows Server 2008 R2",
        "RemoteFX for Windows Server 2008 R2"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_SERVER_VISEXP",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp",
    "categoryId": "a33fb618-0ad1-40a3-b94b-49c90c49ea03",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp_ts_visexp_settings",
    "description": null,
    "helpText": "",
    "name": "TS_VISEXP_SETTINGS",
    "displayName": "Visual experience: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp_ts_visexp_settings_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp_ts_visexp_settings_1",
            "description": null,
            "helpText": null,
            "name": "Rich multimedia",
            "displayName": "Rich multimedia",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp_ts_visexp_settings_2",
            "description": null,
            "helpText": null,
            "name": "Text",
            "displayName": "Text",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_server_visexp"
                }
            ],
            "dependedOnBy": []
        }
    ]
}