{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ConfigureDriverValidationLevel",
        "Manage Print Driver signature validation",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-printers#printers-configuredrivervalidationlevel"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Printers/ConfigureDriverValidationLevel",
    "rootDefinitionId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel",
    "description": "\r\n          This policy setting controls the print driver signature validation mechanism. This policy controls the type of digital signature that is required for a print driver to be considered valid and installed on the system.\r\n\r\n          As part of this validation the catalog/embedded signature is verified and all files in the driver must be a part of the catalog or have their own embedded signature that can be used for validation.\r\n\r\n          You can enable this setting to change the default signature validation method. To use this setting, select one of the options below from the \"Select the driver signature mechanism for this computer\" box.\r\n\r\n          If you disable or do not configure this policy setting, the default method is \"Allow all validly signed drivers\".\r\n\r\n          -- \"Require inbox signed drivers\" specifies only drivers that are shipped as part of a Windows image are allowed on this computer.\r\n\r\n          -- \"Allow inbox and PrintDrivers Trusted Store signed drivers\" specifies only drivers that are shipped as part of a Windows image or drivers that are signed by certificates installed in the 'PrintDrivers' certificate store are allowed on this computer.\r\n\r\n          -- \"Allow inbox, PrintDrivers Trusted Store, and WHQL signed drivers\" specifies the only drivers allowed on this computer are those that are: shipped as part of a Windows image, signed by certificates installed in the 'PrintDrivers' certificate store, or signed by the Windows Hardware Quality Lab (WHQL).\r\n\r\n          -- \"Allow inbox, PrintDrivers Trusted Store, WHQL, and Trusted Publishers Store signed drivers\" specifies the only drivers allowed on this computer are those that are: shipped as part of a Windows image, signed by certificates installed in the 'PrintDrivers' certificate store, signed by the Windows Hardware Quality Lab (WHQL), or signed by certificates installed in the 'Trusted Publishers' certificate store.\r\n\r\n          -- \"Allow all validly signed drivers\" specfies that any print driver that has a valid embedded signature or can be validated against the print driver catalog can be installed on this computer.\r\n\r\n          The 'PrintDrivers' certificate store needs to be created by an administrator under the local machine store location.\r\n\r\n          The 'Trusted Publishers' certificate store can contain certificates from sources that are not related to print drivers.\r\n\r\n      ",
    "helpText": "",
    "name": "ConfigureDriverValidationLevel",
    "displayName": "Manage Print Driver signature validation",
    "defaultOptionId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_printers_configuredrivervalidationlevel_drivervalidationlevel_enum",
                    "required": true
                }
            ]
        }
    ]
}