{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ApprovedActiveXInstallSites",
        "Approved Installation Sites for ActiveX Controls",
        "\\Windows Components\\ActiveX Installer Service",
        "Administrative Templates\\Windows Components\\ActiveX Installer Service",
        "ActiveX Installer Service"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ActiveXControls/ApprovedInstallationSites",
    "rootDefinitionId": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites",
    "categoryId": "78906e32-f4fb-453b-939b-05717ffaae59",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_approvedactivexinstallsiteslist",
    "description": "",
    "helpText": "",
    "name": "ApprovedActiveXInstallSiteslist",
    "displayName": "Host URLs (Device)",
    "childIds": [
        "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_approvedactivexinstallsiteslist_key",
        "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_approvedactivexinstallsiteslist_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_1",
            "parentSettingId": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_approvedactivexinstallsiteslist_key",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_approvedactivexinstallsiteslist_value",
            "required": true
        }
    ]
}