{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableAcrylicBackgroundOnLogon",
        "Show clear logon background",
        "\\System\\Logon",
        "Administrative Templates\\System\\Logon",
        "Logon"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-logon#admx-logon-disableacrylicbackgroundonlogon"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Logon/DisableAcrylicBackgroundOnLogon",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_logon_disableacrylicbackgroundonlogon",
    "categoryId": "f4fd69bc-8622-411d-91bb-0e214f8fb112",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_logon_disableacrylicbackgroundonlogon",
    "description": "This policy setting disables the acrylic blur effect on logon background image.\r\n\r\n        If you enable this policy, the logon background image shows without blur.\r\n        If you disable or do not configure this policy, the logon background image adopts the acrylic blur effect.\r\n      \r\n ",
    "helpText": "",
    "name": "DisableAcrylicBackgroundOnLogon",
    "displayName": "Show clear logon background",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_logon_disableacrylicbackgroundonlogon_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_logon_disableacrylicbackgroundonlogon_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_logon_disableacrylicbackgroundonlogon_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}