{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WCN_EnableRegistrar",
        "Configuration of wireless settings using Windows Connect Now",
        "\\Network\\Windows Connect Now",
        "Administrative Templates\\Network\\Windows Connect Now",
        "Windows Connect Now"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsConnectNow/WCN_EnableRegistrar",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar",
    "categoryId": "bd7d2b68-118d-40ee-9dfd-39b2a22a2082",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_wcn_enableregistrar_maxwcndevicenumber",
    "description": null,
    "helpText": "",
    "name": "WCN_EnableRegistrar_MaxWCNDeviceNumber",
    "displayName": "Maximum number of WCN devices allowed: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 65535,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 500
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar"
        }
    ],
    "dependedOnBy": []
}