{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IZ_Policy_OpenSearchQuery_InternetLockdown",
        "Allow OpenSearch queries in File Explorer",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Locked-Down Internet Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Locked-Down Internet Zone",
        "Locked-Down Internet Zone"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsexplorer#admx-windowsexplorer-iz-policy-opensearchquery-internetlockdown"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/IZ_Policy_OpenSearchQuery_InternetLockdown",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsexplorer_iz_policy_opensearchquery_internetlockdown",
    "categoryId": "b1585568-da15-41fc-a1d0-5d0b194de84c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsexplorer_iz_policy_opensearchquery_internetlockdown",
    "description": "\r\nThis policy setting allows you to manage whether OpenSearch queries in this zone can be performed using Search Connectors in File Explorer.  Search Connectors allow rich searching of remote sources from within File Explorer.  Search results will be returned in File Explorer and can be acted upon like local files.\r\n\r\nIf you enable this policy setting, users can perform OpenSearch queries in this zone using Search Connectors.\r\n\r\nIf you disable this policy setting, users are prevented from performing OpenSearch queries in this zone using Search Connectors.\r\n\r\nIf you do not configure this policy setting, users can perform OpenSearch queries in this zone using Search Connectors.\r\n      \r\n ",
    "helpText": "",
    "name": "IZ_Policy_OpenSearchQuery_InternetLockdown",
    "displayName": "Allow OpenSearch queries in File Explorer",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsexplorer_iz_policy_opensearchquery_internetlockdown_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsexplorer_iz_policy_opensearchquery_internetlockdown_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsexplorer_iz_policy_opensearchquery_internetlockdown_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}