{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "AccessDeniedConfiguration",
        "Customize message for Access Denied errors",
        "\\System\\Access-Denied Assistance",
        "Administrative Templates\\System\\Access-Denied Assistance",
        "Access-Denied Assistance"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_srmfci/AccessDeniedConfiguration",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration",
    "categoryId": "734bed4f-be52-46ef-ae60-8fd195dc8f4d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration_emailmessagetext",
    "description": null,
    "helpText": "",
    "name": "EmailMessageText",
    "displayName": "\r\nAdd the following text to the end of the email:\r\n",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration"
        }
    ],
    "dependedOnBy": []
}