{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Home Button",
        "Browser"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Browser#configurehomebutton"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Browser/ConfigureHomeButton",
    "rootDefinitionId": "device_vendor_msft_policy_config_browser_configurehomebutton",
    "categoryId": "5d835ac8-2e5e-4887-8e4d-0c3846d0ad9f",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_browser_configurehomebutton",
    "description": "The Home button loads either the default Start page, the New tab page, or a URL defined in the Set Home Button URL policy.  By default, this policy is disabled or not configured and clicking the home button loads the default Start page.  When enabled, the home button is locked down preventing your users from making changes in Microsoft Edge's UI settings. To let your users change the Microsoft Edge UI settings, enable the Unlock Home Button policy.  If Enabled AND: - Show home button & set to Start page is selected, clicking the home button loads the Start page. - Show home button & set to New tab page is selected, clicking the home button loads a New tab page. - Show home button & set a specific page is selected, clicking the home button loads the URL specified in the Set Home Button URL policy. - Hide home button is selected, the home button is hidden in Microsoft Edge.  Default setting: Disabled or not configured Related policies: - Set Home Button URL - Unlock Home Button",
    "helpText": "",
    "name": "ConfigureHomeButton",
    "displayName": "Configure Home Button",
    "defaultOptionId": "device_vendor_msft_policy_config_browser_configurehomebutton_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_browser_configurehomebutton_0",
            "description": "Show home button and load the Start page",
            "helpText": null,
            "name": "Show home button and load the Start page",
            "displayName": "Show home button and load the Start page",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_browser_configurehomebutton_1",
            "description": "Show home button and load the New tab page",
            "helpText": null,
            "name": "Show home button and load the New tab page",
            "displayName": "Show home button and load the New tab page",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_browser_configurehomebutton_2",
            "description": "Show home button and load the custom URL defined in the Set Home Button URL policy",
            "helpText": null,
            "name": "Show home button and load the custom URL defined in the Set Home Button URL policy",
            "displayName": "Show home button and load the custom URL defined in the Set Home Button URL policy",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_browser_configurehomebutton_3",
            "description": "Hide home button",
            "helpText": null,
            "name": "Hide home button",
            "displayName": "Hide home button",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}