{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "MaxShellsPerUser",
        "Specify maximum number of remote shells per user",
        "\\Windows Components\\Windows Remote Shell",
        "Administrative Templates\\Windows Components\\Windows Remote Shell",
        "Windows Remote Shell"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-remoteshell#remoteshell-specifymaxremoteshells"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteShell/SpecifyMaxRemoteShells",
    "rootDefinitionId": "device_vendor_msft_policy_config_remoteshell_specifymaxremoteshells",
    "categoryId": "1219a9c2-dccb-445f-9f90-8e86e2de22d6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_remoteshell_specifymaxremoteshells",
    "description": "This policy setting configures the maximum number of concurrent shells any user can remotely open on the same system.\r\n\r\nAny number from 0 to 0x7FFFFFFF cand be set, where 0 means unlimited number of shells.\r\n\r\nIf you enable this policy setting, the user cannot open new remote shells if the count exceeds the specified limit.\r\n\r\nIf you disable or do not configure this policy setting, by default the limit is set to two remote shells per user.\r\n      ",
    "helpText": "",
    "name": "MaxShellsPerUser",
    "displayName": "Specify maximum number of remote shells per user",
    "defaultOptionId": "device_vendor_msft_policy_config_remoteshell_specifymaxremoteshells_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_remoteshell_specifymaxremoteshells_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remoteshell_specifymaxremoteshells_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_remoteshell_specifymaxremoteshells_maxshellsperuser",
                    "required": true
                }
            ]
        }
    ]
}