{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcCCDLocations",
        "CCD Locations",
        "\\FSLogix\\ODFC Containers\\Cloud Cache",
        "Administrative Templates\\FSLogix\\ODFC Containers\\Cloud Cache",
        "Cloud Cache"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC~ODFC_CCD/OdfcCCDLocations",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_ccd_odfcccdlocations",
    "categoryId": "0bae3158-5f75-4e25-acf4-859d2612f892",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_ccd_odfcccdlocations_odfcccdlocations",
    "description": "",
    "helpText": "",
    "name": "OdfcCCDLocations",
    "displayName": "CCD Locations (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_ccd_odfcccdlocations_1",
            "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_ccd_odfcccdlocations"
        }
    ],
    "dependedOnBy": []
}