{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SlowLinkTimeOut",
        "Control slow network connection timeout for user profiles",
        "\\System\\User Profiles",
        "Administrative Templates\\System\\User Profiles",
        "User Profiles"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-userprofiles#admx-userprofiles-slowlinktimeout"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserProfiles/SlowLinkTimeOut",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_userprofiles_slowlinktimeout",
    "categoryId": "b49cb414-bdfb-49d4-af5d-176ded4f9591",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_userprofiles_slowlinktimeout",
    "description": "This policy setting defines a slow connection for roaming user profiles and establishes thresholds for two tests of network speed. \r\n\r\nTo determine the network performance characteristics, a connection is made to the file share storing the user's profile and 64 kilobytes of data is transfered. From that connection and data transfer, the network's latency and connection speed are determined.\r\n\r\nThis policy setting and related policy settings in this folder together define the system's response when roaming user profiles are slow to load.\r\n\r\nIf you enable this policy setting, you can change how long Windows waits for a response from the server before considering the connection to be slow.\r\n\r\nIf you disable or do not configure this policy setting, Windows considers the network connection to be slow if the server returns less than 500 kilobits of data per second or take 120 milliseconds to respond.Consider increasing this value for clients using DHCP Service-assigned addresses or for computers accessing profiles across dial-up connections.Important: If the \"Do not detect slow network connections\" policy setting is enabled, this policy setting is ignored. Also, if the \"Delete cached copies of roaming profiles\" policy setting is enabled, there is no local copy of the roaming profile to load when the system detects a slow connection.\r\n ",
    "helpText": "",
    "name": "SlowLinkTimeOut",
    "displayName": "Control slow network connection timeout for user profiles",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_userprofiles_slowlinktimeout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_slowlinktimeout_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_slowlinktimeout_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_userprofiles_slowlinktimeout_transferrateop",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_userprofiles_slowlinktimeout_slowlinkwaitinterval",
                    "required": true
                }
            ]
        }
    ]
}