{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "QosServiceTypeNetworkControl_PV",
        "Network control service type",
        "\\Network\\QoS Packet Scheduler\\Layer-2 priority value",
        "Administrative Templates\\Network\\QoS Packet Scheduler\\Layer-2 priority value",
        "Layer-2 priority value"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-qos#admx-qos-qosservicetypenetworkcontrol-pv"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_QOS/QosServiceTypeNetworkControl_PV",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv",
    "categoryId": "67c06154-a798-44bb-83c8-d706a3709c10",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv",
    "description": "Specifies an alternate link layer (Layer-2) priority value for packets with the Network Control service type (ServiceTypeNetworkControl). The Packet Scheduler inserts the corresponding priority value in the Layer-2 header of the packets.\r\n\r\nIf you enable this setting, you can change the default priority value associated with the Network Control service type.\r\n\r\nIf you disable this setting, the system uses the default priority value of 0.\r\n\r\nImportant: If the Layer-2 priority value for this service type is specified in the registry for a particular network adapter, this setting is ignored when configuring that network adapter.\r\n ",
    "helpText": "",
    "name": "QosServiceTypeNetworkControl_PV",
    "displayName": "Network control service type",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv_qospriorityvalue",
                    "required": true
                }
            ]
        }
    ]
}