{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Windows Entitlement Reactivation",
        "Licensing"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Licensing#allowwindowsentitlementreactivation"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Licensing/AllowWindowsEntitlementReactivation",
    "rootDefinitionId": "device_vendor_msft_policy_config_licensing_allowwindowsentitlementreactivation",
    "categoryId": "c0204a51-a73c-46a6-8626-deeadcabe6ac",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_licensing_allowwindowsentitlementreactivation",
    "description": "Enables or Disable Windows license reactivation on managed devices.",
    "helpText": "",
    "name": "AllowWindowsEntitlementReactivation",
    "displayName": "Allow Windows Entitlement Reactivation",
    "defaultOptionId": "device_vendor_msft_policy_config_licensing_allowwindowsentitlementreactivation_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_licensing_allowwindowsentitlementreactivation_0",
            "description": "Disable Windows license reactivation on managed devices.",
            "helpText": null,
            "name": "Disable Windows license reactivation on managed devices.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_licensing_allowwindowsentitlementreactivation_1",
            "description": "Enable Windows license reactivation on managed devices.",
            "helpText": null,
            "name": "Enable Windows license reactivation on managed devices.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}