{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_SELECT_NETWORK_DETECT",
        "Select network detection on the server",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Connections",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Connections",
        "Connections"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_SELECT_NETWORK_DETECT",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect",
    "categoryId": "0c2613c9-a7c7-4458-8b0d-2fff13e2beeb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_ts_select_network_detect_level",
    "description": null,
    "helpText": "",
    "name": "TS_SELECT_NETWORK_DETECT_LEVEL",
    "displayName": "Select Network Detect Level (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_ts_select_network_detect_level_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_ts_select_network_detect_level_0",
            "description": null,
            "helpText": null,
            "name": "Use both Connect Time Detect and Continuous Network Detect",
            "displayName": "Use both Connect Time Detect and Continuous Network Detect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_ts_select_network_detect_level_1",
            "description": null,
            "helpText": null,
            "name": "Turn off Connect Time Detect",
            "displayName": "Turn off Connect Time Detect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_ts_select_network_detect_level_2",
            "description": null,
            "helpText": null,
            "name": "Turn off Continuous Network Detect",
            "displayName": "Turn off Continuous Network Detect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_ts_select_network_detect_level_3",
            "description": null,
            "helpText": null,
            "name": "Turn off Connect Time Detect and Continuous Network Detect",
            "displayName": "Turn off Connect Time Detect and Continuous Network Detect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_network_detect"
                }
            ],
            "dependedOnBy": []
        }
    ]
}