{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "PasswordProtectionLoginURLs",
        "Configure the list of enterprise login URLs where password protection service should capture salted hashes of passwords.",
        "\\Google\\Google Chrome\\Safe Browsing settings",
        "Administrative Templates\\Google\\Google Chrome\\Safe Browsing settings",
        "Safe Browsing settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~SafeBrowsing/PasswordProtectionLoginURLs",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_passwordprotectionloginurls",
    "categoryId": "b485695b-0fae-41ae-861c-3030769b28df",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_passwordprotectionloginurls_passwordprotectionloginurlsdesc",
    "description": "",
    "helpText": "",
    "name": "PasswordProtectionLoginURLsDesc",
    "displayName": "Configure the list of enterprise login URLs where password protection service should capture salted hashes of passwords. (Device)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_passwordprotectionloginurls_1",
            "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~safebrowsing_passwordprotectionloginurls"
        }
    ],
    "dependedOnBy": []
}