{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ServerManagerAutoRefreshRate",
        "Configure the refresh interval for Server Manager",
        "\\System\\Server Manager",
        "Administrative Templates\\System\\Server Manager",
        "Server Manager"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ServerManager/ServerManagerAutoRefreshRate",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_servermanager_servermanagerautorefreshrate",
    "categoryId": "1526dde4-6726-470e-aebf-3272ae70a99c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_servermanager_servermanagerautorefreshrate_refreshrate",
    "description": null,
    "helpText": "",
    "name": "RefreshRate",
    "displayName": "Minutes: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 34560,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 2
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_servermanager_servermanagerautorefreshrate_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_servermanager_servermanagerautorefreshrate"
        }
    ],
    "dependedOnBy": []
}