{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ImplicitDataCollectionOff_2",
        "Turn off automatic learning",
        "\\Control Panel\\Regional and Language Options\\Handwriting personalization",
        "Administrative Templates\\Control Panel\\Regional and Language Options\\Handwriting personalization",
        "Handwriting personalization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-implicitdatacollectionoff-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/ImplicitDataCollectionOff_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_globalization_implicitdatacollectionoff_2",
    "categoryId": "e50b312c-2bb3-4565-9212-080dba8d3d85",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_globalization_implicitdatacollectionoff_2",
    "description": "\r\n        This policy setting turns off the automatic learning component of handwriting recognition personalization. \r\n\r\n\t\tAutomatic learning enables the collection and storage of text and ink written by the user in order to help adapt handwriting recognition to the vocabulary and handwriting style of the user. \r\n\r\n\t\tText that is collected includes all outgoing messages in Windows Mail, and MAPI enabled email clients, as well as URLs from the Internet Explorer browser history. The information that is stored includes word frequency and new words not already known to the handwriting recognition engines (for example, proper names and acronyms). Deleting email content or the browser history does not delete the stored personalization data. Ink entered through Input Panel is collected and stored.  \r\n\r\n\t\tNote: Automatic learning of both text and ink might not be available for all languages, even when handwriting personalization is available. See Tablet PC Help for more information.\r\n\r\n\t\tIf you enable this policy setting, automatic learning stops and any stored data is deleted. Users cannot configure this setting in Control Panel.\r\n\r\n\t\tIf you disable this policy setting, automatic learning is turned on. Users cannot configure this policy setting in Control Panel. Collected data is only used for handwriting recognition, if handwriting personalization is turned on.\r\n\r\n\t\tIf you do not configure this policy, users can choose to enable or disable automatic learning either from the Handwriting tab in the Tablet Settings in Control Panel or from the opt-in dialog.\r\n\r\n\t\tThis policy setting is related to the \"Turn off handwriting personalization\" policy setting.\r\n\r\n\t\tNote: The amount of stored ink is limited to 50 MB and the amount of text information to approximately 5 MB. When these limits are reached and new data is collected, old data is deleted to make room for more recent data.\r\n\r\n\t\tNote: Handwriting personalization works only for Microsoft handwriting recognizers, and not with third-party recognizers.\r\n ",
    "helpText": "",
    "name": "ImplicitDataCollectionOff_2",
    "displayName": "Turn off automatic learning",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_globalization_implicitdatacollectionoff_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_globalization_implicitdatacollectionoff_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_globalization_implicitdatacollectionoff_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}