{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "HostToRealm",
        "Define host name-to-Kerberos realm mappings",
        "\\System\\Kerberos",
        "Administrative Templates\\System\\Kerberos",
        "Kerberos"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Kerberos/HostToRealm",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_kerberos_hosttorealm",
    "categoryId": "9b0b8f3b-8e08-4083-9e2b-2e6bfeb01f83",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_kerberos_hosttorealm_hosttorealm",
    "description": null,
    "helpText": "",
    "name": "hosttorealm",
    "displayName": "Define host name-to-realm mappings: (Device)",
    "childIds": [
        "device_vendor_msft_policy_config_admx_kerberos_hosttorealm_hosttorealm_key",
        "device_vendor_msft_policy_config_admx_kerberos_hosttorealm_hosttorealm_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_kerberos_hosttorealm_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_kerberos_hosttorealm"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_kerberos_hosttorealm_hosttorealm_key",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_kerberos_hosttorealm_hosttorealm_value",
            "required": true
        }
    ]
}