{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "end time",
        "endtime",
        "Range Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/RangeSettings",
    "offsetUri": "/EndTime",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_rangesettings_endtime",
    "categoryId": "39d1a447-308a-4a49-9716-3097b321da31",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_quiettime_rangesettings_endtime",
    "description": null,
    "helpText": null,
    "name": "EndTimeDateTime",
    "displayName": "End",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
        "description": null,
        "platform": "android,iOS",
        "deviceMode": "none",
        "technologies": "exchangeOnline"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "dateTime",
        "inputValidationSchema": null,
        "maximumLength": 1024,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}