{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "PK Init Hash Algorithm Configuration",
        "Kerberos"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Kerberos#pkinithashalgorithmconfiguration"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Kerberos/PKInitHashAlgorithmConfiguration",
    "rootDefinitionId": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmconfiguration",
    "categoryId": "14df2cb2-fc75-43af-87f8-a1fbd56a64e3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmconfiguration",
    "description": "Configure hash algorithms for certificate logon",
    "helpText": "",
    "name": "PKInitHashAlgorithmConfiguration",
    "displayName": "PK Init Hash Algorithm Configuration",
    "defaultOptionId": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmconfiguration_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmconfiguration_0",
            "description": "Disabled / Not Configured",
            "helpText": null,
            "name": "Disabled / Not Configured",
            "displayName": "Disabled / Not Configured",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmconfiguration_1",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha1",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha256",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha384",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_kerberos_pkinithashalgorithmsha512",
                    "required": false
                }
            ]
        }
    ]
}