{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Application Control",
        "App Control for Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/applicationcontrol-csp"
    ],
    "baseUri": "./Vendor/MSFT/ApplicationControl/Policies",
    "offsetUri": "/{0}/Policy",
    "rootDefinitionId": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions",
    "categoryId": "56b82fc9-c632-4c76-bb4f-dcf8757f003e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls",
    "description": "App Control for Business Built In Controls",
    "helpText": "",
    "name": "ConfigureApplicationControlBuiltInControls",
    "displayName": "App Control for Business Built In Controls",
    "childIds": [
        "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control",
        "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_selected",
            "parentSettingId": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps",
            "required": false
        }
    ]
}