{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Channel_Log_FileLogAccess_8",
        "Configure log access (legacy)",
        "\\Windows Components\\Event Log Service\\System",
        "Administrative Templates\\Windows Components\\Event Log Service\\System",
        "System"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventLog/Channel_Log_FileLogAccess_8",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_8",
    "categoryId": "9d26f3a1-6a54-4043-bda2-bfeb84e80524",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_8_channel_log_filelogaccess",
    "description": null,
    "helpText": "",
    "name": "Channel_Log_FileLogAccess",
    "displayName": "Log Access (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_8_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_8"
        }
    ],
    "dependedOnBy": []
}