{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ProfileTypeInProfileButtonEnabled",
        "Controls the display of the profile button label for the work or school profile",
        "\\Microsoft Edge\\Profile settings",
        "Microsoft Edge\\Profile settings",
        "Profile settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev136~Policy~microsoft_edge~Profile/ProfileTypeInProfileButtonEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev136~policy~microsoft_edge~profile_profiletypeinprofilebuttonenabled",
    "categoryId": "1043e7ed-8651-44b2-b918-7230c0b75a6c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev136~policy~microsoft_edge~profile_profiletypeinprofilebuttonenabled",
    "description": "Controls whether the label for the work or school profile type is shown in the profile button.\r\n\r\nThis policy does not apply when the OrganizationalBrandingOnWorkProfileUIEnabled policy is enabled.\r\n\r\nIf you enable this policy, the label for the work or school profile type appears in the profile button.\r\n\r\nIf you disable this policy or leave it not configured, the label is not shown.",
    "helpText": "",
    "name": "ProfileTypeInProfileButtonEnabled",
    "displayName": "Controls the display of the profile button label for the work or school profile",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev136~policy~microsoft_edge~profile_profiletypeinprofilebuttonenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev136~policy~microsoft_edge~profile_profiletypeinprofilebuttonenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev136~policy~microsoft_edge~profile_profiletypeinprofilebuttonenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}