{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableWindowsLocationProvider_1",
        "Turn off Windows Location Provider",
        "\\Windows Components\\Location and Sensors\\Windows Location Provider",
        "Administrative Templates\\Windows Components\\Location and Sensors\\Windows Location Provider",
        "Windows Location Provider"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-locationprovideradm#admx-locationprovideradm-disablewindowslocationprovider-1"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LocationProviderAdm/DisableWindowsLocationProvider_1",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_locationprovideradm_disablewindowslocationprovider_1",
    "categoryId": "d6595bc3-dd73-44a3-8b32-d57af6e40208",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_locationprovideradm_disablewindowslocationprovider_1",
    "description": "\r\n        This policy setting turns off the Windows Location Provider feature for this computer.\r\n\r\n        If you enable this policy setting, the Windows Location Provider feature will be turned off, and all programs on this computer will not be able to use the Windows Location Provider feature.\r\n\r\n        If you disable or do not configure this policy setting, all programs on this computer can use the Windows Location Provider feature.\r\n ",
    "helpText": "",
    "name": "DisableWindowsLocationProvider_1",
    "displayName": "Turn off Windows Location Provider",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_locationprovideradm_disablewindowslocationprovider_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_locationprovideradm_disablewindowslocationprovider_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_locationprovideradm_disablewindowslocationprovider_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}