{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ScheduledDiagnosticsExecutionPolicy",
        "Configure Scheduled Maintenance Behavior",
        "\\System\\Troubleshooting and Diagnostics\\Scheduled Maintenance",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\Scheduled Maintenance",
        "Scheduled Maintenance"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-sdiagschd#admx-sdiagschd-scheduleddiagnosticsexecutionpolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_sdiagschd/ScheduledDiagnosticsExecutionPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy",
    "categoryId": "1f31ae2d-4867-4733-b52c-cecc0128e10c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy",
    "description": "Determines whether scheduled diagnostics will run to proactively detect and resolve system problems.\r\n\r\nIf you enable this policy setting, you must choose an execution level.  If you choose detection and troubleshooting only, Windows will periodically detect and troubleshoot problems.  The user will be notified of the problem for interactive resolution. \r\n\r\nIf you choose detection, troubleshooting and resolution, Windows will resolve some of these problems silently without requiring user input.\r\n\r\nIf you disable this policy setting, Windows will not be able to detect, troubleshoot or resolve problems on a scheduled basis.\r\n\r\nIf you do not configure this policy setting, local troubleshooting preferences will take precedence, as configured in the control panel.  If no local troubleshooting preference is configured, scheduled diagnostics are enabled for detection, troubleshooting and resolution by default.\r\n\r\nNo reboots or service restarts are required for this policy to take effect: changes take effect immediately.\r\n\r\nThis policy setting will only take effect when the Task Scheduler service is in the running state.  When the service is stopped or disabled, scheduled diagnostics will not be executed.  The Task Scheduler service can be configured with the Services snap-in to the Microsoft Management Console.\r\n ",
    "helpText": "",
    "name": "ScheduledDiagnosticsExecutionPolicy",
    "displayName": "Configure Scheduled Maintenance Behavior",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_scheduleddiagnosticsexecutionpolicylevel",
                    "required": true
                }
            ]
        }
    ]
}