{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "VHDCompactDisk",
        "VHD Compact Disk",
        "\\FSLogix",
        "Administrative Templates\\FSLogix",
        "FS Logix",
        "FSLogix"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix/VHDCompactDisk",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_vhdcompactdisk",
    "categoryId": "e099d9e1-4ffa-42ed-a250-5fd7875469f2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_vhdcompactdisk",
    "description": "[ENABLED BY DEFAULT]\r\n\r\nNOTE:  Once this policy is Enabled or Disabled, setting it back to Not Configured has NO EFFECT.\r\n\r\nCompacts the VHD disk during the sign-out operation and is designed to automatically decrease the Size On Disk of the user's container(s) depending on a pre-defined threshold.\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\FSLogix\\Apps\\VHDCompactDisk\r\nType:  DWORD\r\nValues:  0 = Disabled, 1 = Enabled",
    "helpText": "",
    "name": "VHDCompactDisk",
    "displayName": "VHD Compact Disk",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_vhdcompactdisk_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_vhdcompactdisk_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_vhdcompactdisk_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}