{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExplorerRibbonStartsMinimized",
        "Start File Explorer with ribbon minimized",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/ExplorerRibbonStartsMinimized",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_explorerribbonstartsminimizeddropdown",
    "description": null,
    "helpText": "",
    "name": "ExplorerRibbonStartsMinimizedDropdown",
    "displayName": "Pick one of the following settings (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_explorerribbonstartsminimizeddropdown_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_explorerribbonstartsminimizeddropdown_1",
            "description": null,
            "helpText": null,
            "name": "Always open new File Explorer windows with the ribbon minimized.",
            "displayName": "Always open new File Explorer windows with the ribbon minimized.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_explorerribbonstartsminimizeddropdown_2",
            "description": null,
            "helpText": null,
            "name": "Never open new File Explorer windows with the ribbon minimized.",
            "displayName": "Never open new File Explorer windows with the ribbon minimized.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_explorerribbonstartsminimizeddropdown_3",
            "description": null,
            "helpText": null,
            "name": "Minimize the ribbon when File Explorer is opened the first time.",
            "displayName": "Minimize the ribbon when File Explorer is opened the first time.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_explorerribbonstartsminimizeddropdown_4",
            "description": null,
            "helpText": null,
            "name": "Display the full ribbon when File Explorer is opened the first time.",
            "displayName": "Display the full ribbon when File Explorer is opened the first time.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsexplorer_explorerribbonstartsminimized"
                }
            ],
            "dependedOnBy": []
        }
    ]
}