{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Projection From PC",
        "Wireless Display"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-WirelessDisplay#wirelessdisplay-allowprojectionfrompc"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/WirelessDisplay/AllowProjectionFromPC",
    "rootDefinitionId": "device_vendor_msft_policy_config_wirelessdisplay_allowprojectionfrompc",
    "categoryId": "a6e15085-a3a9-41dd-9a6a-65c8a26c616d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_wirelessdisplay_allowprojectionfrompc",
    "description": "This policy allows you to turn off projection from a PC.                             If you set it to 0, your PC cannot discover or project to other devices.                             If you set it to 1, your PC can discover and project to other devices.",
    "helpText": "",
    "name": "AllowProjectionFromPC",
    "displayName": "Allow Projection From PC",
    "defaultOptionId": "device_vendor_msft_policy_config_wirelessdisplay_allowprojectionfrompc_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_wirelessdisplay_allowprojectionfrompc_0",
            "description": "Your PC cannot discover or project to other devices.",
            "helpText": null,
            "name": "Your PC cannot discover or project to other devices.",
            "displayName": "Your PC cannot discover or project to other devices.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_wirelessdisplay_allowprojectionfrompc_1",
            "description": "Your PC can discover and project to other devices.",
            "helpText": null,
            "name": "Your PC can discover and project to other devices.",
            "displayName": "Your PC can discover and project to other devices.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}