{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_SecGuide_A001_Block_Flash",
        "Block Flash activation in Office documents",
        "\\MS Security Guide",
        "Administrative Templates\\MS Security Guide",
        "MS Security Guide"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/SecGuidev22h2~Policy~Cat_SecGuide/Pol_SecGuide_A001_Block_Flash",
    "rootDefinitionId": "device_vendor_msft_policy_config_secguidev22h2~policy~cat_secguide_pol_secguide_a001_block_flash",
    "categoryId": "5371d50c-0aaa-425a-a075-2cb1c59968b9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_secguidev22h2~policy~cat_secguide_pol_secguide_a001_block_flash",
    "description": "This policy setting controls whether the Adobe Flash control can be activated by Office documents. Note that activation blocking applies only within Office processes.\r\n\r\nIf you enable this policy setting, you can choose from three options to control whether and how Flash is blocked from activation:\r\n\r\n1. \"Block all activation\" prevents the Flash control from being loaded, whether directly referenced by the document or indirectly by another embedded object.\r\n\r\n2. \"Block embedding/linking, allow other activation\" prevents the Flash control from being loaded when directly referenced by the document, but does not prevent activation through another object.\r\n\r\n3. \"Allow all activation\" restores Office's default behavior, allowing the Flash control to be activated.\r\n\r\nBecause this setting is not a true Group Policy setting and \"tattoos\" the registry, enabling the \"Allow all activation\" option is the only way to restore default behavior after either of the \"Block\" options has been applied. We do not recommend configuring this setting to \"Disabled,\" nor to \"Not Configured\" after it has been enabled.\r\n",
    "helpText": "",
    "name": "Pol_SecGuide_A001_Block_Flash",
    "displayName": "Block Flash activation in Office documents",
    "defaultOptionId": "device_vendor_msft_policy_config_secguidev22h2~policy~cat_secguide_pol_secguide_a001_block_flash_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_secguidev22h2~policy~cat_secguide_pol_secguide_a001_block_flash_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_secguidev22h2~policy~cat_secguide_pol_secguide_a001_block_flash_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_secguidev22h2~policy~cat_secguide_pol_secguide_a001_block_flash_pol_secguide_block_flash",
                    "required": true
                }
            ]
        }
    ]
}