{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Mute",
        "Notifications",
        "Teams",
        "Outlook",
        "Allday"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
    "offsetUri": "/MuteNotificationsAllday",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
    "categoryId": "ad1ecbf4-75da-4dc1-9354-7d00c0e2af72",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
    "description": null,
    "helpText": null,
    "name": "MuteNotificationsAllday",
    "displayName": "Mute notifications all day",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
        "description": null,
        "platform": "android,iOS",
        "deviceMode": "none",
        "technologies": "exchangeOnline"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
            "description": null,
            "helpText": null,
            "name": "Enable",
            "displayName": "Require",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek",
                    "required": true
                }
            ]
        }
    ]
}