{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_CipherSuiteOrder",
        "Cipher suite order",
        "\\Network\\Lanman Workstation",
        "Administrative Templates\\Network\\Lanman Workstation",
        "Lanman Workstation"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LanmanWorkstation/Pol_CipherSuiteOrder",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder",
    "categoryId": "c95a5920-ad56-4668-a6ad-19c3eb428557",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder_multitext_ciphersuiteorder",
    "description": null,
    "helpText": "",
    "name": "MultiText_CipherSuiteOrder",
    "displayName": "\r\nCipher suites:\r\n",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_lanmanworkstation_pol_ciphersuiteorder"
        }
    ],
    "dependedOnBy": []
}