{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LoggingLogDirectory",
        "Log Directory",
        "\\FSLogix\\Logging",
        "Administrative Templates\\FSLogix\\Logging",
        "Logging"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~Logging/LoggingLogDirectory",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_logginglogdirectory",
    "categoryId": "ab2be8b5-5912-4909-8d8b-e66edf4ab097",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_logginglogdirectory_logginglogdirectory",
    "description": "",
    "helpText": "",
    "name": "LoggingLogDirectory",
    "displayName": "Log Directory (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_logginglogdirectory_1",
            "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_logginglogdirectory"
        }
    ],
    "dependedOnBy": []
}