{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Exclusions_Extensions",
        "Extension Exclusions",
        "\\Windows Components\\Microsoft Defender Antivirus\\Exclusions",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Exclusions",
        "Exclusions"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/Exclusions_Extensions",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exclusions_extensions",
    "categoryId": "edba50d5-da3c-48cb-8e50-381ad0bfaaaf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exclusions_extensions_exclusions_extensionslist_value",
    "description": null,
    "helpText": "",
    "name": "Exclusions_ExtensionsList",
    "displayName": "Value",
    "defaultValue": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exclusions_extensions_exclusions_extensionslist",
            "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exclusions_extensions_exclusions_extensionslist"
        }
    ],
    "dependedOnBy": []
}