{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Run_Computer_PS_Scripts_First",
        "Run Windows PowerShell scripts first at computer startup, shutdown",
        "\\System\\Scripts",
        "Administrative Templates\\System\\Scripts",
        "Scripts"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-scripts#admx-scripts-run-computer-ps-scripts-first"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Scripts/Run_Computer_PS_Scripts_First",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_scripts_run_computer_ps_scripts_first",
    "categoryId": "9329c2bd-9e56-4394-9c89-5726e8b76f2f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_scripts_run_computer_ps_scripts_first",
    "description": "This policy setting determines whether Windows PowerShell scripts are run before non-Windows PowerShell scripts during computer startup and shutdown. By default, Windows PowerShell scripts run after non-Windows PowerShell scripts. \r\n \r\nIf you enable this policy setting, within each applicable Group Policy Object (GPO), Windows PowerShell scripts are run before non-Windows PowerShell scripts during computer startup and shutdown. \r\n\r\nFor example, assume the following scenario: \r\n\r\nThere are three GPOs (GPO A, GPO B, and GPO C). This policy setting is enabled in GPO A. \r\n\r\nGPO B and GPO C include the following computer startup scripts:\r\n\r\nGPO B: B.cmd, B.ps1\r\nGPO C: C.cmd, C.ps1\r\n\r\nAssume also that there are two computers, DesktopIT and DesktopSales. \r\nFor DesktopIT, GPOs A, B, and C are applied. Therefore, the scripts for GPOs B and C run in the following order for DesktopIT:\r\n\r\nWithin GPO B: B.ps1, B.cmd\r\nWithin GPO C: C.ps1, C.cmd\r\n \r\nFor DesktopSales, GPOs B and C are applied, but not GPO A. Therefore, the scripts for GPOs B and C run in the following order for DesktopSales:\r\n\r\nWithin GPO B: B.cmd, B.ps1\r\nWithin GPO C: C.cmd, C.ps1\r\n\r\nNote: This policy setting determines the order in which computer startup and shutdown scripts are run within all applicable GPOs. You can override this policy setting for specific script types within a specific GPO by configuring the following policy settings for the GPO:\r\n \r\nComputer Configuration\\Policies\\Windows Settings\\Scripts (Startup/Shutdown)\\Startup\r\nComputer Configuration\\Policies\\Windows Settings\\Scripts (Startup/Shutdown)\\Shutdown\r\n\r\n ",
    "helpText": "",
    "name": "Run_Computer_PS_Scripts_First",
    "displayName": "Run Windows PowerShell scripts first at computer startup, shutdown",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_scripts_run_computer_ps_scripts_first_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_scripts_run_computer_ps_scripts_first_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_scripts_run_computer_ps_scripts_first_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}