{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Unattended Sleep Timeout Plugged In",
        "Power"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Power#power-unattendedsleeptimeoutpluggedin"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Power/UnattendedSleepTimeoutPluggedIn",
    "rootDefinitionId": "device_vendor_msft_policy_config_power_unattendedsleeptimeoutpluggedin",
    "categoryId": "e9cd3225-7b0e-485e-99f8-7ec8dd3977a1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_power_unattendedsleeptimeoutpluggedin",
    "description": "This policy setting allows you to specify the period of inactivity before Windows transitions to sleep automatically when a user is not present at the computer.  If you enable this policy setting, you must provide a value, in seconds, indicating how much idle time should elapse before Windows automatically transitions to sleep when left unattended.  If you specify 0 seconds, Windows does not automatically transition to sleep.  If you disable or do not configure this policy setting, users control this setting.  If the user has configured a slide show to run on the lock screen when the machine is locked, this can prevent the sleep transition from occuring.  The \"Prevent enabling lock screen slide show\" policy setting can be used to disable the slide show feature.",
    "helpText": "",
    "name": "UnattendedSleepTimeoutPluggedIn",
    "displayName": "Unattended Sleep Timeout Plugged In",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4294967295,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}