{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceInstall_DeniedPolicy_DetailText",
        "Display a custom message when installation is prevented by a policy setting",
        "\\System\\Device Installation\\Device Installation Restrictions",
        "Administrative Templates\\System\\Device Installation\\Device Installation Restrictions",
        "Device Installation Restrictions"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DeviceInstallation/DeviceInstall_DeniedPolicy_DetailText",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_deniedpolicy_detailtext",
    "categoryId": "979412d7-6716-440c-9a64-5889026d73da",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_deniedpolicy_detailtext_deviceinstall_deniedpolicy_detailtext_text",
    "description": null,
    "helpText": "",
    "name": "DeviceInstall_DeniedPolicy_DetailText_Text",
    "displayName": "Detail Text (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 128,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_deniedpolicy_detailtext_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_deviceinstallation_deviceinstall_deniedpolicy_detailtext"
        }
    ],
    "dependedOnBy": []
}