{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "W32TIME_POLICY_CONFIGURE_NTPCLIENT",
        "Configure Windows NTP Client",
        "\\System\\Windows Time Service\\Time Providers",
        "Administrative Templates\\System\\Windows Time Service\\Time Providers",
        "Time Providers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_W32Time/W32TIME_POLICY_CONFIGURE_NTPCLIENT",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient",
    "categoryId": "b5006d56-dc0b-4a07-95ee-d6d6e3000f9f",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_w32time_type",
    "description": null,
    "helpText": "",
    "name": "W32TIME_Type",
    "displayName": "Type (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_w32time_type_nt5ds",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_w32time_type_nosync",
            "description": null,
            "helpText": null,
            "name": "NoSync",
            "displayName": "NoSync",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NoSync"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_w32time_type_ntp",
            "description": null,
            "helpText": null,
            "name": "NTP",
            "displayName": "NTP",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NTP"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_w32time_type_nt5ds",
            "description": null,
            "helpText": null,
            "name": "NT5DS",
            "displayName": "NT5DS",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NT5DS"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_w32time_type_allsync",
            "description": null,
            "helpText": null,
            "name": "AllSync",
            "displayName": "AllSync",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AllSync"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_w32time_w32time_policy_configure_ntpclient"
                }
            ],
            "dependedOnBy": []
        }
    ]
}