{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AxISURLZonePolicies",
        "Establish ActiveX installation policy for sites in Trusted zones",
        "\\Windows Components\\ActiveX Installer Service",
        "Administrative Templates\\Windows Components\\ActiveX Installer Service",
        "ActiveX Installer Service"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ActiveXInstallService/AxISURLZonePolicies",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies",
    "categoryId": "78906e32-f4fb-453b-939b-05717ffaae59",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installtrustedocx",
    "description": null,
    "helpText": "",
    "name": "InstallTrustedOCX",
    "displayName": "Installation Policy for ActiveX control signed by trusted publisher (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installtrustedocx_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installtrustedocx_0",
            "description": null,
            "helpText": null,
            "name": "Don't install",
            "displayName": "Don't install",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installtrustedocx_1",
            "description": null,
            "helpText": null,
            "name": "Prompt the user",
            "displayName": "Prompt the user",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installtrustedocx_2",
            "description": null,
            "helpText": null,
            "name": "Silently install",
            "displayName": "Silently install",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies"
                }
            ],
            "dependedOnBy": []
        }
    ]
}