{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Commercial Data Pipeline",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-System#allowcommercialdatapipeline"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/System/AllowCommercialDataPipeline",
    "rootDefinitionId": "device_vendor_msft_policy_config_system_allowcommercialdatapipeline",
    "categoryId": "f62e0f2a-4363-4246-8057-1dc811fe4360",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_system_allowcommercialdatapipeline",
    "description": "AllowCommercialDataPipeline controls whether Microsoft is a processor or controller for Windows diagnostic data collected from this device.                     If you enable this policy Microsoft will be the processor of Windows diagnostic data collected from the Windows device and the customer will be the controller. The device must be registered in Azure AD for this policy to succeed.                     If you disable or don't configure this policy setting, Microsoft will be the controller of Windows diagnostic data collected from this device.                     This policy only controls if Microsoft is a processor for Windows diagnostic data from this device. Configuring this setting does not change whether diagnostic data is collected or the ability of the user to change the level. To configure collection level please use the &quot;Allow Diagnostic Data&quot; policy, and to restrict users on this device from changing the diagnostic data level please use the &quot;Configure diagnostic data opt-in settings user interface&quot; policy.",
    "helpText": "",
    "name": "AllowCommercialDataPipeline",
    "displayName": "Allow Commercial Data Pipeline",
    "defaultOptionId": "device_vendor_msft_policy_config_system_allowcommercialdatapipeline_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_system_allowcommercialdatapipeline_0",
            "description": "Disabled.",
            "helpText": null,
            "name": "Disabled.",
            "displayName": "Disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_system_allowcommercialdatapipeline_1",
            "description": "Enabled.",
            "helpText": null,
            "name": "Enabled.",
            "displayName": "Enabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}