{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CentralClassificationList",
        "File Classification Infrastructure: Specify classification properties list",
        "\\System\\File Classification Infrastructure",
        "Administrative Templates\\System\\File Classification Infrastructure",
        "File Classification Infrastructure"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_srmfci/CentralClassificationList",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist",
    "categoryId": "5c3d081f-6f7c-4650-8a40-200f44eb4794",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist_centralclassificationlisttextelement",
    "description": null,
    "helpText": "",
    "name": "CentralClassificationListTextElement",
    "displayName": "Classification properties list: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_srmfci_centralclassificationlist"
        }
    ],
    "dependedOnBy": []
}