{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ForwarderResourceUsage",
        "Configure forwarder resource usage",
        "\\Windows Components\\Event Forwarding",
        "Administrative Templates\\Windows Components\\Event Forwarding",
        "Event Forwarding"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eventforwarding#admx-eventforwarding-forwarderresourceusage"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventForwarding/ForwarderResourceUsage",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage",
    "categoryId": "d11e32cf-ac55-401a-a81a-232adc304afc",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage",
    "description": "This policy setting controls resource usage for the forwarder (source computer) by controlling the events/per second sent to the Event Collector.\r\n\r\nIf you enable this policy setting, you can control the volume of events sent to the Event Collector by the source computer. This may be required in high volume environments.\r\n\r\nIf you disable or do not configure this policy setting, forwarder resource usage is not specified.\r\n\r\nThis setting applies across all subscriptions for the forwarder (source computer).\r\n ",
    "helpText": "",
    "name": "ForwarderResourceUsage",
    "displayName": "Configure forwarder resource usage",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_eventforwarding_forwarderresourceusage_maxforwardingrate",
                    "required": true
                }
            ]
        }
    ]
}