{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AlternativeBrowserPath",
        "Alternative browser to launch for configured websites.",
        "\\Google\\Google Chrome\\Legacy Browser Support",
        "Administrative Templates\\Google\\Google Chrome\\Legacy Browser Support",
        "Legacy Browser Support"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~BrowserSwitcher/AlternativeBrowserPath",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~browserswitcher_alternativebrowserpath",
    "categoryId": "10247787-95ea-4507-93de-dbd166df12b5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~browserswitcher_alternativebrowserpath",
    "description": "Setting the policy controls which command to use to open URLs in an alternative browser. The policy can be set to one of ${ie}, ${firefox}, ${safari}, ${opera}, ${edge} or a file path. When this policy is set to a file path, that file is used as an executable file. ${ie} is only available on Microsoft® Windows®. ${safari} and ${edge} are only available on Microsoft® Windows® and macOS.\r\n\r\nLeaving the policy unset puts a platform-specific default in use: Internet Explorer® for Microsoft® Windows®, or Safari® for macOS. On Linux®, launching an alternative browser will fail.\r\n\r\nExample value: ${ie}",
    "helpText": "",
    "name": "AlternativeBrowserPath",
    "displayName": "Alternative browser to launch for configured websites.",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~browserswitcher_alternativebrowserpath_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~browserswitcher_alternativebrowserpath_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~browserswitcher_alternativebrowserpath_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~browserswitcher_alternativebrowserpath_alternativebrowserpath",
                    "required": true
                }
            ]
        }
    ]
}