{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RestrictInternetExplorer",
        "Send all sites not included in the Enterprise Mode Site List to Microsoft Edge.",
        "\\Windows Components\\Internet Explorer",
        "Administrative Templates\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-sendsitesnotinenterprisesitelisttoedge"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/SendSitesNotInEnterpriseSiteListToEdge",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_sendsitesnotinenterprisesitelisttoedge",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_internetexplorer_sendsitesnotinenterprisesitelisttoedge",
    "description": "This setting lets you decide whether to open all sites not included in the Enterprise Mode Site List in Microsoft Edge. If you use this setting, you must also turn on the Administrative Templates\\Windows Components\\Internet Explorer\\Use the Enterprise Mode IE website list policy setting and you must include at least one site in the Enterprise Mode Site List.\r\n\r\nEnabling this setting automatically opens all sites not included in the Enterprise Mode Site List in Microsoft Edge.\r\n\r\nDisabling, or not configuring this setting, opens all sites based on the currently active browser.\r\n\r\nNote: If you've also enabled the Administrative Templates\\Windows Components\\Microsoft Edge\\Send all intranet sites to Internet Explorer 11 policy setting, then all intranet sites will continue to open in Internet Explorer 11.",
    "helpText": "",
    "name": "RestrictInternetExplorer",
    "displayName": "Send all sites not included in the Enterprise Mode Site List to Microsoft Edge.",
    "defaultOptionId": "device_vendor_msft_policy_config_internetexplorer_sendsitesnotinenterprisesitelisttoedge_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362.1350",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_sendsitesnotinenterprisesitelisttoedge_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_sendsitesnotinenterprisesitelisttoedge_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}