{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UX_Configuration_SuppressRebootNotification",
        "Suppresses reboot notifications",
        "\\Windows Components\\Microsoft Defender Antivirus\\Client Interface",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Client Interface",
        "Client Interface"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-microsoftdefenderantivirus#admx-microsoftdefenderantivirus-ux-configuration-suppressrebootnotification"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/UX_Configuration_SuppressRebootNotification",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_suppressrebootnotification",
    "categoryId": "e06fb472-94c1-4dd9-afdf-6bb2ddaa3dc6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_suppressrebootnotification",
    "description": "\r\n      This policy setting allows user to supress reboot notifications in UI only mode (for cases where UI can't be in lockdown mode).\r\n\r\n      If you enable this setting AM UI won't show reboot notifications.\r\n    \r\n ",
    "helpText": "",
    "name": "UX_Configuration_SuppressRebootNotification",
    "displayName": "Suppresses reboot notifications",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_suppressrebootnotification_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_suppressrebootnotification_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_suppressrebootnotification_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}