{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "MaxTokenSize",
        "Set maximum Kerberos SSPI context token buffer size",
        "\\System\\Kerberos",
        "Administrative Templates\\System\\Kerberos",
        "Kerberos"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-kerberos#kerberos-setmaximumcontexttokensize"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Kerberos/SetMaximumContextTokenSize",
    "rootDefinitionId": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize",
    "categoryId": "9b0b8f3b-8e08-4083-9e2b-2e6bfeb01f83",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize",
    "description": "This policy setting allows you to set the value returned to applications which request the maximum size of the SSPI context token buffer size.\r\n              \r\nThe size of the context token buffer determines the maximum size of SSPI context tokens an application expects and allocates. Depending upon authentication request processing and group memberships, the buffer might be smaller than the actual size of the SSPI context token. \r\n\r\nIf you enable this policy setting, the Kerberos client or server uses the configured value, or the locally allowed maximum value, whichever is smaller.\r\n\r\nIf you disable or do not configure this policy setting, the Kerberos client or server uses the locally configured value or the default value. \r\n\r\nNote: This policy setting configures the existing MaxTokenSize registry value in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Kerberos\\Parameters, which was added in Windows XP and Windows Server 2003, with a default value of 12,000 bytes. Beginning with Windows 8 the default is 48,000 bytes. Due to HTTP's base64 encoding of authentication context tokens, it is not advised to set this value more than 48,000 bytes.\r\n\r\n",
    "helpText": "",
    "name": "MaxTokenSize",
    "displayName": "Set maximum Kerberos SSPI context token buffer size",
    "defaultOptionId": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize_maxtokensize",
                    "required": true
                }
            ]
        }
    ]
}