{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnablePrebootInputProtectorsOnSlates_Name",
        "Enable use of BitLocker authentication requiring preboot keyboard input on slates",
        "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
        "Operating System Drives"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/BitLocker-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/SystemDrivesEnablePrebootInputProtectorsOnSlates",
    "rootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates",
    "categoryId": "27e0674a-ea53-4f63-9c2e-fe76aa1021d0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates",
    "description": "This policy setting allows users to turn on authentication options that require user input from the pre-boot environment, even if the platform lacks pre-boot input capability.\r\n\r\nThe Windows touch keyboard (such as that used by tablets) isn't available in the pre-boot environment where BitLocker requires additional information such as a PIN or Password.\r\n\r\nIf you enable this policy setting, devices must have an alternative means of pre-boot input (such as an attached USB keyboard).\r\n\r\nIf this policy is not enabled, the Windows Recovery Environment must be enabled on tablets to support the entry of the BitLocker recovery password. When the Windows Recovery Environment is not enabled and this policy is not enabled, you cannot turn on BitLocker on a device that uses the Windows touch keyboard.\r\n\r\nNote that if you do not enable this policy setting, options in the \"Require additional authentication at startup\" policy might not be available on such devices. These options include:\r\n- Configure TPM startup PIN: Required/Allowed\r\n- Configure TPM startup key and PIN: Required/Allowed\r\n- Configure use of passwords for operating system drives.\r\n      \n ",
    "helpText": "",
    "name": "EnablePrebootInputProtectorsOnSlates_Name",
    "displayName": "Enable use of BitLocker authentication requiring preboot keyboard input on slates",
    "defaultOptionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}