{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Smart Screen In Shell",
        "Smart Screen"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-smartscreen#enablesmartscreeninshell"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/SmartScreen/EnableSmartScreenInShell",
    "rootDefinitionId": "device_vendor_msft_policy_config_smartscreen_enablesmartscreeninshell",
    "categoryId": "3f61a5fe-8508-44dd-bcf0-83273643026a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_smartscreen_enablesmartscreeninshell",
    "description": " Allows IT Admins to configure SmartScreen for Windows.",
    "helpText": "",
    "name": "EnableSmartScreenInShell",
    "displayName": "Enable Smart Screen In Shell",
    "defaultOptionId": "device_vendor_msft_policy_config_smartscreen_enablesmartscreeninshell_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_smartscreen_enablesmartscreeninshell_0",
            "description": "Disabled.",
            "helpText": null,
            "name": "Disabled.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_smartscreen_enablesmartscreeninshell_1",
            "description": "Enabled.",
            "helpText": null,
            "name": "Enabled.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}