{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Threat Severity Default Action",
        "Defender"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Defender/ThreatSeverityDefaultAction",
    "rootDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats",
    "description": "",
    "helpText": "",
    "name": "LowSeverityThreatDefaultAction",
    "displayName": "Remediation action for Low severity threats",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_clean",
            "description": null,
            "helpText": null,
            "name": "Clean",
            "displayName": "Clean. Service tries to recover files and try to disinfect.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1=1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_quarantine",
            "description": null,
            "helpText": null,
            "name": "Quarantine",
            "displayName": "Quarantine. Moves files to quarantine.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1=2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_remove",
            "description": null,
            "helpText": null,
            "name": "Remove",
            "displayName": "Remove. Removes files from system.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1=3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_allow",
            "description": null,
            "helpText": null,
            "name": "Allow",
            "displayName": "Allow. Allows file/does none of the above actions.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1=6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_userdefined",
            "description": null,
            "helpText": null,
            "name": "UserDefined",
            "displayName": "User defined. Requires user to make a decision on which action to take.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1=8"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_block",
            "description": null,
            "helpText": null,
            "name": "Block",
            "displayName": "Block. Blocks file execution.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1=10"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction"
                }
            ],
            "dependedOnBy": []
        }
    ]
}