{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_LICENSE_SERVERS",
        "Use the specified Remote Desktop license servers",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Licensing",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Licensing",
        "Licensing"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-terminalserver#admx-terminalserver-ts-license-servers"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_LICENSE_SERVERS",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_license_servers",
    "categoryId": "8778eb21-bf7c-41a7-bae1-412c0e3029db",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_license_servers",
    "description": "This policy setting allows you to specify the order in which an RD Session Host server attempts to locate Remote Desktop license servers.\r\n\r\nIf you enable this policy setting, an RD Session Host server first attempts to locate the specified license servers. If the specified license servers cannot be located, the RD Session Host server will attempt automatic license server discovery. In the automatic license server discovery process, an RD Session Host server in a Windows Server-based domain attempts to contact a license server in the following order:\r\n\r\n    1. Remote Desktop license servers that are published in Active Directory Domain Services.\r\n\r\n    2. Remote Desktop license servers that are installed on domain controllers in the same domain as the RD Session Host server.\r\n\r\nIf you disable or do not configure this policy setting, the RD Session Host server does not specify a license server at the Group Policy level.\r\n\r\n This setting is only available to Windows Insiders.\r\n ",
    "helpText": "",
    "name": "TS_LICENSE_SERVERS",
    "displayName": "Use the specified Remote Desktop license servers",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_license_servers_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_license_servers_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_license_servers_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_terminalserver_ts_license_servers_ts_license_edit",
                    "required": true
                }
            ]
        }
    ]
}