{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Send Intranet Trafficto Internet Explorer",
        "Browser"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Browser#browser-sendintranettraffictointernetexplorer"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Browser/SendIntranetTraffictoInternetExplorer",
    "rootDefinitionId": "device_vendor_msft_policy_config_browser_sendintranettraffictointernetexplorer",
    "categoryId": "5d835ac8-2e5e-4887-8e4d-0c3846d0ad9f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_browser_sendintranettraffictointernetexplorer",
    "description": "Sends all intranet traffic over to Internet Explorer.",
    "helpText": "",
    "name": "SendIntranetTraffictoInternetExplorer",
    "displayName": "Send Intranet Trafficto Internet Explorer",
    "defaultOptionId": "device_vendor_msft_policy_config_browser_sendintranettraffictointernetexplorer_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_browser_sendintranettraffictointernetexplorer_0",
            "description": "All sites, including intranet sites, open in Microsoft Edge automatically.",
            "helpText": null,
            "name": "All sites, including intranet sites, open in Microsoft Edge automatically.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_browser_sendintranettraffictointernetexplorer_1",
            "description": "Only intranet sites open in Internet Explorer 11 automatically.",
            "helpText": null,
            "name": "Only intranet sites open in Internet Explorer 11 automatically.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}