{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_CLIENT_AUDIO_QUALITY",
        "Limit audio playback quality",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Device and Resource Redirection",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Device and Resource Redirection",
        "Device and Resource Redirection"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_CLIENT_AUDIO_QUALITY",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality",
    "categoryId": "fe52de11-190e-4429-96c1-106b22724456",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_ts_audio_quality_level",
    "description": null,
    "helpText": "",
    "name": "TS_AUDIO_QUALITY_LEVEL",
    "displayName": "Audio Quality (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_ts_audio_quality_level_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_ts_audio_quality_level_1",
            "description": null,
            "helpText": null,
            "name": "Dynamic",
            "displayName": "Dynamic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_ts_audio_quality_level_3",
            "description": null,
            "helpText": null,
            "name": "Medium",
            "displayName": "Medium",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_ts_audio_quality_level_7",
            "description": null,
            "helpText": null,
            "name": "High",
            "displayName": "High",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_client_audio_quality"
                }
            ],
            "dependedOnBy": []
        }
    ]
}