{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Update Compliance Processing",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-System#allowupdatecomplianceprocessing"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/System/AllowUpdateComplianceProcessing",
    "rootDefinitionId": "device_vendor_msft_policy_config_system_allowupdatecomplianceprocessing",
    "categoryId": "f62e0f2a-4363-4246-8057-1dc811fe4360",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_system_allowupdatecomplianceprocessing",
    "description": "Allows IT admins to enable diagnostic data from this device to be processed by Update Compliance.                                             The following list shows the supported values:                                                  0 (default)– Diagnostic data is not processed by Update Compliance.                                                 16 – Diagnostic data is allowed to be processed by Update Compliance.                                             If you disable or do not configure this policy setting, diagnostic data from this device will not be processed by Update Compliance.",
    "helpText": "",
    "name": "AllowUpdateComplianceProcessing",
    "displayName": "Allow Update Compliance Processing",
    "defaultOptionId": "device_vendor_msft_policy_config_system_allowupdatecomplianceprocessing_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763.1217",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "unknown",
            "windowsCloudN"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_system_allowupdatecomplianceprocessing_0",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_system_allowupdatecomplianceprocessing_16",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 16
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}