{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Publishing_Server5_Policy",
        "Publishing Server 5 Settings",
        "\\System\\App-V\\Publishing",
        "AppVirtualization",
        "App Virtualization",
        "Publishing"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/PublishingAllowServer5",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5",
    "categoryId": "ea812d2c-1cf9-4132-9b33-12bb7ac17dbd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_user_refresh_interval_prompt",
    "description": "",
    "helpText": "",
    "name": "User_Refresh_Interval_Prompt",
    "displayName": "User Publishing Refresh Interval",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 31,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_1",
            "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5"
        }
    ],
    "dependedOnBy": []
}