{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Applies To",
        "Elevation",
        "Privilege Management"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/PrivilegeManagement/ElevationRules/{0}/AppliesTo",
    "rootDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
    "categoryId": "4f3a6fca-a74c-448d-95b1-9d6d7a5d4449",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_appliesto",
    "description": "",
    "helpText": null,
    "name": "AppliesTo",
    "displayName": "Applies to",
    "defaultOptionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_allusers",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "endpointPrivilegeManagement",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19042",
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_allusers",
            "description": null,
            "helpText": null,
            "name": "Allusers",
            "displayName": "All device users",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Allusers"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
                    "parentSettingId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}