{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebRtcIPHandlingUrl",
        "WebRTC IP Handling Policy for URL Patterns",
        "\\Microsoft Edge\\WebRtc settings",
        "Microsoft Edge\\WebRtc settings",
        "Web Rtc settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev135~Policy~microsoft_edge~WebRtc/WebRtcIPHandlingUrl",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl",
    "categoryId": "08677354-6f67-455e-a430-4d8d2fbabe84",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl_webrtciphandlingurl",
    "description": "",
    "helpText": "",
    "name": "WebRtcIPHandlingUrl",
    "displayName": "WebRTC IP Handling Policy for URL Patterns (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1000000,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl_1",
            "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl"
        }
    ],
    "dependedOnBy": []
}