{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShutdownTimeoutHungSessionsDescription",
        "Timeout for hung logon sessions during shutdown",
        "\\Windows Components\\Shutdown Options",
        "Administrative Templates\\Windows Components\\Shutdown Options",
        "Shutdown Options"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WinInit/ShutdownTimeoutHungSessionsDescription",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription",
    "categoryId": "60a3188c-7ee3-40db-8f9f-33648dc74555",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription_shutdownsessiontimeout_time",
    "description": null,
    "helpText": "",
    "name": "ShutdownSessionTimeout_Time",
    "displayName": "Hung session timeout in Minutes: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 9999,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 9999
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription"
        }
    ],
    "dependedOnBy": []
}