{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Remediation_Scan_ScheduleTime",
        "Specify the time of day to run a scheduled full scan to complete remediation",
        "\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Remediation"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/Remediation_Scan_ScheduleTime",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime",
    "categoryId": "c4665793-15ea-44c9-bd0a-d542b3915fe0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime_remediation_scan_scheduletime",
    "description": null,
    "helpText": "",
    "name": "Remediation_Scan_ScheduleTime",
    "displayName": "Specify the time of day to run a scheduled full scan to complete remediation (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 1440,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 120
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduletime"
        }
    ],
    "dependedOnBy": []
}