{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableWindowsBranchCache_HostedCacheDiscovery",
        "Enable Automatic Hosted Cache Discovery by Service Connection Point",
        "\\Network\\BranchCache",
        "Administrative Templates\\Network\\BranchCache",
        "BranchCache"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-peertopeercaching#admx-peertopeercaching-enablewindowsbranchcache-hostedcachediscovery"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PeerToPeerCaching/EnableWindowsBranchCache_HostedCacheDiscovery",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedcachediscovery",
    "categoryId": "1cda8821-d9e2-485e-8d78-1829593d41ca",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedcachediscovery",
    "description": "This policy setting specifies whether client computers should attempt the automatic configuration of hosted cache mode by searching for hosted cache servers publishing service connection points that are associated with the client's current Active Directory site.  If you enable this policy setting, client computers to which the policy setting is applied search for hosted cache servers using Active Directory, and will prefer both these servers and hosted cache mode rather than manual BranchCache configuration or BranchCache configuration by other group policies.\r\n\r\nIf you enable this policy setting in addition to the \"Turn on BranchCache\" policy setting, BranchCache clients attempt to discover hosted cache servers in the local branch office.  If client computers detect hosted cache servers, hosted cache mode is turned on.  If they do not detect hosted cache servers, hosted cache mode is not turned on, and the client uses any other configuration that is specified manually or by Group Policy.\r\n\r\nWhen this policy setting is applied, the client computer performs or does not perform automatic hosted cache server discovery under the following circumstances:\r\n\r\nIf no other BranchCache mode-based policy settings are applied, the client computer performs automatic hosted cache server discovery. If one or more hosted cache servers is found, the client computer self-configures for hosted cache mode.\r\n\r\nIf the policy setting \"Set BranchCache Distributed Cache Mode\" is applied in addition to this policy, the client computer performs automatic hosted cache server discovery. If one or more hosted cache servers are found, the client computer self-configures for hosted cache mode only.\r\n\r\nIf the policy setting \"Set BranchCache Hosted Cache Mode\" is applied, the client computer does not perform automatic hosted cache discovery. This is also true in cases where the policy setting \"Configure Hosted Cache Servers\" is applied.\r\n\r\nThis policy setting can only be applied to client computers that are running at least Windows 8.  This policy has no effect on computers that are running Windows 7 or Windows Vista.  \r\n\r\nIf you disable, or do not configure this setting, a client will not attempt to discover hosted cache servers by service connection point.\r\n\r\nPolicy configuration\r\n\r\nSelect one of the following:\r\n\r\n- Not Configured. With this selection, BranchCache settings are not applied to client computers by this policy setting, and client computers do not perform hosted cache server discovery.\r\n\r\n- Enabled. With this selection, the policy setting is applied to client computers, which perform automatic hosted cache server discovery and which are configured as hosted cache mode clients.\r\n\r\n- Disabled. With this selection, this policy is not applied to client computers.\r\n            \r\n ",
    "helpText": "",
    "name": "EnableWindowsBranchCache_HostedCacheDiscovery",
    "displayName": "Enable Automatic Hosted Cache Discovery by Service Connection Point",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedcachediscovery_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedcachediscovery_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedcachediscovery_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}