{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Client Settings",
        "Send Data to Microsoft",
        "Privilege Management",
        "Privilege Management Elevation Client Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "PrivilegeManagement/ElevationClientSettings/SendData",
    "rootDefinitionId": "device_vendor_msft_policy_elevationclientsettings_enableepm",
    "categoryId": "b750fe41-33c4-4293-8dfc-42285be35752",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_elevationclientsettings_senddata",
    "description": "",
    "helpText": null,
    "name": "SendDataToMicrosoft",
    "displayName": "Send elevation data for reporting",
    "defaultOptionId": "device_vendor_msft_policy_elevationclientsettings_senddata_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,endpointPrivilegeManagement",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19042",
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_elevationclientsettings_senddata_1",
            "description": "Yes",
            "helpText": null,
            "name": "Yes",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_elevationclientsettings_enableepm_1",
                    "parentSettingId": "device_vendor_msft_policy_elevationclientsettings_enableepm"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_elevationclientsettings_reportingscope",
                    "required": true
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_elevationclientsettings_senddata_0",
            "description": "No",
            "helpText": null,
            "name": "No",
            "displayName": "No",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_elevationclientsettings_enableepm_1",
                    "parentSettingId": "device_vendor_msft_policy_elevationclientsettings_enableepm"
                }
            ],
            "dependedOnBy": []
        }
    ]
}