{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Remediation_Scan_ScheduleDay",
        "Specify the day of the week to run a scheduled full scan to complete remediation",
        "\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Remediation"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/Remediation_Scan_ScheduleDay",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday",
    "categoryId": "c4665793-15ea-44c9-bd0a-d542b3915fe0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday",
    "description": null,
    "helpText": "",
    "name": "Remediation_Scan_ScheduleDay",
    "displayName": "Specify the day of the week to run a scheduled full scan to complete remediation (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_8",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_8",
            "description": null,
            "helpText": null,
            "name": "Never",
            "displayName": "Never",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_0",
            "description": null,
            "helpText": null,
            "name": "Every Day",
            "displayName": "Every Day",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_1",
            "description": null,
            "helpText": null,
            "name": "Sunday",
            "displayName": "Sunday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_2",
            "description": null,
            "helpText": null,
            "name": "Monday",
            "displayName": "Monday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_3",
            "description": null,
            "helpText": null,
            "name": "Tuesday",
            "displayName": "Tuesday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_4",
            "description": null,
            "helpText": null,
            "name": "Wednesday",
            "displayName": "Wednesday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_5",
            "description": null,
            "helpText": null,
            "name": "Thursday",
            "displayName": "Thursday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_6",
            "description": null,
            "helpText": null,
            "name": "Friday",
            "displayName": "Friday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday_7",
            "description": null,
            "helpText": null,
            "name": "Saturday",
            "displayName": "Saturday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday"
                }
            ],
            "dependedOnBy": []
        }
    ]
}