{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShortNameCreationSettings",
        "Short name creation options",
        "\\System\\Filesystem\\NTFS",
        "Administrative Templates\\System\\Filesystem\\NTFS",
        "NTFS"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FileSys/ShortNameCreationSettings",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings",
    "categoryId": "2e71c6fd-dafa-444d-9542-55d838331939",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_shortnamecreationsetting_levels",
    "description": null,
    "helpText": "",
    "name": "ShortNameCreationSetting_Levels",
    "displayName": "Short name creation options (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_shortnamecreationsetting_levels_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_shortnamecreationsetting_levels_0",
            "description": null,
            "helpText": null,
            "name": "Enable on all volumes",
            "displayName": "Enable on all volumes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_shortnamecreationsetting_levels_1",
            "description": null,
            "helpText": null,
            "name": "Disable on all volumes",
            "displayName": "Disable on all volumes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_shortnamecreationsetting_levels_2",
            "description": null,
            "helpText": null,
            "name": "Enable / disable on a per volume basis",
            "displayName": "Enable / disable on a per volume basis",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_shortnamecreationsetting_levels_3",
            "description": null,
            "helpText": null,
            "name": "Disable on all data volumes",
            "displayName": "Disable on all data volumes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_filesys_shortnamecreationsettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}