{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Autorun",
        "Turn off Autoplay",
        "\\Windows Components\\AutoPlay Policies",
        "AutoPlay Policies"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Autoplay/TurnOffAutoPlay",
    "rootDefinitionId": "device_vendor_msft_policy_config_autoplay_turnoffautoplay",
    "categoryId": "2dc7de59-a2b5-4f4a-96a4-597927af0617",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_autoplay_turnoffautoplay_autorun_box",
    "description": "",
    "helpText": "",
    "name": "Autorun_Box",
    "displayName": "Turn off Autoplay on:",
    "defaultOptionId": "device_vendor_msft_policy_config_autoplay_turnoffautoplay_autorun_box_181",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_autoplay_turnoffautoplay_autorun_box_181",
            "description": null,
            "helpText": null,
            "name": "CD-ROM and removable media drives",
            "displayName": "CD-ROM and removable media drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "181"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_autoplay_turnoffautoplay_1",
                    "parentSettingId": "device_vendor_msft_policy_config_autoplay_turnoffautoplay"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_autoplay_turnoffautoplay_autorun_box_255",
            "description": null,
            "helpText": null,
            "name": "All drives",
            "displayName": "All drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "255"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_autoplay_turnoffautoplay_1",
                    "parentSettingId": "device_vendor_msft_policy_config_autoplay_turnoffautoplay"
                }
            ],
            "dependedOnBy": []
        }
    ]
}