{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Disable Clear Tpm Button",
        "Windows Defender Security Center"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-WindowsDefenderSecurityCenter#windowsdefendersecuritycenter-disablecleartpmbutton"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/WindowsDefenderSecurityCenter/DisableClearTpmButton",
    "rootDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablecleartpmbutton",
    "categoryId": "f72e61e9-7e84-4c6d-8057-fa0a4f79cbea",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablecleartpmbutton",
    "description": "Disable the Clear TPM button in Windows Security. Enabled:The Clear TPM button will be unavailable for use. Disabled:The Clear TPM button will be available for use on supported systems. Not configured:Same as Disabled. Supported values:0 - Disabled (default)1 - Enabled",
    "helpText": "",
    "name": "DisableClearTpmButton",
    "displayName": "Disable Clear Tpm Button",
    "defaultOptionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablecleartpmbutton_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablecleartpmbutton_0",
            "description": "(Disabled or not configured) The security processor troubleshooting page shows a button that initiates the process to clear the security processor (TPM).",
            "helpText": null,
            "name": "(Disabled or not configured) The security processor troubleshooting page shows a button that initiates the process to clear the security processor (TPM).",
            "displayName": "(Disabled or not configured) The security processor troubleshooting page shows a button that initiates the process to clear the security processor (TPM).",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disablecleartpmbutton_1",
            "description": "(Enabled) The security processor troubleshooting page will not show a button to initiate the process to clear the security processor (TPM)",
            "helpText": null,
            "name": "(Enabled) The security processor troubleshooting page will not show a button to initiate the process to clear the security processor (TPM)",
            "displayName": "(Enabled) The security processor troubleshooting page will not show a button to initiate the process to clear the security processor (TPM)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}