{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Dynamic Lock",
        "Passport For Work",
        "Windows Hello For Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
    "offsetUri": "/DynamicLock/DynamicLock",
    "rootDefinitionId": "device_vendor_msft_passportforwork_dynamiclock_dynamiclock",
    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_passportforwork_dynamiclock_dynamiclock",
    "description": "Enables/Disables Dyanamic Lock",
    "helpText": "",
    "name": "DynamicLock",
    "displayName": "Dynamic Lock",
    "defaultOptionId": "device_vendor_msft_passportforwork_dynamiclock_dynamiclock_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager",
        "configurationServiceProviderVersion": "1.4",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_passportforwork_dynamiclock_dynamiclock_false",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_passportforwork_dynamiclock_dynamiclock_true",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}