{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ShowAppCellularAccessUI",
        "Set Per-App Cellular Access UI Visibility",
        "\\Network\\WWAN Service\\WWAN UI Settings",
        "Administrative Templates\\Network\\WWAN Service\\WWAN UI Settings",
        "WWAN UI Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-cellular#cellular-showappcellularaccessui"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Cellular/ShowAppCellularAccessUI",
    "rootDefinitionId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui",
    "categoryId": "a51a8665-045d-482d-b68b-2128959c8b31",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_cellular_showappcellularaccessui",
    "description": "This policy setting configures the visibility of the link to the per-application cellular access control page in the cellular setting UX.\r\n\r\nIf this policy setting is enabled, a drop-down list box presenting possible values will be active.  Select \"Hide\" or \"Show\" to hide or show the link to the per-application cellular access control page.\r\nIf this policy setting is disabled or is not configured, the link to the per-application cellular access control page is showed by default.\r\n      ",
    "helpText": "",
    "name": "ShowAppCellularAccessUI",
    "displayName": "Set Per-App Cellular Access UI Visibility",
    "defaultOptionId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_cellular_showappcellularaccessui_showappcellularaccessui_option",
                    "required": true
                }
            ]
        }
    ]
}