{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CertPropRootCleanupString",
        "Configure root certificate clean up",
        "\\Windows Components\\Smart Card",
        "Administrative Templates\\Windows Components\\Smart Card",
        "Smart Card"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Smartcard/CertPropRootCleanupString",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring",
    "categoryId": "4fc4d2f3-35ee-43ec-a033-ef78da571e70",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_rootcertcleanupoption_levels",
    "description": null,
    "helpText": "",
    "name": "RootCertCleanupOption_Levels",
    "displayName": "Root certificate clean up options (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_rootcertcleanupoption_levels_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_rootcertcleanupoption_levels_0",
            "description": null,
            "helpText": null,
            "name": "No cleanup",
            "displayName": "No cleanup",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_rootcertcleanupoption_levels_1",
            "description": null,
            "helpText": null,
            "name": "Clean up certificates on smart card removal",
            "displayName": "Clean up certificates on smart card removal",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_rootcertcleanupoption_levels_2",
            "description": null,
            "helpText": null,
            "name": "Clean up certificates on log off",
            "displayName": "Clean up certificates on log off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_smartcard_certproprootcleanupstring"
                }
            ],
            "dependedOnBy": []
        }
    ]
}