{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DfdAlertPolicy",
        "Disk Diagnostic: Configure custom alert text",
        "\\System\\Troubleshooting and Diagnostics\\Disk Diagnostic",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\Disk Diagnostic",
        "Disk Diagnostic"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DiskDiagnostic/DfdAlertPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_diskdiagnostic_dfdalertpolicy",
    "categoryId": "7bc264db-6da2-4c6b-a357-aec47c717737",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_diskdiagnostic_dfdalertpolicy_dfdalertpolicytitle",
    "description": null,
    "helpText": "",
    "name": "DfdAlertPolicyTitle",
    "displayName": "Custom alert text (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 512,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_diskdiagnostic_dfdalertpolicy_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_diskdiagnostic_dfdalertpolicy"
        }
    ],
    "dependedOnBy": []
}