{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "WerConsentCustomize_2",
        "Customize consent settings",
        "\\Windows Components\\Windows Error Reporting\\Consent",
        "Administrative Templates\\Windows Components\\Windows Error Reporting\\Consent",
        "Consent"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ErrorReporting/CustomizeConsentSettings",
    "rootDefinitionId": "device_vendor_msft_policy_config_errorreporting_customizeconsentsettings",
    "categoryId": "e781bfae-233f-463f-a85b-7299ce5a87c5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_errorreporting_customizeconsentsettings_werconsentcustomize_key",
    "description": "",
    "helpText": "",
    "name": "WerConsentCustomize",
    "displayName": "Name",
    "defaultValue": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_errorreporting_customizeconsentsettings_werconsentcustomize",
            "parentSettingId": "device_vendor_msft_policy_config_errorreporting_customizeconsentsettings_werconsentcustomize"
        }
    ],
    "dependedOnBy": []
}