{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WdiDpsScenarioExecutionPolicy",
        "Diagnostics: Configure scenario execution level",
        "\\System\\Troubleshooting and Diagnostics",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics",
        "Troubleshooting and Diagnostics"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WDI/WdiDpsScenarioExecutionPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy",
    "categoryId": "424a0e73-8002-42e3-b47d-2062fc17c3b3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy_wdidpsscenarioexecutionpolicylevel",
    "description": null,
    "helpText": "",
    "name": "WdiDpsScenarioExecutionPolicyLevel",
    "displayName": "Scenario Execution Level (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy_wdidpsscenarioexecutionpolicylevel_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy_wdidpsscenarioexecutionpolicylevel_1",
            "description": null,
            "helpText": null,
            "name": "Detection and Troubleshooting Only",
            "displayName": "Detection and Troubleshooting Only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy_wdidpsscenarioexecutionpolicylevel_2",
            "description": null,
            "helpText": null,
            "name": "Detection, Troubleshooting and Resolution",
            "displayName": "Detection, Troubleshooting and Resolution",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wdi_wdidpsscenarioexecutionpolicy"
                }
            ],
            "dependedOnBy": []
        }
    ]
}