{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "USER_HOME",
        "Set user home folder",
        "\\System\\User Profiles",
        "Administrative Templates\\System\\User Profiles",
        "User Profiles"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserProfiles/USER_HOME",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_userprofiles_user_home",
    "categoryId": "b49cb414-bdfb-49d4-af5d-176ded4f9591",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter",
    "description": null,
    "helpText": "",
    "name": "DRIVE_LETTER",
    "displayName": "Drive letter (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_z:",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_g:",
            "description": null,
            "helpText": null,
            "name": "G:",
            "displayName": "G:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "G:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_h:",
            "description": null,
            "helpText": null,
            "name": "H:",
            "displayName": "H:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "H:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_i:",
            "description": null,
            "helpText": null,
            "name": "I:",
            "displayName": "I:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "I:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_j:",
            "description": null,
            "helpText": null,
            "name": "J:",
            "displayName": "J:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "J:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_k:",
            "description": null,
            "helpText": null,
            "name": "K:",
            "displayName": "K:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "K:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_l:",
            "description": null,
            "helpText": null,
            "name": "L:",
            "displayName": "L:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "L:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_m:",
            "description": null,
            "helpText": null,
            "name": "M:",
            "displayName": "M:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "M:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_n:",
            "description": null,
            "helpText": null,
            "name": "N:",
            "displayName": "N:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "N:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_o:",
            "description": null,
            "helpText": null,
            "name": "O:",
            "displayName": "O:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "O:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_p:",
            "description": null,
            "helpText": null,
            "name": "P:",
            "displayName": "P:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "P:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_q:",
            "description": null,
            "helpText": null,
            "name": "Q:",
            "displayName": "Q:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Q:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_r:",
            "description": null,
            "helpText": null,
            "name": "R:",
            "displayName": "R:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "R:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_s:",
            "description": null,
            "helpText": null,
            "name": "S:",
            "displayName": "S:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "S:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_t:",
            "description": null,
            "helpText": null,
            "name": "T:",
            "displayName": "T:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "T:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_u:",
            "description": null,
            "helpText": null,
            "name": "U:",
            "displayName": "U:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "U:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_v:",
            "description": null,
            "helpText": null,
            "name": "V:",
            "displayName": "V:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "V:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_w:",
            "description": null,
            "helpText": null,
            "name": "W:",
            "displayName": "W:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "W:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_x:",
            "description": null,
            "helpText": null,
            "name": "X:",
            "displayName": "X:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "X:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_y:",
            "description": null,
            "helpText": null,
            "name": "Y:",
            "displayName": "Y:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Y:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_user_home_drive_letter_z:",
            "description": null,
            "helpText": null,
            "name": "Z:",
            "displayName": "Z:",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Z:"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_user_home_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_user_home"
                }
            ],
            "dependedOnBy": []
        }
    ]
}