{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "TCGSecurityActivationDisabled",
        "Do not allow Windows to activate Enhanced Storage devices",
        "\\System\\Enhanced Storage Access",
        "Administrative Templates\\System\\Enhanced Storage Access",
        "Enhanced Storage Access"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-storage#storage-enhancedstoragedevices"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Storage/EnhancedStorageDevices",
    "rootDefinitionId": "device_vendor_msft_policy_config_storage_enhancedstoragedevices",
    "categoryId": "71f349a7-1ca3-4945-8c7d-fd68df3759ac",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_storage_enhancedstoragedevices",
    "description": "This policy setting configures whether or not Windows will activate an Enhanced Storage device.\r\n\r\nIf you enable this policy setting, Windows will not activate unactivated Enhanced Storage devices.\r\n\r\nIf you disable or do not configure this policy setting, Windows will activate unactivated Enhanced Storage devices.",
    "helpText": "",
    "name": "TCGSecurityActivationDisabled",
    "displayName": "Do not allow Windows to activate Enhanced Storage devices",
    "defaultOptionId": "device_vendor_msft_policy_config_storage_enhancedstoragedevices_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_storage_enhancedstoragedevices_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_storage_enhancedstoragedevices_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}