{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "AllowPinnedFolderHomeGroup",
        "Start"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Start#start-allowpinnedfolderhomegroup"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Start/AllowPinnedFolderHomeGroup",
    "rootDefinitionId": "device_vendor_msft_policy_config_start_allowpinnedfolderhomegroup",
    "categoryId": "311e1dac-a77c-4bc0-a376-35ad55923b7d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_start_allowpinnedfolderhomegroup",
    "description": "This policy controls the visibility of the HomeGroup shortcut on the Start menu. The possible values are 0 - means that the shortcut should be hidden and grays out the corresponding toggle in the Settings app, 1 - means that the shortcut should be visible and grays out the corresponding toggle in the Settings app, 65535 - means that there is no enforced configuration and the setting can be changed by the user.",
    "helpText": "",
    "name": "AllowPinnedFolderHomeGroup",
    "displayName": "Allow Pinned Folder Home Group",
    "defaultOptionId": "device_vendor_msft_policy_config_start_allowpinnedfolderhomegroup_65535",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_start_allowpinnedfolderhomegroup_0",
            "description": "The shortcut is hidden and disables the setting in the Settings app.",
            "helpText": null,
            "name": "The shortcut is hidden and disables the setting in the Settings app.",
            "displayName": "The shortcut is hidden and disables the setting in the Settings app.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_start_allowpinnedfolderhomegroup_1",
            "description": "The shortcut is visible and disables the setting in the Settings app.",
            "helpText": null,
            "name": "The shortcut is visible and disables the setting in the Settings app.",
            "displayName": "The shortcut is visible and disables the setting in the Settings app.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_start_allowpinnedfolderhomegroup_65535",
            "description": "There is no enforced configuration and the setting can be changed by the user.",
            "helpText": null,
            "name": "There is no enforced configuration and the setting can be changed by the user.",
            "displayName": "There is no enforced configuration and the setting can be changed by the user.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 65535
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}