{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DontUseFrameInterpolation",
        "Prevent Video Smoothing",
        "\\Windows Components\\Windows Media Player",
        "Administrative Templates\\Windows Components\\Windows Media Player",
        "Windows Media Player"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsmediaplayer#admx-windowsmediaplayer-dontuseframeinterpolation"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/DontUseFrameInterpolation",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_dontuseframeinterpolation",
    "categoryId": "22ebd92b-80b6-493d-99d8-3c72f1a0827e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsmediaplayer_dontuseframeinterpolation",
    "description": "This policy setting allows you to prevent video smoothing from occurring.\r\n\r\nIf you enable this policy setting, video smoothing is prevented, which can improve video playback on computers with limited resources. In addition, the Use Video Smoothing check box in the Video Acceleration Settings dialog box in the Player is cleared and is not available.\r\n\r\nIf you disable this policy setting, video smoothing occurs if necessary, and the Use Video Smoothing check box is selected and is not available.\r\n\r\nIf you do not configure this policy setting, video smoothing occurs if necessary. Users can change the setting for the Use Video Smoothing check box.\r\n\r\nVideo smoothing is available only on the Windows XP Home Edition and Windows XP Professional operating systems.\r\n ",
    "helpText": "",
    "name": "DontUseFrameInterpolation",
    "displayName": "Prevent Video Smoothing",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_dontuseframeinterpolation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_dontuseframeinterpolation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_dontuseframeinterpolation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}