{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableMicrosoftStoreSource",
        "Enable App Installer Microsoft Store Source",
        "\\Windows Components\\Desktop App Installer",
        "Administrative Templates\\Windows Components\\Desktop App Installer",
        "Desktop App Installer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-desktopappinstaller#desktopappinstaller-enablemicrosoftstoresource"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DesktopAppInstaller/EnableMicrosoftStoreSource",
    "rootDefinitionId": "device_vendor_msft_policy_config_desktopappinstaller_enablemicrosoftstoresource",
    "categoryId": "70063d93-03f0-462e-9943-b0241b88d54d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_desktopappinstaller_enablemicrosoftstoresource",
    "description": "This policy controls the Microsoft Store source included with the Windows Package Manager.\r\n\r\nIf you do not configure this setting, the Microsoft Store source for the Windows Package manager will be available and can be removed.\r\n\r\nIf you enable this setting, the Microsoft Store source for the Windows Package Manager will be available and cannot be removed.\r\n\r\nIf you disable this setting the Microsoft Store source for the Windows Package Manager will not be available.",
    "helpText": "",
    "name": "EnableMicrosoftStoreSource",
    "displayName": "Enable App Installer Microsoft Store Source",
    "defaultOptionId": "device_vendor_msft_policy_config_desktopappinstaller_enablemicrosoftstoresource_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_desktopappinstaller_enablemicrosoftstoresource_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_desktopappinstaller_enablemicrosoftstoresource_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}