{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Costed Network Behavior Background Priority",
        "BITS"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-BITS#bits-costednetworkbehaviorbackgroundpriority"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/BITS/CostedNetworkBehaviorBackgroundPriority",
    "rootDefinitionId": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority",
    "categoryId": "7443c1d4-1087-486c-9a0a-f9da9074e4e1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority",
    "description": "This policy setting defines the default behavior that the Background Intelligent Transfer Service (BITS) uses for background transfers when the system is connected to a costed network (3G, etc. ). Download behavior policies further limit the network usage of background transfers. If you enable this policy setting, you can define a default download policy for each BITS job priority. This setting does not override a download policy explicitly configured by the application that created the BITS job, but does apply to jobs that are created by specifying only a priority. For example, you can specify that background jobs are by default to transfer only when on uncosted network connections, but foreground jobs should proceed only when not roaming. The values that can be assigned are:1 -  Always transfer2 -  Transfer unless roaming3 -  Transfer unless surcharge applies (when not roaming or overcap)4 -  Transfer unless nearing limit (when not roaming or nearing cap)5 -  Transfer only if unconstrained",
    "helpText": "",
    "name": "CostedNetworkBehaviorBackgroundPriority",
    "displayName": "Costed Network Behavior Background Priority",
    "defaultOptionId": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority_1",
            "description": "Always transfer",
            "helpText": null,
            "name": "Always transfer",
            "displayName": "Always transfer",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority_2",
            "description": "Transfer unless roaming",
            "helpText": null,
            "name": "Transfer unless roaming",
            "displayName": "Transfer unless roaming",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority_3",
            "description": "Transfer unless surcharge applies (when not roaming or over cap)",
            "helpText": null,
            "name": "Transfer unless surcharge applies (when not roaming or over cap)",
            "displayName": "Transfer unless surcharge applies (when not roaming or over cap)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority_4",
            "description": "Transfer unless nearing limit (when not roaming or nearing cap)",
            "helpText": null,
            "name": "Transfer unless nearing limit (when not roaming or nearing cap)",
            "displayName": "Transfer unless nearing limit (when not roaming or nearing cap)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_bits_costednetworkbehaviorbackgroundpriority_5",
            "description": "Transfer only if unconstrained",
            "helpText": null,
            "name": "Transfer only if unconstrained",
            "displayName": "Transfer only if unconstrained",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}