{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_HashSupportVersion",
        "Hash Version support for BranchCache",
        "\\Network\\Lanman Server",
        "Administrative Templates\\Network\\Lanman Server",
        "Lanman Server"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-lanmanserver#admx-lanmanserver-pol-hashsupportversion"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LanmanServer/Pol_HashSupportVersion",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion",
    "categoryId": "fd49df1b-bfad-4ed5-85c2-046a32fa8782",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion",
    "description": "This policy setting specifies whether the BranchCache hash generation service supports version 1 (V1) hashes, version 2 (V2) hashes, or both V1 and V2 hashes. Hashes, also called content information, are created based on the data in shared folders where BranchCache is enabled. \r\n\r\nIf you specify only one version that is supported, content information for that version is the only type that is generated by BranchCache, and it is the only type of content information that can be retrieved by client computers. For example, if you enable support for V1 hashes, BranchCache generates only V1 hashes and client computers can retrieve only V1 hashes.\r\n\r\nPolicy configuration\r\n\r\nSelect one of the following:\r\n\r\n- Not Configured. With this selection, BranchCache settings are not applied to client computers by this policy setting. In this circumstance, which is the default, both V1 and V2 hash generation and retrieval are supported.\r\n\r\n- Enabled. With this selection, the policy setting is applied and the hash version(s) that are specified in \"Hash version supported\" are generated and retrieved.\r\n\r\n- Disabled. With this selection, both V1 and V2 hash generation and retrieval are supported.\r\n\r\nIn circumstances where this setting is enabled, you can also select and configure the following option:\r\n\r\nHash version supported:\r\n\r\n- To support V1 content information only, configure \"Hash version supported\" with the value of 1.\r\n\r\n- To support V2 content information only, configure \"Hash version supported\" with the value of 2.\r\n\r\n- To support both V1 and V2 content information, configure \"Hash version supported\" with the value of 3.\n ",
    "helpText": "",
    "name": "Pol_HashSupportVersion",
    "displayName": "Hash Version support for BranchCache",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_lbl_hashversionsupportactioncombo",
                    "required": true
                }
            ]
        }
    ]
}