{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableDesktopSlideShowDC",
        "Turn on desktop background slideshow (on battery)",
        "\\System\\Power Management\\Video and Display Settings",
        "Administrative Templates\\System\\Power Management\\Video and Display Settings",
        "Video and Display Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-power#admx-power-enabledesktopslideshowdc"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/EnableDesktopSlideShowDC",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_enabledesktopslideshowdc",
    "categoryId": "01bbe7c3-10eb-40a3-8387-c74c33c294b1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_power_enabledesktopslideshowdc",
    "description": "This policy setting allows you to specify if Windows should enable the desktop background slideshow.\r\n\r\nIf you enable this policy setting, desktop background slideshow is enabled.\r\n\r\nIf you disable this policy setting, the desktop background slideshow is disabled.\r\n\r\nIf you disable or do not configure this policy setting, users control this setting.",
    "helpText": "",
    "name": "EnableDesktopSlideShowDC",
    "displayName": "Turn on desktop background slideshow (on battery)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_enabledesktopslideshowdc_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_enabledesktopslideshowdc_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_enabledesktopslideshowdc_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}