{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ApprovedActiveXInstallSites",
        "Approved Installation Sites for ActiveX Controls",
        "\\Windows Components\\ActiveX Installer Service",
        "Administrative Templates\\Windows Components\\ActiveX Installer Service",
        "ActiveX Installer Service"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-activexcontrols#activexcontrols-approvedinstallationsites"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ActiveXControls/ApprovedInstallationSites",
    "rootDefinitionId": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites",
    "categoryId": "78906e32-f4fb-453b-939b-05717ffaae59",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites",
    "description": "This policy setting determines which ActiveX installation sites standard users in your organization can use to install ActiveX controls on their computers. When this setting is enabled, the administrator can create a list of approved Activex Install sites specified by host URL. \r\n\r\nIf you enable this setting, the administrator can create a list of approved ActiveX Install sites specified by host URL. \r\n      \r\nIf you disable or do not configure this policy setting, ActiveX controls prompt the user for administrative credentials before installation. \r\n\r\nNote: Wild card characters cannot be used when specifying the host URLs.\r\n",
    "helpText": "",
    "name": "ApprovedActiveXInstallSites",
    "displayName": "Approved Installation Sites for ActiveX Controls",
    "defaultOptionId": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_activexcontrols_approvedinstallationsites_approvedactivexinstallsiteslist",
                    "required": true
                }
            ]
        }
    ]
}