{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Netlogon_DnsAvoidRegisterRecords",
        "Specify DC Locator DNS records not registered by the DCs",
        "\\System\\Net Logon\\DC Locator DNS Records",
        "Administrative Templates\\System\\Net Logon\\DC Locator DNS Records",
        "DC Locator DNS Records"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-netlogon#admx-netlogon-netlogon-dnsavoidregisterrecords"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Netlogon/Netlogon_DnsAvoidRegisterRecords",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnsavoidregisterrecords",
    "categoryId": "7f4d325e-bff8-4d91-8313-614243e55e6d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnsavoidregisterrecords",
    "description": "This policy setting determines which DC Locator DNS records are not registered by the Net Logon service.\r\n\r\nIf you enable this policy setting, select Enabled and specify a list of space-delimited mnemonics (instructions) for the DC Locator DNS records that will not be registered by the DCs to which this setting is applied.\r\n\r\nSelect the mnemonics from the following list:\r\n\r\nMnemonic         Type  DNS Record\r\n\r\nLdapIpAddress    A     <DnsDomainName>\r\nLdap             SRV   _ldap._tcp.<DnsDomainName>\r\nLdapAtSite       SRV   _ldap._tcp.<SiteName>._sites.<DnsDomainName>\r\nPdc              SRV   _ldap._tcp.pdc._msdcs.<DnsDomainName>\r\nGc               SRV   _ldap._tcp.gc._msdcs.<DnsForestName>\r\nGcAtSite         SRV   _ldap._tcp.<SiteName>._sites.gc._msdcs.<DnsForestName>\r\nDcByGuid         SRV   _ldap._tcp.<DomainGuid>.domains._msdcs.<DnsForestName>\r\nGcIpAddress      A     gc._msdcs.<DnsForestName>\r\nDsaCname         CNAME <DsaGuid>._msdcs.<DnsForestName>\r\nKdc              SRV   _kerberos._tcp.dc._msdcs.<DnsDomainName>\r\nKdcAtSite        SRV   _kerberos._tcp.<SiteName>._sites.dc._msdcs.<DnsDomainName>\r\nDc               SRV   _ldap._tcp.dc._msdcs.<DnsDomainName>\r\nDcAtSite         SRV   _ldap._tcp.<SiteName>._sites.dc._msdcs.<DnsDomainName>\r\nRfc1510Kdc       SRV   _kerberos._tcp.<DnsDomainName>\r\nRfc1510KdcAtSite SRV   _kerberos._tcp.<SiteName>._sites.<DnsDomainName>\r\nGenericGc        SRV   _gc._tcp.<DnsForestName>\r\nGenericGcAtSite  SRV   _gc._tcp.<SiteName>._sites.<DnsForestName>\r\nRfc1510UdpKdc    SRV   _kerberos._udp.<DnsDomainName>\r\nRfc1510Kpwd      SRV   _kpasswd._tcp.<DnsDomainName>\r\nRfc1510UdpKpwd   SRV   _kpasswd._udp.<DnsDomainName>\r\n\r\nIf you disable this policy setting, DCs configured to perform dynamic registration of DC Locator DNS records register all DC Locator DNS resource records.\r\n\r\nIf you do not configure this policy setting, DCs use their local configuration.\r\n ",
    "helpText": "",
    "name": "Netlogon_DnsAvoidRegisterRecords",
    "displayName": "Specify DC Locator DNS records not registered by the DCs",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnsavoidregisterrecords_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnsavoidregisterrecords_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnsavoidregisterrecords_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_netlogon_netlogon_dnsavoidregisterrecords_netlogon_dnsavoidregisterrecordslabel",
                    "required": true
                }
            ]
        }
    ]
}