{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SharedInstallationPath",
        "Shared installation path",
        "\\Visual Studio\\Install and Update Settings",
        "Administrative Templates\\Visual Studio\\Install and Update Settings",
        "Install and Update Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov1~Policy~VisualStudio~InstallandUpdateSettings/SharedInstallationPath",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_sharedinstallationpath",
    "categoryId": "175ddbac-b0ae-4d9d-b76e-4eb1a487fc93",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_sharedinstallationpath",
    "description": "The directory where some packages shared across versions of instances of Visual Studio are installed. You can change the value anytime, but it will only affect future installs. Any products already installed to the old location must not be moved or they might not function correctly.\r\n\r\nThe Visual Studio Installer enforces a 150 character limit for the path.",
    "helpText": "",
    "name": "SharedInstallationPath",
    "displayName": "Shared installation path",
    "defaultOptionId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_sharedinstallationpath_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_sharedinstallationpath_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_sharedinstallationpath_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_sharedinstallationpath_sharedinstallationpath_textbox",
                    "required": true
                }
            ]
        }
    ]
}