{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SNMP_Traps_Public",
        "Specify traps for public community",
        "\\Network\\SNMP",
        "Administrative Templates\\Network\\SNMP",
        "SNMP"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-snmp#admx-snmp-snmp-traps-public"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Snmp/SNMP_Traps_Public",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_snmp_snmp_traps_public",
    "categoryId": "b13e38a0-6ad6-4a1f-b53f-d8ca94847586",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_snmp_snmp_traps_public",
    "description": "This policy setting allows trap configuration for the Simple Network Management Protocol (SNMP) agent.\r\n\r\nSimple Network Management Protocol is a protocol designed to give a user the capability to remotely manage a computer network by polling and setting terminal values and monitoring network events.\r\n\r\nThis policy setting allows you to configure the name of the hosts that receive trap messages for the community sent by the SNMP service. A trap message is an alert or significant event that allows the SNMP agent to notify management systems asynchronously.\r\n\r\nIf you enable this policy setting, the SNMP service sends trap messages to the hosts within the \"public\" community.\r\n\r\nIf you disable or do not configure this policy setting, the SNMP service takes the trap configuration configured on the local computer instead.\r\n\r\nNote: This setting has no effect if the SNMP agent is not installed on the client computer.\r\n\r\nAlso, see the other two SNMP settings: \"Specify permitted managers\" and \"Specify Community Name\".\r\n ",
    "helpText": "",
    "name": "SNMP_Traps_Public",
    "displayName": "Specify traps for public community",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_snmp_snmp_traps_public_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_snmp_snmp_traps_public_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_snmp_snmp_traps_public_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_snmp_snmp_traps_public_snmp_traps_publiclistbox",
                    "required": true
                }
            ]
        }
    ]
}