{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "trv2_payload",
        "Cloud Policy Details",
        "\\Windows Components\\Tenant Restrictions",
        "Administrative Templates\\Windows Components\\Tenant Restrictions",
        "Tenant Restrictions"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/TenantRestrictions/ConfigureTenantRestrictions",
    "rootDefinitionId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions",
    "categoryId": "1638d9ec-63d5-4d6b-b1b6-4b0402268e36",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_enforcefirewall",
    "description": "",
    "helpText": "",
    "name": "EnforceFirewall",
    "displayName": "Enable firewall protection of Microsoft endpoints (Device)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1320",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_enforcefirewall_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_enforcefirewall_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}