{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_MeteredUpdatesMicrosoftEdgeDev",
        "Let users update on metered connections",
        "\\Microsoft Edge Update\\Applications\\Microsoft Edge Dev",
        "Microsoft Edge Update\\Applications\\Microsoft Edge Dev",
        "Microsoft Edge Dev"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev127~Policy~Cat_EdgeUpdate~Cat_Applications~Cat_MicrosoftEdgeDev/Pol_MeteredUpdatesMicrosoftEdgeDev",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev",
    "categoryId": "13f62499-a266-42c8-a4dc-531efcea55cb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev_part_meteredupdatespolicy",
    "description": "",
    "helpText": "",
    "name": "Part_MeteredUpdatesPolicy",
    "displayName": "Metered Updates Policy (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev_part_meteredupdatespolicy_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev_part_meteredupdatespolicy_1",
            "description": null,
            "helpText": null,
            "name": "Metered Disable updates",
            "displayName": "Metered Disable updates",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev_part_meteredupdatespolicy_2",
            "description": null,
            "helpText": null,
            "name": "Metered Updates Allowed",
            "displayName": "Metered Updates Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_meteredupdatesmicrosoftedgedev"
                }
            ],
            "dependedOnBy": []
        }
    ]
}