{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Toasts",
        "Above Lock"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-abovelock#allowtoasts"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AboveLock/AllowToasts",
    "rootDefinitionId": "device_vendor_msft_policy_config_abovelock_allowtoasts",
    "categoryId": "ef8b8f2d-7791-4c44-a4f2-e39051f2e715",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_abovelock_allowtoasts",
    "description": "Specifies whether to allow toast notifications above the device lock screen. Most restrictive value is \"Block\".",
    "helpText": "",
    "name": "AllowToasts",
    "displayName": "Allow Toasts",
    "defaultOptionId": "device_vendor_msft_policy_config_abovelock_allowtoasts_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_abovelock_allowtoasts_0",
            "description": "Not allowed.",
            "helpText": null,
            "name": "Not allowed.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_abovelock_allowtoasts_1",
            "description": "Allowed.",
            "helpText": null,
            "name": "Allowed.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}