{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Developer Unlock",
        "Application Management",
        "Microsoft App Store"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-ApplicationManagement#allowdeveloperunlock"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ApplicationManagement/AllowDeveloperUnlock",
    "rootDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock",
    "categoryId": "a0c9f0b7-aa25-4e9c-a393-516145847b8b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock",
    "description": "Specifies whether developer unlock is allowed. Most restricted value is 0.",
    "helpText": "",
    "name": "AllowDeveloperUnlock",
    "displayName": "Allow Developer Unlock",
    "defaultOptionId": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock_65535",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock_0",
            "description": "Explicit deny.",
            "helpText": null,
            "name": "Explicit deny.",
            "displayName": "Explicit deny.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock_1",
            "description": "Explicit allow unlock.",
            "helpText": null,
            "name": "Explicit allow unlock.",
            "displayName": "Explicit allow unlock.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock_65535",
            "description": "Not configured.",
            "helpText": null,
            "name": "Not configured.",
            "displayName": "Not configured.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 65535
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}