{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PreventGeoIdChange_2",
        "Disallow changing of geographic location",
        "\\System\\Locale Services",
        "Administrative Templates\\System\\Locale Services",
        "Locale Services"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-preventgeoidchange-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/PreventGeoIdChange_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_globalization_preventgeoidchange_2",
    "categoryId": "2cbf2609-1f6a-4597-84e2-a57da0ad0472",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_globalization_preventgeoidchange_2",
    "description": "This policy setting prevents users from changing their user geographical location (GeoID).\r\n\r\nIf you enable this policy setting, users cannot change their GeoID.\r\n\r\nIf you disable or do not configure this policy setting, users may select any GeoID.\r\n\r\nIf you enable this policy setting at the computer level, it cannot be disabled by a per-user policy setting. If you disable this policy setting at the computer level, the per-user policy is ignored. If you do not configure this policy setting at the computer level, restrictions are based on per-user policy settings.\r\n\r\nTo set this policy setting on a per-user basis, make sure that the per-computer policy setting is not configured.\r\n ",
    "helpText": "",
    "name": "PreventGeoIdChange_2",
    "displayName": "Disallow changing of geographic location",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_globalization_preventgeoidchange_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_globalization_preventgeoidchange_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_globalization_preventgeoidchange_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}