{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisallowKerberos_1",
        "Disallow Kerberos authentication",
        "\\Windows Components\\Windows Remote Management (WinRM)\\WinRM Service",
        "Administrative Templates\\Windows Components\\Windows Remote Management (WinRM)\\WinRM Service",
        "WinRM Service"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsremotemanagement#admx-windowsremotemanagement-disallowkerberos-1"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsRemoteManagement/DisallowKerberos_1",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsremotemanagement_disallowkerberos_1",
    "categoryId": "023116df-a32c-43b0-a384-d6fe7ad9fabe",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsremotemanagement_disallowkerberos_1",
    "description": "This policy setting allows you to manage whether the Windows Remote Management (WinRM) service accepts Kerberos credentials over the network.\r\n\r\n        If you enable this policy setting, the WinRM service does not accept Kerberos credentials over the network.\r\n\r\n        If you disable or do not configure this policy setting, the WinRM service accepts Kerberos authentication from a remote client.\r\n ",
    "helpText": "",
    "name": "DisallowKerberos_1",
    "displayName": "Disallow Kerberos authentication",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsremotemanagement_disallowkerberos_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsremotemanagement_disallowkerberos_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsremotemanagement_disallowkerberos_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}