{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DomainPrinters",
        "Add Printer wizard - Network scan page (Managed network)",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-printing#admx-printing-domainprinters"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing/DomainPrinters",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing_domainprinters",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_printing_domainprinters",
    "description": "If you enable this policy setting, it sets the maximum number of printers (of each type) that the Add Printer wizard will display on a computer on a managed network (when the computer is able to reach a domain controller, e.g. a domain-joined laptop on a corporate network.)\r\n\r\n          If this policy setting is disabled, the network scan page will not be displayed.\r\n\r\n          If this policy setting is not configured, the Add Printer wizard will display the default number of printers of each type:\r\n          Directory printers: 20\r\n          TCP/IP printers: 0\r\n          Web Services printers: 0\r\n          Bluetooth printers: 10\r\n          Shared printers: 0\r\n\r\n          In order to view available Web Services printers on your network, ensure that network discovery is turned on. To turn on network discovery, click \"Start\", click \"Control Panel\", and then click \"Network and Internet\". On the \"Network and Internet\" page, click \"Network and Sharing Center\". On the Network and Sharing Center page, click \"Change advanced sharing settings\". On the Advanced sharing settings page, click the arrow next to \"Domain\" arrow, click \"turn on network discovery\", and then click \"Save changes\".\r\n\r\n          If you would like to not display printers of a certain type, enable this policy and set the number of printers to display to 0.\r\n\r\n          In Windows 10 and later, only TCP/IP printers can be shown in the wizard. If you enable this policy setting, only TCP/IP printer limits are applicable. On Windows 10 only, if you disable or do not configure this policy setting, the default limit is applied.\r\n          \r\n          In Windows 8 and later, Bluetooth printers are not shown so its limit does not apply to those versions of Windows.\r\n      \r\n ",
    "helpText": "",
    "name": "DomainPrinters",
    "displayName": "Add Printer wizard - Network scan page (Managed network)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing_domainprinters_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_domainprinters_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_domainprinters_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_domainprinters_adprinters",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_domainprinters_ipprinters",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_domainprinters_wsdprinters",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_domainprinters_bluetoothprinters",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_domainprinters_shareprinters",
                    "required": true
                }
            ]
        }
    ]
}