{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DocumentInspector",
        "Prevent document inspectors from running",
        "\\Microsoft Office 2016 (Machine)\\Miscellaneous",
        "Microsoft Office 2016 (Machine)\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_Miscellaneous/L_DocumentInspector",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_miscellaneous_l_documentinspector",
    "categoryId": "8c879ddf-7acf-45f3-81d3-2c78c7a1321b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_miscellaneous_l_documentinspector",
    "description": "This policy setting allows you to prevent document inspectors from running in Microsoft Office programs.\r\n      \r\nIf you enable this policy setting, specific document inspectors can be disabled by entering their Class ID (CLSID).  The inspector CLSID can be found at HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Office\\16.0\\Word\\\"Document Inspectors\" and similarly in Excel and PowerPoint.\r\n\r\nIf you disable or do not configure this policy setting, document inspectors may be run in Microsoft Office programs.",
    "helpText": "",
    "name": "L_DocumentInspector",
    "displayName": "Prevent document inspectors from running",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_miscellaneous_l_documentinspector_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_miscellaneous_l_documentinspector_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_miscellaneous_l_documentinspector_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_miscellaneous_l_documentinspector_l_empty197",
                    "required": true
                }
            ]
        }
    ]
}