{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DBS",
        "Use a device-based license for Office 365 ProPlus",
        "\\Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Licensing Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v3~Policy~L_MicrosoftOfficemachine~L_LicensingSettings/L_DBS",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v3~policy~l_microsoftofficemachine~l_licensingsettings_l_dbs",
    "categoryId": "2e3f0407-6387-41b4-b6c2-ada4354be759",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_office16v3~policy~l_microsoftofficemachine~l_licensingsettings_l_dbs",
    "description": "This policy setting controls whether Office 365 ProPlus uses a device-based license instead of a user-based license.\r\n\r\nImportant: For eligibility requirements and configuration steps to use a device-based license with Office 365 ProPlus, see https://go.microsoft.com/fwlink/p/?linkid=2094216.\r\n\r\nIf you enable this policy setting, Office 365 ProPlus will use a device-based license instead of a user-based license.\r\n\r\nIf you disable or don’t configure this policy setting, Office 365 ProPlus will use a user-based license. Therefore, the user who signs in and activates Office must have an Office license.\r\n      ",
    "helpText": "",
    "name": "L_DBS",
    "displayName": "Use a device-based license for Office 365 ProPlus",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v3~policy~l_microsoftofficemachine~l_licensingsettings_l_dbs_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v3~policy~l_microsoftofficemachine~l_licensingsettings_l_dbs_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v3~policy~l_microsoftofficemachine~l_licensingsettings_l_dbs_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}