{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AppCompatTurnOffApplicationImpactTelemetry",
        "Turn off Application Telemetry",
        "\\Windows Components\\Application Compatibility",
        "Administrative Templates\\Windows Components\\Application Compatibility",
        "Application Compatibility"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-appcompat#admx-appcompat-appcompatturnoffapplicationimpacttelemetry"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AppCompat/AppCompatTurnOffApplicationImpactTelemetry",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_appcompat_appcompatturnoffapplicationimpacttelemetry",
    "categoryId": "0cc63077-26e9-4fbd-a343-fd88102efd7e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_appcompat_appcompatturnoffapplicationimpacttelemetry",
    "description": "The policy controls the state of the Application Telemetry engine in the system.\r\n\r\nApplication Telemetry is a mechanism that tracks anonymous usage of specific Windows system components by applications.\r\n\r\nTurning Application Telemetry off by selecting \"enable\" will stop the collection of usage data.\r\n\r\nIf the customer Experience Improvement program is turned off, Application Telemetry will be turned off regardless of how this policy is set.\r\n\r\nDisabling telemetry will take effect on any newly launched applications. To ensure that telemetry collection has stopped for all applications, please reboot your machine.\r\n ",
    "helpText": "",
    "name": "AppCompatTurnOffApplicationImpactTelemetry",
    "displayName": "Turn off Application Telemetry",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_appcompat_appcompatturnoffapplicationimpacttelemetry_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_appcompat_appcompatturnoffapplicationimpacttelemetry_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_appcompat_appcompatturnoffapplicationimpacttelemetry_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}