{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SoftwareSASGeneration",
        "Disable or enable software Secure Attention Sequence",
        "\\Windows Components\\Windows Logon Options",
        "Administrative Templates\\Windows Components\\Windows Logon Options",
        "Windows Logon Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-winlogon#admx-winlogon-softwaresasgeneration"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WinLogon/SoftwareSASGeneration",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_winlogon_softwaresasgeneration",
    "categoryId": "e9aff162-feb0-400a-aa68-8dd8deb93275",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_winlogon_softwaresasgeneration",
    "description": "This policy setting controls whether or not software can simulate the Secure Attention Sequence (SAS).\r\n\r\nIf you enable this policy setting, you have one of four options:\r\n\r\nIf you set this policy setting to \"None,\" user mode software cannot simulate the SAS.\r\nIf you set this policy setting to \"Services,\" services can simulate the SAS.\r\nIf you set this policy setting to \"Ease of Access applications,\" Ease of Access applications can simulate the SAS.\r\nIf you set this policy setting to \"Services and Ease of Access applications,\" both services and Ease of Access applications can simulate the SAS.\r\n\r\nIf you disable or do not configure this setting, only Ease of Access applications running on the secure desktop can simulate the SAS.\r\n ",
    "helpText": "",
    "name": "SoftwareSASGeneration",
    "displayName": "Disable or enable software Secure Attention Sequence",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_winlogon_softwaresasgeneration_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_winlogon_softwaresasgeneration_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_winlogon_softwaresasgeneration_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_winlogon_softwaresasgeneration_softwaresasgenerationdescription",
                    "required": true
                }
            ]
        }
    ]
}