{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get",
    "keywords": [
        " Provider ID",
        "DM Client",
        "Config Refresh"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/DMClient",
    "offsetUri": "/Provider/{0}",
    "rootDefinitionId": "device_vendor_msft_dmclient_provider_{providerid}",
    "categoryId": "80b21376-0e9a-4e5b-8a74-b672adbe94a8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_dmclient_provider_{providerid}",
    "description": "This node contains the URI-encoded value of the bootstrapped device management account’s Provider ID. Scope is dynamic. This value is set and controlled by the MDM server. As a best practice, use text that doesn’t require XML/URI escaping.",
    "helpText": "",
    "name": "{ProviderID}",
    "displayName": " Provider ID",
    "childIds": [
        "device_vendor_msft_dmclient_provider_{providerid}_providerid",
        "device_vendor_msft_dmclient_provider_{providerid}_entdevicename",
        "device_vendor_msft_dmclient_provider_{providerid}_exchangeid",
        "device_vendor_msft_dmclient_provider_{providerid}_entdmid",
        "device_vendor_msft_dmclient_provider_{providerid}_signedentdmid",
        "device_vendor_msft_dmclient_provider_{providerid}_certrenewtimestamp",
        "device_vendor_msft_dmclient_provider_{providerid}_publisherdeviceid",
        "device_vendor_msft_dmclient_provider_{providerid}_managementserviceaddress",
        "device_vendor_msft_dmclient_provider_{providerid}_upn",
        "device_vendor_msft_dmclient_provider_{providerid}_helpphonenumber",
        "device_vendor_msft_dmclient_provider_{providerid}_helpwebsite",
        "device_vendor_msft_dmclient_provider_{providerid}_helpemailaddress",
        "device_vendor_msft_dmclient_provider_{providerid}_requiremessagesigning",
        "device_vendor_msft_dmclient_provider_{providerid}_syncapplicationversion",
        "device_vendor_msft_dmclient_provider_{providerid}_aadresourceid",
        "device_vendor_msft_dmclient_provider_{providerid}_enableomadmkeepalivemessage",
        "device_vendor_msft_dmclient_provider_{providerid}_managementserveraddresslist",
        "device_vendor_msft_dmclient_provider_{providerid}_commercialid",
        "device_vendor_msft_dmclient_provider_{providerid}_managementservertoupgradeto",
        "device_vendor_msft_dmclient_provider_{providerid}_numberofdaysafterlostcontacttounenroll",
        "device_vendor_msft_dmclient_provider_{providerid}_aadsenddevicetoken",
        "device_vendor_msft_dmclient_provider_{providerid}_forceaadtoken",
        "device_vendor_msft_dmclient_provider_{providerid}_push_pfn",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_intervalforfirstsetofretries",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_numberoffirstretries",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_intervalforsecondsetofretries",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_numberofsecondretries",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_intervalforremainingscheduledretries",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_numberofremainingscheduledretries",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_pollonlogin",
        "device_vendor_msft_dmclient_provider_{providerid}_poll_alluserspollonfirstlogin",
        "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_title",
        "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_bodytext",
        "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_hyperlinkhref",
        "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_hyperlinktext",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedpolicies",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectednetworkprofiles",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedmsiapppackages",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedmodernapppackages",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedpfxcerts",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedscepcerts",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_timeoutuntilsyncfailure",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_serverhasfinishedprovisioning",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_issyncdone",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_wasdevicesuccessfullyprovisioned",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_blockinstatuspage",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_allowcollectlogsbutton",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_customerrortext",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_skipdevicestatuspage",
        "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_skipuserstatuspage",
        "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_securitymode",
        "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_usecertifrevocationcheckoffline",
        "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_cert0",
        "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_cert1",
        "device_vendor_msft_dmclient_provider_{providerid}_configlock_lock",
        "device_vendor_msft_dmclient_provider_{providerid}_configlock_unlockduration",
        "device_vendor_msft_dmclient_provider_{providerid}_linkedenrollment_discoveryendpoint",
        "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_numallowedconcurrentusersessionforbackgroundsync",
        "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_numallowedconcurrentusersessionatuserlogonsync",
        "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_intervalforscheduledretriesforusersession",
        "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_numberofscheduledretriesforusersession",
        "device_vendor_msft_dmclient_provider_{providerid}_recovery_allowrecovery",
        "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled",
        "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_cadence",
        "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_pauseperiod"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_providerid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_entdevicename",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_exchangeid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_entdmid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_signedentdmid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_certrenewtimestamp",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_publisherdeviceid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_managementserviceaddress",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_upn",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_helpphonenumber",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_helpwebsite",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_helpemailaddress",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_requiremessagesigning",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_syncapplicationversion",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_aadresourceid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_enableomadmkeepalivemessage",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_managementserveraddresslist",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_commercialid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_managementservertoupgradeto",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_numberofdaysafterlostcontacttounenroll",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_aadsenddevicetoken",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_forceaadtoken",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_push_pfn",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_intervalforfirstsetofretries",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_numberoffirstretries",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_intervalforsecondsetofretries",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_numberofsecondretries",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_intervalforremainingscheduledretries",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_numberofremainingscheduledretries",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_pollonlogin",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_poll_alluserspollonfirstlogin",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_title",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_bodytext",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_hyperlinkhref",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_customenrollmentcompletepage_hyperlinktext",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedpolicies",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectednetworkprofiles",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedmsiapppackages",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedmodernapppackages",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedpfxcerts",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_expectedscepcerts",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_timeoutuntilsyncfailure",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_serverhasfinishedprovisioning",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_issyncdone",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_wasdevicesuccessfullyprovisioned",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_blockinstatuspage",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_allowcollectlogsbutton",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_customerrortext",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_skipdevicestatuspage",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_firstsyncstatus_skipuserstatuspage",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_securitymode",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_usecertifrevocationcheckoffline",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_cert0",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_enhancedapplayersecurity_cert1",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_configlock_lock",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_configlock_unlockduration",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_linkedenrollment_discoveryendpoint",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_numallowedconcurrentusersessionforbackgroundsync",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_numallowedconcurrentusersessionatuserlogonsync",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_intervalforscheduledretriesforusersession",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_multiplesession_numberofscheduledretriesforusersession",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_recovery_allowrecovery",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_cadence",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_pauseperiod",
            "required": false
        }
    ]
}