{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "MaxConcurrentUsers",
        "MaxConcurrentUsers",
        "\\Windows Components\\Windows Remote Shell",
        "Administrative Templates\\Windows Components\\Windows Remote Shell",
        "Windows Remote Shell"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-remoteshell#remoteshell-maxconcurrentusers"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteShell/MaxConcurrentUsers",
    "rootDefinitionId": "device_vendor_msft_policy_config_remoteshell_maxconcurrentusers",
    "categoryId": "1219a9c2-dccb-445f-9f90-8e86e2de22d6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_remoteshell_maxconcurrentusers",
    "description": "This policy setting configures the maximum number of users able to concurrently perform remote shell operations on the system.\r\n\r\nThe value can be any  number from 1 to 100.\r\n\r\nIf you enable this policy setting, the new shell connections are rejected if they exceed the specified limit.\r\n\r\nIf you disable or do not configure this policy setting, the default number is five users.",
    "helpText": "",
    "name": "MaxConcurrentUsers",
    "displayName": "MaxConcurrentUsers",
    "defaultOptionId": "device_vendor_msft_policy_config_remoteshell_maxconcurrentusers_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_remoteshell_maxconcurrentusers_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remoteshell_maxconcurrentusers_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_remoteshell_maxconcurrentusers_maxconcurrentusers",
                    "required": true
                }
            ]
        }
    ]
}