{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Passwordless Experience",
        "Authentication"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Authentication#enablepasswordlessexperience"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Authentication/EnablePasswordlessExperience",
    "rootDefinitionId": "device_vendor_msft_policy_config_authentication_enablepasswordlessexperience",
    "categoryId": "a79b2d36-7dea-4a84-81ef-27f99296bccf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_authentication_enablepasswordlessexperience",
    "description": "Specifies whether connected users on AADJ devices receive a Passwordless experience on Windows\r\n ",
    "helpText": "",
    "name": "EnablePasswordlessExperience",
    "displayName": "Enable Passwordless Experience",
    "defaultOptionId": "device_vendor_msft_policy_config_authentication_enablepasswordlessexperience_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22631.2506",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablepasswordlessexperience_0",
            "description": "The feature defaults to the existing edition and device capabilities.",
            "helpText": null,
            "name": "The feature defaults to the existing edition and device capabilities.",
            "displayName": "The feature defaults to the existing edition and device capabilities.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablepasswordlessexperience_1",
            "description": "Enabled. The Passwordless experience will be enabled on Windows",
            "helpText": null,
            "name": "Enabled. The Passwordless experience will be enabled on Windows",
            "displayName": "Enabled. The Passwordless experience will be enabled on Windows",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablepasswordlessexperience_2",
            "description": "Disabled. The Passwordless experience will not be enabled on Windows",
            "helpText": null,
            "name": "Disabled. The Passwordless experience will not be enabled on Windows",
            "displayName": "Disabled. The Passwordless experience will not be enabled on Windows",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}