{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DCBatteryDischargeAction1_2",
        "Low battery notification action",
        "\\System\\Power Management\\Notification Settings",
        "Administrative Templates\\System\\Power Management\\Notification Settings",
        "Notification Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/DCBatteryDischargeAction1_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2",
    "categoryId": "d5585700-13a0-4ab4-9b19-4c15c1ead170",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_selectdcbatterydischargeaction1",
    "description": null,
    "helpText": "",
    "name": "SelectDCBatteryDischargeAction1",
    "displayName": "Low Battery Notification Action (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_selectdcbatterydischargeaction1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_selectdcbatterydischargeaction1_0",
            "description": null,
            "helpText": null,
            "name": "Take no action",
            "displayName": "Take no action",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_selectdcbatterydischargeaction1_1",
            "description": null,
            "helpText": null,
            "name": "Sleep",
            "displayName": "Sleep",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_selectdcbatterydischargeaction1_2",
            "description": null,
            "helpText": null,
            "name": "Hibernate",
            "displayName": "Hibernate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_selectdcbatterydischargeaction1_3",
            "description": null,
            "helpText": null,
            "name": "Shut down",
            "displayName": "Shut down",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargeaction1_2"
                }
            ],
            "dependedOnBy": []
        }
    ]
}