{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_UpdateBlockVersion",
        "Prevent Office from being updated to a specific version",
        "\\Microsoft Office 2016 (Machine)\\Updates",
        "Microsoft Office 2016 (Machine)\\Updates",
        "Updates"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_Updates/L_UpdateBlockVersion",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_updateblockversion",
    "categoryId": "86dae9f9-7eb1-4566-8558-b63fa2e20fee",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_updateblockversion",
    "description": "\r\n            This policy setting allows you to prevent Office from being updated to a specific version, and instead have Office be updated to a different version that you specify.\r\n\r\n            If you enable this policy setting, you need to specify both the version to block and the version to update Office to. You list the version to block first and separate the two versions with a colon. You can specify more than one version to block by separating the entries with a vertical bar.\r\n\r\n            For example, if you want to block versions 16.0.10326.10000 and 16.0.10326.20000 and have Office updated to version 16.0.10328.10000 instead, you would enter 16.0.10326.10000:16.0.10328.10000|16.0.10326.20000:16.0.10328.10000.\r\n\r\n            If the blocked version is already installed, Office will be updated to the other version you've specified.\r\n\r\n            Note: if you make a mistake entering the versions, the update won't be blocked. Also, be sure that the installation files for the version that you want to update Office to are available on the update location.\r\n\r\n            If you disable or don't configure this policy setting, Office will be updated to whichever more current version is available in the location where Office is configured to get updates from, unless youve specified a version to block by using the Office Deployment Tool.\r\n\r\n            Note: This policy setting only applies to Office products that are installed by using Click-to-Run. It doesn't apply to Office products that use Windows Installer (MSI).",
    "helpText": "",
    "name": "L_UpdateBlockVersion",
    "displayName": "Prevent Office from being updated to a specific version",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_updateblockversion_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_updateblockversion_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_updateblockversion_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_updateblockversion_l_updateblockversionid",
                    "required": true
                }
            ]
        }
    ]
}