{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Force Instant Wake",
        "Human Presence"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-HumanPresence#humanpresence-forceinstantwake"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/HumanPresence/ForceInstantWake",
    "rootDefinitionId": "device_vendor_msft_policy_config_humanpresence_forceinstantwake",
    "categoryId": "a77e6e83-a02e-4a51-a27e-6437ea42aeb5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_humanpresence_forceinstantwake",
    "description": "Determines whether Wake on Arrival is forced on/off by the MDM policy. The user will not be able to change this setting and the toggle in the UI will be greyed out.",
    "helpText": "",
    "name": "ForceInstantWake",
    "displayName": "Force Instant Wake",
    "defaultOptionId": "device_vendor_msft_policy_config_humanpresence_forceinstantwake_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forceinstantwake_2",
            "description": "ForcedOff.",
            "helpText": null,
            "name": "ForcedOff.",
            "displayName": "Forced Off.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forceinstantwake_1",
            "description": "ForcedOn.",
            "helpText": null,
            "name": "ForcedOn.",
            "displayName": "Forced On.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_humanpresence_forceinstantwake_0",
            "description": "DefaultToUserChoice.",
            "helpText": null,
            "name": "DefaultToUserChoice.",
            "displayName": "Default To User Choice.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}