{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow VPN Over Cellular",
        "Connectivity"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-connectivity#allowvpnovercellular"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Connectivity/AllowVPNOverCellular",
    "rootDefinitionId": "device_vendor_msft_policy_config_connectivity_allowvpnovercellular",
    "categoryId": "f03f9f2f-f8ba-4c94-ad5f-95ada256c8c6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_connectivity_allowvpnovercellular",
    "description": "Specifies what type of underlying connections VPN is allowed to use. Most restricted value is 0.",
    "helpText": "",
    "name": "AllowVPNOverCellular",
    "displayName": "Allow VPN Over Cellular",
    "defaultOptionId": "device_vendor_msft_policy_config_connectivity_allowvpnovercellular_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_connectivity_allowvpnovercellular_0",
            "description": "VPN is not allowed over cellular.",
            "helpText": null,
            "name": "VPN is not allowed over cellular.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_connectivity_allowvpnovercellular_1",
            "description": "VPN can use any connection, including cellular.",
            "helpText": null,
            "name": "VPN can use any connection, including cellular.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}