{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_DefaultRemoveDesktopShortcut",
        "Remove Desktop Shortcuts upon update default",
        "\\Microsoft Edge Update\\Applications",
        "Microsoft Edge Update\\Applications",
        "Applications"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev127~Policy~Cat_EdgeUpdate~Cat_Applications/Pol_DefaultRemoveDesktopShortcut",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut",
    "categoryId": "2c7e8e8e-47fe-48ba-8cb4-55ce296edced",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_part_removedesktopshortcut",
    "description": "",
    "helpText": "",
    "name": "Part_RemoveDesktopShortcut",
    "displayName": "",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_part_removedesktopshortcut_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_part_removedesktopshortcut_1",
            "description": null,
            "helpText": null,
            "name": "Force delete system-level Desktop Shortcuts",
            "displayName": "Force delete system-level Desktop Shortcuts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_part_removedesktopshortcut_2",
            "description": null,
            "helpText": null,
            "name": "Force delete system-level and user-level Desktop Shortcuts",
            "displayName": "Force delete system-level and user-level Desktop Shortcuts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_part_removedesktopshortcut_0",
            "description": null,
            "helpText": null,
            "name": "Prevent Desktop Shortcut creation on install",
            "displayName": "Prevent Desktop Shortcut creation on install",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev127~policy~cat_edgeupdate~cat_applications_pol_defaultremovedesktopshortcut"
                }
            ],
            "dependedOnBy": []
        }
    ]
}