{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "POL_AdmPwd",
        "Password Settings",
        "\\LAPS",
        "Administrative Templates\\LAPS",
        "LAPS"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AdmPwd/POL_AdmPwd",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd",
    "categoryId": "b3b2fc04-4b88-4a1c-8370-04573019eebe",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_elm_admpwd_passwordcomplexity",
    "description": "",
    "helpText": "",
    "name": "ELM_AdmPwd_PasswordComplexity",
    "displayName": "Password Complexity (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_elm_admpwd_passwordcomplexity_4",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_elm_admpwd_passwordcomplexity_1",
            "description": null,
            "helpText": null,
            "name": "Large letters",
            "displayName": "Large letters",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_elm_admpwd_passwordcomplexity_2",
            "description": null,
            "helpText": null,
            "name": "Large letters + small letters",
            "displayName": "Large letters + small letters",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_elm_admpwd_passwordcomplexity_3",
            "description": null,
            "helpText": null,
            "name": "Large letters + small letters + numbers",
            "displayName": "Large letters + small letters + numbers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_elm_admpwd_passwordcomplexity_4",
            "description": null,
            "helpText": null,
            "name": "Large letters + small letters + numbers + specials",
            "displayName": "Large letters + small letters + numbers + specials",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_admpwd_pol_admpwd"
                }
            ],
            "dependedOnBy": []
        }
    ]
}