{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "trv2_payload",
        "Cloud Policy Details",
        "\\Windows Components\\Tenant Restrictions",
        "Administrative Templates\\Windows Components\\Tenant Restrictions",
        "Tenant Restrictions"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-tenantrestrictions#tenantrestrictions-configuretenantrestrictions"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/TenantRestrictions/ConfigureTenantRestrictions",
    "rootDefinitionId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions",
    "categoryId": "1638d9ec-63d5-4d6b-b1b6-4b0402268e36",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions",
    "description": "This setting enables and configures the device-based tenant restrictions feature for Azure Active Directory.\r\n\r\nWhen you enable this setting, compliant applications will be prevented from accessing disallowed tenants, according to a policy set in your Azure AD tenant.\r\n\r\nNote: Creation of a policy in your home tenant is required, and additional security measures for managed devices are recommended for best protection. Refer to Azure AD Tenant Restrictions for more details.\r\n\r\nhttps://go.microsoft.com/fwlink/?linkid=2148762\r\n\r\nBefore enabling firewall protection, ensure that a Windows Defender Application Control (WDAC) policy that correctly tags applications has been applied to the target devices. Enabling firewall protection without a corresponding WDAC policy will prevent all applications from reaching Microsoft endpoints. This firewall setting is not supported on all versions of Windows - see the following link for more information. \r\nFor details about setting up WDAC with tenant restrictions, see https://go.microsoft.com/fwlink/?linkid=2155230",
    "helpText": "",
    "name": "trv2_payload",
    "displayName": "Cloud Policy Details",
    "defaultOptionId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1320",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_payloadcloudid",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_payloadtenantid",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_payloadpolicyid",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_enforcefirewall",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_payloadhostnamesid",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_payloadsubdomainsupportedhostnamesid",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_tenantrestrictions_configuretenantrestrictions_payloadiprangesid",
                    "required": true
                }
            ]
        }
    ]
}