{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ApplicationGuardUploadBlockingEnabled",
        "Prevents files from being uploaded while in Application Guard",
        "\\Microsoft Edge\\Application Guard settings",
        "Microsoft Edge\\Application Guard settings",
        "Application Guard settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev96~Policy~microsoft_edge~ApplicationGuard/ApplicationGuardUploadBlockingEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~applicationguard_applicationguarduploadblockingenabled",
    "categoryId": "5bd0eaf1-1818-44e8-9168-fc75c5739cc8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~applicationguard_applicationguarduploadblockingenabled",
    "description": "Sets whether files can be uploaded while in Application Guard.\r\n\r\nIf you enable this policy, users will not be able to upload files in Application Guard.\r\n\r\nIf you disable or don't configure this policy, users will be able to upload files while in Application Guard.",
    "helpText": "",
    "name": "ApplicationGuardUploadBlockingEnabled",
    "displayName": "Prevents files from being uploaded while in Application Guard",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~applicationguard_applicationguarduploadblockingenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~applicationguard_applicationguarduploadblockingenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~applicationguard_applicationguarduploadblockingenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}