{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Hide Exclusions From Local Admins",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Defender-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Defender",
    "offsetUri": "/Configuration/HideExclusionsFromLocalAdmins",
    "rootDefinitionId": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins",
    "description": "This policy setting controls whether or not exclusions are visible to local admins. To control local users exlcusions visibility use HideExclusionsFromLocalUsers. If HideExclusionsFromLocalAdmins is set then HideExclusionsFromLocalUsers will be implicitly set.",
    "helpText": "",
    "name": "HideExclusionsFromLocalAdmins",
    "displayName": "Hide Exclusions From Local Admins",
    "defaultOptionId": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.3",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins_1",
            "description": "If you enable this setting, local admins will no longer be able to see the exclusion list in Windows Security App or via PowerShell.",
            "helpText": null,
            "name": "If you enable this setting, local admins will no longer be able to see the exclusion list in Windows Security App or via PowerShell.",
            "displayName": "If you enable this setting, local admins will no longer be able to see the exclusion list in Windows Security App or via PowerShell.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins_0",
            "description": "If you disable or do not configure this setting, local admins will be able to see exclusions in the Windows Security App and via PowerShell.",
            "helpText": null,
            "name": "If you disable or do not configure this setting, local admins will be able to see exclusions in the Windows Security App and via PowerShell.",
            "displayName": "If you disable or do not configure this setting, local admins will be able to see exclusions in the Windows Security App and via PowerShell.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}