{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExploitGuard_ASR_Rules",
        "Configure Attack Surface Reduction rules",
        "\\Windows Components\\Microsoft Defender Antivirus\\Microsoft Defender Exploit Guard\\Attack Surface Reduction",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Microsoft Defender Exploit Guard\\Attack Surface Reduction",
        "Attack Surface Reduction"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-microsoftdefenderantivirus#admx-microsoftdefenderantivirus-exploitguard-asr-rules"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/ExploitGuard_ASR_Rules",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_rules",
    "categoryId": "07221402-6a9c-4440-ae6f-3217ce5ad8fd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_rules",
    "description": "\r\n    Set the state for each Attack Surface Reduction (ASR) rule.\r\n\r\n    After enabling this setting, you can set each rule to the following in the Options section:\r\n    - Block: the rule will be applied\r\n    - Audit Mode: if the rule would normally cause an event, then it will be recorded (although the rule will not actually be applied)\r\n    - Off: the rule will not be applied\r\n    - Not Configured: the rule is enabled with default values\r\n    - Warn: the rule will be applied and the end-user will have the option to bypass the block\r\n\r\n    Unless the ASR rule is disabled, a subsample of audit events are collected for ASR rules will the value of not configured.\r\n\r\n    Enabled:\r\n    Specify the state for each ASR rule under the Options section for this setting.\r\n    Enter each rule on a new line as a name-value pair:\r\n    - Name column: Enter a valid ASR rule ID\r\n    - Value column: Enter the status ID that relates to state you want to specify for the associated rule\r\n\r\n    The following status IDs are permitted under the value column:\r\n    - 1 (Block)\r\n    - 0 (Off)\r\n    - 2 (Audit)\r\n    - 5 (Not Configured)\r\n    - 6 (Warn)\r\n\r\n    \r\n    Example:\r\n    xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx            0\r\n    xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx            1\r\n    xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx            2\r\n\r\n    Disabled:\r\n    No ASR rules will be configured.\r\n\r\n    Not configured:\r\n    Same as Disabled.\r\n\r\n    You can exclude folders or files in the \"Exclude files and paths from Attack Surface Reduction Rules\" GP setting.\r\n    \r\n ",
    "helpText": "",
    "name": "ExploitGuard_ASR_Rules",
    "displayName": "Configure Attack Surface Reduction rules",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_rules_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_rules_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_rules_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_rules_exploitguard_asr_rules",
                    "required": true
                }
            ]
        }
    ]
}