{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Netlogon_LdapSrvPriority",
        "Set Priority in the DC Locator DNS SRV records",
        "\\System\\Net Logon\\DC Locator DNS Records",
        "Administrative Templates\\System\\Net Logon\\DC Locator DNS Records",
        "DC Locator DNS Records"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Netlogon/Netlogon_LdapSrvPriority",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_ldapsrvpriority",
    "categoryId": "7f4d325e-bff8-4d91-8313-614243e55e6d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_netlogon_netlogon_ldapsrvpriority_netlogon_ldapsrvprioritylabel",
    "description": null,
    "helpText": "",
    "name": "Netlogon_LdapSrvPriorityLabel",
    "displayName": "Priority: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 65535,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_netlogon_netlogon_ldapsrvpriority_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_netlogon_netlogon_ldapsrvpriority"
        }
    ],
    "dependedOnBy": []
}