{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Moving Platform",
        "Mixed Reality"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-MixedReality#configuremovingplatform"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/MixedReality/ConfigureMovingPlatform",
    "rootDefinitionId": "device_vendor_msft_policy_config_mixedreality_configuremovingplatform",
    "categoryId": "f10138ba-123a-43bc-8031-4458ba327374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_mixedreality_configuremovingplatform",
    "description": "This policy controls the behavior of moving platform feature on HoloLens 2, that is, whether it’s turned off / on or it can be toggled by a user. It should only be used by customers who intend to use HoloLens 2 in moving environments with low dynamic motion. Please refer to HoloLens 2 Moving Platform Mode for background information.",
    "helpText": "",
    "name": "ConfigureMovingPlatform",
    "displayName": "Configure Moving Platform",
    "defaultOptionId": "device_vendor_msft_policy_config_mixedreality_configuremovingplatform_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.20348",
        "windowsSkus": [
            "holographicForBusiness"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_configuremovingplatform_0",
            "description": "Last set user's preference. Initial state is OFF and after that user's preference is persisted across reboots and is used to initialize the system.",
            "helpText": null,
            "name": "Last set user's preference. Initial state is OFF and after that user's preference is persisted across reboots and is used to initialize the system.",
            "displayName": "Last set user's preference. Initial state is OFF and after that user's preference is persisted across reboots and is used to initialize the system.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_configuremovingplatform_1",
            "description": "Moving platform is disabled and cannot be changed by user.",
            "helpText": null,
            "name": "Moving platform is disabled and cannot be changed by user.",
            "displayName": "Moving platform is disabled and cannot be changed by user.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_configuremovingplatform_2",
            "description": "Moving platform is enabled and cannot be changed by user.",
            "helpText": null,
            "name": "Moving platform is enabled and cannot be changed by user.",
            "displayName": "Moving platform is enabled and cannot be changed by user.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}