{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceInstall_Instance_IDs_Allow",
        "Allow installation of devices that match any of these device instance IDs",
        "\\System\\Device Installation\\Device Installation Restrictions",
        "Administrative Templates\\System\\Device Installation\\Device Installation Restrictions",
        "Device Installation Restrictions"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeviceInstallation/AllowInstallationOfMatchingDeviceInstanceIDs",
    "rootDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids",
    "categoryId": "979412d7-6716-440c-9a64-5889026d73da",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids_deviceinstall_instance_ids_allow_list",
    "description": "",
    "helpText": "",
    "name": "DeviceInstall_Instance_IDs_Allow_List",
    "displayName": "Allowed Instance IDs",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids_1",
            "parentSettingId": "device_vendor_msft_policy_config_deviceinstallation_allowinstallationofmatchingdeviceinstanceids"
        }
    ],
    "dependedOnBy": []
}