{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password Expiration Protection Enabled",
        "LAPS"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/LAPS-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/LAPS",
    "offsetUri": "/Policies/PasswordExpirationProtectionEnabled",
    "rootDefinitionId": "device_vendor_msft_laps_policies_backupdirectory",
    "categoryId": "f1dcf7b6-2d89-41bf-b5eb-02a879c6db5d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_laps_policies_passwordexpirationprotectionenabled",
    "description": "Use this setting to configure additional enforcement of maximum password age for the managed local administrator account.\n\nWhen this setting is enabled, planned password expiration that would result in a password age greater than that dictated by \"PasswordAgeDays\" policy is NOT allowed. When such expiration is detected, the password is changed immediately and the new password expiration date is set according to policy.\n\nIf not specified, this setting defaults to True.\r\n ",
    "helpText": "",
    "name": "PasswordExpirationProtectionEnabled",
    "displayName": "Password Expiration Protection Enabled",
    "defaultOptionId": "device_vendor_msft_laps_policies_passwordexpirationprotectionenabled_true",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763.4244",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_laps_policies_passwordexpirationprotectionenabled_false",
            "description": "Allow configured password expiriration timestamp to exceed maximum password age",
            "helpText": null,
            "name": "Allow configured password expiriration timestamp to exceed maximum password age",
            "displayName": "Allow configured password expiriration timestamp to exceed maximum password age",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_laps_policies_backupdirectory_2",
                    "parentSettingId": "device_vendor_msft_laps_policies_backupdirectory"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_passwordexpirationprotectionenabled_true",
            "description": "Do not allow configured password expiriration timestamp to exceed maximum password age",
            "helpText": null,
            "name": "Do not allow configured password expiriration timestamp to exceed maximum password age",
            "displayName": "Do not allow configured password expiriration timestamp to exceed maximum password age",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_laps_policies_backupdirectory_2",
                    "parentSettingId": "device_vendor_msft_laps_policies_backupdirectory"
                }
            ],
            "dependedOnBy": []
        }
    ]
}