{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AutomaticFullscreenBlockedForUrls",
        "Block automatic full screen on specified sites",
        "\\Microsoft Edge\\Content settings",
        "Microsoft Edge\\Content settings",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev132~Policy~microsoft_edge~ContentSettings/AutomaticFullscreenBlockedForUrls",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~contentsettings_automaticfullscreenblockedforurls",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~contentsettings_automaticfullscreenblockedforurls",
    "description": "For security reasons, the\r\nrequestFullscreen() web API\r\nrequires a prior user gesture (\"transient activation\") to be called or it will\r\nfail. Users' personal settings may allow certain origins to call this API\r\nwithout a prior user gesture.\r\n\r\nThis policy supersedes users' personal settings and blocks matching origins\r\nfrom calling the API without a prior user gesture.\r\n\r\nFor detailed information about valid URL patterns, see https://go.microsoft.com/fwlink/?linkid=2095322.\r\nWildcards (*) are allowed.\r\n\r\nOrigins matching both blocked and allowed policy patterns will be blocked.\r\nOrigins not specified by policy or user settings will require a prior user\r\ngesture to call this API.\r\n\r\nExample value:\r\n\r\nhttps://www.example.com\r\n[*.]example.edu",
    "helpText": "",
    "name": "AutomaticFullscreenBlockedForUrls",
    "displayName": "Block automatic full screen on specified sites",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~contentsettings_automaticfullscreenblockedforurls_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~contentsettings_automaticfullscreenblockedforurls_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~contentsettings_automaticfullscreenblockedforurls_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~contentsettings_automaticfullscreenblockedforurls_automaticfullscreenblockedforurlsdesc",
                    "required": true
                }
            ]
        }
    ]
}