{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "end time",
        "endtime",
        "Certain Hours"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsDaily",
    "offsetUri": "/EndTime",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
    "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_endtime",
    "description": null,
    "helpText": null,
    "name": "EndTime",
    "displayName": "End time",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
        "description": null,
        "platform": "android,iOS",
        "deviceMode": "none",
        "technologies": "exchangeOnline"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "time",
        "inputValidationSchema": null,
        "maximumLength": 1024,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": "07:00:00"
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1",
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily"
        }
    ],
    "dependedOnBy": []
}