{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_externalConverterAsDefaultForFileExtensionPPT",
        "Turn on an external converter as the default for a file extension",
        "\\Microsoft PowerPoint 2016 (Machine)\\Converters",
        "Microsoft PowerPoint 2016 (Machine)\\Converters",
        "Converters"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ppt16v2~Policy~L_MicrosoftOfficePowerPointMachine~L_ConvertersMachinePPT/L_externalConverterAsDefaultForFileExtensionPPT",
    "rootDefinitionId": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt",
    "categoryId": "686ae3dd-a663-4484-854e-8f8d578fe3b8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_l_listofexternalconvertersppt",
    "description": "",
    "helpText": "",
    "name": "L_listOfExternalConvertersPPT",
    "displayName": "List of external file format converters to customize (Device)",
    "childIds": [
        "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_l_listofexternalconvertersppt_key",
        "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_l_listofexternalconvertersppt_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_1",
            "parentSettingId": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_l_listofexternalconvertersppt_key",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpointmachine~l_convertersmachineppt_l_externalconverterasdefaultforfileextensionppt_l_listofexternalconvertersppt_value",
            "required": true
        }
    ]
}