{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableListSync",
        "Disables Lists sync on this device.",
        "\\List Sync",
        "List Sync"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv6~Policy~NucleusListSync/DisableListSync",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv6~policy~nucleuslistsync_disablelistsync",
    "categoryId": "7fc23813-7a7c-412a-b9bd-eda07e6b1f5d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_onedrivengscv6~policy~nucleuslistsync_disablelistsync",
    "description": "\r\n     By default, Lists sync is turned on for users of Microsoft Lists. If you enable this policy, Lists sync will be blocked from running on the device.\r\n\r\n     ",
    "helpText": "",
    "name": "DisableListSync",
    "displayName": "Disables Lists sync on this device.",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv6~policy~nucleuslistsync_disablelistsync_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv6~policy~nucleuslistsync_disablelistsync_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv6~policy~nucleuslistsync_disablelistsync_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}