{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_LICENSING_MODE",
        "Set the Remote Desktop licensing mode",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Licensing",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Licensing",
        "Licensing"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_LICENSING_MODE",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode",
    "categoryId": "8778eb21-bf7c-41a7-bae1-412c0e3029db",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_ts_licensing_name",
    "description": "\r\n This setting is only available to Windows Insiders.\r\n ",
    "helpText": "",
    "name": "TS_LICENSING_NAME",
    "displayName": "Specify the licensing mode for the RD Session Host server. (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_ts_licensing_name_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_ts_licensing_name_2",
            "description": null,
            "helpText": null,
            "name": "Per Device",
            "displayName": "Per Device",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_ts_licensing_name_4",
            "description": null,
            "helpText": null,
            "name": "Per User",
            "displayName": "Per User",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_ts_licensing_name_6",
            "description": null,
            "helpText": null,
            "name": "AAD Per User",
            "displayName": "AAD Per User",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_licensing_mode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}