{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Reporting_Server_Policy",
        "Reporting Server",
        "\\System\\App-V\\Reporting",
        "AppVirtualization",
        "App Virtualization",
        "Reporting"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/AllowReportingServer",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver",
    "categoryId": "48f508a5-5a2c-4d20-8d89-2d352a209907",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_reporting_server_url_prompt",
    "description": "",
    "helpText": "",
    "name": "Reporting_Server_URL_Prompt",
    "displayName": "Reporting Server URL",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_1",
            "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver"
        }
    ],
    "dependedOnBy": []
}