{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableScripts",
        "Turn on Script Execution",
        "\\Windows Components\\Windows PowerShell",
        "Administrative Templates\\Windows Components\\Windows PowerShell",
        "Windows PowerShell"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PowerShellExecutionPolicy/EnableScripts",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts",
    "categoryId": "5a92aaed-3c64-4074-bacf-91dc1896d6f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_executionpolicy",
    "description": null,
    "helpText": "",
    "name": "ExecutionPolicy",
    "displayName": "Execution Policy (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_executionpolicy_allsigned",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_executionpolicy_allsigned",
            "description": null,
            "helpText": null,
            "name": "Allow only signed scripts",
            "displayName": "Allow only signed scripts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AllSigned"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_executionpolicy_remotesigned",
            "description": null,
            "helpText": null,
            "name": "Allow local scripts and remote signed scripts",
            "displayName": "Allow local scripts and remote signed scripts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "RemoteSigned"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_executionpolicy_unrestricted",
            "description": null,
            "helpText": null,
            "name": "Allow all scripts",
            "displayName": "Allow all scripts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Unrestricted"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_powershellexecutionpolicy_enablescripts"
                }
            ],
            "dependedOnBy": []
        }
    ]
}