{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "QosServiceTypeControlledLoad_C",
        "Controlled load service type",
        "\\Network\\QoS Packet Scheduler\\DSCP value of conforming packets",
        "Administrative Templates\\Network\\QoS Packet Scheduler\\DSCP value of conforming packets",
        "DSCP value of conforming packets"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_QOS/QosServiceTypeControlledLoad_C",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_qos_qosservicetypecontrolledload_c",
    "categoryId": "3426ef3d-40f5-474e-a493-4a1545c62348",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_qos_qosservicetypecontrolledload_c_qosdscpvalue",
    "description": null,
    "helpText": "",
    "name": "QosDSCPValue",
    "displayName": "DSCP value: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 63,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 24
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_qos_qosservicetypecontrolledload_c_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_qos_qosservicetypecontrolledload_c"
        }
    ],
    "dependedOnBy": []
}