{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableAppSyncSettingSync",
        "Do not sync Apps",
        "\\Windows Components\\Sync your settings",
        "Administrative Templates\\Windows Components\\Sync your settings",
        "Sync your settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-settingsync#admx-settingsync-disableappsyncsettingsync"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_SettingSync/DisableAppSyncSettingSync",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_settingsync_disableappsyncsettingsync",
    "categoryId": "7574a907-5608-491f-8011-c57d487457f4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_settingsync_disableappsyncsettingsync",
    "description": "\r\n        Prevent the \"AppSync\" group from syncing to and from this PC.  This turns off and disables the \"AppSync\" group on the \"sync your settings\" page in PC settings.\r\n\r\nIf you enable this policy setting, the \"AppSync\" group will not be synced.\r\n\r\nUse the option \"Allow users to turn app syncing on\" so that syncing it turned off by default but not disabled.\r\n\r\nIf you do not set or disable this setting, syncing of the \"AppSync\" group is on by default and configurable by the user.\r\n      \r\n ",
    "helpText": "",
    "name": "DisableAppSyncSettingSync",
    "displayName": "Do not sync Apps",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_settingsync_disableappsyncsettingsync_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_settingsync_disableappsyncsettingsync_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_settingsync_disableappsyncsettingsync_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_settingsync_disableappsyncsettingsync_checkbox_useroverride",
                    "required": true
                }
            ]
        }
    ]
}