{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExploitGuard_ASR_ASROnlyExclusions",
        "Exclude files and paths from Attack Surface Reduction Rules",
        "\\Windows Components\\Microsoft Defender Antivirus\\Microsoft Defender Exploit Guard\\Attack Surface Reduction",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Microsoft Defender Exploit Guard\\Attack Surface Reduction",
        "Attack Surface Reduction"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-microsoftdefenderantivirus#admx-microsoftdefenderantivirus-exploitguard-asr-asronlyexclusions"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/ExploitGuard_ASR_ASROnlyExclusions",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_asronlyexclusions",
    "categoryId": "07221402-6a9c-4440-ae6f-3217ce5ad8fd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_asronlyexclusions",
    "description": "\r\n    Exclude files and paths from Attack Surface Reduction (ASR) rules.\r\n\r\n    Enabled:\r\n    Specify the folders or files and resources that should be excluded from ASR rules in the Options section.\r\n    Enter each rule on a new line as a name-value pair:\r\n    - Name column: Enter a folder path or a fully qualified resource name. For example, \"C:\\Windows\" will exclude all files in that directory. \"C:\\Windows\\App.exe\" will exclude only that specific file in that specific folder\r\n    - Value column: Enter \"0\" for each item\r\n\r\n    Disabled:\r\n    No exclusions will be applied to the ASR rules.\r\n\r\n    Not configured:\r\n    Same as Disabled.\r\n\r\n    You can configure ASR rules in the Configure Attack Surface Reduction rules GP setting.\r\n    \r\n ",
    "helpText": "",
    "name": "ExploitGuard_ASR_ASROnlyExclusions",
    "displayName": "Exclude files and paths from Attack Surface Reduction Rules",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_asronlyexclusions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_asronlyexclusions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_asronlyexclusions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_asr_asronlyexclusions_exploitguard_asr_asronlyexclusions",
                    "required": true
                }
            ]
        }
    ]
}