{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Recovery Password Rotation",
        "BitLocker"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/BitLocker-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/ConfigureRecoveryPasswordRotation",
    "rootDefinitionId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation",
    "categoryId": "0a1347d2-90c0-407a-baa0-e4859260532a",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation",
    "description": " Allows Admin to configure Numeric Recovery Password Rotation upon use for OS and fixed drives on AAD and Hybrid domain joined devices.\n                          When not configured, Rotation is turned on by default for AAD only and off on Hybrid. The Policy will be effective only when \n                          Active Directory back up for recovery password is configured to required.\n                          For OS drive: Turn on \"Do not enable Bitlocker until recovery information is stored to AD DS for operating system drives\"\n                          For Fixed drives: Turn on \"Do not enable Bitlocker until recovery information is stored to AD DS for fixed data drives\"\n                       \n                          Supported Values: 0 - Numeric Recovery Passwords rotation OFF.\n                                            1 - Numeric Recovery Passwords Rotation upon use ON for AAD joined devices. Default value\n                                            2 - Numeric Recovery Passwords Rotation upon use ON for both AAD and Hybrid devices\n                         \n                         If you want to disable this policy use the following SyncML:\n \n                         112./Device/Vendor/MSFT/BitLocker/ConfigureRecoveryPasswordRotationint0",
    "helpText": "",
    "name": "ConfigureRecoveryPasswordRotation",
    "displayName": "Configure Recovery Password Rotation",
    "defaultOptionId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18363",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_0",
            "description": "Refresh off (default)",
            "helpText": null,
            "name": "Refresh off (default)",
            "displayName": "Refresh off (default)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_1",
            "description": "Refresh on for Azure AD-joined devices",
            "helpText": null,
            "name": "Refresh on for Azure AD-joined devices",
            "displayName": "Refresh on for Azure AD-joined devices",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_2",
            "description": "Refresh on for both Azure AD-joined and hybrid-joined devices",
            "helpText": null,
            "name": "Refresh on for both Azure AD-joined and hybrid-joined devices",
            "displayName": "Refresh on for both Azure AD-joined and hybrid-joined devices",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}