{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password Complexity",
        "LAPS"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/LAPS-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/LAPS",
    "offsetUri": "/Policies/PasswordComplexity",
    "rootDefinitionId": "device_vendor_msft_laps_policies_passwordcomplexity",
    "categoryId": "f1dcf7b6-2d89-41bf-b5eb-02a879c6db5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "device_vendor_msft_laps_policies_passwordcomplexity",
    "description": "Use this setting to configure password complexity of the managed local administrator account.\n\nThe allowable settings are:\n\n1=Large letters\n2=Large letters + small letters\n3=Large letters + small letters + numbers\n4=Large letters + small letters + numbers + special characters\n\nIf not specified, this setting will default to 4.\r\n ",
    "helpText": "",
    "name": "PasswordComplexity",
    "displayName": "Password Complexity",
    "defaultOptionId": "device_vendor_msft_laps_policies_passwordcomplexity_4",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763.4244",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_laps_policies_passwordcomplexity_1",
            "description": "Large letters",
            "helpText": null,
            "name": "Large letters",
            "displayName": "Large letters",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_passwordcomplexity_2",
            "description": "Large letters + small letters",
            "helpText": null,
            "name": "Large letters + small letters",
            "displayName": "Large letters + small letters",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_passwordcomplexity_3",
            "description": "Large letters + small letters + numbers",
            "helpText": null,
            "name": "Large letters + small letters + numbers",
            "displayName": "Large letters + small letters + numbers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_passwordcomplexity_4",
            "description": "Large letters + small letters + numbers + special characters",
            "helpText": null,
            "name": "Large letters + small letters + numbers + special characters",
            "displayName": "Large letters + small letters + numbers + special characters",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_passwordcomplexity_5",
            "description": "Large letters + small letters + numbers + special characters (improved readability)",
            "helpText": null,
            "name": "Large letters + small letters + numbers + special characters (improved readability)",
            "displayName": "Large letters + small letters + numbers + special characters (improved readability)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}