{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DQ_Limit",
        "Specify default quota limit and warning level",
        "\\System\\Disk Quotas",
        "Administrative Templates\\System\\Disk Quotas",
        "Disk Quotas"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DiskQuota/DQ_Limit",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit",
    "categoryId": "c08e929f-742a-4cd8-a7e6-9a3d170fe020",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits",
    "description": null,
    "helpText": "",
    "name": "DQ_ThresholdUnits",
    "displayName": "Units (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits_1",
            "description": null,
            "helpText": null,
            "name": "KB",
            "displayName": "KB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits_2",
            "description": null,
            "helpText": null,
            "name": "MB",
            "displayName": "MB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits_3",
            "description": null,
            "helpText": null,
            "name": "GB",
            "displayName": "GB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits_4",
            "description": null,
            "helpText": null,
            "name": "TB",
            "displayName": "TB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits_5",
            "description": null,
            "helpText": null,
            "name": "PB",
            "displayName": "PB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_dq_thresholdunits_6",
            "description": null,
            "helpText": null,
            "name": "EB",
            "displayName": "EB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_diskquota_dq_limit_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_diskquota_dq_limit"
                }
            ],
            "dependedOnBy": []
        }
    ]
}