{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AVD_SERVER_UDP_STUN_CLIENT_PORT_RANGE",
        "Use port range for RDP Shortpath for unmanaged networks",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Azure Virtual Desktop"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/terminalServer-AVDv1~Policy~AVD_GP_NODE/AVD_SERVER_UDP_STUN_CLIENT_PORT_RANGE",
    "rootDefinitionId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range",
    "categoryId": "845ff38a-408b-449c-9ef3-7fdc331027df",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range",
    "description": "This policy setting allows you to specify the UDP port range the Azure Virtual Desktop client will use to communicate with the session host when RDP Shortpath for public networks is used. \r\nIf you enable this policy setting, the Azure Virtual Desktop client will randomly select the port from the range for every connection. If the specified port range is exhausted, the client's operating system will choose a port to use.\r\nIf you disable or do not configure this policy setting, the operating system on the client will select a port used for the session (recommended)\r\n\r\nIf you enable this policy setting, we recommend configuring firewall rules on the client to allow inbound UDP connection in this port range for Azure Virtual Desktop clients. If you do not configure firewall rules, Windows Defender Firewall may prompt the user to allow communication.\r\nIf you enable this policy setting, you can also customize a UDP port range for the Azure Virtual Desktop client. \r\nWhen choosing the base and pool size, consider the number of ports setting to ensure that the upper bound does not exceed 49151. For example, if you select 38300 as a port base and 1000 as pool size, the upper bound will be 39299.\r\n\r\nUDP port base:\r\nThis setting allows you to customize the base for the UDP port range. The default base port is 38300 (recommended). You can select any value in the 1024-49151 range for the base. \r\n\r\nPort pool size:\r\nThis setting allows you to select how many ports will be in the UDP port range. Default (recommended) is 1000. \r\n\r\n",
    "helpText": "",
    "name": "AVD_SERVER_UDP_STUN_CLIENT_PORT_RANGE",
    "displayName": "Use port range for RDP Shortpath for unmanaged networks",
    "defaultOptionId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range_part_iceclientportbase",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range_part_iceclientportrange",
                    "required": true
                }
            ]
        }
    ]
}