{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Fips Algorithm Policy",
        "Cryptography"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Cryptography#allowfipsalgorithmpolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Cryptography/AllowFipsAlgorithmPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_cryptography_allowfipsalgorithmpolicy",
    "categoryId": "bdc32a5e-2bce-46b1-9838-ed557b1e287e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_cryptography_allowfipsalgorithmpolicy",
    "description": "Allows or disallows the Federal Information Processing Standard (FIPS) policy.",
    "helpText": "",
    "name": "AllowFipsAlgorithmPolicy",
    "displayName": "Allow Fips Algorithm Policy",
    "defaultOptionId": "device_vendor_msft_policy_config_cryptography_allowfipsalgorithmpolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_cryptography_allowfipsalgorithmpolicy_1",
            "description": "Allow",
            "helpText": null,
            "name": "Allow",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_cryptography_allowfipsalgorithmpolicy_0",
            "description": "Block",
            "helpText": null,
            "name": "Block",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}