{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Privilege Use Audit Non Sensitive Privilege Use",
        "Audit",
        "Auditing"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#privilegeuse_auditnonsensitiveprivilegeuse"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Audit/PrivilegeUse_AuditNonSensitivePrivilegeUse",
    "rootDefinitionId": "device_vendor_msft_policy_config_audit_privilegeuse_auditnonsensitiveprivilegeuse",
    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_audit_privilegeuse_auditnonsensitiveprivilegeuse",
    "description": "This policy setting allows you to audit events generated by the use of non-sensitive privileges (user rights). The following privileges are non-sensitive:         Access Credential Manager as a trusted caller.         Access this computer from the network.         Add workstations to domain.         Adjust memory quotas for a process.         Allow log on locally.         Allow log on through Terminal Services.         Bypass traverse checking.         Change the system time.         Create a pagefile.         Create global objects.                  Create permanent shared objects.         Create symbolic links.         Deny access this computer from the network.         Deny log on as a batch job.         Deny log on as a service.         Deny log on locally.         Deny log on through Terminal Services.         Force shutdown from a remote system.         Increase a process working set.         Increase scheduling priority.         Lock pages in memory.         Log on as a batch job.         Log on as a service.         Modify an object label.         Perform volume maintenance tasks.         Profile single process.         Profile system performance.         Remove computer from docking station.         Shut down the system.         Synchronize directory service data.  If you configure this policy setting, an audit event is generated when a non-sensitive privilege is called. Success audits record successful calls and Failure audits record unsuccessful calls. If you do not configure this policy setting, no audit event is generated when a non-sensitive privilege is called.",
    "helpText": "",
    "name": "PrivilegeUse_AuditNonSensitivePrivilegeUse",
    "displayName": "Privilege Use Audit Non Sensitive Privilege Use",
    "defaultOptionId": "device_vendor_msft_policy_config_audit_privilegeuse_auditnonsensitiveprivilegeuse_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134.1039",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditnonsensitiveprivilegeuse_0",
            "description": "Off/None",
            "helpText": null,
            "name": "Off/None",
            "displayName": "Off/ None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditnonsensitiveprivilegeuse_1",
            "description": "Success",
            "helpText": null,
            "name": "Success",
            "displayName": "Success",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditnonsensitiveprivilegeuse_2",
            "description": "Failure",
            "helpText": null,
            "name": "Failure",
            "displayName": "Failure",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditnonsensitiveprivilegeuse_3",
            "description": "Success+Failure",
            "helpText": null,
            "name": "Success+Failure",
            "displayName": "Success+ Failure",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}