{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SSLCipherSuiteOrder",
        "SSL Cipher Suite Order",
        "\\Network\\SSL Configuration Settings",
        "Administrative Templates\\Network\\SSL Configuration Settings",
        "SSL Configuration Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-ciphersuiteorder#admx-ciphersuiteorder-sslciphersuiteorder"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_CipherSuiteOrder/SSLCipherSuiteOrder",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_ciphersuiteorder_sslciphersuiteorder",
    "categoryId": "b221d3c2-e05a-4210-bf9c-2d7c7c0fd35a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_ciphersuiteorder_sslciphersuiteorder",
    "description": "This policy setting determines the cipher suites used by the Secure Socket Layer (SSL).\r\n\r\nIf you enable this policy setting, SSL cipher suites are prioritized in the order specified.\r\n\r\nIf you disable or do not configure this policy setting, default cipher suite order is used.\r\n\r\nLink for all the cipherSuites: http://go.microsoft.com/fwlink/?LinkId=517265\r\n\r\n      \r\n ",
    "helpText": "",
    "name": "SSLCipherSuiteOrder",
    "displayName": "SSL Cipher Suite Order",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_ciphersuiteorder_sslciphersuiteorder_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_ciphersuiteorder_sslciphersuiteorder_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_ciphersuiteorder_sslciphersuiteorder_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_ciphersuiteorder_sslciphersuiteorder_pol_sslciphersuiteorder",
                    "required": true
                }
            ]
        }
    ]
}