{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Turn Off Hybrid Sleep Plugged In",
        "Power"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Power#power-turnoffhybridsleeppluggedin"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Power/TurnOffHybridSleepPluggedIn",
    "rootDefinitionId": "device_vendor_msft_policy_config_power_turnoffhybridsleeppluggedin",
    "categoryId": "e9cd3225-7b0e-485e-99f8-7ec8dd3977a1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_power_turnoffhybridsleeppluggedin",
    "description": "This policy setting allows you to turn off hybrid sleep.  If you set this to 0, a hiberfile is not generated when the system transitions to sleep (Stand By).  If you do not configure this policy setting, users control this setting.",
    "helpText": "",
    "name": "TurnOffHybridSleepPluggedIn",
    "displayName": "Turn Off Hybrid Sleep Plugged In",
    "defaultOptionId": "device_vendor_msft_policy_config_power_turnoffhybridsleeppluggedin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_power_turnoffhybridsleeppluggedin_0",
            "description": "",
            "helpText": null,
            "name": "",
            "displayName": "",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_power_turnoffhybridsleeppluggedin_1",
            "description": "hybrid sleep",
            "helpText": null,
            "name": "hybrid sleep",
            "displayName": "hybrid sleep",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}