{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_DELETE_ROAMING_USER_PROFILES",
        "Limit the size of the entire roaming user profile cache",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Profiles",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Profiles",
        "Profiles"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_DELETE_ROAMING_USER_PROFILES",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_delete_roaming_user_profiles",
    "categoryId": "b237a91d-a442-4a7e-8169-1bd6c798f490",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_delete_roaming_user_profiles_ts_profile_directory_monitoring_interval",
    "description": null,
    "helpText": "",
    "name": "TS_PROFILE_DIRECTORY_MONITORING_INTERVAL",
    "displayName": "Monitoring interval (minutes): (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 10080,
        "minimumValue": 15
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 900
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_delete_roaming_user_profiles_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_delete_roaming_user_profiles"
        }
    ],
    "dependedOnBy": []
}