{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_SELECT_TRANSPORT",
        "Select RDP transport protocols",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Connections",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Connections",
        "Connections"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_SELECT_TRANSPORT",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport",
    "categoryId": "0c2613c9-a7c7-4458-8b0d-2fff13e2beeb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_ts_select_transport_type",
    "description": null,
    "helpText": "",
    "name": "TS_SELECT_TRANSPORT_TYPE",
    "displayName": "Select Transport Type (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_ts_select_transport_type_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_ts_select_transport_type_0",
            "description": null,
            "helpText": null,
            "name": "Use both UDP and TCP",
            "displayName": "Use both UDP and TCP",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_ts_select_transport_type_1",
            "description": null,
            "helpText": null,
            "name": "Use only TCP",
            "displayName": "Use only TCP",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_ts_select_transport_type_2",
            "description": null,
            "helpText": null,
            "name": "Use either UDP or TCP",
            "displayName": "Use either UDP or TCP",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport"
                }
            ],
            "dependedOnBy": []
        }
    ]
}