{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Remediation_Scan_ScheduleDay",
        "Specify the day of the week to run a scheduled full scan to complete remediation",
        "\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Remediation",
        "Remediation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-microsoftdefenderantivirus#admx-microsoftdefenderantivirus-remediation-scan-scheduleday"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/Remediation_Scan_ScheduleDay",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday",
    "categoryId": "c4665793-15ea-44c9-bd0a-d542b3915fe0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday",
    "description": "This policy setting allows you to specify the day of the week on which to perform a scheduled full scan in order to complete remediation. The scan can also be configured to run every day or to never run at all.\r\n\r\n    This setting can be configured with the following ordinal number values:\r\n    (0x0) Every Day\r\n    (0x1) Sunday \r\n    (0x2) Monday\r\n    (0x3) Tuesday\r\n    (0x4) Wednesday\r\n    (0x5) Thursday\r\n    (0x6) Friday\r\n    (0x7) Saturday\r\n    (0x8) Never (default)\r\n\r\n    If you enable this setting, a scheduled full scan to complete remediation will run at the frequency specified.\r\n\r\n    If you disable or do not configure this setting, a scheduled full scan to complete remediation will run at a default frequency.\r\n ",
    "helpText": "",
    "name": "Remediation_Scan_ScheduleDay",
    "displayName": "Specify the day of the week to run a scheduled full scan to complete remediation",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_remediation_scan_scheduleday_remediation_scan_scheduleday",
                    "required": true
                }
            ]
        }
    ]
}