{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AccessDeniedConfiguration",
        "Customize message for Access Denied errors",
        "\\System\\Access-Denied Assistance",
        "Administrative Templates\\System\\Access-Denied Assistance",
        "Access-Denied Assistance"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_srmfci/AccessDeniedConfiguration",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration",
    "categoryId": "734bed4f-be52-46ef-ae60-8fd195dc8f4d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration_includeuserclaimscheck",
    "description": null,
    "helpText": "",
    "name": "IncludeUserClaimsCheck",
    "displayName": "Include user claims (Device)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration_includeuserclaimscheck_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration_includeuserclaimscheck_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_srmfci_accessdeniedconfiguration"
                }
            ],
            "dependedOnBy": []
        }
    ]
}