{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ProxySettings",
        "Proxy settings",
        "\\Google\\Google Chrome",
        "Administrative Templates\\Google\\Google Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome/ProxySettings",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_proxysettings",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_proxysettings",
    "description": "Setting the policy configures the proxy settings for Chrome and ARC-apps, which ignore all proxy-related options specified from the command line.\r\n\r\n Leaving the policy unset lets users choose their proxy settings.\r\n\r\n Setting the ProxySettings policy accepts the following fields:\r\n   * ProxyMode, which lets you specify the proxy server Chrome uses and prevents users from changing proxy settings\r\n   * ProxyPacUrl, a URL to a proxy .pac file\r\n   * ProxyPacMandatory, which prevents the network stack from falling back to direct connections with invalid or unavailable PAC script\r\n   * ProxyServer, a URL of the proxy server\r\n   * ProxyBypassList, a list of hosts for which the proxy will be bypassed\r\n\r\n The ProxyServerMode field is deprecated in favor of the ProxyMode field.\r\n\r\n  For ProxyMode, if you choose the value:\r\n    * direct, a proxy is never used and all other fields are ignored.\r\n    * system, the systems's proxy is used and all other fields are ignored.\r\n    * auto_detect, all other fields are ignored.\r\n    * fixed_servers, the ProxyServer and ProxyBypassList fields are used.\r\n    * pac_script, the ProxyPacUrl, ProxyPacMandatory and ProxyBypassList fields are used.\r\n\r\nNote: For more detailed examples, visit The Chromium Projects ( https://www.chromium.org/developers/design-documents/network-settings#TOC-Command-line-options-for-proxy-sett ).\r\nSee https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ProxySettings for more information about schema and formatting.\r\n\r\n\r\nExample value:\r\n\r\n{\r\n  \"ProxyMode\": \"fixed_servers\",\r\n  \"ProxyServer\": \"123.123.123.123:8080\",\r\n  \"ProxyBypassList\": \"https://www.example1.com,https://www.example2.com,https://internalsite/\"\r\n}",
    "helpText": "",
    "name": "ProxySettings",
    "displayName": "Proxy settings",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_proxysettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_proxysettings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_proxysettings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_proxysettings_proxysettings",
                    "required": true
                }
            ]
        }
    ]
}