{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Telemetry Opt In Settings Ux",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-System#system-configuretelemetryoptinsettingsux"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/System/ConfigureTelemetryOptInSettingsUx",
    "rootDefinitionId": "device_vendor_msft_policy_config_system_configuretelemetryoptinsettingsux",
    "categoryId": "f62e0f2a-4363-4246-8057-1dc811fe4360",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_system_configuretelemetryoptinsettingsux",
    "description": "",
    "helpText": "",
    "name": "ConfigureTelemetryOptInSettingsUx",
    "displayName": "Configure Telemetry Opt In Settings Ux",
    "defaultOptionId": "device_vendor_msft_policy_config_system_configuretelemetryoptinsettingsux_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_system_configuretelemetryoptinsettingsux_0",
            "description": "Enable Telemetry opt-in Settings.",
            "helpText": null,
            "name": "Enable Telemetry opt-in Settings.",
            "displayName": "Enable Telemetry opt-in Settings.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_system_configuretelemetryoptinsettingsux_1",
            "description": "Disable Telemetry opt-in Settings.",
            "helpText": null,
            "name": "Disable Telemetry opt-in Settings.",
            "displayName": "Disable Telemetry opt-in Settings.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}