{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ManagedSearchEngines",
        "Manage Search Engines",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/ManagedSearchEngines",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedsearchengines",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedsearchengines",
    "description": "Lets you configure a list of up to 10 search engines, one of which must be marked as the default search engine.\r\nYou do not need to specify the encoding. Starting in Microsoft Edge 80, the suggest_url and image_search_url parameters are optional. The optional parameter, image_search_post_params (consists of comma-separated name/value pairs), is available starting in Microsoft Edge 80.\r\n\r\nStarting in Microsoft Edge 83, you can enable search engine discovery with the allow_search_engine_discovery optional parameter. This parameter must be the first item in the list. If allow_search_engine_discovery is not specified, search engine discovery will be disabled by default.\r\n\r\nIf you enable this policy, users can't add, remove, or change any search engine in the list. Users can set their default search engine to any search engine in the list.\r\n\r\nIf you disable or don't configure this policy, users can modify the search engines list as desired.\r\n\r\nIf the 'DefaultSearchProviderSearchURL' (Default search provider search URL) policy is set, this policy (ManagedSearchEngines) is ignored. The user must restart their browser to finish applying this policy.\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"allow_search_engine_discovery\": true\r\n  }, \r\n  {\r\n    \"is_default\": true, \r\n    \"suggest_url\": \"https://www.example1.com/qbox?query={searchTerms}\", \r\n    \"search_url\": \"https://www.example1.com/search?q={searchTerms}\", \r\n    \"name\": \"Example1\", \r\n    \"keyword\": \"example1.com\"\r\n  }, \r\n  {\r\n    \"suggest_url\": \"https://www.example2.com/qbox?query={searchTerms}\", \r\n    \"image_search_url\": \"https://www.example2.com/images/detail/search?iss=sbiupload\", \r\n    \"name\": \"Example2\", \r\n    \"keyword\": \"example2.com\", \r\n    \"image_search_post_params\": \"content={imageThumbnail},url={imageURL},sbisrc={SearchSource}\", \r\n    \"search_url\": \"https://www.example2.com/search?q={searchTerms}\"\r\n  }, \r\n  {\r\n    \"suggest_url\": \"https://www.example3.com/qbox?query={searchTerms}\", \r\n    \"image_search_url\": \"https://www.example3.com/images/detail/search?iss=sbiupload\", \r\n    \"name\": \"Example3\", \r\n    \"keyword\": \"example3.com\", \r\n    \"encoding\": \"UTF-8\", \r\n    \"search_url\": \"https://www.example3.com/search?q={searchTerms}\"\r\n  }, \r\n  {\r\n    \"search_url\": \"https://www.example4.com/search?q={searchTerms}\", \r\n    \"name\": \"Example4\", \r\n    \"keyword\": \"example4.com\"\r\n  }\r\n]",
    "helpText": "",
    "name": "ManagedSearchEngines",
    "displayName": "Manage Search Engines",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedsearchengines_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedsearchengines_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedsearchengines_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedsearchengines_managedsearchengines",
                    "required": true
                }
            ]
        }
    ]
}