{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Max Inactivity Time Device Lock With External Display",
        "Device Lock"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-DeviceLock#maxinactivitytimedevicelockwithexternaldisplay"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeviceLock/MaxInactivityTimeDeviceLockWithExternalDisplay",
    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_maxinactivitytimedevicelockwithexternaldisplay",
    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_devicelock_maxinactivitytimedevicelockwithexternaldisplay",
    "description": "Sets the maximum timeout value for the external display.",
    "helpText": "",
    "name": "MaxInactivityTimeDeviceLockWithExternalDisplay",
    "displayName": "[Deprecated] Max Inactivity Time Device Lock With External Display",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "88.8.88888",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 999,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [],
    "dependedOnBy": []
}