{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "MaxTokenSize",
        "Set maximum Kerberos SSPI context token buffer size",
        "\\System\\Kerberos",
        "Administrative Templates\\System\\Kerberos",
        "Kerberos"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Kerberos/SetMaximumContextTokenSize",
    "rootDefinitionId": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize",
    "categoryId": "9b0b8f3b-8e08-4083-9e2b-2e6bfeb01f83",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize_maxtokensize",
    "description": "",
    "helpText": "",
    "name": "MaxTokenSize",
    "displayName": "Maximum size (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 12000
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 48000
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize_1",
            "parentSettingId": "device_vendor_msft_policy_config_kerberos_setmaximumcontexttokensize"
        }
    ],
    "dependedOnBy": []
}