{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DwmDefaultColorizationColor_2",
        "Specify a default color",
        "\\Windows Components\\Desktop Window Manager\\Window Frame Coloring",
        "Administrative Templates\\Windows Components\\Desktop Window Manager\\Window Frame Coloring",
        "Window Frame Coloring"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DWM/DwmDefaultColorizationColor_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2",
    "categoryId": "b5234c18-e555-409e-9550-59b89d1672f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_dwmdefaultcolorizationcolorblue",
    "description": null,
    "helpText": "",
    "name": "DwmDefaultColorizationColorBlue",
    "displayName": "Blue (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 255,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2"
        }
    ],
    "dependedOnBy": []
}