{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Publishing_Server5_Policy",
        "Publishing Server 5 Settings",
        "\\System\\App-V\\Publishing",
        "AppVirtualization",
        "App Virtualization",
        "Publishing"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-appvirtualization#appvirtualization-publishingallowserver5"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/PublishingAllowServer5",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5",
    "categoryId": "ea812d2c-1cf9-4132-9b33-12bb7ac17dbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5",
    "description": "      Publishing Server Display Name: Displays the name of publishing server.\r\n      \r\n      Publishing Server URL: Displays the URL of publishing server.\r\n      \r\n      Global Publishing Refresh: Enables global publishing refresh (Boolean).\r\n      \r\n      Global Publishing Refresh On Logon: Triggers a global publishing refresh on logon (Boolean).\r\n      \r\n      Global Publishing Refresh Interval: Specifies the publishing refresh interval using the GlobalRefreshIntervalUnit. To disable package refresh, select 0.\r\n      \r\n      Global Publishing Refresh Interval Unit: Specifies the interval unit (Hour 0-23, Day 0-31).\r\n      \r\n      User Publishing Refresh: Enables user publishing refresh (Boolean).\r\n      \r\n      User Publishing Refresh On Logon: Triggers a user publishing refresh on logon (Boolean).\r\n      \r\n      User Publishing Refresh Interval: Specifies the publishing refresh interval using the UserRefreshIntervalUnit. To disable package refresh, select 0.\r\n      \r\n      User Publishing Refresh Interval Unit: Specifies the interval unit (Hour 0-23, Day 0-31).\r\n      ",
    "helpText": "",
    "name": "Publishing_Server5_Policy",
    "displayName": "Publishing Server 5 Settings",
    "defaultOptionId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_publishing_server5_name_prompt",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_publishing_server_url_prompt",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_global_publishing_refresh_options",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_global_refresh_onlogon_options",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_global_refresh_interval_prompt",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_global_refresh_unit_options",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_user_publishing_refresh_options",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_user_refresh_onlogon_options",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_user_refresh_interval_prompt",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_publishingallowserver5_user_refresh_unit_options",
                    "required": true
                }
            ]
        }
    ]
}