{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SetDowngrading",
        "Configure Client BranchCache Version Support",
        "\\Network\\BranchCache",
        "Administrative Templates\\Network\\BranchCache",
        "BranchCache"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PeerToPeerCaching/SetDowngrading",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading",
    "categoryId": "1cda8821-d9e2-485e-8d78-1829593d41ca",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading_downgrading_version",
    "description": null,
    "helpText": "",
    "name": "Downgrading_Version",
    "displayName": "Select from the following versions: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading_downgrading_version_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading_downgrading_version_1",
            "description": null,
            "helpText": null,
            "name": "Windows Vista with BITS 4.0 installed, Windows 7, or Windows Server 2008 R2",
            "displayName": "Windows Vista with BITS 4.0 installed, Windows 7, or Windows Server 2008 R2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading_downgrading_version_2",
            "description": null,
            "helpText": null,
            "name": "Windows 8",
            "displayName": "Windows 8",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_peertopeercaching_setdowngrading"
                }
            ],
            "dependedOnBy": []
        }
    ]
}