{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Set Policy Driven Update Source For Other Updates",
        "Update",
        "Windows Update For Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Update#update-setpolicydrivenupdatesourceforotherupdates"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Update/SetPolicyDrivenUpdateSourceForOtherUpdates",
    "rootDefinitionId": "device_vendor_msft_policy_config_update_setpolicydrivenupdatesourceforotherupdates",
    "categoryId": "0e6c9053-73d6-4c56-9147-53513f6eefd8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_update_setpolicydrivenupdatesourceforotherupdates",
    "description": "",
    "helpText": "",
    "name": "SetPolicyDrivenUpdateSourceForOtherUpdates",
    "displayName": "Set Policy Driven Update Source For Other Updates",
    "defaultOptionId": "device_vendor_msft_policy_config_update_setpolicydrivenupdatesourceforotherupdates_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_update_setpolicydrivenupdatesourceforotherupdates_0",
            "description": "Detect, download and deploy other Updates from Windows Update",
            "helpText": null,
            "name": "Detect, download and deploy other Updates from Windows Update",
            "displayName": "Detect, download and deploy other Updates from Windows Update",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update_setpolicydrivenupdatesourceforotherupdates_1",
            "description": "Detect, download and deploy other Updates from Windows Server Update Services (WSUS)",
            "helpText": null,
            "name": "Detect, download and deploy other Updates from Windows Server Update Services (WSUS)",
            "displayName": "Detect, download and deploy other Updates from Windows Server Update Services (WSUS)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}