{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EventViewer_RedirectionProgram",
        "Events.asp program",
        "\\Windows Components\\Event Viewer",
        "Administrative Templates\\Windows Components\\Event Viewer",
        "Event Viewer"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventViewer/EventViewer_RedirectionProgram",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventviewer_eventviewer_redirectionprogram",
    "categoryId": "d4bdfec1-2e40-49d2-b8f2-e5b15f072b10",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_eventviewer_eventviewer_redirectionprogram_eventviewer_redirectionprogram",
    "description": null,
    "helpText": "",
    "name": "EventViewer_RedirectionProgram",
    "displayName": "Events.asp program (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_eventviewer_eventviewer_redirectionprogram_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_eventviewer_eventviewer_redirectionprogram"
        }
    ],
    "dependedOnBy": []
}