{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Alphanumeric Device Password Required",
        "Device Lock"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#alphanumericdevicepasswordrequired"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeviceLock/AlphanumericDevicePasswordRequired",
    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
    "settingUsage": "configuration,compliance",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired",
    "description": "Determines the type of PIN or password required. This policy only applies if the DeviceLock/DevicePasswordEnabled policy is set to 0",
    "helpText": "",
    "name": "AlphanumericDevicePasswordRequired",
    "displayName": "Alphanumeric Device Password Required",
    "defaultOptionId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
            "description": "Password or Alphanumeric PIN required.",
            "helpText": null,
            "name": "Password or Alphanumeric PIN required.",
            "displayName": "Password or Alphanumeric PIN required.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_1",
            "description": "Password or Numeric PIN required.",
            "helpText": null,
            "name": "Password or Numeric PIN required.",
            "displayName": "Password or Numeric PIN required.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_2",
            "description": "Password, Numeric PIN, or Alphanumeric PIN required.",
            "helpText": null,
            "name": "Password, Numeric PIN, or Alphanumeric PIN required.",
            "displayName": "Password, Numeric PIN, or Alphanumeric PIN required.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                }
            ],
            "dependedOnBy": []
        }
    ]
}