{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Boot To Cloud PC Enhanced",
        "Cloud Desktop"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/CloudDesktop-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/CloudDesktop",
    "offsetUri": "/BootToCloudPCEnhanced",
    "rootDefinitionId": "device_vendor_msft_clouddesktop_boottocloudpcenhanced",
    "categoryId": "39e4c352-be9c-4e75-8111-8236279c7f1e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_clouddesktop_boottocloudpcenhanced",
    "description": "This node allows to configure different kinds of Boot to Cloud mode. Boot to cloud mode enables users to seamlessly sign-in to a Cloud PC. For using this feature, Cloud Provider application must be installed on the PC and the user must have a Cloud PC provisioned. This node supports the below options: 0. Not Configured. 1. Enable Boot to Cloud Shared PC Mode: Boot to Cloud Shared PC mode allows multiple users to sign-in on the device and use for shared purpose. 2. Enable Boot to Cloud Dedicated Mode (Cloud only): Dedicated mode allows user to sign-in on the device using various authentication mechanism configured by their organization (For ex. PIN, Biometrics etc). This mode preserves user personalization, including their profile picture and username in local machine, and facilitates fast account switching.",
    "helpText": "",
    "name": "BootToCloudPCEnhanced",
    "displayName": "Boot To Cloud PC Enhanced",
    "defaultOptionId": "device_vendor_msft_clouddesktop_boottocloudpcenhanced_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621.3235",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "holoLens",
            "holographicForBusiness",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_clouddesktop_boottocloudpcenhanced_0",
            "description": "Not Configured",
            "helpText": null,
            "name": "Not Configured",
            "displayName": "Not Configured",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_clouddesktop_boottocloudpcenhanced_1",
            "description": "Enable Boot to Cloud Shared PC Mode",
            "helpText": null,
            "name": "Enable Boot to Cloud Shared PC Mode",
            "displayName": "Enable Boot to Cloud Shared PC Mode",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_clouddesktop_boottocloudpcenhanced_2",
            "description": "Enable Boot to Cloud Dedicated Mode (Cloud only)",
            "helpText": null,
            "name": "Enable Boot to Cloud Dedicated Mode (Cloud only)",
            "displayName": "Enable Boot to Cloud Dedicated Mode (Cloud only)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}