{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enabled",
        "DM Client",
        "Config Refresh"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/DMClient-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/DMClient",
    "offsetUri": "/Provider/{0}/ConfigRefresh/Enabled",
    "rootDefinitionId": "device_vendor_msft_dmclient_provider_{providerid}",
    "categoryId": "80b21376-0e9a-4e5b-8a74-b672adbe94a8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled",
    "description": "This node determines whether or not a periodic settings refresh for MDM policies will occur.",
    "helpText": "",
    "name": "Enabled",
    "displayName": "Config refresh",
    "defaultOptionId": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.6",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000.2836",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled_false",
            "description": "Disabled.",
            "helpText": null,
            "name": "ConfigRefresh is disabled.",
            "displayName": "Disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_dmclient_provider_{providerid}",
                    "parentSettingId": "device_vendor_msft_dmclient_provider_{providerid}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled_true",
            "description": "Enabled.",
            "helpText": null,
            "name": "ConfigRefresh is enabled.",
            "displayName": "Enabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_dmclient_provider_{providerid}",
                    "parentSettingId": "device_vendor_msft_dmclient_provider_{providerid}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}