{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Automatic Account Management Enable Account",
        "LAPS"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/LAPS-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/LAPS",
    "offsetUri": "/Policies/AutomaticAccountManagementEnableAccount",
    "rootDefinitionId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled",
    "categoryId": "f1dcf7b6-2d89-41bf-b5eb-02a879c6db5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_laps_policies_automaticaccountmanagementenableaccount",
    "description": "Use this setting to configure whether the automatically managed account is enabled or disabled.\n\nIf this setting is enabled, the target account will be enabled.\n\nIf this setting is disabled, the target account will be disabled.\n\nIf not specified, this setting defaults to False.",
    "helpText": "",
    "name": "AutomaticAccountManagementEnableAccount",
    "displayName": "Automatic Account Management Enable Account",
    "defaultOptionId": "device_vendor_msft_laps_policies_automaticaccountmanagementenableaccount_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_laps_policies_automaticaccountmanagementenableaccount_false",
            "description": "The target account will be disabled",
            "helpText": null,
            "name": "The target account will be disabled",
            "displayName": "The target account will be disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "False"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_true",
                    "parentSettingId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_automaticaccountmanagementenableaccount_true",
            "description": "The target account will be enabled",
            "helpText": null,
            "name": "The target account will be enabled",
            "displayName": "The target account will be enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "True"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_true",
                    "parentSettingId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled"
                }
            ],
            "dependedOnBy": []
        }
    ]
}