{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Automatic Account Management Name Or Prefix",
        "LAPS"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/LAPS-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/LAPS",
    "offsetUri": "/Policies/AutomaticAccountManagementNameOrPrefix",
    "rootDefinitionId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled",
    "categoryId": "f1dcf7b6-2d89-41bf-b5eb-02a879c6db5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_laps_policies_automaticaccountmanagementnameorprefix",
    "description": "Use this setting to configure the name or prefix of the managed local administrator account.\n\nIf specified, the value will be used as the name or name prefix of the managed account.\n\nIf not specified, this setting will default to \"WLapsAdmin\".",
    "helpText": "",
    "name": "AutomaticAccountManagementNameOrPrefix",
    "displayName": "Automatic Account Management Name Or Prefix",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_true",
            "parentSettingId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled"
        }
    ],
    "dependedOnBy": []
}