{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RA_Optimize_Bandwidth",
        "Turn on bandwidth optimization",
        "\\System\\Remote Assistance",
        "Administrative Templates\\System\\Remote Assistance",
        "Remote Assistance"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemoteAssistance/RA_Optimize_Bandwidth",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth",
    "categoryId": "12a1b259-a0d5-4505-aedf-b8ca811cd5f9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_ra_optimize_bandwidth_list",
    "description": null,
    "helpText": "",
    "name": "RA_Optimize_Bandwidth_List",
    "displayName": "Optimize settings for reduced bandwidth: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_ra_optimize_bandwidth_list_14",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_ra_optimize_bandwidth_list_14",
            "description": null,
            "helpText": null,
            "name": "No optimization",
            "displayName": "No optimization",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "14"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_ra_optimize_bandwidth_list_12",
            "description": null,
            "helpText": null,
            "name": "No full window drag",
            "displayName": "No full window drag",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "12"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_ra_optimize_bandwidth_list_8",
            "description": null,
            "helpText": null,
            "name": "Turn off background",
            "displayName": "Turn off background",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_ra_optimize_bandwidth_list_0",
            "description": null,
            "helpText": null,
            "name": "Full optimization",
            "displayName": "Full optimization",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth"
                }
            ],
            "dependedOnBy": []
        }
    ]
}