{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "AppxRuntimeApplicationContentUriRules",
        "Turn on dynamic Content URI Rules for Windows store apps",
        "\\Windows Components\\App runtime",
        "Administrative Templates\\Windows Components\\App runtime",
        "App runtime"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AppXRuntime/AppxRuntimeApplicationContentUriRules",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_appxruntime_appxruntimeapplicationcontenturirules",
    "categoryId": "1ed81d90-7326-4d0b-8934-b0a8bdddc5ce",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_appxruntime_appxruntimeapplicationcontenturirules_listbox_contenturirules",
    "description": null,
    "helpText": "",
    "name": "ListBox_ContentUriRules",
    "displayName": "Content URI Rules: (Device)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_appxruntime_appxruntimeapplicationcontenturirules_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_appxruntime_appxruntimeapplicationcontenturirules"
        }
    ],
    "dependedOnBy": []
}