{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "FontMitigation",
        "Untrusted Font Blocking",
        "\\System\\Mitigation Options",
        "Administrative Templates\\System\\Mitigation Options",
        "Mitigation Options"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/FontMitigation",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation",
    "categoryId": "80ed7629-87dd-4bb1-8ea0-555f20d3b156",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_fontmitigation_dl",
    "description": null,
    "helpText": "",
    "name": "FontMitigation_DL",
    "displayName": "Mitigation Options (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_fontmitigation_dl_1000000000000",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_fontmitigation_dl_1000000000000",
            "description": null,
            "helpText": null,
            "name": "Block untrusted fonts and log events",
            "displayName": "Block untrusted fonts and log events",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1000000000000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_fontmitigation_dl_2000000000000",
            "description": null,
            "helpText": null,
            "name": "Do not block untrusted fonts",
            "displayName": "Do not block untrusted fonts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2000000000000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_fontmitigation_dl_3000000000000",
            "description": null,
            "helpText": null,
            "name": "Log events without blocking untrusted fonts",
            "displayName": "Log events without blocking untrusted fonts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3000000000000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_grouppolicy_fontmitigation"
                }
            ],
            "dependedOnBy": []
        }
    ]
}