{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Cross Device Clipboard",
        "Privacy"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Privacy#privacy-allowcrossdeviceclipboard"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Privacy/AllowCrossDeviceClipboard",
    "rootDefinitionId": "device_vendor_msft_policy_config_privacy_allowcrossdeviceclipboard",
    "categoryId": "98e76d3e-9e52-45b3-b0c7-f029023121e9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_privacy_allowcrossdeviceclipboard",
    "description": "Allows syncing of Clipboard across devices under the same Microsoft account.",
    "helpText": "",
    "name": "AllowCrossDeviceClipboard",
    "displayName": "Allow Cross Device Clipboard",
    "defaultOptionId": "device_vendor_msft_policy_config_privacy_allowcrossdeviceclipboard_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_privacy_allowcrossdeviceclipboard_0",
            "description": "Not allowed.",
            "helpText": null,
            "name": "Not allowed.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_privacy_allowcrossdeviceclipboard_1",
            "description": "Allowed.",
            "helpText": null,
            "name": "Allowed.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}