{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RpcStateInformation",
        "Maintain RPC Troubleshooting State Information",
        "\\System\\Remote Procedure Call",
        "Administrative Templates\\System\\Remote Procedure Call",
        "Remote Procedure Call"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RPC/RpcStateInformation",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation",
    "categoryId": "73a3a483-dcba-4b34-b7cb-9c68c871864c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_rpcstateinformationlist",
    "description": null,
    "helpText": "",
    "name": "RpcStateInformationList",
    "displayName": "RPC Runtime state information to maintain: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_rpcstateinformationlist_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_rpcstateinformationlist_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_rpcstateinformationlist_1",
            "description": null,
            "helpText": null,
            "name": "Auto1",
            "displayName": "Auto1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_rpcstateinformationlist_2",
            "description": null,
            "helpText": null,
            "name": "Auto2",
            "displayName": "Auto2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_rpcstateinformationlist_3",
            "description": null,
            "helpText": null,
            "name": "Server",
            "displayName": "Server",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_rpcstateinformationlist_4",
            "description": null,
            "helpText": null,
            "name": "Full",
            "displayName": "Full",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_rpc_rpcstateinformation"
                }
            ],
            "dependedOnBy": []
        }
    ]
}