{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Streaming_Package_Source_Root",
        "Package Source Root",
        "\\System\\App-V\\Streaming",
        "AppVirtualization",
        "App Virtualization",
        "Streaming"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/StreamingAllowPackageSourceRoot",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_streamingallowpackagesourceroot",
    "categoryId": "3800661e-5841-4499-8d4e-914527435f59",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_streamingallowpackagesourceroot_package_source_root_prompt",
    "description": "",
    "helpText": "",
    "name": "Package_Source_Root_Prompt",
    "displayName": "Package Source Root",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_appvirtualization_streamingallowpackagesourceroot_1",
            "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_streamingallowpackagesourceroot"
        }
    ],
    "dependedOnBy": []
}