{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Mute",
        "Notifications",
        "Teams",
        "Outlook",
        "Non-working time"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
    "offsetUri": "/MuteNotificationsClockedout",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsclockedout",
    "categoryId": "fde9be9c-e0ab-4dd8-9df3-0794e608d15a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsclockedout",
    "description": "This will automatically mute Microsoft Teams notifications when managed account is in non-working time. Note: Configuring this setting will prevent end users from editing their global quiet time settings.",
    "helpText": null,
    "name": "MuteNotificationsClockedout",
    "displayName": "Mute notifications",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
        "description": null,
        "platform": "android,iOS",
        "deviceMode": "none",
        "technologies": "exchangeOnline"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsclockedout_1",
            "description": null,
            "helpText": null,
            "name": "Enable",
            "displayName": "Require",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}