{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BITS_EnablePeercaching",
        "Allow BITS Peercaching",
        "\\Network\\Background Intelligent Transfer Service (BITS)",
        "Administrative Templates\\Network\\Background Intelligent Transfer Service (BITS)",
        "Background Intelligent Transfer Service (BITS)"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-bits#admx-bits-bits-enablepeercaching"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Bits/BITS_EnablePeercaching",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_bits_bits_enablepeercaching",
    "categoryId": "f2345e03-bcd9-48fc-9c52-11ae06ba625a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_bits_bits_enablepeercaching",
    "description": "This policy setting determines if the Background Intelligent Transfer Service (BITS) peer caching feature is enabled on a specific computer.  By default, the files in a BITS job are downloaded only from the origin server specified by the job's owner.\r\n\r\n          If BITS peer caching is enabled, BITS caches downloaded files and makes them available to other BITS peers. When transferring a download job, BITS first requests the files for the job from its peers in the same IP subnet. If none of the peers in the subnet have the requested files, BITS downloads them from the origin server.\r\n\r\n          If you enable this policy setting, BITS downloads files from peers, caches the files, and responds to content requests from peers.  Using the \"Do not allow the computer to act as a BITS peer caching server\" and \"Do not allow the computer to act as a BITS peer caching client\" policy settings, it is possible to control BITS peer caching functionality at a more detailed level. However, it should be noted that the \"Allow BITS peer caching\" policy setting must be enabled for the other two policy settings to have any effect.\r\n\r\n          If you disable or do not configure this policy setting, the BITS peer caching feature will be disabled, and BITS will download files directly from the origin server.\r\n ",
    "helpText": "",
    "name": "BITS_EnablePeercaching",
    "displayName": "Allow BITS Peercaching",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_bits_bits_enablepeercaching_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_enablepeercaching_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_enablepeercaching_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}