{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Telemetry Opt In Change Notification",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-System#configuretelemetryoptinchangenotification"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/System/ConfigureTelemetryOptInChangeNotification",
    "rootDefinitionId": "device_vendor_msft_policy_config_system_configuretelemetryoptinchangenotification",
    "categoryId": "f62e0f2a-4363-4246-8057-1dc811fe4360",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_system_configuretelemetryoptinchangenotification",
    "description": "",
    "helpText": "",
    "name": "ConfigureTelemetryOptInChangeNotification",
    "displayName": "Configure Telemetry Opt In Change Notification",
    "defaultOptionId": "device_vendor_msft_policy_config_system_configuretelemetryoptinchangenotification_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_system_configuretelemetryoptinchangenotification_0",
            "description": "Enable telemetry change notifications.",
            "helpText": null,
            "name": "Enable telemetry change notifications.",
            "displayName": "Enable telemetry change notifications.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_system_configuretelemetryoptinchangenotification_1",
            "description": "Disable telemetry change notifications.",
            "helpText": null,
            "name": "Disable telemetry change notifications.",
            "displayName": "Disable telemetry change notifications.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}