{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "SetCost3G",
        "Set 3G Cost",
        "\\Network\\WWAN Service\\WWAN Media Cost",
        "Administrative Templates\\Network\\WWAN Service\\WWAN Media Cost",
        "WWAN Media Cost"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DataUsage/SetCost3G",
    "rootDefinitionId": "device_vendor_msft_policy_config_datausage_setcost3g",
    "categoryId": "ab6aa2f6-87bf-4a06-a206-e0902af3e4bc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_datausage_setcost3g_cost3g_dropdownlist",
    "description": "",
    "helpText": "",
    "name": "Cost3G_Dropdownlist",
    "displayName": "Please select a 3G connection cost value to set: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_datausage_setcost3g_cost3g_dropdownlist_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_datausage_setcost3g_cost3g_dropdownlist_1",
            "description": null,
            "helpText": null,
            "name": "Unrestricted",
            "displayName": "Unrestricted",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_datausage_setcost3g_1",
                    "parentSettingId": "device_vendor_msft_policy_config_datausage_setcost3g"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_datausage_setcost3g_cost3g_dropdownlist_2",
            "description": null,
            "helpText": null,
            "name": "Fixed",
            "displayName": "Fixed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_datausage_setcost3g_1",
                    "parentSettingId": "device_vendor_msft_policy_config_datausage_setcost3g"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_datausage_setcost3g_cost3g_dropdownlist_3",
            "description": null,
            "helpText": null,
            "name": "Variable",
            "displayName": "Variable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_datausage_setcost3g_1",
                    "parentSettingId": "device_vendor_msft_policy_config_datausage_setcost3g"
                }
            ],
            "dependedOnBy": []
        }
    ]
}