{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "VideoPowerDownTimeOutAC_2",
        "Turn off the display (plugged in) (Device)",
        "\\System\\Power Management\\Video and Display Settings",
        "Power",
        "Video and Display Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-power#power-displayofftimeoutpluggedin"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Power/DisplayOffTimeoutPluggedIn",
    "rootDefinitionId": "device_vendor_msft_policy_config_power_displayofftimeoutpluggedin",
    "categoryId": "01bbe7c3-10eb-40a3-8387-c74c33c294b1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_power_displayofftimeoutpluggedin",
    "description": "This policy setting allows you to specify the period of inactivity before Windows turns off the display.\r\n\r\nIf you enable this policy setting, you must provide a value, in seconds, indicating how much idle time should elapse before Windows turns off the display.\r\n\r\nIf you disable or do not configure this policy setting, users control this setting.\r\n\r\nIf the user has configured a slide show to run on the lock screen when the machine is locked, this can prevent the display from turning off.  The \"Prevent enabling lock screen slide show\" policy setting can be used to disable the slide show feature.",
    "helpText": "",
    "name": "VideoPowerDownTimeOutAC_2",
    "displayName": "Turn off the display (plugged in)",
    "defaultOptionId": "device_vendor_msft_policy_config_power_displayofftimeoutpluggedin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_power_displayofftimeoutpluggedin_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_power_displayofftimeoutpluggedin_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_power_displayofftimeoutpluggedin_entervideoacpowerdowntimeout",
                    "required": true
                }
            ]
        }
    ]
}