{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "AddonManagement_AddOnList",
        "Add-on List",
        "\\Windows Components\\Internet Explorer\\Security Features\\Add-on Management",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Security Features\\Add-on Management",
        "Add-on Management"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/AllowAddOnList",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_allowaddonlist",
    "categoryId": "89c0381d-3b9b-4be5-8077-ffb18d47e910",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_internetexplorer_allowaddonlist_addonlist",
    "description": "",
    "helpText": "",
    "name": "AddOnList",
    "displayName": "Add-on List (Device)",
    "childIds": [
        "device_vendor_msft_policy_config_internetexplorer_allowaddonlist_addonlist_key",
        "device_vendor_msft_policy_config_internetexplorer_allowaddonlist_addonlist_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_internetexplorer_allowaddonlist_1",
            "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_allowaddonlist"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_internetexplorer_allowaddonlist_addonlist_key",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_internetexplorer_allowaddonlist_addonlist_value",
            "required": true
        }
    ]
}