{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SourceAutoUpdateInterval",
        "Set App Installer Source Auto Update Interval In Minutes",
        "\\Windows Components\\Desktop App Installer",
        "Administrative Templates\\Windows Components\\Desktop App Installer",
        "Desktop App Installer"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DesktopAppInstaller/SourceAutoUpdateInterval",
    "rootDefinitionId": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval",
    "categoryId": "70063d93-03f0-462e-9943-b0241b88d54d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval_sourceautoupdateinterval",
    "description": "",
    "helpText": "",
    "name": "SourceAutoUpdateInterval",
    "displayName": "Source Auto Update Interval In Minutes (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 43200,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 5
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval_1",
            "parentSettingId": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval"
        }
    ],
    "dependedOnBy": []
}