{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Notepad",
        "Notepad",
        "\\Windows Components\\Microsoft User Experience Virtualization\\Applications",
        "Administrative Templates\\Windows Components\\Microsoft User Experience Virtualization\\Applications",
        "Applications"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-userexperiencevirtualization#admx-userexperiencevirtualization-notepad"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserExperienceVirtualization/Notepad",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_userexperiencevirtualization_notepad",
    "categoryId": "3afbcb74-88c5-4a41-bdc2-82c117b4e82e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_userexperiencevirtualization_notepad",
    "description": "This policy setting configures the synchronization of user settings of Notepad.\r\nBy default, the user settings of Notepad synchronize between computers. Use the policy setting to prevent the user settings of Notepad from synchronization between computers. \r\nIf you enable this policy setting, the Notepad user settings continue to synchronize. \r\nIf you disable this policy setting, Notepad user settings are excluded from the synchronization settings.\r\nIf you do not configure this policy setting, any defined values will be deleted.\r\n      \r\n ",
    "helpText": "",
    "name": "Notepad",
    "displayName": "Notepad",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_userexperiencevirtualization_notepad_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_userexperiencevirtualization_notepad_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userexperiencevirtualization_notepad_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}