{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DFSDiscoverDC",
        "Configure how often a DFS client discovers domain controllers",
        "\\Network",
        "Administrative Templates\\Network",
        "Network"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DFS/DFSDiscoverDC",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_dfs_dfsdiscoverdc",
    "categoryId": "dad3971c-b07b-461b-8ead-6eda80ee57e1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_dfs_dfsdiscoverdc_dfsdiscoverdialog",
    "description": null,
    "helpText": "",
    "name": "DFSDiscoverDialog",
    "displayName": "Time in minutes: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 360,
        "minimumValue": 15
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 15
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_dfs_dfsdiscoverdc_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_dfs_dfsdiscoverdc"
        }
    ],
    "dependedOnBy": []
}