{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "MaxProcessesPerShell",
        "Specify maximum number of processes per Shell",
        "\\Windows Components\\Windows Remote Shell",
        "Administrative Templates\\Windows Components\\Windows Remote Shell",
        "Windows Remote Shell"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-remoteshell#remoteshell-specifymaxprocesses"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteShell/SpecifyMaxProcesses",
    "rootDefinitionId": "device_vendor_msft_policy_config_remoteshell_specifymaxprocesses",
    "categoryId": "1219a9c2-dccb-445f-9f90-8e86e2de22d6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_remoteshell_specifymaxprocesses",
    "description": "This policy setting configures the maximum number of processes a remote shell is allowed to launch.\r\n\r\nIf you enable this policy setting, you can specify any number from 0 to 0x7FFFFFFF to set the maximum number of process per shell. Zero (0) means unlimited number of processes.\r\n\r\nIf you disable or do not configure this policy setting,  the limit is five processes per shell.",
    "helpText": "",
    "name": "MaxProcessesPerShell",
    "displayName": "Specify maximum number of processes per Shell",
    "defaultOptionId": "device_vendor_msft_policy_config_remoteshell_specifymaxprocesses_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_remoteshell_specifymaxprocesses_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remoteshell_specifymaxprocesses_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_remoteshell_specifymaxprocesses_maxprocessespershell",
                    "required": true
                }
            ]
        }
    ]
}