{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WFPDllCacheDir",
        "Specify Windows File Protection cache location",
        "\\System\\Windows File Protection",
        "Administrative Templates\\System\\Windows File Protection",
        "Windows File Protection"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsFileProtection/WFPDllCacheDir",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir",
    "categoryId": "dbb76878-34a9-4f87-bbc6-4de7ea223ff4",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir_wfpdllcachedirbox",
    "description": "\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "WFPDllCacheDirBox",
    "displayName": "Cache file path: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.9",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.21322",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir"
        }
    ],
    "dependedOnBy": []
}