{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "EncryptionMethodWithXts_Name",
        "Choose drive encryption method and cipher strength (Windows 10 [Version 1511] and later)",
        "\\Windows Components\\BitLocker Drive Encryption",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption",
        "BitLocker Drive Encryption"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp#encryptionmethodbydrivetype"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/EncryptionMethodByDriveType",
    "rootDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
    "categoryId": "0101d1d0-1e54-47b0-a749-62c6bd7ab3da",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
    "description": "",
    "helpText": "",
    "name": "EncryptionMethodWithXtsRdvDropDown_Name",
    "displayName": "Select the encryption method for removable data drives:",
    "defaultOptionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_3",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_3",
            "description": null,
            "helpText": null,
            "name": "AES-CBC 128-bit  (default)",
            "displayName": "AES-CBC 128-bit  (default)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_4",
            "description": null,
            "helpText": null,
            "name": "AES-CBC 256-bit",
            "displayName": "AES-CBC 256-bit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_6",
            "description": null,
            "helpText": null,
            "name": "XTS-AES 128-bit",
            "displayName": "XTS-AES 128-bit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_7",
            "description": null,
            "helpText": null,
            "name": "XTS-AES 256-bit",
            "displayName": "XTS-AES 256-bit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype"
                }
            ],
            "dependedOnBy": []
        }
    ]
}