{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RA_Optimize_Bandwidth",
        "Turn on bandwidth optimization",
        "\\System\\Remote Assistance",
        "Administrative Templates\\System\\Remote Assistance",
        "Remote Assistance"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-remoteassistance#admx-remoteassistance-ra-optimize-bandwidth"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemoteAssistance/RA_Optimize_Bandwidth",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth",
    "categoryId": "12a1b259-a0d5-4505-aedf-b8ca811cd5f9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth",
    "description": "This policy setting allows you to improve performance in low bandwidth scenarios.\r\n\r\nThis setting is incrementally scaled from \"No optimization\" to \"Full optimization\".  Each incremental setting includes the previous optimization setting.\r\n\r\nFor example:\r\n\r\n\"Turn off background\" will include the following optimizations:\r\n-No full window drag\r\n-Turn off background\r\n\r\n\"Full optimization\" will include the following optimizations:\r\n-Use 16-bit color (8-bit color in Windows Vista)\r\n-Turn off font smoothing (not supported in Windows Vista)\r\n-No full window drag\r\n-Turn off background\r\n\r\nIf you enable this policy setting, bandwidth optimization occurs at the level specified.\r\n\r\nIf you disable this policy setting, application-based settings are used.\r\n\r\nIf you do not configure this policy setting, application-based settings are used.\r\n ",
    "helpText": "",
    "name": "RA_Optimize_Bandwidth",
    "displayName": "Turn on bandwidth optimization",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_remoteassistance_ra_optimize_bandwidth_ra_optimize_bandwidth_list",
                    "required": true
                }
            ]
        }
    ]
}