{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExploitGuard_ControlledFolderAccess_ProtectedFolders",
        "Configure protected folders",
        "\\Windows Components\\Microsoft Defender Antivirus\\Microsoft Defender Exploit Guard\\Controlled Folder Access",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Microsoft Defender Exploit Guard\\Controlled Folder Access",
        "Controlled Folder Access"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/ExploitGuard_ControlledFolderAccess_ProtectedFolders",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders",
    "categoryId": "98c9cd71-f6eb-4dfd-b045-85c7e0b44487",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders_exploitguard_controlledfolderaccess_protectedfolders",
    "description": null,
    "helpText": "",
    "name": "ExploitGuard_ControlledFolderAccess_ProtectedFolders",
    "displayName": "Enter the folders that should be guarded: (Device)",
    "childIds": [
        "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders_exploitguard_controlledfolderaccess_protectedfolders_key",
        "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders_exploitguard_controlledfolderaccess_protectedfolders_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders_exploitguard_controlledfolderaccess_protectedfolders_key",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_exploitguard_controlledfolderaccess_protectedfolders_exploitguard_controlledfolderaccess_protectedfolders_value",
            "required": true
        }
    ]
}