{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Client Settings",
        "Elevation",
        "Privilege Management",
        "Privilege Management Elevation Client Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "PrivilegeManagement/ElevationClientSettings/EnableEPM",
    "rootDefinitionId": "device_vendor_msft_policy_elevationclientsettings_enableepm",
    "categoryId": "b750fe41-33c4-4293-8dfc-42285be35752",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "id": "device_vendor_msft_policy_elevationclientsettings_enableepm",
    "description": "",
    "helpText": null,
    "name": "EndpointPrivilegeManagement",
    "displayName": "Endpoint Privilege Management",
    "defaultOptionId": "device_vendor_msft_policy_elevationclientsettings_enableepm_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,endpointPrivilegeManagement",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19042",
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_elevationclientsettings_enableepm_1",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_elevationclientsettings_allowelevationdetection",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_elevationclientsettings_defaultelevationresponse",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_elevationclientsettings_senddata",
                    "required": true
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_elevationclientsettings_enableepm_0",
            "description": "Turning off this feature will uninstall the companion client from assigned devices if one is already installed",
            "helpText": "Turning off this feature will uninstall the companion client from assigned devices if one is already installed",
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}