{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "iSCSIGeneral_ChangeIQNName",
        "Do not allow changes to initiator iqn name",
        "\\System\\iSCSI\\General iSCSI",
        "Administrative Templates\\System\\iSCSI\\General iSCSI",
        "General iSCSI"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-iscsi#admx-iscsi-iscsigeneral-changeiqnname"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_iSCSI/iSCSIGeneral_ChangeIQNName",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_iscsi_iscsigeneral_changeiqnname",
    "categoryId": "7d7f6a09-2088-4f1f-a1f1-14fbca93a808",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_iscsi_iscsigeneral_changeiqnname",
    "description": "  If enabled then do not allow the initiator iqn name to be changed. If disabled then the initiator iqn name may be changed.\r\n ",
    "helpText": "",
    "name": "iSCSIGeneral_ChangeIQNName",
    "displayName": "Do not allow changes to initiator iqn name",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_iscsi_iscsigeneral_changeiqnname_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_iscsi_iscsigeneral_changeiqnname_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_iscsi_iscsigeneral_changeiqnname_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}