{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Disable Store Originated Apps",
        "Application Management",
        "Microsoft App Store"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-ApplicationManagement#applicationmanagement-disablestoreoriginatedapps"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ApplicationManagement/DisableStoreOriginatedApps",
    "rootDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_disablestoreoriginatedapps",
    "categoryId": "a0c9f0b7-aa25-4e9c-a393-516145847b8b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_applicationmanagement_disablestoreoriginatedapps",
    "description": "Boolean value that disables the launch of all apps from Microsoft Store that came pre-installed or were downloaded.",
    "helpText": "",
    "name": "DisableStoreOriginatedApps",
    "displayName": "Disable Store Originated Apps",
    "defaultOptionId": "device_vendor_msft_policy_config_applicationmanagement_disablestoreoriginatedapps_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_applicationmanagement_disablestoreoriginatedapps_0",
            "description": "Enable launch of apps.",
            "helpText": null,
            "name": "Enable launch of apps.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationmanagement_disablestoreoriginatedapps_1",
            "description": "Disable launch of apps.",
            "helpText": null,
            "name": "Disable launch of apps.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}