{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "DisallowNegotiate_2",
        "Disallow Negotiate authentication",
        "\\Windows Components\\Windows Remote Management (WinRM)\\WinRM Client",
        "Administrative Templates\\Windows Components\\Windows Remote Management (WinRM)\\WinRM Client",
        "WinRM Client"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-remotemanagement#remotemanagement-disallownegotiateauthenticationclient"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteManagement/DisallowNegotiateAuthenticationClient",
    "rootDefinitionId": "device_vendor_msft_policy_config_remotemanagement_disallownegotiateauthenticationclient",
    "categoryId": "c919e047-97fc-489f-ab0e-bcb070e36c55",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_remotemanagement_disallownegotiateauthenticationclient",
    "description": "This policy setting allows you to manage whether the Windows Remote Management (WinRM) client uses Negotiate authentication.\r\n\r\nIf you enable this policy setting, the WinRM client does not use Negotiate authentication.\r\n\r\nIf you disable or do not configure this policy setting, the WinRM client uses Negotiate authentication.",
    "helpText": "",
    "name": "DisallowNegotiate_2",
    "displayName": "Disallow Negotiate authentication",
    "defaultOptionId": "device_vendor_msft_policy_config_remotemanagement_disallownegotiateauthenticationclient_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_remotemanagement_disallownegotiateauthenticationclient_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remotemanagement_disallownegotiateauthenticationclient_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}