{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AxISURLZonePolicies",
        "Establish ActiveX installation policy for sites in Trusted zones",
        "\\Windows Components\\ActiveX Installer Service",
        "Administrative Templates\\Windows Components\\ActiveX Installer Service",
        "ActiveX Installer Service"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-activexinstallservice#admx-activexinstallservice-axisurlzonepolicies"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ActiveXInstallService/AxISURLZonePolicies",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies",
    "categoryId": "78906e32-f4fb-453b-939b-05717ffaae59",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies",
    "description": "This policy setting controls the installation of ActiveX controls for sites in Trusted zone. \r\n\r\nIf you enable this policy setting, ActiveX controls are installed according to the settings defined by this policy setting. \r\n      \r\nIf you disable or do not configure this policy setting, ActiveX controls prompt the user before installation. \r\n\r\nIf the trusted site uses the HTTPS protocol, this policy setting can also control how ActiveX Installer Service responds to certificate errors. By default all HTTPS connections must supply a server certificate that passes all validation criteria. If you are aware that a trusted site has a certificate error but you want to trust it anyway you can select the certificate errors that you want to ignore. \r\n    \r\nNote: This policy setting applies to all sites in Trusted zones.\r\n\r\n ",
    "helpText": "",
    "name": "AxISURLZonePolicies",
    "displayName": "Establish ActiveX installation policy for sites in Trusted zones",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installtrustedocx",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installsignedocx",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_installunsignedocx",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_ignoreunknownca",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_ignoreinvalidcn",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_ignoreinvalidcertdate",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_activexinstallservice_axisurlzonepolicies_ignorewrongcertusage",
                    "required": true
                }
            ]
        }
    ]
}