{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Pol_SecGuide_0101_WDPUA",
        "Turn on Windows Defender protection against Potentially Unwanted Applications (DEPRECATED)",
        "\\MS Security Guide",
        "MS Security Guide"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-mssecurityguide#mssecurityguide-turnonwindowsdefenderprotectionagainstpotentiallyunwantedapplications"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/MSSecurityGuide/TurnOnWindowsDefenderProtectionAgainstPotentiallyUnwantedApplications",
    "rootDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_turnonwindowsdefenderprotectionagainstpotentiallyunwantedapplications",
    "categoryId": "5371d50c-0aaa-425a-a075-2cb1c59968b9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_mssecurityguide_turnonwindowsdefenderprotectionagainstpotentiallyunwantedapplications",
    "description": "If this setting is enabled, Windows Defender protects against Potentially Unwanted Applications. For more information, see https://blogs.technet.microsoft.com/mmpc/2015/11/25/shields-up-on-potentially-unwanted-applications-in-your-enterprise/.\r\n\r\nIf this setting is disabled or not configured, Potentially Unwanted Application protection is disabled.\r\n\r\nBeginning with Windows 10 v1809 and Windows Server 2019, this functionality should instead be configured through the following Group Policy setting:\r\nComputer Configuration\\Administrative Templates\\Windows Components\\Windows Defender Antivirus, Configure detection for potentially unwanted applications.\r\n",
    "helpText": "",
    "name": "Pol_SecGuide_0101_WDPUA",
    "displayName": "Turn on Windows Defender protection against Potentially Unwanted Applications (DEPRECATED)",
    "defaultOptionId": "device_vendor_msft_policy_config_mssecurityguide_turnonwindowsdefenderprotectionagainstpotentiallyunwantedapplications_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_mssecurityguide_turnonwindowsdefenderprotectionagainstpotentiallyunwantedapplications_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mssecurityguide_turnonwindowsdefenderprotectionagainstpotentiallyunwantedapplications_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}