{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WCM_MinimizeConnections",
        "Minimize the number of simultaneous connections to the Internet or a Windows Domain",
        "\\Network\\Windows Connection Manager",
        "Administrative Templates\\Network\\Windows Connection Manager",
        "Windows Connection Manager"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WCM/WCM_MinimizeConnections",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections",
    "categoryId": "618e0144-c57c-45e1-8b55-94dd3d9fec33",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options",
    "description": null,
    "helpText": "",
    "name": "WCM_MinimizeConnections_Options",
    "displayName": "Minimize Policy Options (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_0",
            "description": null,
            "helpText": null,
            "name": "0 = Allow simultaneous connections",
            "displayName": "0 = Allow simultaneous connections",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_1",
            "description": null,
            "helpText": null,
            "name": "1 = Minimize simultaneous connections",
            "displayName": "1 = Minimize simultaneous connections",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_2",
            "description": null,
            "helpText": null,
            "name": "2 = Stay connected to cellular",
            "displayName": "2 = Stay connected to cellular",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_3",
            "description": null,
            "helpText": null,
            "name": "3 = Prevent Wi-Fi when on Ethernet",
            "displayName": "3 = Prevent Wi-Fi when on Ethernet",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections"
                }
            ],
            "dependedOnBy": []
        }
    ]
}