{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_SELECT_TRANSPORT",
        "Select RDP transport protocols",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Connections",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Connections",
        "Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-terminalserver#admx-terminalserver-ts-select-transport"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_SELECT_TRANSPORT",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport",
    "categoryId": "0c2613c9-a7c7-4458-8b0d-2fff13e2beeb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport",
    "description": "This policy setting allows you to specify which protocols can be used for Remote Desktop Protocol (RDP) access to this server.\r\n\r\nIf you enable this policy setting, you must specify if you would like RDP to use UDP.\r\n\r\nYou can select one of the following options: \"Use both UDP and TCP\", \"Use only TCP\" or \"Use either UDP or TCP (default)\" \r\n\r\nIf you select \"Use either UDP or TCP\" and the UDP connection is successful, most of the RDP traffic will use UDP.\r\n\r\nIf the UDP connection is not successful or if you select \"Use only TCP,\" all of the RDP traffic will use TCP.\r\n\r\nIf you disable or do not configure this policy setting, RDP will choose the optimal protocols for delivering the best user experience.\r\n\t  \r\n ",
    "helpText": "",
    "name": "TS_SELECT_TRANSPORT",
    "displayName": "Select RDP transport protocols",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_terminalserver_ts_select_transport_ts_select_transport_type",
                    "required": true
                }
            ]
        }
    ]
}