{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS_AppendToMultiLabelName",
        "Allow DNS suffix appending to unqualified multi-label name queries",
        "\\Network\\DNS Client",
        "Administrative Templates\\Network\\DNS Client",
        "DNS Client"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-dnsclient#admx-dnsclient-dns-appendtomultilabelname"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DnsClient/DNS_AppendToMultiLabelName",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_dnsclient_dns_appendtomultilabelname",
    "categoryId": "bd8dacbf-ab7b-4a93-8294-7db61b9d49b4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_dnsclient_dns_appendtomultilabelname",
    "description": "Specifies that computers may attach suffixes to an unqualified multi-label name before sending subsequent DNS queries if the original name query fails.\r\n\r\nA name containing dots, but not dot-terminated, is called an unqualified multi-label name, for example \"server.corp\" is an unqualified multi-label name. The name \"server.corp.contoso.com.\" is an example of a fully qualified name because it contains a terminating dot.\r\n\r\nFor example, if attaching suffixes is allowed, an unqualified multi-label name query for \"server.corp\" will be queried by the DNS client first. If the query succeeds, the response is returned to the client. If the query fails, the unqualified multi-label name is appended with DNS suffixes. These suffixes can be derived from a combination of the local DNS client's primary domain suffix, a connection-specific domain suffix, and a DNS suffix search list.\r\n\r\nIf attaching suffixes is allowed, and a DNS client with a primary domain suffix of \"contoso.com\" performs a query for \"server.corp\" the DNS client will send a query for \"server.corp\" first, and then a query for \"server.corp.contoso.com.\" second if the first query fails.\r\n\r\nIf you enable this policy setting, suffixes are allowed to be appended to an unqualified multi-label name if the original name query fails.\r\n\r\nIf you disable this policy setting, no suffixes are appended to unqualified multi-label name queries if the original name query fails.\r\n\r\nIf you do not configure this policy setting, computers will use their local DNS client settings to determine the query behavior for unqualified multi-label names.\n ",
    "helpText": "",
    "name": "DNS_AppendToMultiLabelName",
    "displayName": "Allow DNS suffix appending to unqualified multi-label name queries",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_dnsclient_dns_appendtomultilabelname_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_dnsclient_dns_appendtomultilabelname_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_dnsclient_dns_appendtomultilabelname_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}