{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "RDVDenyWriteAccess_Name",
        "Deny write access to removable drives not protected by BitLocker",
        "\\Windows Components\\BitLocker Drive Encryption\\Removable Data Drives",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Removable Data Drives",
        "Removable Data Drives"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/RemovableDrivesRequireEncryption",
    "rootDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
    "categoryId": "949a5b32-bbe6-40f6-9d73-99cf9fafe75f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
    "description": "This policy setting configures whether BitLocker protection is required for a computer to be able to write data to a removable data drive.\r\n\r\nIf you enable this policy setting, all removable data drives that are not BitLocker-protected will be mounted as read-only. If the drive is protected by BitLocker, it will be mounted with read and write access.\r\n\r\nIf the \"Deny write access to devices configured in another organization\" option is selected, only drives with identification fields matching the computer's identification fields will be given write access. When a removable data drive is accessed it will be checked for valid identification field and allowed identification fields. These fields are defined by the \"Provide the unique identifiers for your organization\" policy setting.\r\n\r\nIf you disable or do not configure this policy setting, all removable data drives on the computer will be mounted with read and write access.\r\n\r\nNote: This policy setting can be overridden by the policy settings under User Configuration\\Administrative Templates\\System\\Removable Storage Access. If the \"Removable Disks: Deny write access\" policy setting is enabled this policy setting will be ignored.\r\n\r\n      ",
    "helpText": "",
    "name": "RDVDenyWriteAccess_Name",
    "displayName": "Deny write access to removable drives not protected by BitLocker",
    "defaultOptionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
                    "required": true
                }
            ]
        }
    ]
}