{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_MSS_KeepAliveTime",
        "MSS: (KeepAliveTime) How often keep-alive packets are sent in milliseconds",
        "\\MSS (Legacy)",
        "Administrative Templates\\MSS (Legacy)",
        "MSS (Legacy)"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MSS-legacy/Pol_MSS_KeepAliveTime",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime",
    "categoryId": "e00ff1f8-a2d1-4d3b-bb07-f58b38b8d5d7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime",
    "description": null,
    "helpText": "",
    "name": "KeepAliveTime",
    "displayName": "KeepAliveTime (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_300000",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_150000",
            "description": null,
            "helpText": null,
            "name": "150000 or 2.5 minutes",
            "displayName": "150000 or 2.5 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "150000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_300000",
            "description": null,
            "helpText": null,
            "name": "300000 or 5 minutes (recommended) ",
            "displayName": "300000 or 5 minutes (recommended) ",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "300000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_600000",
            "description": null,
            "helpText": null,
            "name": "600000 or 10 minutes",
            "displayName": "600000 or 10 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "600000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_1200000",
            "description": null,
            "helpText": null,
            "name": "1200000 or 20 minutes",
            "displayName": "1200000 or 20 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1200000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_2400000",
            "description": null,
            "helpText": null,
            "name": "2400000 or 40 minutes",
            "displayName": "2400000 or 40 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2400000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_3600000",
            "description": null,
            "helpText": null,
            "name": "3600000 or 1 hour",
            "displayName": "3600000 or 1 hour",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3600000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_keepalivetime_7200000",
            "description": null,
            "helpText": null,
            "name": "7200000 or 2 hours (default value)",
            "displayName": "7200000 or 2 hours (default value)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7200000"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_keepalivetime"
                }
            ],
            "dependedOnBy": []
        }
    ]
}