{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RpcMinimumHttpConnectionTimeout",
        "Set Minimum Idle Connection Timeout for RPC/HTTP connections",
        "\\System\\Remote Procedure Call",
        "Administrative Templates\\System\\Remote Procedure Call",
        "Remote Procedure Call"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RPC/RpcMinimumHttpConnectionTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout",
    "categoryId": "73a3a483-dcba-4b34-b7cb-9c68c871864c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout_rpcminimumhttpconnectiontimeoutvalue",
    "description": null,
    "helpText": "",
    "name": "RpcMinimumHttpConnectionTimeoutValue",
    "displayName": "Minimum Idle Connection Timeout (in seconds): (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 9999,
        "minimumValue": 90
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 900
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout"
        }
    ],
    "dependedOnBy": []
}