{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Attack Surface Reduction Rules",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Defender/AttackSurfaceReductionRules",
    "rootDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb",
    "description": "With this rule, admins can prevent unsigned or untrusted scripts (such as VBScript, JavaScript) and executables (such as .exe, .dll, .scr files) from removable USB drives, including attached SD cards, from running.",
    "helpText": "",
    "name": "BlockUntrustedUnsignedProcessesThatRunFromUSB",
    "displayName": "Block untrusted and unsigned processes that run from USB",
    "defaultOptionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_off",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_off",
            "description": null,
            "helpText": null,
            "name": "Off",
            "displayName": "Off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "b2b3f03d-6a65-4f7b-a9c7-1c7ef74a9ba4=0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_block",
            "description": null,
            "helpText": null,
            "name": "Block",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "b2b3f03d-6a65-4f7b-a9c7-1c7ef74a9ba4=1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_perruleexclusions",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_audit",
            "description": null,
            "helpText": null,
            "name": "Audit",
            "displayName": "Audit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "b2b3f03d-6a65-4f7b-a9c7-1c7ef74a9ba4=2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_perruleexclusions",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_warn",
            "description": null,
            "helpText": null,
            "name": "Warn",
            "displayName": "Warn",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "b2b3f03d-6a65-4f7b-a9c7-1c7ef74a9ba4=6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_perruleexclusions",
                    "required": false
                }
            ]
        }
    ]
}