{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PruningRetries",
        "Directory pruning retry",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing2/PruningRetries",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing2_pruningretries",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle",
    "description": null,
    "helpText": "",
    "name": "PruningRetriesTitle",
    "displayName": "Retries: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_0",
            "description": null,
            "helpText": null,
            "name": "No Retry",
            "displayName": "No Retry",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningretries_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningretries"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_1",
            "description": null,
            "helpText": null,
            "name": "1 Retry",
            "displayName": "1 Retry",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningretries_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningretries"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_2",
            "description": null,
            "helpText": null,
            "name": "2 Retries",
            "displayName": "2 Retries",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningretries_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningretries"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_3",
            "description": null,
            "helpText": null,
            "name": "3 Retries",
            "displayName": "3 Retries",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningretries_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningretries"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_4",
            "description": null,
            "helpText": null,
            "name": "4 Retries",
            "displayName": "4 Retries",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningretries_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningretries"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_5",
            "description": null,
            "helpText": null,
            "name": "5 Retries",
            "displayName": "5 Retries",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningretries_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningretries"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretries_pruningretriestitle_6",
            "description": null,
            "helpText": null,
            "name": "6 Retries",
            "displayName": "6 Retries",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_pruningretries_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_pruningretries"
                }
            ],
            "dependedOnBy": []
        }
    ]
}