{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "VPN Connection",
        "Connection Name"
    ],
    "infoUrls": [],
    "baseUri": "./device/vendor/msft/vpnconnection",
    "offsetUri": "/connectionname",
    "rootDefinitionId": "device_vendor_msft_vpnconnection_connectionname",
    "categoryId": "7f5517b0-3ff7-4f7e-aa4c-3d2ccbf37bdc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_vpnconnection_connectionname",
    "description": "This is a descriptive name for the VPN connection and will be displayed to end-users on their device.",
    "helpText": "",
    "name": "connectionname",
    "displayName": "Connection name",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10VPN/policyJourneyState/0",
    "redirectMessage": "Create a VPN Connection policy",
    "redirectReason": "The \"VPN Connection\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}