{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Throttle For Scheduled Scan Only",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Defender-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Defender",
    "offsetUri": "/Configuration/ThrottleForScheduledScanOnly",
    "rootDefinitionId": "device_vendor_msft_defender_configuration_throttleforscheduledscanonly",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_defender_configuration_throttleforscheduledscanonly",
    "description": "A CPU usage limit can be applied to scheduled scans only, or to scheduled and custom scans. The default value applies a CPU usage limit to scheduled scans only.",
    "helpText": "",
    "name": "ThrottleForScheduledScanOnly",
    "displayName": "Throttle For Scheduled Scan Only",
    "defaultOptionId": "device_vendor_msft_defender_configuration_throttleforscheduledscanonly_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.3",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_defender_configuration_throttleforscheduledscanonly_1",
            "description": "If you enable this setting, CPU throttling will apply only to scheduled scans.",
            "helpText": null,
            "name": "If you enable this setting, CPU throttling will apply only to scheduled scans.",
            "displayName": "If you enable this setting, CPU throttling will apply only to scheduled scans.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_defender_configuration_throttleforscheduledscanonly_0",
            "description": "If you disable this setting, CPU throttling will apply to scheduled and custom scans.",
            "helpText": null,
            "name": "If you disable this setting, CPU throttling will apply to scheduled and custom scans.",
            "displayName": "If you disable this setting, CPU throttling will apply to scheduled and custom scans.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}