{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WdiScenarioExecutionPolicy",
        "Configure MSI Corrupted File Recovery behavior",
        "\\System\\Troubleshooting and Diagnostics\\MSI Corrupted File Recovery",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\MSI Corrupted File Recovery",
        "MSI Corrupted File Recovery"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-msifilerecovery#admx-msifilerecovery-wdiscenarioexecutionpolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MsiFileRecovery/WdiScenarioExecutionPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy",
    "categoryId": "2ac8fe19-ca17-4533-8818-a5e12030de51",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy",
    "description": "This policy setting allows you to configure the recovery behavior for corrupted MSI files to one of three states:\r\n\r\nPrompt for Resolution: Detection, troubleshooting, and recovery of corrupted MSI applications will be turned on. Windows will prompt the user with a dialog box when application reinstallation is required. This is the default recovery behavior on Windows client.\r\n\r\nSilent: Detection, troubleshooting, and notification of MSI application to reinstall will occur with no UI. Windows will log an event when corruption is determined and will suggest the application that should be re-installed. This behavior is recommended for headless operation and is the default recovery behavior on Windows server.\r\n\r\nTroubleshooting Only: Detection and verification of file corruption will be performed without UI.  Recovery is not attempted.\r\n\r\nIf you enable this policy setting, the recovery behavior for corrupted files is set to either the Prompt For Resolution (default on Windows client), Silent (default on Windows server), or Troubleshooting Only.  \r\n\r\nIf you disable this policy setting, the troubleshooting and recovery behavior for corrupted files will be disabled. No troubleshooting or resolution will be attempted.\r\n\r\nIf you do not configure this policy setting, the recovery behavior for corrupted files will be set to the default recovery behavior.\r\n\r\nNo system or service restarts are required for changes to this policy setting to take immediate effect after a Group Policy refresh.\r\n\r\nNote:  This policy setting will take effect only when the Diagnostic Policy Service (DPS) is in the running state. When the service is stopped or disabled, system file recovery will not be attempted. The DPS can be configured with the Services snap-in to the Microsoft Management Console.\r\n ",
    "helpText": "",
    "name": "WdiScenarioExecutionPolicy",
    "displayName": "Configure MSI Corrupted File Recovery behavior",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_wdiscenarioexecutionpolicylevel",
                    "required": true
                }
            ]
        }
    ]
}