{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AllowSystemSleepWithRemoteFilesOpenDC",
        "Allow automatic sleep with Open Network Files (on battery)",
        "\\System\\Power Management\\Sleep Settings",
        "Administrative Templates\\System\\Power Management\\Sleep Settings",
        "Sleep Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-power#admx-power-allowsystemsleepwithremotefilesopendc"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/AllowSystemSleepWithRemoteFilesOpenDC",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_allowsystemsleepwithremotefilesopendc",
    "categoryId": "4b2f3557-98e9-48d2-9b78-bcb100f72372",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_power_allowsystemsleepwithremotefilesopendc",
    "description": "This policy setting allows you to manage automatic sleep with open network files.\r\n\r\nIf you enable this policy setting, the computer automatically sleeps when network files are open.\r\n\r\nIf you disable or do not configure this policy setting, the computer does not automatically sleep when network files are open.\r\n ",
    "helpText": "",
    "name": "AllowSystemSleepWithRemoteFilesOpenDC",
    "displayName": "Allow automatic sleep with Open Network Files (on battery)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_allowsystemsleepwithremotefilesopendc_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_allowsystemsleepwithremotefilesopendc_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_allowsystemsleepwithremotefilesopendc_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}