{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DenyFreshCredentials",
        "Deny delegating fresh credentials",
        "\\System\\Credentials Delegation",
        "Administrative Templates\\System\\Credentials Delegation",
        "Credentials Delegation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-credssp#admx-credssp-denyfreshcredentials"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_CredSsp/DenyFreshCredentials",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_credssp_denyfreshcredentials",
    "categoryId": "cae68a5f-9d1e-44e8-a34b-6a390b88c451",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_credssp_denyfreshcredentials",
    "description": "This policy setting applies to applications using the Cred SSP component (for example: Remote Desktop Connection).\r\n\r\nIf you enable this policy setting, you can specify the servers to which the user's fresh credentials cannot be delegated (fresh credentials are those that you are prompted for when executing the application).\r\n\r\nIf you disable or do not configure (by default) this policy setting, this policy setting does not specify any server.\r\n\r\nNote: The \"Deny delegating fresh credentials\" policy setting can be set to one or more Service Principal Names (SPNs). The SPN represents the target server to which the user credentials cannot be delegated. The use of a single wildcard character is permitted when specifying the SPN.\r\n\r\nFor Example:\r\nTERMSRV/host.humanresources.fabrikam.com Remote Desktop Session Host running on host.humanresources.fabrikam.com machine\r\nTERMSRV/* Remote Desktop Session Host running on all machines.\r\nTERMSRV/*.humanresources.fabrikam.com Remote Desktop Session Host running on all machines in .humanresources.fabrikam.com\r\n\r\nThis policy setting can be used in combination with the \"Allow delegating fresh credentials\" policy setting to define exceptions for specific servers that are otherwise permitted when using wildcard characters in the \"Allow delegating fresh credentials\" server list.\r\n ",
    "helpText": "",
    "name": "DenyFreshCredentials",
    "displayName": "Deny delegating fresh credentials",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_credssp_denyfreshcredentials_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_credssp_denyfreshcredentials_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_credssp_denyfreshcredentials_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_credssp_denyfreshcredentials_denyfreshcredentials_name",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_credssp_denyfreshcredentials_concatenatedefaults_dfc",
                    "required": true
                }
            ]
        }
    ]
}