{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BITS_MaxJobsPerMachine",
        "Limit the maximum number of BITS jobs for this computer",
        "\\Network\\Background Intelligent Transfer Service (BITS)",
        "Administrative Templates\\Network\\Background Intelligent Transfer Service (BITS)",
        "Background Intelligent Transfer Service (BITS)"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-bits#admx-bits-bits-maxjobspermachine"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Bits/BITS_MaxJobsPerMachine",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_bits_bits_maxjobspermachine",
    "categoryId": "f2345e03-bcd9-48fc-9c52-11ae06ba625a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_bits_bits_maxjobspermachine",
    "description": "This policy setting limits the number of BITS jobs that can be created for all users of the computer. By default, BITS limits the total number of jobs that can be created on the computer to 300 jobs. You can use this policy setting to raise or lower the maximum number of user BITS jobs.\r\n\r\n          If you enable this policy setting, BITS will limit the maximum number of BITS jobs to the specified number.\r\n\r\n          If you disable or do not configure this policy setting, BITS will use the default BITS job limit of 300 jobs.\r\n\r\n          Note: BITS jobs created by services and the local administrator account do not count toward this limit.\r\n ",
    "helpText": "",
    "name": "BITS_MaxJobsPerMachine",
    "displayName": "Limit the maximum number of BITS jobs for this computer",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_bits_bits_maxjobspermachine_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxjobspermachine_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxjobspermachine_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxjobspermachine_bits_maxjobspermachinelist",
                    "required": true
                }
            ]
        }
    ]
}