{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "AllowSavedCredentialsWhenNTLMOnly",
        "Allow delegating saved credentials with NTLM-only server authentication",
        "\\System\\Credentials Delegation",
        "Administrative Templates\\System\\Credentials Delegation",
        "Credentials Delegation"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_CredSsp/AllowSavedCredentialsWhenNTLMOnly",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_credssp_allowsavedcredentialswhenntlmonly",
    "categoryId": "cae68a5f-9d1e-44e8-a34b-6a390b88c451",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_credssp_allowsavedcredentialswhenntlmonly_allowsavedcredentialswhenntlmonly_name",
    "description": null,
    "helpText": "",
    "name": "AllowSavedCredentialsWhenNTLMOnly_Name",
    "displayName": "Add servers to the list: (Device)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_credssp_allowsavedcredentialswhenntlmonly_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_credssp_allowsavedcredentialswhenntlmonly"
        }
    ],
    "dependedOnBy": []
}