{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Channel_Log_FileLogAccess_2",
        "Configure log access",
        "\\Windows Components\\Event Log Service\\Security",
        "Administrative Templates\\Windows Components\\Event Log Service\\Security",
        "Security"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eventlog#admx-eventlog-channel-log-filelogaccess-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventLog/Channel_Log_FileLogAccess_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_2",
    "categoryId": "8dca6b5f-ff9c-44c8-9822-008acef616aa",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_2",
    "description": "This policy setting specifies the security descriptor to use for the log using the Security Descriptor Definition Language (SDDL) string. You cannot configure write permissions for this log. You must set both \"configure log access\" policy settings for this log in order to affect the both modern and legacy tools.\r\n\r\nIf you enable this policy setting, only those users whose security descriptor matches the configured specified value can access the log.\r\n\r\nIf you disable or do not configure this policy setting, only system software and administrators can read or clear this log.\r\n\r\nNote: If you enable this policy setting, some tools and APIs may ignore it. The same change should be made to the \"Configure log access (legacy)\" policy setting to enforce this change across all tools and APIs.\r\n ",
    "helpText": "",
    "name": "Channel_Log_FileLogAccess_2",
    "displayName": "Configure log access",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_eventlog_channel_log_filelogaccess_2_channel_log_filelogaccess",
                    "required": true
                }
            ]
        }
    ]
}