{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Steaming_Autoload",
        "Specify what to load in background (aka AutoLoad)",
        "\\System\\App-V\\Streaming",
        "AppVirtualization",
        "App Virtualization",
        "Streaming"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/AllowStreamingAutoload",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload",
    "categoryId": "3800661e-5841-4499-8d4e-914527435f59",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_steaming_autoload_options",
    "description": "",
    "helpText": "",
    "name": "Steaming_Autoload_Options",
    "displayName": "Autoload Options",
    "defaultOptionId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_steaming_autoload_options_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_steaming_autoload_options_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_1",
                    "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_steaming_autoload_options_1",
            "description": null,
            "helpText": null,
            "name": "Previously Used",
            "displayName": "Previously Used",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_1",
                    "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_steaming_autoload_options_2",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload_1",
                    "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_allowstreamingautoload"
                }
            ],
            "dependedOnBy": []
        }
    ]
}