{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WdiScenarioExecutionPolicy",
        "Microsoft Support Diagnostic Tool: Configure execution level",
        "\\System\\Troubleshooting and Diagnostics\\Microsoft Support Diagnostic Tool",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\Microsoft Support Diagnostic Tool",
        "Microsoft Support Diagnostic Tool"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-msdt#admx-msdt-wdiscenarioexecutionpolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MSDT/WdiScenarioExecutionPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_msdt_wdiscenarioexecutionpolicy",
    "categoryId": "5c1c00f2-def5-4064-925d-aedf4aa0f060",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_msdt_wdiscenarioexecutionpolicy",
    "description": "This policy setting determines the execution level for Microsoft Support Diagnostic Tool.\r\n\r\nMicrosoft Support Diagnostic Tool (MSDT) gathers diagnostic data for analysis by support professionals.\r\n\r\nIf you enable this policy setting, administrators can use MSDT to collect and send diagnostic data to a support professional to resolve a problem.\r\n\r\nIf you disable this policy setting, MSDT cannot gather diagnostic data.\r\n\r\nIf you do not configure this policy setting, MSDT is turned on by default.\r\n\r\nThis policy setting takes effect only if the diagnostics-wide scenario execution policy is not configured.\r\n\r\nNo reboots or service restarts are required for this policy setting to take effect. Changes take effect immediately.\r\n\r\nThis policy setting will only take effect when the Diagnostic Policy Service (DPS) is in the running state. When the service is stopped or disabled, diagnostic scenarios will not be executed. The DPS can be configured with the Services snap-in to the Microsoft Management Console.\r\n ",
    "helpText": "",
    "name": "WdiScenarioExecutionPolicy",
    "displayName": "Microsoft Support Diagnostic Tool: Configure execution level",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_msdt_wdiscenarioexecutionpolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_msdt_wdiscenarioexecutionpolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_msdt_wdiscenarioexecutionpolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}