{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "IZ_PolicyJavaPermissions_3",
        "Java permissions",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Intranet Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Intranet Zone",
        "Intranet Zone"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-intranetzonejavapermissions"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/IntranetZoneJavaPermissions",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions",
    "categoryId": "76f2d08c-0a3f-4f4e-ad04-51aa16aea0bf",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions",
    "description": "This policy setting allows you to manage permissions for Java applets.\r\n\r\nIf you enable this policy setting, you can choose options from the drop-down box. Custom, to control permissions settings individually.\r\n\r\nLow Safety enables applets to perform all operations.\r\n\r\nMedium Safety enables applets to run in their sandbox (an area in memory outside of which the program cannot make calls), plus capabilities like scratch space (a safe and secure storage area on the client computer) and user-controlled file I/O.\r\n\r\nHigh Safety enables applets to run in their sandbox. Disable Java to prevent any applets from running.\r\n\r\nIf you disable this policy setting, Java applets cannot run.\r\n\r\nIf you do not configure this policy setting, the permission is set to Medium Safety.",
    "helpText": "",
    "name": "IZ_PolicyJavaPermissions_3",
    "displayName": "Java permissions",
    "defaultOptionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions_iz_partname1c00",
                    "required": true
                }
            ]
        }
    ]
}