{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Disable Automatic Re Deployment Credentials",
        "Credential Providers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-CredentialProviders#disableautomaticredeploymentcredentials"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/CredentialProviders/DisableAutomaticReDeploymentCredentials",
    "rootDefinitionId": "device_vendor_msft_policy_config_credentialproviders_disableautomaticredeploymentcredentials",
    "categoryId": "c9ab1080-67a7-4d6c-8213-056d4eb08ea0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_credentialproviders_disableautomaticredeploymentcredentials",
    "description": "Boolean policy to disable the visibility of the credential provider that triggers the PC refresh on a device. This policy does not actually trigger the refresh. The admin user is required to authenticate to trigger the refresh on the target device. The Autopilot Reset feature allows admin to reset devices to a known good managed state while preserving the management enrollment. After the Autopilot Reset is triggered the devices are for ready for use by information workers or students.",
    "helpText": "",
    "name": "DisableAutomaticReDeploymentCredentials",
    "displayName": "Disable Automatic Re Deployment Credentials",
    "defaultOptionId": "device_vendor_msft_policy_config_credentialproviders_disableautomaticredeploymentcredentials_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_credentialproviders_disableautomaticredeploymentcredentials_0",
            "description": "Enable the visibility of the credentials for Autopilot Reset.",
            "helpText": null,
            "name": "Enable the visibility of the credentials for Autopilot Reset.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_credentialproviders_disableautomaticredeploymentcredentials_1",
            "description": "Disable visibility of the credentials for Autopilot Reset.",
            "helpText": null,
            "name": "Disable visibility of the credentials for Autopilot Reset.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}