{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_HonorCipherSuiteOrder",
        "Honor cipher suite order",
        "\\Network\\Lanman Server",
        "Administrative Templates\\Network\\Lanman Server",
        "Lanman Server"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-lanmanserver#admx-lanmanserver-pol-honorciphersuiteorder"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LanmanServer/Pol_HonorCipherSuiteOrder",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_honorciphersuiteorder",
    "categoryId": "fd49df1b-bfad-4ed5-85c2-046a32fa8782",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_lanmanserver_pol_honorciphersuiteorder",
    "description": "This policy setting determines how the SMB server selects a cipher suite when negotiating a new connection with an SMB client.\r\n\r\nIf you enable this policy setting, the SMB server will select the cipher suite it most prefers from the list of client-supported cipher suites, ignoring the client's preferences.\r\n\r\nIf you disable or do not configure this policy setting, the SMB server will select the cipher suite the client most prefers from the list of server-supported cipher suites.\r\n\r\nNote: When configuring this security setting, changes will not take effect until you restart Windows.\n ",
    "helpText": "",
    "name": "Pol_HonorCipherSuiteOrder",
    "displayName": "Honor cipher suite order",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_honorciphersuiteorder_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_honorciphersuiteorder_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_honorciphersuiteorder_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}