{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UserPolicyMode",
        "Configure user Group Policy loopback processing mode",
        "\\System\\Group Policy",
        "Administrative Templates\\System\\Group Policy",
        "Group Policy"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/UserPolicyMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode",
    "categoryId": "deadde1d-7e7f-4577-bd6e-fc237c3854c5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode_userpolicymodeop",
    "description": null,
    "helpText": "",
    "name": "UserPolicyModeOp",
    "displayName": "Mode: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode_userpolicymodeop_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode_userpolicymodeop_1",
            "description": null,
            "helpText": null,
            "name": "Merge",
            "displayName": "Merge",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode_userpolicymodeop_2",
            "description": null,
            "helpText": null,
            "name": "Replace",
            "displayName": "Replace",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_grouppolicy_userpolicymode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}