{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WFPShowProgress",
        "Hide the file scan progress window",
        "\\System\\Windows File Protection",
        "Administrative Templates\\System\\Windows File Protection",
        "Windows File Protection"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsfileprotection#admx-windowsfileprotection-wfpshowprogress"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsFileProtection/WFPShowProgress",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpshowprogress",
    "categoryId": "dbb76878-34a9-4f87-bbc6-4de7ea223ff4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpshowprogress",
    "description": "This policy setting hides the file scan progress window. This window provides status information to sophisticated users, but it might confuse novices.\r\n\r\nIf you enable this policy setting, the file scan window does not appear during file scanning.\r\n\r\nIf you disable or do not configure this policy setting, the file scan progress window appears.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "WFPShowProgress",
    "displayName": "Hide the file scan progress window (Windows Insiders only)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpshowprogress_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.9",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.21322",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpshowprogress_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpshowprogress_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}