{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "QosServiceTypeNetworkControl_PV",
        "Network control service type",
        "\\Network\\QoS Packet Scheduler\\Layer-2 priority value",
        "Administrative Templates\\Network\\QoS Packet Scheduler\\Layer-2 priority value",
        "Layer-2 priority value"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_QOS/QosServiceTypeNetworkControl_PV",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv",
    "categoryId": "67c06154-a798-44bb-83c8-d706a3709c10",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv_qospriorityvalue",
    "description": null,
    "helpText": "",
    "name": "QosPriorityValue",
    "displayName": "Priority value (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 7,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 7
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_qos_qosservicetypenetworkcontrol_pv"
        }
    ],
    "dependedOnBy": []
}