{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "PKCS Imported Certificate",
        "PKCS Certificate",
        "Intended Purpose"
    ],
    "infoUrls": [],
    "baseUri": "./device/vendor/msft/pkcsimportedcertificate",
    "offsetUri": "/intendedpurpose",
    "rootDefinitionId": "device_vendor_msft_pkcsimportedcertificate_intendedpurpose",
    "categoryId": "b2b85670-5475-4148-ab3d-c4c86b4d5af0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_pkcsimportedcertificate_intendedpurpose",
    "description": null,
    "helpText": "",
    "name": "intendedpurpose",
    "displayName": "Intended Purpose",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10ImportedPFX/policyJourneyState/0",
    "redirectMessage": "Create a PKCS imported certificate policy",
    "redirectReason": "The \"PKCS imported certificate\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}