{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Manual Wi Fi Configuration",
        "Wifi",
        "Wi-Fi Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-wifi#wifi-allowmanualwificonfiguration"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Wifi/AllowManualWiFiConfiguration",
    "rootDefinitionId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration",
    "categoryId": "0a803a48-789a-48b0-b928-e52d56ab17f1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration",
    "description": "Allow or disallow connecting to Wi-Fi outside of MDM server-installed networks. Most restricted value is 0. Note Setting this policy deletes any previously installed user-configured and Wi-Fi sense Wi-Fi profiles from the device. Certain Wi-Fi profiles that are not user configured nor Wi-Fi sense might not be deleted. In addition, not all non-MDM profiles are completely deleted.",
    "helpText": "",
    "name": "AllowManualWiFiConfiguration",
    "displayName": "Allow Manual Wi Fi Configuration",
    "defaultOptionId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration_0",
            "description": "No Wi-Fi connection outside of MDM provisioned network is allowed.",
            "helpText": null,
            "name": "No Wi-Fi connection outside of MDM provisioned network is allowed.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration_1",
            "description": "Adding new network SSIDs beyond the already MDM provisioned ones is allowed.",
            "helpText": null,
            "name": "Adding new network SSIDs beyond the already MDM provisioned ones is allowed.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}