{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Disk Management"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Restrictions/NetworkStorage",
    "rootDefinitionId": "diskmanagement_diskmanagement",
    "categoryId": "83febe72-a64f-4051-9071-1efae1ea9a15",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "diskmanagement_restrictions_networkstorage",
    "description": "Specifies the mount policy for network storage:\n* Allowed - network storage that is read-write or read-only will be mounted.\n* ReadOnly - only network storage that is read-only will be mounted. Note that network storage that is read-write will not be mounted read-only.\n* Disallowed - no network storage will be mounted.",
    "helpText": null,
    "name": "Restrictions_NetworkStorage",
    "displayName": "Network Storage",
    "defaultOptionId": "diskmanagement_restrictions_networkstorage_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "diskmanagement_restrictions_networkstorage_0",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Allowed"
            },
            "dependentOn": [
                {
                    "dependentOn": "diskmanagement_restrictions",
                    "parentSettingId": "diskmanagement_restrictions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "diskmanagement_restrictions_networkstorage_1",
            "description": null,
            "helpText": null,
            "name": "ReadOnly",
            "displayName": "ReadOnly",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ReadOnly"
            },
            "dependentOn": [
                {
                    "dependentOn": "diskmanagement_restrictions",
                    "parentSettingId": "diskmanagement_restrictions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "diskmanagement_restrictions_networkstorage_2",
            "description": null,
            "helpText": null,
            "name": "Disallowed",
            "displayName": "Disallowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Disallowed"
            },
            "dependentOn": [
                {
                    "dependentOn": "diskmanagement_restrictions",
                    "parentSettingId": "diskmanagement_restrictions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}