{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Disk Management"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Restrictions",
    "rootDefinitionId": "diskmanagement_diskmanagement",
    "categoryId": "83febe72-a64f-4051-9071-1efae1ea9a15",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "diskmanagement_restrictions",
    "description": "Defines the restrictions for disks",
    "helpText": null,
    "name": "Restrictions",
    "displayName": "Restrictions",
    "childIds": [
        "diskmanagement_restrictions_externalstorage",
        "diskmanagement_restrictions_networkstorage"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "diskmanagement_diskmanagement",
            "parentSettingId": "diskmanagement_diskmanagement"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "diskmanagement_restrictions_externalstorage",
            "required": false
        },
        {
            "dependedOnBy": "diskmanagement_restrictions_networkstorage",
            "required": false
        }
    ]
}