{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Autopilot",
        "Device Preparation",
        "AllowedPolicyIds",
        "Policies"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/autopilot/DevicePreparation",
    "offsetUri": "/AllowedPolicyIds",
    "rootDefinitionId": "enrollment_autopilot_dpp_allowedpolicyids",
    "categoryId": "8894808d-fb39-4151-bf83-1b8a126285cf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "enrollment_autopilot_dpp_allowedpolicyids",
    "description": "Select up to 10 policies you want to reference with this deployment. These policies should already be assigned to the Device group you selected earlier. You can check the installation status for these policies in the Device status report for this deployment.",
    "helpText": "",
    "name": "AllowedPolicyIds",
    "displayName": "Allowed Policies",
    "maximumCount": 600,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "enrollment",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1000,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}