{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Autopilot",
        "Device Preparation",
        "User account type",
        "Deployment settings"
    ],
    "infoUrls": [],
    "baseUri": "./enrollment/autopilot/DevicePreparation",
    "offsetUri": "/DeploymentSettings/AccountType",
    "rootDefinitionId": "enrollment_autopilot_dpp_accountype",
    "categoryId": "47b863f6-8116-432b-9fc1-9e487fdaa203",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "template",
    "id": "enrollment_autopilot_dpp_accountype",
    "description": "",
    "helpText": "",
    "name": "AccountType",
    "displayName": "User account type",
    "defaultOptionId": "enrollment_autopilot_dpp_accountype_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "enrollment",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "enrollment_autopilot_dpp_accountype_0",
            "description": null,
            "helpText": null,
            "name": "Administrator",
            "displayName": "Administrator",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_accountype_1",
            "description": null,
            "helpText": null,
            "name": "StandardUser",
            "displayName": "Standard User",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}