{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extension Settings",
        "Safari Extension Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ManagedExtensions/{0}/State",
    "rootDefinitionId": "extensionsettings_extensionsettings",
    "categoryId": "7d9e5b9b-84e7-473c-b6ca-a1629448df55",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "extensionsettings_managedextensions_generickey_state",
    "description": "Controls whether an extension is allowed.\n* Allowed - The user is allowed to turn the extension on or off\n* AlwaysOn - The extension will always be on\n* AlwaysOff - The extension will always be off",
    "helpText": null,
    "name": "ManagedExtensions_genericKey_State",
    "displayName": "State",
    "defaultOptionId": "extensionsettings_managedextensions_generickey_state_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "extensionsettings_managedextensions_generickey_state_0",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Allowed"
            },
            "dependentOn": [
                {
                    "dependentOn": "extensionsettings_managedextensions_generickey",
                    "parentSettingId": "extensionsettings_managedextensions_generickey"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "extensionsettings_managedextensions_generickey_state_1",
            "description": null,
            "helpText": null,
            "name": "AlwaysOn",
            "displayName": "Always On",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AlwaysOn"
            },
            "dependentOn": [
                {
                    "dependentOn": "extensionsettings_managedextensions_generickey",
                    "parentSettingId": "extensionsettings_managedextensions_generickey"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "extensionsettings_managedextensions_generickey_state_2",
            "description": null,
            "helpText": null,
            "name": "AlwaysOff",
            "displayName": "Always Off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AlwaysOff"
            },
            "dependentOn": [
                {
                    "dependentOn": "extensionsettings_managedextensions_generickey",
                    "parentSettingId": "extensionsettings_managedextensions_generickey"
                }
            ],
            "dependedOnBy": []
        }
    ]
}