{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extension Settings",
        "Safari Extension Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ManagedExtensions",
    "rootDefinitionId": "extensionsettings_extensionsettings",
    "categoryId": "7d9e5b9b-84e7-473c-b6ca-a1629448df55",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "id": "extensionsettings_managedextensions",
    "description": "Extensions being managed",
    "helpText": null,
    "name": "ManagedExtensions",
    "displayName": "Managed Extensions",
    "childIds": [
        "extensionsettings_managedextensions_generickey",
        "extensionsettings_managedextensions_generickey_keytobereplaced"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "extensionsettings_extensionsettings",
            "parentSettingId": "extensionsettings_extensionsettings"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "extensionsettings_managedextensions_generickey",
            "required": false
        },
        {
            "dependedOnBy": "extensionsettings_managedextensions_generickey_keytobereplaced",
            "required": true
        }
    ]
}