{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extension Settings",
        "Safari Extension Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.configuration.safari.extensions.settings",
    "rootDefinitionId": "extensionsettings_extensionsettings",
    "categoryId": "7d9e5b9b-84e7-473c-b6ca-a1629448df55",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "extensionsettings_extensionsettings",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.configuration.safari.extensions.settings",
    "displayName": "com.apple.configuration.safari.extensions.settings",
    "childIds": [
        "extensionsettings_managedextensions"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "extensionsettings_managedextensions",
            "required": false
        }
    ]
}