{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Antivirus engine",
        "Antivirus engine"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "threatTypeSettings/[{0}]/key",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key",
    "description": "Type of the threat for which the behavior is configured.",
    "helpText": null,
    "name": "threatTypeSettings_item_key",
    "displayName": "Threat type",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_0",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_0",
            "description": null,
            "helpText": null,
            "name": "potentially_unwanted_application",
            "displayName": "potentially_unwanted_application",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "potentially_unwanted_application"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
                    "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key_1",
            "description": null,
            "helpText": null,
            "name": "archive_bomb",
            "displayName": "archive_bomb",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "archive_bomb"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
                    "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}