{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#enforcement-level-for-antivirus-engine"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "enforcementLevel",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_enforcementlevel",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_antivirusengine_enforcementlevel",
    "description": "Specifies the enforcement preference of antivirus engine. Real-time: Real-time protection (scan files as they're modified) is enabled. On-demand: Files are scanned only on demand and real-time protection is turned off. Passive: Runs the antivirus engine in passive mode.",
    "helpText": null,
    "name": "enforcementLevel",
    "displayName": "Enforcement Level",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_enforcementlevel_2",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_0",
            "description": null,
            "helpText": null,
            "name": "Realtime",
            "displayName": "Realtime",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "real_time"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_1",
            "description": null,
            "helpText": null,
            "name": "OnDemand",
            "displayName": "OnDemand",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "on_demand"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_antivirusengine_enforcementlevel_2",
            "description": null,
            "helpText": null,
            "name": "Passive",
            "displayName": "Passive",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "passive"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}