{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#maximum-number-of-items-in-the-antivirus-scan-history"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "maximumOnDemandScanThreads",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_maximumondemandscanthreads",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_antivirusengine_maximumondemandscanthreads",
    "description": "Specify the maximum number of number of threads used to perform the on demand scan.",
    "helpText": null,
    "name": "maximumOnDemandScanThreads",
    "displayName": "maximum on demand scan threads",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 64,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 2
    },
    "dependentOn": [],
    "dependedOnBy": []
}