{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Linux - Password Policy",
        "Password Policy"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2210105"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "/PasswordPolicy/MinimumLength",
    "rootDefinitionId": "linux_passwordpolicy_minimumlength",
    "categoryId": "8ccafa97-9bbb-40e1-b668-3110bc449ac2",
    "settingUsage": "compliance",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_passwordpolicy_minimumlength",
    "description": "Specifies the minimum number of total characters a password must contain.",
    "helpText": null,
    "name": "MinimumLength",
    "displayName": "Minimum Length",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}