{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        " EDR preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/edr",
    "offsetUri": "tags/[{0}]/key",
    "rootDefinitionId": "linux_mdatp_managed_edr_tags",
    "categoryId": "22a2a407-0f28-481d-bdbe-1f9cb6d589c3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_mdatp_managed_edr_tags_item_key",
    "description": "Specify a tag name and its value. The GROUP tag, tags the device with the specified value. The tag is reflected in the portal under the device page and can be used for filtering and grouping devices.",
    "helpText": null,
    "name": "tags_item_key",
    "displayName": "Type of tag",
    "defaultOptionId": "linux_mdatp_managed_edr_tags_item_key_0",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_edr_tags_item_key_0",
            "description": null,
            "helpText": null,
            "name": "GROUP",
            "displayName": "GROUP",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "GROUP"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_edr_tags",
                    "parentSettingId": "linux_mdatp_managed_edr_tags"
                }
            ],
            "dependedOnBy": []
        }
    ]
}