{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        " EDR preferences"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#add-tag-or-group-id-to-the-configuration-profile"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/edr",
    "offsetUri": "tags",
    "rootDefinitionId": "linux_mdatp_managed_edr_tags",
    "categoryId": "22a2a407-0f28-481d-bdbe-1f9cb6d589c3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_edr_tags",
    "description": null,
    "helpText": null,
    "name": "tags",
    "displayName": "Device tags",
    "childIds": [
        "linux_mdatp_managed_edr_tags_item_key",
        "linux_mdatp_managed_edr_tags_item_value"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "linux_mdatp_managed_edr_tags_item_key",
            "required": true
        },
        {
            "dependedOnBy": "linux_mdatp_managed_edr_tags_item_value",
            "required": true
        }
    ]
}