{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Antivirus engine",
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#threat-type-settings"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "threatTypeSettings",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "description": "The threatTypeSettings preference in the antivirus engine is used to control how certain threat types are handled by the product.",
    "helpText": null,
    "name": "threatTypeSettings",
    "displayName": "Threat type settings",
    "childIds": [
        "linux_mdatp_managed_antivirusengine_threattypesettings_item_key",
        "linux_mdatp_managed_antivirusengine_threattypesettings_item_value"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key",
            "required": true
        },
        {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value",
            "required": true
        }
    ]
}