{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Custom Compliance"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2210013"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "/CustomCompliance/Rules",
    "rootDefinitionId": "linux_customcompliance_required",
    "categoryId": "9f52aad9-53cb-4f92-b21f-7f4a6721a623",
    "settingUsage": "compliance",
    "uxBehavior": "default",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "linux_customcompliance_rules",
    "description": "Select your rules file",
    "helpText": null,
    "name": "CustomCompliance_Rules",
    "displayName": "Select your rules file",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "json",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": [
            "json"
        ]
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "linux_customcompliance_required_true",
            "parentSettingId": "linux_customcompliance_required"
        }
    ],
    "dependedOnBy": []
}