{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cloud delivered protection preferences"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#configure-cloud-block-level"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "cloudBlockLevel",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_cloudblocklevel",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_cloudservice_cloudblocklevel",
    "description": "Determines how aggressive Defender for Endpoint is in blocking and scanning suspicious files.",
    "helpText": null,
    "name": "cloudBlockLevel",
    "displayName": "Configure cloud block level",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_cloudblocklevel_normal",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_normal",
            "description": null,
            "helpText": null,
            "name": "Normal",
            "displayName": "Normal",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "normal"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_moderate",
            "description": null,
            "helpText": null,
            "name": "Moderate",
            "displayName": "Moderate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "moderate"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_high",
            "description": null,
            "helpText": null,
            "name": "High",
            "displayName": "High",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "high"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_high_plus",
            "description": null,
            "helpText": null,
            "name": "High_Plus",
            "displayName": "High_Plus",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "high_plus"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_cloudblocklevel_zero_tolerance",
            "description": null,
            "helpText": null,
            "name": "Zero_Tolerance",
            "displayName": "Zero_Tolerance",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zero_tolerance"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}