{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Linux Custom Configuration"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2218882"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "/CustomConfig/Script",
    "rootDefinitionId": "linux_customconfig_script",
    "categoryId": "36716a4c-cedb-47bb-8f4b-5783fedc7c47",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "linux_customconfig_script",
    "description": "Select the file containing the script to execute.",
    "helpText": null,
    "name": "CustomConfig_Script",
    "displayName": "Execution Script",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "bashScript",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 1,
        "isSecret": false,
        "fileTypes": [
            "sh"
        ]
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}