{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Cloud delivered protection preferences",
        "Cloud delivered protection preferences"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#diagnostic-collection-level"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "diagnosticLevel",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_diagnosticlevel",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_cloudservice_diagnosticlevel",
    "description": "We encourage you to share your diagnostic and usage data with us to help improve Microsoft products and services.",
    "helpText": null,
    "name": "diagnosticLevel",
    "displayName": "Diagnostic data collection level",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_diagnosticlevel_0",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_cloudservice_diagnosticlevel_0",
            "description": null,
            "helpText": null,
            "name": "optional",
            "displayName": "optional",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "optional"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_diagnosticlevel_1",
            "description": null,
            "helpText": null,
            "name": "required",
            "displayName": "required",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "required"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}