{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Exclusion Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/exclusionSettings",
    "offsetUri": "exclusions/[{0}]/isDirectory",
    "rootDefinitionId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "categoryId": "d2191717-e304-46f7-bcc0-55e6477026c9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory",
    "description": "Directory if selected, or file if not selected",
    "helpText": null,
    "name": "exclusions_item_isDirectory",
    "displayName": "Is directory",
    "defaultOptionId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_true",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
                    "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_exclusionsettings_exclusions_item_isdirectory_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_0",
                    "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type"
                }
            ],
            "dependedOnBy": []
        }
    ]
}