{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Cloud delivered protection preferences",
        "Cloud delivered protection preferences"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#enable--disable-automatic-security-intelligence-updates"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "automaticDefinitionUpdateEnabled",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled",
    "description": "Determines whether security intelligence updates are installed automatically:",
    "helpText": null,
    "name": "automaticDefinitionUpdateEnabled",
    "displayName": "Automatic security intelligence updates",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_true",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}