{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Retries",
        "Linux Custom Configuration"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2218882"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "CustomConfig/ExecutionRetries",
    "rootDefinitionId": "linux_customconfig_executionretries",
    "categoryId": "36716a4c-cedb-47bb-8f4b-5783fedc7c47",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "linux_customconfig_executionretries",
    "description": "Specifies how many times to retry script execution on failure.",
    "helpText": null,
    "name": "CustomConfigExecutionRetries",
    "displayName": "Execution retries",
    "defaultOptionId": null,
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_customconfig_executionretries_0",
            "description": null,
            "helpText": null,
            "name": "No retries",
            "displayName": "No retries",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionretries_1",
            "description": null,
            "helpText": null,
            "name": "1 time",
            "displayName": "1 time",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionretries_2",
            "description": null,
            "helpText": null,
            "name": "2 times",
            "displayName": "2 times",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionretries_3",
            "description": null,
            "helpText": null,
            "name": "3 times",
            "displayName": "3 times",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}