{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#muting-non-exec-mounts"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "nonExecMountPolicy",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy",
    "description": "Specifies the behavior of RTP on mount point marked as nonexec. ",
    "helpText": null,
    "name": "nonExecMountPolicy",
    "displayName": "non execute mount mute",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_0",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_0",
            "description": null,
            "helpText": null,
            "name": "unmute",
            "displayName": "unmute",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "unmute"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy_1",
            "description": null,
            "helpText": null,
            "name": "mute",
            "displayName": "mute",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mute"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}