{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Login Window Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "loginwindow",
    "rootDefinitionId": "loginwindow_loginwindow",
    "categoryId": "0e937777-d01a-4180-a937-c2010451a529",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "loginwindow_loginwindow",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "loginwindow",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "loginwindow_disableloginitemssuppression"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "loginwindow_disableloginitemssuppression",
            "required": false
        }
    ]
}