{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Math Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Calculator/ProgrammerMode/Enabled",
    "rootDefinitionId": "mathsettings_mathsettings",
    "categoryId": "6b83806b-eb3e-4224-b082-d6f2c8ab3eb9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "mathsettings_calculator_programmermode_enabled",
    "description": "Controls whether the mode is enabled.",
    "helpText": null,
    "name": "Calculator_ProgrammerMode_Enabled",
    "displayName": "Enabled",
    "defaultOptionId": "mathsettings_calculator_programmermode_enabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "mathsettings_calculator_programmermode_enabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "mathsettings_calculator_programmermode",
                    "parentSettingId": "mathsettings_calculator_programmermode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "mathsettings_calculator_programmermode_enabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "mathsettings_calculator_programmermode",
                    "parentSettingId": "mathsettings_calculator_programmermode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}