{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Math Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Calculator/ProgrammerMode",
    "rootDefinitionId": "mathsettings_mathsettings",
    "categoryId": "6b83806b-eb3e-4224-b082-d6f2c8ab3eb9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "mathsettings_calculator_programmermode",
    "description": "If present, configures the programmer mode of the calculator. If not present, programmer mode is enabled.",
    "helpText": null,
    "name": "Calculator_ProgrammerMode",
    "displayName": "Programmer Mode",
    "childIds": [
        "mathsettings_calculator_programmermode_enabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "mathsettings_calculator",
            "parentSettingId": "mathsettings_calculator"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "mathsettings_calculator_programmermode_enabled",
            "required": true
        }
    ]
}