{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Math Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Calculator/InputModes",
    "rootDefinitionId": "mathsettings_mathsettings",
    "categoryId": "6b83806b-eb3e-4224-b082-d6f2c8ab3eb9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "mathsettings_calculator_inputmodes",
    "description": "If present, controls global input options of the calculator. If not present, all input modes are enabled.",
    "helpText": null,
    "name": "Calculator_InputModes",
    "displayName": "Input Modes",
    "childIds": [
        "mathsettings_calculator_inputmodes_unitconversion",
        "mathsettings_calculator_inputmodes_rpn"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "mathsettings_calculator",
            "parentSettingId": "mathsettings_calculator"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "mathsettings_calculator_inputmodes_unitconversion",
            "required": true
        },
        {
            "dependedOnBy": "mathsettings_calculator_inputmodes_rpn",
            "required": false
        }
    ]
}