{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Math Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "SystemBehavior",
    "rootDefinitionId": "mathsettings_mathsettings",
    "categoryId": "6b83806b-eb3e-4224-b082-d6f2c8ab3eb9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "mathsettings_systembehavior",
    "description": "If present, configures math behavior in the system.",
    "helpText": null,
    "name": "SystemBehavior",
    "displayName": "System Behavior",
    "childIds": [
        "mathsettings_systembehavior_keyboardsuggestions",
        "mathsettings_systembehavior_mathnotes"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "mathsettings_mathsettings",
            "parentSettingId": "mathsettings_mathsettings"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "mathsettings_systembehavior_keyboardsuggestions",
            "required": true
        },
        {
            "dependedOnBy": "mathsettings_systembehavior_mathnotes",
            "required": true
        }
    ]
}