{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Math Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Calculator",
    "rootDefinitionId": "mathsettings_mathsettings",
    "categoryId": "6b83806b-eb3e-4224-b082-d6f2c8ab3eb9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "mathsettings_calculator",
    "description": "If present, configures the built-in Calculator app.",
    "helpText": null,
    "name": "Calculator",
    "displayName": "Calculator",
    "childIds": [
        "mathsettings_calculator_basicmode",
        "mathsettings_calculator_scientificmode",
        "mathsettings_calculator_programmermode",
        "mathsettings_calculator_mathnotesmode",
        "mathsettings_calculator_inputmodes"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "mathsettings_mathsettings",
            "parentSettingId": "mathsettings_mathsettings"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "mathsettings_calculator_basicmode",
            "required": false
        },
        {
            "dependedOnBy": "mathsettings_calculator_scientificmode",
            "required": false
        },
        {
            "dependedOnBy": "mathsettings_calculator_programmermode",
            "required": false
        },
        {
            "dependedOnBy": "mathsettings_calculator_mathnotesmode",
            "required": false
        },
        {
            "dependedOnBy": "mathsettings_calculator_inputmodes",
            "required": false
        }
    ]
}