{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Os recovery settings",
        "Keyboard settings",
        "Operating system settings"
    ],
    "infoUrls": [],
    "baseUri": "./osrecoverysettings",
    "offsetUri": "/keyboardsettings",
    "rootDefinitionId": "osrecoverysettings_keyboardsettings",
    "categoryId": "71f79fa3-14c0-4df8-bf9c-8476e36ea755",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog,template",
    "id": "osrecoverysettings_keyboardsettings",
    "description": "",
    "helpText": "",
    "name": "keyboardSettings",
    "displayName": "Keyboard settings",
    "defaultOptionId": "osrecoverysettings_keyboardsettings_english",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "windowsOsRecovery",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "osrecoverysettings_keyboardsettings_afrikaans",
            "description": null,
            "helpText": null,
            "name": "Afrikaans",
            "displayName": "Afrikaans",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "af-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_afrikaansn",
            "description": null,
            "helpText": null,
            "name": "Afrikaans (Namibia)",
            "displayName": "Afrikaans (Namibia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_albanian",
            "description": null,
            "helpText": null,
            "name": "Albanian",
            "displayName": "Albanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sq-AL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_albaniank",
            "description": null,
            "helpText": null,
            "name": "Albanian (Kosovo)",
            "displayName": "Albanian (Kosovo)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_alsatianf",
            "description": null,
            "helpText": null,
            "name": "Alsatian (France)",
            "displayName": "Alsatian (France)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gsw-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_amharic",
            "description": null,
            "helpText": null,
            "name": "Amharic",
            "displayName": "Amharic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "am-ET"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabic",
            "description": null,
            "helpText": null,
            "name": "Arabic",
            "displayName": "Arabic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-SA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabica",
            "description": null,
            "helpText": null,
            "name": "Arabic (Algeria)",
            "displayName": "Arabic (Algeria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-DZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabicb",
            "description": null,
            "helpText": null,
            "name": "Arabic (Bahrain)",
            "displayName": "Arabic (Bahrain)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-BH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabice",
            "description": null,
            "helpText": null,
            "name": "Arabic (Egypt)",
            "displayName": "Arabic (Egypt)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-EG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabici",
            "description": null,
            "helpText": null,
            "name": "Arabic (Iraq)",
            "displayName": "Arabic (Iraq)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-IQ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabicj)",
            "description": null,
            "helpText": null,
            "name": "Arabic (Jordan)",
            "displayName": "Arabic (Jordan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-JO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabick",
            "description": null,
            "helpText": null,
            "name": "Arabic (Kuwait)",
            "displayName": "Arabic (Kuwait)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-KW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabicl",
            "description": null,
            "helpText": null,
            "name": "Arabic (Lebanon)",
            "displayName": "Arabic (Lebanon)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-LB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabicli",
            "description": null,
            "helpText": null,
            "name": "Arabic (Libya)",
            "displayName": "Arabic (Libya)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-LY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabicm",
            "description": null,
            "helpText": null,
            "name": "Arabic (Morocco)",
            "displayName": "Arabic (Morocco)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-MA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arbaico",
            "description": null,
            "helpText": null,
            "name": "Arabic (Oman)",
            "displayName": "Arabic (Oman)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-OM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arbaicq",
            "description": null,
            "helpText": null,
            "name": "Arabic (Qatar)",
            "displayName": "Arabic (Qatar)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-QA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arbaics",
            "description": null,
            "helpText": null,
            "name": "Arabic (Syria)",
            "displayName": "Arabic (Syria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-SY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arbaict",
            "description": null,
            "helpText": null,
            "name": "Arabic (Tunisia)",
            "displayName": "Arabic (Tunisia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-TN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arbaicu",
            "description": null,
            "helpText": null,
            "name": "Arabic (United Arab Emirates)",
            "displayName": "Arabic (United Arab Emirates)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-AE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabicw",
            "description": null,
            "helpText": null,
            "name": "Arabic (World)",
            "displayName": "Arabic (World)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_arabicy",
            "description": null,
            "helpText": null,
            "name": "Arabic (Yemen)",
            "displayName": "Arabic (Yemen)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-YE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_armenian",
            "description": null,
            "helpText": null,
            "name": "Armenian",
            "displayName": "Armenian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hy-AM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_assamese",
            "description": null,
            "helpText": null,
            "name": "Assamese",
            "displayName": "Assamese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "as-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_azerbaijani",
            "description": null,
            "helpText": null,
            "name": "Azerbaijani",
            "displayName": "Azerbaijani",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "az-Latn-AZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_azerbaijanic",
            "description": null,
            "helpText": null,
            "name": "Azerbaijani (Cyrillic)",
            "displayName": "Azerbaijani (Cyrillic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "az-Cyrl-AZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_bangla",
            "description": null,
            "helpText": null,
            "name": "Bangla",
            "displayName": "Bangla",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bn-BD"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_bashkir",
            "description": null,
            "helpText": null,
            "name": "Bashkir",
            "displayName": "Bashkir",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ba-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_basque",
            "description": null,
            "helpText": null,
            "name": "Basque",
            "displayName": "Basque",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "eu-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_belarusian",
            "description": null,
            "helpText": null,
            "name": "Belarusian",
            "displayName": "Belarusian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "be-BY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_bengali",
            "description": null,
            "helpText": null,
            "name": "Bengali (India)",
            "displayName": "Bengali (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bn-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_bosnian",
            "description": null,
            "helpText": null,
            "name": "Bosnian (Latin)",
            "displayName": "Bosnian (Latin)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bs-Latn-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_breton",
            "description": null,
            "helpText": null,
            "name": "Breton",
            "displayName": "Breton",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "br-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_bulgarian",
            "description": null,
            "helpText": null,
            "name": "Bulgarian",
            "displayName": "Bulgarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bg-BG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_burmese",
            "description": null,
            "helpText": null,
            "name": "Burmese",
            "displayName": "Burmese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "my-MM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_catalan",
            "description": null,
            "helpText": null,
            "name": "Catalan",
            "displayName": "Catalan",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ca-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_catalana",
            "description": null,
            "helpText": null,
            "name": "Catalan (Andorra)",
            "displayName": "Catalan (Andorra)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ca-ES-valencia"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_catalanfrance",
            "description": null,
            "helpText": null,
            "name": "Catalan (France)",
            "displayName": "Catalan (France)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_catalanitaly",
            "description": null,
            "helpText": null,
            "name": "Catalan (Italy)",
            "displayName": "Catalan (Italy)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-IT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_centralatlastamazight",
            "description": null,
            "helpText": null,
            "name": "Central Atlas Tamazight",
            "displayName": "Central Atlas Tamazight",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tzm-Latn-DZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_centralatlastamazightarabic",
            "description": null,
            "helpText": null,
            "name": "Central Atlas Tamazight (Arabic)",
            "displayName": "Central Atlas Tamazight (Arabic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-MA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_centralatlastamazighttifinagh",
            "description": null,
            "helpText": null,
            "name": "Central Atlas Tamazight (Tifinagh)",
            "displayName": "Central Atlas Tamazight (Tifinagh)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tzm-Tfng-MA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_centralkurdish",
            "description": null,
            "helpText": null,
            "name": "Central Kurdish",
            "displayName": "Central Kurdish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ku-Arab-IQ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_chechen",
            "description": null,
            "helpText": null,
            "name": "Chechen",
            "displayName": "Chechen",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ru-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_cherokee",
            "description": null,
            "helpText": null,
            "name": "Cherokee",
            "displayName": "Cherokee",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "chr-Cher-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_chinese",
            "description": null,
            "helpText": null,
            "name": "Chinese",
            "displayName": "Chinese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_chinesesimplifiedhongkongsar",
            "description": null,
            "helpText": null,
            "name": "Chinese (Simplified, Hong Kong SAR)",
            "displayName": "Chinese (Simplified, Hong Kong SAR)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_chinesesimplifiedmacaosar",
            "description": null,
            "helpText": null,
            "name": "Chinese (Simplified, Macao SAR)",
            "displayName": "Chinese (Simplified, Macao SAR)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_chinesetraditional",
            "description": null,
            "helpText": null,
            "name": "Chinese (Traditional)",
            "displayName": "Chinese (Traditional)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-TW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_chinesetraditionaltaiwan",
            "description": null,
            "helpText": null,
            "name": "Chinese (Traditional, Taiwan)",
            "displayName": "Chinese (Traditional, Taiwan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-TW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_churchslavic",
            "description": null,
            "helpText": null,
            "name": "Church Slavic",
            "displayName": "Church Slavic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ru-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_colognian",
            "description": null,
            "helpText": null,
            "name": "Colognian",
            "displayName": "Colognian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_cornish",
            "description": null,
            "helpText": null,
            "name": "Cornish",
            "displayName": "Cornish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_corsican",
            "description": null,
            "helpText": null,
            "name": "Corsican",
            "displayName": "Corsican",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "co-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_croatian",
            "description": null,
            "helpText": null,
            "name": "Croatian",
            "displayName": "Croatian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hr-HR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_croatianbosniaherzegovina",
            "description": null,
            "helpText": null,
            "name": "Croatian (Bosnia & Herzegovina)",
            "displayName": "Croatian (Bosnia & Herzegovina)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hr-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_czech",
            "description": null,
            "helpText": null,
            "name": "Czech",
            "displayName": "Czech",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "cs-CZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_danish",
            "description": null,
            "helpText": null,
            "name": "Danish",
            "displayName": "Danish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "da-DK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_danishgreenland",
            "description": null,
            "helpText": null,
            "name": "Danish (Greenland)",
            "displayName": "Danish (Greenland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "da-DK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_divehi",
            "description": null,
            "helpText": null,
            "name": "Divehi",
            "displayName": "Divehi",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "dv-MV"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dutch",
            "description": null,
            "helpText": null,
            "name": "Dutch",
            "displayName": "Dutch",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nl-NL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dutcharuba",
            "description": null,
            "helpText": null,
            "name": "Dutch (Aruba)",
            "displayName": "Dutch (Aruba)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dutchbelgium",
            "description": null,
            "helpText": null,
            "name": "Dutch (Belgium)",
            "displayName": "Dutch (Belgium)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nl-BE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dutchbonaires",
            "description": null,
            "helpText": null,
            "name": "Dutch (Bonaire, Sint Eustatius and Saba)",
            "displayName": "Dutch (Bonaire, Sint Eustatius and Saba)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dutchcuracao",
            "description": null,
            "helpText": null,
            "name": "Dutch (Curaçao)",
            "displayName": "Dutch (Curaçao)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dutchsintmaarten",
            "description": null,
            "helpText": null,
            "name": "Dutch (Sint Maarten)",
            "displayName": "Dutch (Sint Maarten)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dutchsuriname",
            "description": null,
            "helpText": null,
            "name": "Dutch (Suriname)",
            "displayName": "Dutch (Suriname)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_dzongkha",
            "description": null,
            "helpText": null,
            "name": "Dzongkha",
            "displayName": "Dzongkha",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "dz-BT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_english",
            "description": null,
            "helpText": null,
            "name": "English",
            "displayName": "English",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishaustralia",
            "description": null,
            "helpText": null,
            "name": "English (Australia)",
            "displayName": "English (Australia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-AU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishaustria",
            "description": null,
            "helpText": null,
            "name": "English (Austria)",
            "displayName": "English (Austria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishbelgium",
            "description": null,
            "helpText": null,
            "name": "English (Belgium)",
            "displayName": "English (Belgium)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-BE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishbelize",
            "description": null,
            "helpText": null,
            "name": "English (Belize)",
            "displayName": "English (Belize)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-BZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishbritishvirginislands",
            "description": null,
            "helpText": null,
            "name": "English (British Virgin Islands)",
            "displayName": "English (British Virgin Islands)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishburundi",
            "description": null,
            "helpText": null,
            "name": "English (Burundi)",
            "displayName": "English (Burundi)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishcanada",
            "description": null,
            "helpText": null,
            "name": "English (Canada)",
            "displayName": "English (Canada)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishcaribbean",
            "description": null,
            "helpText": null,
            "name": "English (Caribbean)",
            "displayName": "English (Caribbean)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-029"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishdenmark",
            "description": null,
            "helpText": null,
            "name": "English (Denmark)",
            "displayName": "English (Denmark)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishfalklandislands",
            "description": null,
            "helpText": null,
            "name": "English (Falkland Islands)",
            "displayName": "English (Falkland Islands)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishfinland",
            "description": null,
            "helpText": null,
            "name": "English (Finland)",
            "displayName": "English (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishgermany",
            "description": null,
            "helpText": null,
            "name": "English (Germany)",
            "displayName": "English (Germany)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishgibraltar",
            "description": null,
            "helpText": null,
            "name": "English (Gibraltar)",
            "displayName": "English (Gibraltar)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishguernsey",
            "description": null,
            "helpText": null,
            "name": "English (Guernsey)",
            "displayName": "English (Guernsey)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishhongkongsar",
            "description": null,
            "helpText": null,
            "name": "English (Hong Kong SAR)",
            "displayName": "English (Hong Kong SAR)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-HK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishindia",
            "description": null,
            "helpText": null,
            "name": "English (India)",
            "displayName": "English (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishireland",
            "description": null,
            "helpText": null,
            "name": "English (Ireland)",
            "displayName": "English (Ireland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-IE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishisleofman",
            "description": null,
            "helpText": null,
            "name": "English (Isle of Man)",
            "displayName": "English (Isle of Man)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishisrael",
            "description": null,
            "helpText": null,
            "name": "English (Israel)",
            "displayName": "English (Israel)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishjamaica",
            "description": null,
            "helpText": null,
            "name": "English (Jamaica)",
            "displayName": "English (Jamaica)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-JM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishjersey",
            "description": null,
            "helpText": null,
            "name": "English (Jersey)",
            "displayName": "English (Jersey)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishmalaysia",
            "description": null,
            "helpText": null,
            "name": "English (Malaysia)",
            "displayName": "English (Malaysia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-MY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishmalta",
            "description": null,
            "helpText": null,
            "name": "English (Malta)",
            "displayName": "English (Malta)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishnetherlands",
            "description": null,
            "helpText": null,
            "name": "English (Netherlands)",
            "displayName": "English (Netherlands)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishnewzealand",
            "description": null,
            "helpText": null,
            "name": "English (New Zealand)",
            "displayName": "English (New Zealand)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-NZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishphilippines",
            "description": null,
            "helpText": null,
            "name": "English (Philippines)",
            "displayName": "English (Philippines)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-PH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishsingapore",
            "description": null,
            "helpText": null,
            "name": "English (Singapore)",
            "displayName": "English (Singapore)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-SG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishslovenia",
            "description": null,
            "helpText": null,
            "name": "English (Slovenia)",
            "displayName": "English (Slovenia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishsouthafrica",
            "description": null,
            "helpText": null,
            "name": "English (South Africa)",
            "displayName": "English (South Africa)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishsweden",
            "description": null,
            "helpText": null,
            "name": "English (Sweden)",
            "displayName": "English (Sweden)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishswitzerland",
            "description": null,
            "helpText": null,
            "name": "English (Switzerland)",
            "displayName": "English (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishtrinidadtobago",
            "description": null,
            "helpText": null,
            "name": "English (Trinidad & Tobago)",
            "displayName": "English (Trinidad & Tobago)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-TT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishuk",
            "description": null,
            "helpText": null,
            "name": "English (United Kingdom)",
            "displayName": "English (United Kingdom)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_englishzimbabwe",
            "description": null,
            "helpText": null,
            "name": "English (Zimbabwe)",
            "displayName": "English (Zimbabwe)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-ZW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_estonian",
            "description": null,
            "helpText": null,
            "name": "Estonian",
            "displayName": "Estonian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "et-EE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_faroese",
            "description": null,
            "helpText": null,
            "name": "Faroese",
            "displayName": "Faroese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fo-FO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_filipino",
            "description": null,
            "helpText": null,
            "name": "Filipino",
            "displayName": "Filipino",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fil-PH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_finnish",
            "description": null,
            "helpText": null,
            "name": "Finnish",
            "displayName": "Finnish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fi-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_french",
            "description": null,
            "helpText": null,
            "name": "French",
            "displayName": "French",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchbelgium",
            "description": null,
            "helpText": null,
            "name": "French (Belgium)",
            "displayName": "French (Belgium)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-BE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchcameroon",
            "description": null,
            "helpText": null,
            "name": "French (Cameroon)",
            "displayName": "French (Cameroon)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchcanada",
            "description": null,
            "helpText": null,
            "name": "French (Canada)",
            "displayName": "French (Canada)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchcotedivoire",
            "description": null,
            "helpText": null,
            "name": "French (Côte d’Ivoire)",
            "displayName": "French (Côte d’Ivoire)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchhaiti",
            "description": null,
            "helpText": null,
            "name": "French (Haiti)",
            "displayName": "French (Haiti)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-HT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchluxembourg",
            "description": null,
            "helpText": null,
            "name": "French (Luxembourg)",
            "displayName": "French (Luxembourg)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-LU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchmali",
            "description": null,
            "helpText": null,
            "name": "French (Mali)",
            "displayName": "French (Mali)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-ML"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchmonaco",
            "description": null,
            "helpText": null,
            "name": "French (Monaco)",
            "displayName": "French (Monaco)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-MC"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchmorocco",
            "description": null,
            "helpText": null,
            "name": "French (Morocco)",
            "displayName": "French (Morocco)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-MA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchreunion",
            "description": null,
            "helpText": null,
            "name": "French (Réunion)",
            "displayName": "French (Réunion)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-RE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchsenegal",
            "description": null,
            "helpText": null,
            "name": "French (Senegal)",
            "displayName": "French (Senegal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchswitzerland",
            "description": null,
            "helpText": null,
            "name": "French (Switzerland)",
            "displayName": "French (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_frenchcongodrc",
            "description": null,
            "helpText": null,
            "name": "French Congo (DRC)",
            "displayName": "French Congo (DRC)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CD"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_friulian",
            "description": null,
            "helpText": null,
            "name": "Friulian",
            "displayName": "Friulian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-IT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulah",
            "description": null,
            "helpText": null,
            "name": "Fulah",
            "displayName": "Fulah",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ff-Latn-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahadlam",
            "description": null,
            "helpText": null,
            "name": "Fulah (Adlam)",
            "displayName": "Fulah (Adlam)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahburkinafaso",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Burkina Faso)",
            "displayName": "Fulah (Latin, Burkina Faso)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahcameroon",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Cameroon)",
            "displayName": "Fulah (Latin, Cameroon)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahgambia",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Gambia)",
            "displayName": "Fulah (Latin, Gambia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahghana",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Ghana)",
            "displayName": "Fulah (Latin, Ghana)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahguinea",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Guinea)",
            "displayName": "Fulah (Latin, Guinea)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahguineabissau",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Guinea-Bissau)",
            "displayName": "Fulah (Latin, Guinea-Bissau)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahliberia",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Liberia)",
            "displayName": "Fulah (Latin, Liberia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahmauritania",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Mauritania)",
            "displayName": "Fulah (Latin, Mauritania)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahniger",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Niger)",
            "displayName": "Fulah (Latin, Niger)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahnigeria",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Nigeria)",
            "displayName": "Fulah (Latin, Nigeria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_fulahsierraleone",
            "description": null,
            "helpText": null,
            "name": "Fulah (Latin, Sierra Leone)",
            "displayName": "Fulah (Latin, Sierra Leone)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_galician",
            "description": null,
            "helpText": null,
            "name": "Galician",
            "displayName": "Galician",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gl-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_georgian",
            "description": null,
            "helpText": null,
            "name": "Georgian",
            "displayName": "Georgian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ka-GE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_german",
            "description": null,
            "helpText": null,
            "name": "German",
            "displayName": "German",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_germanaustria",
            "description": null,
            "helpText": null,
            "name": "German (Austria)",
            "displayName": "German (Austria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-AT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_germanbelgium",
            "description": null,
            "helpText": null,
            "name": "German (Belgium)",
            "displayName": "German (Belgium)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-BE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_germanitaly",
            "description": null,
            "helpText": null,
            "name": "German (Italy)",
            "displayName": "German (Italy)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_germanliechtenstein",
            "description": null,
            "helpText": null,
            "name": "German (Liechtenstein)",
            "displayName": "German (Liechtenstein)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-LI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_germanluxembourg",
            "description": null,
            "helpText": null,
            "name": "German (Luxembourg)",
            "displayName": "German (Luxembourg)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-LU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_germanswitzerland",
            "description": null,
            "helpText": null,
            "name": "German (Switzerland)",
            "displayName": "German (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_greek",
            "description": null,
            "helpText": null,
            "name": "Greek",
            "displayName": "Greek",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "el-GR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_guarani",
            "description": null,
            "helpText": null,
            "name": "Guarani",
            "displayName": "Guarani",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gn-PY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_gujarati",
            "description": null,
            "helpText": null,
            "name": "Gujarati",
            "displayName": "Gujarati",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gu-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_hausa",
            "description": null,
            "helpText": null,
            "name": "Hausa",
            "displayName": "Hausa",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ha-Latn-NG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_hawaiian",
            "description": null,
            "helpText": null,
            "name": "Hawaiian",
            "displayName": "Hawaiian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "haw-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_hebrew",
            "description": null,
            "helpText": null,
            "name": "Hebrew",
            "displayName": "Hebrew",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "he-IL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_hindi",
            "description": null,
            "helpText": null,
            "name": "Hindi",
            "displayName": "Hindi",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hi-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_hungarian",
            "description": null,
            "helpText": null,
            "name": "Hungarian",
            "displayName": "Hungarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hu-HU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_icelandic",
            "description": null,
            "helpText": null,
            "name": "Icelandic",
            "displayName": "Icelandic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "is-IS"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_igbo",
            "description": null,
            "helpText": null,
            "name": "Igbo",
            "displayName": "Igbo",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ig-NG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_indonesian",
            "description": null,
            "helpText": null,
            "name": "Indonesian",
            "displayName": "Indonesian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "id-ID"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_interlingua",
            "description": null,
            "helpText": null,
            "name": "Interlingua",
            "displayName": "Interlingua",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_inuktitut",
            "description": null,
            "helpText": null,
            "name": "Inuktitut",
            "displayName": "Inuktitut",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "iu-Latn-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_inuktitutsyllabics",
            "description": null,
            "helpText": null,
            "name": "Inuktitut (Syllabics)",
            "displayName": "Inuktitut (Syllabics)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "iu-Cans-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_irish",
            "description": null,
            "helpText": null,
            "name": "Irish",
            "displayName": "Irish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ga-IE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_irishunitedkingdom",
            "description": null,
            "helpText": null,
            "name": "Irish (United Kingdom)",
            "displayName": "Irish (United Kingdom)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_italian",
            "description": null,
            "helpText": null,
            "name": "Italian",
            "displayName": "Italian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-IT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_italianswitzerland",
            "description": null,
            "helpText": null,
            "name": "Italian (Switzerland)",
            "displayName": "Italian (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_italianvaticancity",
            "description": null,
            "helpText": null,
            "name": "Italian (Vatican City)",
            "displayName": "Italian (Vatican City)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_japanese",
            "description": null,
            "helpText": null,
            "name": "Japanese",
            "displayName": "Japanese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ja-JP"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_javanese",
            "description": null,
            "helpText": null,
            "name": "Javanese",
            "displayName": "Javanese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "jv"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_javanesejavanese",
            "description": null,
            "helpText": null,
            "name": "Javanese (Javanese)",
            "displayName": "Javanese (Javanese)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "jv-Java"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kalaallisut",
            "description": null,
            "helpText": null,
            "name": "Kalaallisut",
            "displayName": "Kalaallisut",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kl-GL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kannada",
            "description": null,
            "helpText": null,
            "name": "Kannada",
            "displayName": "Kannada",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kn-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kashmiri",
            "description": null,
            "helpText": null,
            "name": "Kashmiri",
            "displayName": "Kashmiri",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ur-PK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kashmiridevanagari",
            "description": null,
            "helpText": null,
            "name": "Kashmiri (Devanagari)",
            "displayName": "Kashmiri (Devanagari)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hi-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kazakh",
            "description": null,
            "helpText": null,
            "name": "Kazakh",
            "displayName": "Kazakh",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kk-KZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_khmer",
            "description": null,
            "helpText": null,
            "name": "Khmer",
            "displayName": "Khmer",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "km-KH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kinyarwanda",
            "description": null,
            "helpText": null,
            "name": "Kinyarwanda",
            "displayName": "Kinyarwanda",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "rw-RW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kiswahili",
            "description": null,
            "helpText": null,
            "name": "Kiswahili",
            "displayName": "Kiswahili",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sw-KE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kiswahilicongodrc",
            "description": null,
            "helpText": null,
            "name": "Kiswahili (Congo DRC)",
            "displayName": "Kiswahili (Congo DRC)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kiswahilitanzania",
            "description": null,
            "helpText": null,
            "name": "Kiswahili (Tanzania)",
            "displayName": "Kiswahili (Tanzania)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kiswahiliuganda",
            "description": null,
            "helpText": null,
            "name": "Kiswahili (Uganda)",
            "displayName": "Kiswahili (Uganda)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_konkani",
            "description": null,
            "helpText": null,
            "name": "Konkani",
            "displayName": "Konkani",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kok-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_korean",
            "description": null,
            "helpText": null,
            "name": "Korean",
            "displayName": "Korean",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ko-KR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_koreannorthkorea",
            "description": null,
            "helpText": null,
            "name": "Korean (North Korea)",
            "displayName": "Korean (North Korea)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_kyrgyz",
            "description": null,
            "helpText": null,
            "name": "Kyrgyz",
            "displayName": "Kyrgyz",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ky-KG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_lao",
            "description": null,
            "helpText": null,
            "name": "Lao",
            "displayName": "Lao",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lo-LA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_latvian",
            "description": null,
            "helpText": null,
            "name": "Latvian",
            "displayName": "Latvian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lv-LV"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_lithuanian",
            "description": null,
            "helpText": null,
            "name": "Lithuanian",
            "displayName": "Lithuanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lt-LT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_lowersorbian",
            "description": null,
            "helpText": null,
            "name": "Lower Sorbian",
            "displayName": "Lower Sorbian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "dsb-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_luxembourgish",
            "description": null,
            "helpText": null,
            "name": "Luxembourgish",
            "displayName": "Luxembourgish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lb-LU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_macedonian",
            "description": null,
            "helpText": null,
            "name": "Macedonian",
            "displayName": "Macedonian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mk-MK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_malagasy",
            "description": null,
            "helpText": null,
            "name": "Malagasy",
            "displayName": "Malagasy",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mg"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_malay",
            "description": null,
            "helpText": null,
            "name": "Malay",
            "displayName": "Malay",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ms-MY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_malaybrunei",
            "description": null,
            "helpText": null,
            "name": "Malay (Brunei)",
            "displayName": "Malay (Brunei)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ms-BN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_malayindonesia",
            "description": null,
            "helpText": null,
            "name": "Malay (Indonesia)",
            "displayName": "Malay (Indonesia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_malaysingapore",
            "description": null,
            "helpText": null,
            "name": "Malay (Singapore)",
            "displayName": "Malay (Singapore)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_malayalam",
            "description": null,
            "helpText": null,
            "name": "Malayalam",
            "displayName": "Malayalam",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ml-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_maltese",
            "description": null,
            "helpText": null,
            "name": "Maltese",
            "displayName": "Maltese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mt-MT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_manipuri",
            "description": null,
            "helpText": null,
            "name": "Manipuri",
            "displayName": "Manipuri",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_manx",
            "description": null,
            "helpText": null,
            "name": "Manx",
            "displayName": "Manx",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_maori",
            "description": null,
            "helpText": null,
            "name": "Maori",
            "displayName": "Maori",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mi-NZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_mapuche",
            "description": null,
            "helpText": null,
            "name": "Mapuche",
            "displayName": "Mapuche",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "arn-CL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_marathi",
            "description": null,
            "helpText": null,
            "name": "Marathi",
            "displayName": "Marathi",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mr-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_mazanderani",
            "description": null,
            "helpText": null,
            "name": "Mazanderani",
            "displayName": "Mazanderani",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fa-IR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_mohawk",
            "description": null,
            "helpText": null,
            "name": "Mohawk",
            "displayName": "Mohawk",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "moh-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_mongolian",
            "description": null,
            "helpText": null,
            "name": "Mongolian",
            "displayName": "Mongolian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mn-MN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_mongolian_traditional_mongolian",
            "description": null,
            "helpText": null,
            "name": "Mongolian (Traditional Mongolian)",
            "displayName": "Mongolian (Traditional Mongolian)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mn-Mong-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_mongolian_traditional_mongolian_mongolia",
            "description": null,
            "helpText": null,
            "name": "Mongolian (Traditional Mongolian, Mongolia)",
            "displayName": "Mongolian (Traditional Mongolian, Mongolia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mn-Mong-MN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_nko",
            "description": null,
            "helpText": null,
            "name": "N'ko",
            "displayName": "N'ko",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nqo"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_nepali",
            "description": null,
            "helpText": null,
            "name": "Nepali",
            "displayName": "Nepali",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ne-NP"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_nepali_india",
            "description": null,
            "helpText": null,
            "name": "Nepali (India)",
            "displayName": "Nepali (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ne-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_northern_luri",
            "description": null,
            "helpText": null,
            "name": "Northern Luri",
            "displayName": "Northern Luri",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-IQ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_northern_sami",
            "description": null,
            "helpText": null,
            "name": "Northern Sami",
            "displayName": "Northern Sami",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "se-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_norwegian",
            "description": null,
            "helpText": null,
            "name": "Norwegian",
            "displayName": "Norwegian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nb-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_norwegian_nynorsk",
            "description": null,
            "helpText": null,
            "name": "Norwegian Nynorsk",
            "displayName": "Norwegian Nynorsk",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nn-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_occitan",
            "description": null,
            "helpText": null,
            "name": "Occitan",
            "displayName": "Occitan",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "oc-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_odia",
            "description": null,
            "helpText": null,
            "name": "Odia",
            "displayName": "Odia",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "or-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_oromo",
            "description": null,
            "helpText": null,
            "name": "Oromo",
            "displayName": "Oromo",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "om-ET"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_oromo_kenya",
            "description": null,
            "helpText": null,
            "name": "Oromo (Kenya)",
            "displayName": "Oromo (Kenya)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_ossetic",
            "description": null,
            "helpText": null,
            "name": "Ossetic",
            "displayName": "Ossetic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ru-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_papiamento",
            "description": null,
            "helpText": null,
            "name": "Papiamento",
            "displayName": "Papiamento",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pap-029"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_pashto",
            "description": null,
            "helpText": null,
            "name": "Pashto",
            "displayName": "Pashto",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ps-AF"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_pashto_pakistan",
            "description": null,
            "helpText": null,
            "name": "Pashto (Pakistan)",
            "displayName": "Pashto (Pakistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_persian",
            "description": null,
            "helpText": null,
            "name": "Persian",
            "displayName": "Persian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fa-IR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_persian_afghanistan",
            "description": null,
            "helpText": null,
            "name": "Persian (Afghanistan)",
            "displayName": "Persian (Afghanistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fa-AF"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_polish",
            "description": null,
            "helpText": null,
            "name": "Polish",
            "displayName": "Polish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pl-PL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese",
            "description": null,
            "helpText": null,
            "name": "Portuguese",
            "displayName": "Portuguese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-BR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_angola",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Angola)",
            "displayName": "Portuguese (Angola)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_cabo_verde",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Cabo Verde)",
            "displayName": "Portuguese (Cabo Verde)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_equatorial_guinea",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Equatorial Guinea)",
            "displayName": "Portuguese (Equatorial Guinea)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_guinea_bissau",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Guinea-Bissau)",
            "displayName": "Portuguese (Guinea-Bissau)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_luxembourg",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Luxembourg)",
            "displayName": "Portuguese (Luxembourg)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_macao_sar",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Macao SAR)",
            "displayName": "Portuguese (Macao SAR)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_mozambique",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Mozambique)",
            "displayName": "Portuguese (Mozambique)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_portugal",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Portugal)",
            "displayName": "Portuguese (Portugal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_switzerland",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Switzerland)",
            "displayName": "Portuguese (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_sao_tome_principe",
            "description": null,
            "helpText": null,
            "name": "Portuguese (São Tomé & Príncipe)",
            "displayName": "Portuguese (São Tomé & Príncipe)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_portuguese_timor_leste",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Timor-Leste)",
            "displayName": "Portuguese (Timor-Leste)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_prussian",
            "description": null,
            "helpText": null,
            "name": "Prussian",
            "displayName": "Prussian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_punjabi",
            "description": null,
            "helpText": null,
            "name": "Punjabi",
            "displayName": "Punjabi",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pa-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_quechua",
            "description": null,
            "helpText": null,
            "name": "Quechua",
            "displayName": "Quechua",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "quz-BO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_quechua_ecuador",
            "description": null,
            "helpText": null,
            "name": "Quechua (Ecuador)",
            "displayName": "Quechua (Ecuador)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "quz-EC"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_quechua_peru",
            "description": null,
            "helpText": null,
            "name": "Quechua (Peru)",
            "displayName": "Quechua (Peru)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "quz-PE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_romanian",
            "description": null,
            "helpText": null,
            "name": "Romanian",
            "displayName": "Romanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ro-RO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_romanian_moldova",
            "description": null,
            "helpText": null,
            "name": "Romanian (Moldova)",
            "displayName": "Romanian (Moldova)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ro-MD"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_romansh",
            "description": null,
            "helpText": null,
            "name": "Romansh",
            "displayName": "Romansh",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "rm-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_russian",
            "description": null,
            "helpText": null,
            "name": "Russian",
            "displayName": "Russian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ru-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_russian_moldova",
            "description": null,
            "helpText": null,
            "name": "Russian (Moldova)",
            "displayName": "Russian (Moldova)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sakha",
            "description": null,
            "helpText": null,
            "name": "Sakha",
            "displayName": "Sakha",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sah-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sami_lule_norway",
            "description": null,
            "helpText": null,
            "name": "Sami, Lule (Norway)",
            "displayName": "Sami, Lule (Norway)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "smj-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sami_northern_finland",
            "description": null,
            "helpText": null,
            "name": "Sami, Northern (Finland)",
            "displayName": "Sami, Northern (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "se-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sami_northern_sweden",
            "description": null,
            "helpText": null,
            "name": "Sami, Northern (Sweden)",
            "displayName": "Sami, Northern (Sweden)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "se-SE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sami_southern_norway",
            "description": null,
            "helpText": null,
            "name": "Sami, Southern (Norway)",
            "displayName": "Sami, Southern (Norway)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sma-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sanskrit",
            "description": null,
            "helpText": null,
            "name": "Sanskrit",
            "displayName": "Sanskrit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sa-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_scottish_gaelic",
            "description": null,
            "helpText": null,
            "name": "Scottish Gaelic",
            "displayName": "Scottish Gaelic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gd-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian",
            "description": null,
            "helpText": null,
            "name": "Serbian",
            "displayName": "Serbian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Latn-RS"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian_cyrillic",
            "description": null,
            "helpText": null,
            "name": "Serbian (Cyrillic)",
            "displayName": "Serbian (Cyrillic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Cyrl-RS"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian_cyrillic_bosnia_herzegovina",
            "description": null,
            "helpText": null,
            "name": "Serbian (Cyrillic, Bosnia and Herzegovina)",
            "displayName": "Serbian (Cyrillic, Bosnia and Herzegovina)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Cyrl-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian_cyrillic_kosovo",
            "description": null,
            "helpText": null,
            "name": "Serbian (Cyrillic, Kosovo)",
            "displayName": "Serbian (Cyrillic, Kosovo)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian_cyrillic_montenegro",
            "description": null,
            "helpText": null,
            "name": "Serbian (Cyrillic, Montenegro)",
            "displayName": "Serbian (Cyrillic, Montenegro)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Cyrl-ME"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian_latin_bosnia_herzegovina",
            "description": null,
            "helpText": null,
            "name": "Serbian (Latin, Bosnia & Herzegovina)",
            "displayName": "Serbian (Latin, Bosnia & Herzegovina)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Latn-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian_latin_kosovo",
            "description": null,
            "helpText": null,
            "name": "Serbian (Latin, Kosovo)",
            "displayName": "Serbian (Latin, Kosovo)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_serbian_latin_montenegro",
            "description": null,
            "helpText": null,
            "name": "Serbian (Latin, Montenegro)",
            "displayName": "Serbian (Latin, Montenegro)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Latn-ME"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sesotho",
            "description": null,
            "helpText": null,
            "name": "Sesotho",
            "displayName": "Sesotho",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "st-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sesotho_lesotho",
            "description": null,
            "helpText": null,
            "name": "Sesotho (Lesotho)",
            "displayName": "Sesotho (Lesotho)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sesotho_sa_leboa",
            "description": null,
            "helpText": null,
            "name": "Sesotho sa Leboa",
            "displayName": "Sesotho sa Leboa",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nso-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_setswana",
            "description": null,
            "helpText": null,
            "name": "Setswana",
            "displayName": "Setswana",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tn-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_setswana_botswana",
            "description": null,
            "helpText": null,
            "name": "Setswana (Botswana)",
            "displayName": "Setswana (Botswana)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tn-BW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_shona",
            "description": null,
            "helpText": null,
            "name": "Shona",
            "displayName": "Shona",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "jv"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_sinhala",
            "description": null,
            "helpText": null,
            "name": "Sinhala",
            "displayName": "Sinhala",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "si-LK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_slovak",
            "description": null,
            "helpText": null,
            "name": "Slovak",
            "displayName": "Slovak",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sk-SK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_slovenian",
            "description": null,
            "helpText": null,
            "name": "Slovenian",
            "displayName": "Slovenian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sl-SI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_somali",
            "description": null,
            "helpText": null,
            "name": "Somali",
            "displayName": "Somali",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "so-SO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_somali_djibouti",
            "description": null,
            "helpText": null,
            "name": "Somali (Djibouti)",
            "displayName": "Somali (Djibouti)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_somali_ethiopia",
            "description": null,
            "helpText": null,
            "name": "Somali (Ethiopia)",
            "displayName": "Somali (Ethiopia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_somali_kenya",
            "description": null,
            "helpText": null,
            "name": "Somali (Kenya)",
            "displayName": "Somali (Kenya)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish",
            "description": null,
            "helpText": null,
            "name": "Spanish",
            "displayName": "Spanish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_argentina",
            "description": null,
            "helpText": null,
            "name": "Spanish (Argentina)",
            "displayName": "Spanish (Argentina)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-AR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_belize",
            "description": null,
            "helpText": null,
            "name": "Spanish (Belize)",
            "displayName": "Spanish (Belize)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_bolivia",
            "description": null,
            "helpText": null,
            "name": "Spanish (Bolivia)",
            "displayName": "Spanish (Bolivia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-BO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_brazil",
            "description": null,
            "helpText": null,
            "name": "Spanish (Brazil)",
            "displayName": "Spanish (Brazil)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_chile",
            "description": null,
            "helpText": null,
            "name": "Spanish (Chile)",
            "displayName": "Spanish (Chile)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-CL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_colombia",
            "description": null,
            "helpText": null,
            "name": "Spanish (Colombia)",
            "displayName": "Spanish (Colombia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-CO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_costa_rica",
            "description": null,
            "helpText": null,
            "name": "Spanish (Costa Rica)",
            "displayName": "Spanish (Costa Rica)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-CR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_cuba",
            "description": null,
            "helpText": null,
            "name": "Spanish (Cuba)",
            "displayName": "Spanish (Cuba)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-MX"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_dominican_republic",
            "description": null,
            "helpText": null,
            "name": "Spanish (Dominican Republic)",
            "displayName": "Spanish (Dominican Republic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-DO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_ecuador",
            "description": null,
            "helpText": null,
            "name": "Spanish (Ecuador)",
            "displayName": "Spanish (Ecuador)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-EC"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_el_salvador",
            "description": null,
            "helpText": null,
            "name": "Spanish (El Salvador)",
            "displayName": "Spanish (El Salvador)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-SV"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_equatorial_guinea",
            "description": null,
            "helpText": null,
            "name": "Spanish (Equatorial Guinea)",
            "displayName": "Spanish (Equatorial Guinea)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-MX"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_guatemala",
            "description": null,
            "helpText": null,
            "name": "Spanish (Guatemala)",
            "displayName": "Spanish (Guatemala)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-GT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_honduras",
            "description": null,
            "helpText": null,
            "name": "Spanish (Honduras)",
            "displayName": "Spanish (Honduras)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-HN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_latin_america",
            "description": null,
            "helpText": null,
            "name": "Spanish (Latin America)",
            "displayName": "Spanish (Latin America)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-419"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_mexico",
            "description": null,
            "helpText": null,
            "name": "Spanish (Mexico)",
            "displayName": "Spanish (Mexico)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-MX"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_nicaragua",
            "description": null,
            "helpText": null,
            "name": "Spanish (Nicaragua)",
            "displayName": "Spanish (Nicaragua)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-NI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_panama",
            "description": null,
            "helpText": null,
            "name": "Spanish (Panama)",
            "displayName": "Spanish (Panama)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_paraguay",
            "description": null,
            "helpText": null,
            "name": "Spanish (Paraguay)",
            "displayName": "Spanish (Paraguay)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_peru",
            "description": null,
            "helpText": null,
            "name": "Spanish (Peru)",
            "displayName": "Spanish (Peru)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_philippines",
            "description": null,
            "helpText": null,
            "name": "Spanish (Philippines)",
            "displayName": "Spanish (Philippines)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-MX"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_puerto_rico",
            "description": null,
            "helpText": null,
            "name": "Spanish (Puerto Rico)",
            "displayName": "Spanish (Puerto Rico)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_united_states",
            "description": null,
            "helpText": null,
            "name": "Spanish (United States)",
            "displayName": "Spanish (United States)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_uruguay",
            "description": null,
            "helpText": null,
            "name": "Spanish (Uruguay)",
            "displayName": "Spanish (Uruguay)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-UY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_spanish_venezuela",
            "description": null,
            "helpText": null,
            "name": "Spanish (Venezuela)",
            "displayName": "Spanish (Venezuela)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-VE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_standard_moroccan_tamazight",
            "description": null,
            "helpText": null,
            "name": "Standard Moroccan Tamazight",
            "displayName": "Standard Moroccan Tamazight",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zgh"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_swedish",
            "description": null,
            "helpText": null,
            "name": "Swedish",
            "displayName": "Swedish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sv-SE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_swedish_finland",
            "description": null,
            "helpText": null,
            "name": "Swedish (Finland)",
            "displayName": "Swedish (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sv-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_swiss_german",
            "description": null,
            "helpText": null,
            "name": "Swiss German",
            "displayName": "Swiss German",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_syriac",
            "description": null,
            "helpText": null,
            "name": "Syriac",
            "displayName": "Syriac",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "syr-SY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tachelhit",
            "description": null,
            "helpText": null,
            "name": "Tachelhit",
            "displayName": "Tachelhit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tzm-Tfng-MA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tachelhit_latin",
            "description": null,
            "helpText": null,
            "name": "Tachelhit (Latin)",
            "displayName": "Tachelhit (Latin)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tzm-Latn-DZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tajik",
            "description": null,
            "helpText": null,
            "name": "Tajik",
            "displayName": "Tajik",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tg-Cyrl-TJ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tamil",
            "description": null,
            "helpText": null,
            "name": "Tamil",
            "displayName": "Tamil",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ta-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tamil_malaysia",
            "description": null,
            "helpText": null,
            "name": "Tamil (Malaysia)",
            "displayName": "Tamil (Malaysia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ta-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tamil_singapore",
            "description": null,
            "helpText": null,
            "name": "Tamil (Singapore)",
            "displayName": "Tamil (Singapore)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ta-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tamil_sri_lanka",
            "description": null,
            "helpText": null,
            "name": "Tamil (Sri Lanka)",
            "displayName": "Tamil (Sri Lanka)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ta-LK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tatar",
            "description": null,
            "helpText": null,
            "name": "Tatar",
            "displayName": "Tatar",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tt-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_telugu",
            "description": null,
            "helpText": null,
            "name": "Telugu",
            "displayName": "Telugu",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "te-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_thai",
            "description": null,
            "helpText": null,
            "name": "Thai",
            "displayName": "Thai",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "th-TH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tibetan",
            "description": null,
            "helpText": null,
            "name": "Tibetan",
            "displayName": "Tibetan",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bo-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tibetan_india",
            "description": null,
            "helpText": null,
            "name": "Tibetan (India)",
            "displayName": "Tibetan (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bo-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_tigrinya",
            "description": null,
            "helpText": null,
            "name": "Tigrinya",
            "displayName": "Tigrinya",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ti-ET"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_turkish",
            "description": null,
            "helpText": null,
            "name": "Turkish",
            "displayName": "Turkish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tr-TR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_turkmen",
            "description": null,
            "helpText": null,
            "name": "Turkmen",
            "displayName": "Turkmen",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tk-TM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_ukrainian",
            "description": null,
            "helpText": null,
            "name": "Ukrainian",
            "displayName": "Ukrainian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uk-UA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_upper_sorbian",
            "description": null,
            "helpText": null,
            "name": "Upper Sorbian",
            "displayName": "Upper Sorbian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hsb-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_urdu",
            "description": null,
            "helpText": null,
            "name": "Urdu",
            "displayName": "Urdu",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ur-PK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_urdu_india",
            "description": null,
            "helpText": null,
            "name": "Urdu (India)",
            "displayName": "Urdu (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ur-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_uyghur",
            "description": null,
            "helpText": null,
            "name": "Uyghur",
            "displayName": "Uyghur",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ug-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_uzbek",
            "description": null,
            "helpText": null,
            "name": "Uzbek",
            "displayName": "Uzbek",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uz-Latn-UZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_uzbek_arabic",
            "description": null,
            "helpText": null,
            "name": "Uzbek (Arabic)",
            "displayName": "Uzbek (Arabic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ps-AF"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_uzbek_cyrillic",
            "description": null,
            "helpText": null,
            "name": "Uzbek (Cyrillic)",
            "displayName": "Uzbek (Cyrillic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uz-Cyrl-UZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_valencian_spain",
            "description": null,
            "helpText": null,
            "name": "Valencian (Spain)",
            "displayName": "Valencian (Spain)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ca-ES-valencia"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_vietnamese",
            "description": null,
            "helpText": null,
            "name": "Vietnamese",
            "displayName": "Vietnamese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "vi-VN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_walser",
            "description": null,
            "helpText": null,
            "name": "Walser",
            "displayName": "Walser",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_welsh",
            "description": null,
            "helpText": null,
            "name": "Welsh",
            "displayName": "Welsh",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "cy-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_western_frisian",
            "description": null,
            "helpText": null,
            "name": "Western Frisian",
            "displayName": "Western Frisian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fy-NL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_wolof",
            "description": null,
            "helpText": null,
            "name": "Wolof",
            "displayName": "Wolof",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wo-SN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_xitsonga",
            "description": null,
            "helpText": null,
            "name": "Xitsonga",
            "displayName": "Xitsonga",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ts-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_yi",
            "description": null,
            "helpText": null,
            "name": "Yi",
            "displayName": "Yi",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ii-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_yoruba",
            "description": null,
            "helpText": null,
            "name": "Yoruba",
            "displayName": "Yoruba",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "yo-NG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_isixhosa",
            "description": null,
            "helpText": null,
            "name": "IsiXhosa",
            "displayName": "IsiXhosa",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "xh-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_keyboardsettings_isizulu",
            "description": null,
            "helpText": null,
            "name": "IsiZulu",
            "displayName": "IsiZulu",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zu-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}