{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Os recovery settings",
        "Operating system"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./osrecoverysettings",
    "offsetUri": "/os",
    "rootDefinitionId": "osrecoverysettings_os",
    "categoryId": "b92241c7-e419-4dc7-b373-08e595c1db1d",
    "settingUsage": "configuration",
    "uxBehavior": "largeTextBox",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "osrecoverysettings_os",
    "description": "Select the operating system to be installed in recovery scenarios for devices in your organization. Learn more about OS recovery scenarios.",
    "helpText": "",
    "name": "OS",
    "displayName": "OS",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "windowsOsRecovery",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1000,
        "minimumLength": 1,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}