{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Os recovery settings",
        "Format disk",
        "Operating system settings"
    ],
    "infoUrls": [],
    "baseUri": "./osrecoverysettings",
    "offsetUri": "/formatdisk",
    "rootDefinitionId": "osrecoverysettings_formatdisk",
    "categoryId": "71f79fa3-14c0-4df8-bf9c-8476e36ea755",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "osrecoverysettings_formatdisk",
    "description": "By default, the primary disk is formatted. Or format all the partition",
    "helpText": "",
    "name": "formatDisk",
    "displayName": "Format disk",
    "defaultOptionId": "osrecoverysettings_formatdisk_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "windowsOsRecovery",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "osrecoverysettings_formatdisk_0",
            "description": null,
            "helpText": null,
            "name": "Format windows partition",
            "displayName": "Format windows partition",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Format windows partition"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_formatdisk_1",
            "description": null,
            "helpText": null,
            "name": "Format all partition",
            "displayName": "Format all partition",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Format all partition"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}