{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Settings",
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RequirePasscode",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "passcode_requirepasscode",
    "description": "Specifies whether the user is forced to set a passcode. Setting this value, without any other keys present, forces the user to enter a passcode, without imposing a length or quality. The presence of any of the other keys implicitly requires a passcode be present on the device, and this key is ignored.",
    "helpText": null,
    "name": "RequirePasscode",
    "displayName": "Require Passcode on Device",
    "defaultOptionId": "passcode_requirepasscode_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "passcode_requirepasscode_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "passcode_requirepasscode_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}