{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Settings",
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.configuration.passcode.settings",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "passcode_passcode",
    "description": "Use this configuration to define passcode policy settings",
    "helpText": null,
    "name": "com.apple.configuration.passcode.settings",
    "displayName": "Passcode",
    "childIds": [
        "passcode_requirepasscode",
        "passcode_requirealphanumericpasscode",
        "passcode_requirecomplexpasscode",
        "passcode_minimumlength",
        "passcode_minimumcomplexcharacters",
        "passcode_maximumfailedattempts",
        "passcode_failedattemptsresetinminutes",
        "passcode_maximumgraceperiodinminutes",
        "passcode_maximuminactivityinminutes",
        "passcode_maximumpasscodeageindays",
        "passcode_passcodereuselimit",
        "passcode_changeatnextauth",
        "passcode_customregex"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "passcode_requirepasscode",
            "required": false
        },
        {
            "dependedOnBy": "passcode_requirealphanumericpasscode",
            "required": false
        },
        {
            "dependedOnBy": "passcode_requirecomplexpasscode",
            "required": false
        },
        {
            "dependedOnBy": "passcode_minimumlength",
            "required": false
        },
        {
            "dependedOnBy": "passcode_minimumcomplexcharacters",
            "required": false
        },
        {
            "dependedOnBy": "passcode_maximumfailedattempts",
            "required": false
        },
        {
            "dependedOnBy": "passcode_failedattemptsresetinminutes",
            "required": false
        },
        {
            "dependedOnBy": "passcode_maximumgraceperiodinminutes",
            "required": false
        },
        {
            "dependedOnBy": "passcode_maximuminactivityinminutes",
            "required": false
        },
        {
            "dependedOnBy": "passcode_maximumpasscodeageindays",
            "required": false
        },
        {
            "dependedOnBy": "passcode_passcodereuselimit",
            "required": false
        },
        {
            "dependedOnBy": "passcode_changeatnextauth",
            "required": false
        },
        {
            "dependedOnBy": "passcode_customregex",
            "required": false
        }
    ]
}