{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Settings",
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "MaximumFailedAttempts",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "passcode_maximumfailedattempts",
    "description": "Specifies the number of failed passcode attempts that can be made before an iOS device is erased or a macOS device is locked. If you don’t change this setting, after six failed attempts, the device imposes a time delay before a passcode can be entered again. The time delay increases with each failed attempt. After the final failed attempt, all data and settings are securely erased from the iOS device. A macOS device locks after the final attempt. The passcode time delay begins after the sixth attempt, so if you set this value to six or lower, no time delay is imposed and the device is erased when the attempt limit is exceeded.",
    "helpText": null,
    "name": "MaximumFailedAttempts",
    "displayName": "Maximum Number of Failed Attempts",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 11,
        "minimumValue": 2
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 11
    },
    "dependentOn": [
        {
            "dependentOn": "passcode_passcode",
            "parentSettingId": "passcode_passcode"
        }
    ],
    "dependedOnBy": []
}