{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode",
        "Declarative Device Management (DDM)\\Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ChangeAtNextAuth",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "passcode_changeatnextauth",
    "description": "If 'true', the system forces a password reset the next time the user tries to authenticate. If you set this key in a configuration in the system scope (device channel), the setting takes effect for all users, and admin authentication may fail until the admin user password is also reset.",
    "helpText": null,
    "name": "ChangeAtNextAuth",
    "displayName": "Change At Next Auth",
    "defaultOptionId": "passcode_changeatnextauth_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "passcode_changeatnextauth_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "passcode_changeatnextauth_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}