{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode",
        "Declarative Device Management (DDM)\\Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "MaximumPasscodeAgeInDays",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "passcode_maximumpasscodeageindays",
    "description": "Specifies the maximum number of days that the passcode can remain unchanged. After this number of days, the system forces the user to change the passcode before it unlocks the device.",
    "helpText": null,
    "name": "MaximumPasscodeAgeInDays",
    "displayName": "Maximum Passcode Age In Days",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 730,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "passcode_passcode",
            "parentSettingId": "passcode_passcode"
        }
    ],
    "dependedOnBy": []
}