{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Personal Hotspot"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/PersonalHotspot/Enabled",
    "rootDefinitionId": "settings_item_personalhotspot",
    "categoryId": "1a056b49-3fb9-4097-b286-c5f493208578",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_personalhotspot_enabled",
    "description": "If 'true', enable Personal Hotspot. If 'false', disable Personal Hotspot.",
    "helpText": null,
    "name": "Settings_item_PersonalHotspot_Enabled",
    "displayName": "Enabled",
    "defaultOptionId": "settings_item_personalhotspot_enabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_personalhotspot_enabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_personalhotspot",
                    "parentSettingId": "settings_item_personalhotspot"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_personalhotspot_enabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_personalhotspot",
                    "parentSettingId": "settings_item_personalhotspot"
                }
            ],
            "dependedOnBy": []
        }
    ]
}