{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MDM Options"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/MDMOptions/MDMOptions/IdleRebootAllowed",
    "rootDefinitionId": "settings_item_mdmoptions",
    "categoryId": "dd68a290-1ba7-470f-afca-339f443a767c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_mdmoptions_mdmoptions_idlerebootallowed",
    "description": "If true, device will automatically reboot while locked after several days of inactivity. This will be turned off by default upon enrollment on supervised devices.",
    "helpText": null,
    "name": "Settings_item_MDMOptions_MDMOptions_IdleRebootAllowed",
    "displayName": "Idle Reboot Allowed",
    "defaultOptionId": "settings_item_mdmoptions_mdmoptions_idlerebootallowed_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_mdmoptions_mdmoptions_idlerebootallowed_false",
            "description": null,
            "helpText": null,
            "name": "Blocked",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_mdmoptions_mdmoptions",
                    "parentSettingId": "settings_item_mdmoptions_mdmoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_mdmoptions_mdmoptions_idlerebootallowed_true",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_mdmoptions_mdmoptions",
                    "parentSettingId": "settings_item_mdmoptions_mdmoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}