{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Wallpaper"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/Wallpaper",
    "rootDefinitionId": "settings_item_wallpaper",
    "categoryId": "ef7328b1-c666-40fe-a933-57b14bc77dd3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_wallpaper",
    "description": "A dictionary that contains wallpaper settings. This setting doesn't support User Enrollment, and is available in iOS 8 and later. Starting from iOS 16.0 & iPadOS 17.0, when the wallpaper is set for the first time, both location will be updated. After that either location can be set separately.",
    "helpText": null,
    "name": "Settings_item_Wallpaper",
    "displayName": "Wallpaper",
    "childIds": [
        "settings_item_wallpaper_image",
        "settings_item_wallpaper_where"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_wallpaper_image",
            "required": true
        },
        {
            "dependedOnBy": "settings_item_wallpaper_where",
            "required": true
        }
    ]
}