{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Default Applications"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/DefaultApplications",
    "rootDefinitionId": "settings_item_defaultapplications",
    "categoryId": "b32726b3-b0e9-465b-86f8-b61ad8af52f0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_defaultapplications",
    "description": "A dictionary that contains default application bundle identifiers. Currently it supports a default web browser app.",
    "helpText": null,
    "name": "Settings_item_DefaultApplications",
    "displayName": "Default Applications",
    "childIds": [
        "settings_item_defaultapplications_webbrowser"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_defaultapplications_webbrowser",
            "required": false
        }
    ]
}