{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Wallpaper"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/Wallpaper/Where",
    "rootDefinitionId": "settings_item_wallpaper",
    "categoryId": "ef7328b1-c666-40fe-a933-57b14bc77dd3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_wallpaper_where",
    "description": "A number that indicates where to use the wallpaper, which is one of the following values:\n\n* '1': Lock screen\n* '2': Home screen\n* '3': Both lock and home screens.\n\nIn iOS 16 and later, and iPadOS 17 and later, when you set the wallpaper for the first time, the system sets both the lock screen and home screen. After that, you can separately set each location.",
    "helpText": null,
    "name": "Settings_item_Wallpaper_Where",
    "displayName": "Where",
    "defaultOptionId": "settings_item_wallpaper_where_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_wallpaper_where_0",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "Lock screen",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_wallpaper",
                    "parentSettingId": "settings_item_wallpaper"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_wallpaper_where_1",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "Home screen",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_wallpaper",
                    "parentSettingId": "settings_item_wallpaper"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_wallpaper_where_2",
            "description": null,
            "helpText": null,
            "name": "3",
            "displayName": "Both",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_wallpaper",
                    "parentSettingId": "settings_item_wallpaper"
                }
            ],
            "dependedOnBy": []
        }
    ]
}