{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Accessibility Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/AccessibilitySettings",
    "rootDefinitionId": "settings_item_accessibilitysettings",
    "categoryId": "e7dccaa6-2b16-4dd3-b835-83ca641d0c80",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_accessibilitysettings",
    "description": "A dictionary that contains accessibility settings. Available in iOS 16 and later.",
    "helpText": null,
    "name": "Settings_item_AccessibilitySettings",
    "displayName": "Accessibility Settings",
    "childIds": [
        "settings_item_accessibilitysettings_boldtextenabled",
        "settings_item_accessibilitysettings_increasecontrastenabled",
        "settings_item_accessibilitysettings_reducemotionenabled",
        "settings_item_accessibilitysettings_reducetransparencyenabled",
        "settings_item_accessibilitysettings_textsize",
        "settings_item_accessibilitysettings_touchaccommodationsenabled",
        "settings_item_accessibilitysettings_voiceoverenabled",
        "settings_item_accessibilitysettings_zoomenabled",
        "settings_item_accessibilitysettings_grayscaleenabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_accessibilitysettings_boldtextenabled",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_increasecontrastenabled",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_reducemotionenabled",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_reducetransparencyenabled",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_textsize",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_touchaccommodationsenabled",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_voiceoverenabled",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_zoomenabled",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_accessibilitysettings_grayscaleenabled",
            "required": false
        }
    ]
}