{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MDM Options"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/MDMOptions/MDMOptions/ActivationLockAllowedWhileSupervised",
    "rootDefinitionId": "settings_item_mdmoptions",
    "categoryId": "dd68a290-1ba7-470f-afca-339f443a767c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_mdmoptions_mdmoptions_activationlockallowedwhilesupervised",
    "description": "If 'true', a supervised device registers itself with Activation Lock when the user enables Find My. This setting is available for supervised devices in iOS 7 and later, and macOS 10.15 and later.",
    "helpText": null,
    "name": "Settings_item_MDMOptions_MDMOptions_ActivationLockAllowedWhileSupervised",
    "displayName": "Activation Lock Allowed While Supervised",
    "defaultOptionId": "settings_item_mdmoptions_mdmoptions_activationlockallowedwhilesupervised_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_mdmoptions_mdmoptions_activationlockallowedwhilesupervised_false",
            "description": null,
            "helpText": null,
            "name": "Blocked",
            "displayName": "Blocked",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_mdmoptions_mdmoptions",
                    "parentSettingId": "settings_item_mdmoptions_mdmoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_mdmoptions_mdmoptions_activationlockallowedwhilesupervised_true",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_mdmoptions_mdmoptions",
                    "parentSettingId": "settings_item_mdmoptions_mdmoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}