{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Bluetooth"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/Bluetooth",
    "rootDefinitionId": "settings_item_bluetooth",
    "categoryId": "3c7f15ef-a539-411c-93f1-5f97b7bd5519",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_bluetooth",
    "description": "A dictionary that contains Bluetooth settings. This setting requires the Network Information access right, doesn't support User Enrollment, is only available on supervised devices, and is available in iOS 11.3 and later, and macOS 10.13.4 and later.",
    "helpText": null,
    "name": "Settings_item_Bluetooth",
    "displayName": "Bluetooth",
    "childIds": [
        "settings_item_bluetooth_enabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_bluetooth_enabled",
            "required": true
        }
    ]
}