{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Accessibility Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/AccessibilitySettings/TextSize",
    "rootDefinitionId": "settings_item_accessibilitysettings",
    "categoryId": "e7dccaa6-2b16-4dd3-b835-83ca641d0c80",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_accessibilitysettings_textsize",
    "description": "The accessibility text size apps that support dynamic text use. 0 is the smallest value, and 11 is the largest available.",
    "helpText": null,
    "name": "Settings_item_AccessibilitySettings_TextSize",
    "displayName": "Text Size",
    "defaultOptionId": "settings_item_accessibilitysettings_textsize_4",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_accessibilitysettings_textsize_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_2",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_3",
            "description": null,
            "helpText": null,
            "name": "3",
            "displayName": "3",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_4",
            "description": null,
            "helpText": null,
            "name": "4",
            "displayName": "4",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_5",
            "description": null,
            "helpText": null,
            "name": "5",
            "displayName": "5",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_6",
            "description": null,
            "helpText": null,
            "name": "6",
            "displayName": "6",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 6
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_7",
            "description": null,
            "helpText": null,
            "name": "7",
            "displayName": "7",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 7
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_8",
            "description": null,
            "helpText": null,
            "name": "8",
            "displayName": "8",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 8
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_9",
            "description": null,
            "helpText": null,
            "name": "9",
            "displayName": "9",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 9
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_10",
            "description": null,
            "helpText": null,
            "name": "10",
            "displayName": "10",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 10
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_textsize_11",
            "description": null,
            "helpText": null,
            "name": "11",
            "displayName": "11",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 11
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}