{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Voice Roaming"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/VoiceRoaming/Enabled",
    "rootDefinitionId": "settings_item_voiceroaming",
    "categoryId": "1fbc29d7-0530-4208-b506-9df648a402e9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_voiceroaming_enabled",
    "description": "If 'true', enable voice roaming. If 'false', disable voice roaming, which also disables data roaming. The setting is only available for certain carriers.",
    "helpText": null,
    "name": "Settings_item_VoiceRoaming_Enabled",
    "displayName": "Enabled",
    "defaultOptionId": "settings_item_voiceroaming_enabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_voiceroaming_enabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_voiceroaming",
                    "parentSettingId": "settings_item_voiceroaming"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_voiceroaming_enabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_voiceroaming",
                    "parentSettingId": "settings_item_voiceroaming"
                }
            ],
            "dependedOnBy": []
        }
    ]
}