{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Bluetooth"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/Bluetooth/Enabled",
    "rootDefinitionId": "settings_item_bluetooth",
    "categoryId": "3c7f15ef-a539-411c-93f1-5f97b7bd5519",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_bluetooth_enabled",
    "description": "If 'true', enable the Bluetooth setting. If 'false', disable the Bluetooth setting.",
    "helpText": null,
    "name": "Settings_item_Bluetooth_Enabled",
    "displayName": "Enabled",
    "defaultOptionId": "settings_item_bluetooth_enabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_bluetooth_enabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_bluetooth",
                    "parentSettingId": "settings_item_bluetooth"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_bluetooth_enabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_bluetooth",
                    "parentSettingId": "settings_item_bluetooth"
                }
            ],
            "dependedOnBy": []
        }
    ]
}