{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Beta",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_beta",
    "description": "Configurations for controlling or specifying the beta programs associated with a device. Only applicable on Supervised devices with iOS 18+ and MacOS 15+",
    "helpText": null,
    "name": "Beta",
    "displayName": "Beta",
    "childIds": [
        "softwareupdate_beta_programenrollment",
        "softwareupdate_beta_offerprograms",
        "softwareupdate_beta_requireprogram"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "softwareupdate_softwareupdate",
            "parentSettingId": "softwareupdate_softwareupdate"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "softwareupdate_beta_programenrollment",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_beta_offerprograms",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_beta_requireprogram",
            "required": false
        }
    ]
}