{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AllowStandardUserOSUpdates",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_allowstandarduserosupdates",
    "description": "If 'true', a standard user can perform Major and Minor Software Updates. If 'false', only administrators can perform Major and Minor Software Updates.",
    "helpText": null,
    "name": "AllowStandardUserOSUpdates",
    "displayName": "Allow Standard User OS Updates",
    "defaultOptionId": "softwareupdate_allowstandarduserosupdates_true",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "softwareupdate_allowstandarduserosupdates_false",
            "description": null,
            "helpText": null,
            "name": "Blocked",
            "displayName": "Blocked",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_softwareupdate",
                    "parentSettingId": "softwareupdate_softwareupdate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_allowstandarduserosupdates_true",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_softwareupdate",
                    "parentSettingId": "softwareupdate_softwareupdate"
                }
            ],
            "dependedOnBy": []
        }
    ]
}