{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RecommendedCadence",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "softwareupdate_recommendedcadence",
    "description": "Specifies how the device shows software updates to the user. When more than one update is available update, the device behaves as follows:\n* \"All\" - Shows all software update versions.\n* \"Oldest\" - Shows only the oldest (lower numbered) software update version.\n* \"Newest\" - Shows only the newest (highest numbered) software update version. Only applicable on Supervised devices with iOS 18+ and MacOS 15+",
    "helpText": null,
    "name": "RecommendedCadence",
    "displayName": "Recommended Cadence",
    "defaultOptionId": "softwareupdate_recommendedcadence_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "softwareupdate_recommendedcadence_0",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "All"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_softwareupdate",
                    "parentSettingId": "softwareupdate_softwareupdate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_recommendedcadence_1",
            "description": null,
            "helpText": null,
            "name": "Oldest",
            "displayName": "Oldest",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Oldest"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_softwareupdate",
                    "parentSettingId": "softwareupdate_softwareupdate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_recommendedcadence_2",
            "description": null,
            "helpText": null,
            "name": "Newest",
            "displayName": "Newest",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Newest"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_softwareupdate",
                    "parentSettingId": "softwareupdate_softwareupdate"
                }
            ],
            "dependedOnBy": []
        }
    ]
}