{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Beta/RequireProgram",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_beta_requireprogram",
    "description": "The device automatically enrolls in this beta program. This key must only be present if the `ProgramEnrollment` key is set to `AlwaysOn`. The `OfferPrograms` key must not be present if this key is present.",
    "helpText": null,
    "name": "Beta_RequireProgram",
    "displayName": "Require Program",
    "childIds": [
        "softwareupdate_beta_requireprogram_description",
        "softwareupdate_beta_requireprogram_token"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "softwareupdate_beta",
            "parentSettingId": "softwareupdate_beta"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "softwareupdate_beta_requireprogram_description",
            "required": true
        },
        {
            "dependedOnBy": "softwareupdate_beta_requireprogram_token",
            "required": true
        }
    ]
}