{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Deferrals/MajorPeriodInDays",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_deferrals_majorperiodindays",
    "description": "Specifies the number of days to defer a major OS software update on the device. When set, software updates only appear after the specified delay, following the release of the software update.",
    "helpText": null,
    "name": "Deferrals_MajorPeriodInDays",
    "displayName": "Major Period In Days",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 90,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "softwareupdate_deferrals",
            "parentSettingId": "softwareupdate_deferrals"
        }
    ],
    "dependedOnBy": []
}