{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.configuration.softwareupdate.settings",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "softwareupdate_softwareupdate",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.configuration.softwareupdate.settings",
    "displayName": "com.apple.configuration.softwareupdate.settings",
    "childIds": [
        "softwareupdate_notifications",
        "softwareupdate_deferrals",
        "softwareupdate_recommendedcadence",
        "softwareupdate_automaticactions",
        "softwareupdate_rapidsecurityresponse",
        "softwareupdate_allowstandarduserosupdates",
        "softwareupdate_beta"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "softwareupdate_notifications",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_deferrals",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_recommendedcadence",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_automaticactions",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_rapidsecurityresponse",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_allowstandarduserosupdates",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_beta",
            "required": false
        }
    ]
}