{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Notifications",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_notifications",
    "description": "If 'true', the device shows all software update enforcement notifications. If 'false', the device only shows notifications triggered one hour before the enforcement deadline, and the restart countdown notification. Only applicable on Supervised devices with iOS 18+ and MacOS 15+",
    "helpText": null,
    "name": "Notifications",
    "displayName": "Notifications",
    "defaultOptionId": "softwareupdate_notifications_true",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "softwareupdate_notifications_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_softwareupdate",
                    "parentSettingId": "softwareupdate_softwareupdate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_notifications_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_softwareupdate",
                    "parentSettingId": "softwareupdate_softwareupdate"
                }
            ],
            "dependedOnBy": []
        }
    ]
}