{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Beta/OfferPrograms",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_beta_offerprograms",
    "description": "An array of beta programs allowed on the device. This key must only be present if the `ProgramEnrollment` key is set to `Allowed` or `AlwaysOn`. This key must not be present if the `RequireProgram` key is present. This key can be present on unsupervised devices where the `ProgramEnrollment` key is not supported but is implicitly set to `Allowed`.",
    "helpText": null,
    "name": "Beta_OfferPrograms",
    "displayName": "Offer Programs",
    "childIds": [
        "softwareupdate_beta_offerprograms_item_description",
        "softwareupdate_beta_offerprograms_item_token"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "softwareupdate_beta",
            "parentSettingId": "softwareupdate_beta"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "softwareupdate_beta_offerprograms_item_description",
            "required": true
        },
        {
            "dependedOnBy": "softwareupdate_beta_offerprograms_item_token",
            "required": true
        }
    ]
}