{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RapidSecurityResponse/EnableRollback",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_rapidsecurityresponse_enablerollback",
    "description": "If 'false', Rapid Security Response rollbacks are not offered to the user. If 'true', Rapid Security Response rollbacks are offered to the user.",
    "helpText": null,
    "name": "RapidSecurityResponse_EnableRollback",
    "displayName": "Enable Rollback",
    "defaultOptionId": "softwareupdate_rapidsecurityresponse_enablerollback_true",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "softwareupdate_rapidsecurityresponse_enablerollback_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_rapidsecurityresponse",
                    "parentSettingId": "softwareupdate_rapidsecurityresponse"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_rapidsecurityresponse_enablerollback_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_rapidsecurityresponse",
                    "parentSettingId": "softwareupdate_rapidsecurityresponse"
                }
            ],
            "dependedOnBy": []
        }
    ]
}