{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoControlPanel",
        "Prohibit access to Control Panel and PC settings",
        "\\Control Panel",
        "Administrative Templates\\Control Panel",
        "Control Panel"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-controlpanel#admx-controlpanel-nocontrolpanel"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ControlPanel/NoControlPanel",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_controlpanel_nocontrolpanel",
    "categoryId": "7a3a7335-4837-4bc5-9282-448402a05d89",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_controlpanel_nocontrolpanel",
    "description": "Disables all Control Panel programs and the PC settings app.\r\n\r\nThis setting prevents Control.exe and SystemSettings.exe, the program files for Control Panel and PC settings, from starting. As a result, users cannot start Control Panel or PC settings, or run any of their items.\r\n\r\nThis setting removes Control Panel from:\r\nThe Start screen\r\nFile Explorer\r\n\r\nThis setting removes PC settings from:\r\nThe Start screen\r\nSettings charm\r\nAccount picture\r\nSearch results\r\n\r\nIf users try to select a Control Panel item from the Properties item on a context menu, a message appears explaining that a setting prevents the action.\n ",
    "helpText": "",
    "name": "NoControlPanel",
    "displayName": "Prohibit access to Control Panel and PC settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_controlpanel_nocontrolpanel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_controlpanel_nocontrolpanel_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_controlpanel_nocontrolpanel_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}