{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoServices",
        "Go directly to Components Wizard",
        "\\Control Panel\\Add or Remove Programs",
        "Administrative Templates\\Control Panel\\Add or Remove Programs",
        "Add or Remove Programs"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-addremoveprograms#admx-addremoveprograms-noservices"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AddRemovePrograms/NoServices",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_addremoveprograms_noservices",
    "categoryId": "a809df26-b5db-4af9-b247-a539ada4e869",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_addremoveprograms_noservices",
    "description": "Prevents users from using Add or Remove Programs to configure installed services.\r\n\r\nThis setting removes the \"Set up services\" section of the Add/Remove Windows Components page. The \"Set up services\" section lists system services that have not been configured and offers users easy access to the configuration tools.\r\n\r\nIf you disable this setting or do not configure it, \"Set up services\" appears only when there are unconfigured system services. If you enable this setting, \"Set up services\" never appears.\r\n\r\nThis setting does not prevent users from using other methods to configure services.\r\n\r\nNote: When \"Set up services\" does not appear, clicking the Add/Remove Windows Components button starts the Windows Component Wizard immediately. Because the only remaining option on the Add/Remove Windows Components page starts the wizard, that option is selected automatically, and the page is bypassed.\r\n\r\nTo remove \"Set up services\" and prevent the Windows Component Wizard from starting, enable the \"Hide Add/Remove Windows Components page\" setting. If the \"Hide Add/Remove Windows Components page\" setting is enabled, this setting is ignored.\r\n ",
    "helpText": "",
    "name": "NoServices",
    "displayName": "Go directly to Components Wizard (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_addremoveprograms_noservices_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_noservices_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_noservices_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}