{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TrustedCatalog06",
        "Trusted Catalog Location #6",
        "\\Microsoft Office 2016\\Security Settings\\Trust Center\\Trusted Catalogs",
        "Microsoft Office 2016\\Security Settings\\Trust Center\\Trusted Catalogs",
        "Trusted Catalogs"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_SecuritySettings~L_trustcenter241~L_TrustedCatalogs/L_TrustedCatalog06",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_trustedcatalog06",
    "categoryId": "24f6d328-64e7-4490-be38-452ac3b61f6f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_trustedcatalog06",
    "description": "This policy setting sets the URL location of a Trusted SharePoint Catalog or Shared Folder Catalog. All web add-ins at this location are trusted so that users can work with these add-ins in their documents. However, the user cannot insert these add-ins into an Office document.\r\n\r\nIf you enable this policy setting and set the URL, users can work with web add-ins from the SharePoint Catalog or Shared Folder Catalog at that URL.\r\n\r\nIf you disable this policy setting, users will not be able to work with any web add-ins on Internet zone catalogs, and they will be prompted before they start web add-ins from any other catalogs.\r\n\r\nIf you do not configure this policy setting or any others in the Trusted Catalogs folder, users can set their own Trusted Sharepoint Catalog and Shared Folder Catalog locations.",
    "helpText": "",
    "name": "L_TrustedCatalog06",
    "displayName": "Trusted Catalog Location #6 (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_trustedcatalog06_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_trustedcatalog06_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_trustedcatalog06_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_trustedcatalog06_l_url",
                    "required": true
                }
            ]
        }
    ]
}