{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Promotingerrorsaswarnings",
        "Promote Level 2 errors as errors, not warnings",
        "\\Microsoft Outlook 2016\\Security\\Cryptography\\Signature Status dialog box",
        "Microsoft Outlook 2016\\Security\\Cryptography\\Signature Status dialog box",
        "Signature Status dialog box"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_Security~L_Cryptography~L_SignatureStatusDialog/L_Promotingerrorsaswarnings",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_promotingerrorsaswarnings",
    "categoryId": "ae89907b-f0c0-4e8f-ab59-dc5514e0a2ff",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_promotingerrorsaswarnings",
    "description": "This policy setting allows you to treat Level 2 errors as warnings instead of errors.  Level 2 errors occur when the message signature appears to be valid, but there are other issues with the signature. \r\n\r\nIf you enable this policy setting, Level 2 errors will be treated as warnings.\r\n\r\nIf you disable or do not configure this policy setting, Level 2 errors will be treated as errors\r\n\r\nWhen you specify a value for PromoteErrorsAsWarnings, note that potential Level 2 error conditions include the following:\r\n\r\n- Unknown Signature Algorithm\r\n- No Signing Certification Found\r\n- Bad Attribute Sets\r\n- No Issuer Certificate found\r\n- No CRL Found\r\n- Out-of-date CRL\r\n- Root Trust Problem\r\n- Out-of-date CTL",
    "helpText": "",
    "name": "L_Promotingerrorsaswarnings",
    "displayName": "Promote Level 2 errors as errors, not warnings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_promotingerrorsaswarnings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_promotingerrorsaswarnings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_promotingerrorsaswarnings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}