{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_RasConnect",
        "Prohibit connecting and disconnecting a remote access connection",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-networkconnections#admx-networkconnections-nc-rasconnect"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_RasConnect",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasconnect",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasconnect",
    "description": "Determines whether users can connect and disconnect remote access connections.\r\n\r\nIf you enable this setting (and enable the \"Enable Network Connections settings for Administrators\" setting), double-clicking the icon has no effect, and the Connect and Disconnect menu items are disabled for all users (including administrators).\r\n\r\nImportant: If the \"Enable Network Connections settings for Administrators\" is disabled or not configured, this setting will not apply to administrators on post-Windows 2000 computers.\r\n\r\nIf you disable this setting or do not configure it, the Connect and Disconnect options for remote access connections are available to all users. Users can connect or disconnect a remote access connection by double-clicking the icon representing the connection, by right-clicking it, or by using the File menu.\r\n ",
    "helpText": "",
    "name": "NC_RasConnect",
    "displayName": "Prohibit connecting and disconnecting a remote access connection (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasconnect_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasconnect_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasconnect_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}