{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WPDDevices_DenyWrite_Access_1",
        "WPD Devices: Deny write access",
        "\\System\\Removable Storage Access",
        "Administrative Templates\\System\\Removable Storage Access",
        "Removable Storage Access"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-removablestorage#admx-removablestorage-wpddevices-denywrite-access-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemovableStorage/WPDDevices_DenyWrite_Access_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_1",
    "categoryId": "180b2a03-16d4-43cd-ba84-9b4546753ef4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_1",
    "description": "This policy setting denies write access to removable disks, which may include media players, cellular phones, auxiliary displays, and CE devices.\r\n\r\nIf you enable this policy setting, write access is denied to this removable storage class.\r\n\r\nIf you disable or do not configure this policy setting, write access is allowed to this removable storage class.\r\n ",
    "helpText": "",
    "name": "WPDDevices_DenyWrite_Access_1",
    "displayName": "WPD Devices: Deny write access (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_wpddevices_denywrite_access_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}