{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TryHarderPinnedOpenSearch",
        "Pin Internet search sites to the \"Search again\" links and the Start menu",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsexplorer#admx-windowsexplorer-tryharderpinnedopensearch"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/TryHarderPinnedOpenSearch",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch",
    "description": "This policy setting allows you to add Internet or intranet sites to the \"Search again\" links located at the bottom of search results in File Explorer and the Start menu links. The \"Search again\" links at the bottom of the Search Results view allow the user to reconduct a search but in a different location.  The Internet search site will be searched with the text in the search box.  To add an Internet search site, specify the URL of the search site in OpenSearch format with {searchTerms} for the query string (for example, http://www.example.com/results.aspx?q={searchTerms}).\r\n\r\nYou can add up to five additional links to the \"Search again\" links at the bottom of results returned in File Explorer after a search is executed.  These links will be shared between Internet search sites and Search Connectors/Libraries.  Search Connector/Library links take precedence over Internet search links.\r\n\r\nThe first several links will also be pinned to the Start menu.  A total of four links can be pinned on the Start menu.  The \"See more results\" link will be pinned first by default, unless it is disabled via Group Policy.  The \"Search the Internet\" link is pinned second, if it is pinned via Group Policy (though this link is disabled by default).  If a custom Internet search link is pinned using the \"Custom Internet search provider\" Group Policy, this link will be pinned third on the Start menu.  The remaining link(s) will be shared between pinned Internet/intranet links and pinned Search Connectors/Libraries.  Search Connector/Library links take precedence over Internet/intranet search links.\r\n\r\nIf you enable this policy setting, the specified Internet sites will appear in the \"Search again\" links and the Start menu links.\r\n\r\nIf you disable or do not configure this policy setting, no custom Internet search sites will be added to the \"Search again\" links or the Start menu links.\r\n ",
    "helpText": "",
    "name": "TryHarderPinnedOpenSearch",
    "displayName": "Pin Internet search sites to the \"Search again\" links and the Start menu (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearch0",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearchlabel0",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearch1",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearchlabel1",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearch2",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearchlabel2",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearch3",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearchlabel3",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearch4",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedopensearch_opensearchlabel4",
                    "required": true
                }
            ]
        }
    ]
}