{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableTargetedMessaging",
        "Hide dynamic lifecycle messages",
        "\\Microsoft Office 2016\\Tools | Options | General | Web Options...",
        "Microsoft Office 2016\\Tools | Options | General | Web Options...",
        "Tools | Options | General | Web Options..."
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ToolsOptionsGeneralWebOptions/L_DisableTargetedMessaging",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions_l_disabletargetedmessaging",
    "categoryId": "2d5a483f-b408-426d-9234-2883eae20afb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions_l_disabletargetedmessaging",
    "description": "This policy setting controls whether dynamic lifecycle messages are displayed in Office applications.\r\n\r\nA dynamic lifecycle message appears as a notification in an Office application. This message is similar to a default lifecycle message, but provides additional information. For example, a message that reminds users to renew their subscription that also includes information to help them renew. Office periodically connects to the Internet and contacts Microsoft to determine if there are any relevant messages to display.\r\n\r\nIf you enable this policy setting, Office won’t check for these types of messages, but, default lifecycle messages still display in Office applications.\r\n\r\nIf you disable or don’t configure this policy setting, Office checks for these types of messages and displays them.",
    "helpText": "",
    "name": "L_DisableTargetedMessaging",
    "displayName": "Hide dynamic lifecycle messages (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions_l_disabletargetedmessaging_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions_l_disabletargetedmessaging_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions_l_disabletargetedmessaging_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}