{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_UserEnableWorkFolders",
        "Specify Work Folders settings",
        "\\Windows Components\\Work Folders",
        "Administrative Templates\\Windows Components\\Work Folders",
        "Work Folders"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WorkFoldersClient/Pol_UserEnableWorkFolders",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders",
    "categoryId": "a53581a1-e9d7-4ba4-9dea-cea90d40cca1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_ghostingpreference_enum",
    "description": null,
    "helpText": "",
    "name": "Lbl_GhostingPreference_Enum",
    "displayName": "On-demand file access preference: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_ghostingpreference_enum_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_ghostingpreference_enum_1",
            "description": null,
            "helpText": null,
            "name": "Enable (recommended)",
            "displayName": "Enable (recommended)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_ghostingpreference_enum_2",
            "description": null,
            "helpText": null,
            "name": "Disable",
            "displayName": "Disable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_ghostingpreference_enum_3",
            "description": null,
            "helpText": null,
            "name": "User choice",
            "displayName": "User choice",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders"
                }
            ],
            "dependedOnBy": []
        }
    ]
}