{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "HidePrivacyTab",
        "Hide Privacy Tab",
        "\\Windows Components\\Windows Media Player\\User Interface",
        "Administrative Templates\\Windows Components\\Windows Media Player\\User Interface",
        "User Interface"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsmediaplayer#admx-windowsmediaplayer-hideprivacytab"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/HidePrivacyTab",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_hideprivacytab",
    "categoryId": "200c575d-37d9-405b-aa92-c7a3da6f9358",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsmediaplayer_hideprivacytab",
    "description": "This policy setting allows you to hide the Privacy tab in Windows Media Player.\r\n\r\nIf you enable this policy setting, the \"Update my music files (WMA and MP3 files) by retrieving missing media information from the Internet\" check box on the Media Library tab is available, even though the Privacy tab is hidden, unless the \"Prevent music file media information retrieval\" policy setting is enabled.\r\n\r\nThe default privacy settings are used for the options on the Privacy tab unless the user changed the settings previously.\r\n\r\nIf you disable or do not configure this policy setting, the Privacy tab is not hidden, and users can configure any privacy settings not configured by other polices.\r\n ",
    "helpText": "",
    "name": "HidePrivacyTab",
    "displayName": "Hide Privacy Tab (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_hideprivacytab_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_hideprivacytab_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_hideprivacytab_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}