{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultSearchProviderContextMenuAccessAllowed_recommended",
        "Allow default search provider context menu search access",
        "\\Google\\Google Chrome - Default Settings (users can override)",
        "Administrative Templates\\Google\\Google Chrome - Default Settings (users can override)",
        "Google Chrome - Default Settings (users can override)",
        "Google Chrome - Default Settings users can override"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome_recommended/DefaultSearchProviderContextMenuAccessAllowed_recommended",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_recommended_defaultsearchprovidercontextmenuaccessallowed_recommended",
    "categoryId": "c3857f91-3df8-472f-9b5a-b10778c715c0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_recommended_defaultsearchprovidercontextmenuaccessallowed_recommended",
    "description": "Enables the use of a default search provider on the context menu.\r\n\r\nIf you set this policy to disabled the search context menu item that relies on your default search provider will not be available.\r\n\r\nIf this policy is set to enabled or not set, the context menu item for your default search provider will be available.\r\n\r\nThe policy value is only appled when the DefaultSearchProviderEnabled policy is enabled, and is not applicable otherwise.",
    "helpText": "",
    "name": "DefaultSearchProviderContextMenuAccessAllowed_recommended",
    "displayName": "Allow default search provider context menu search access (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_recommended_defaultsearchprovidercontextmenuaccessallowed_recommended_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_recommended_defaultsearchprovidercontextmenuaccessallowed_recommended_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_recommended_defaultsearchprovidercontextmenuaccessallowed_recommended_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}