{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_AlertIfNotDefault",
        "Prompt the user if Word is not the default application for its file extensions",
        "\\Microsoft Word 2016\\Word Options\\General",
        "Microsoft Word 2016\\Word Options\\General",
        "General"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_OptionsGeneral/L_AlertIfNotDefault",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_alertifnotdefault",
    "categoryId": "bd69fa31-677f-4d3d-bd4c-91ab1cd0dcb4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_alertifnotdefault",
    "description": "\r\n        This policy setting specifies whether to prompt users to change their file extensions association if any of the file type extensions that were associated with Word, are no longer associated with Word.\r\n\r\n        If you enable this policy setting, users will never be prompted on program start whenever any of these file types are associated with other applications. If the policy is Enabled, the checkbox under “File->Options-> General -> Start up options-> Tell me …” is Disabled and Unchecked.\r\n\r\n        If you disable or do not configure this policy setting users will be prompted on program start whenever any of these file types are associated with other applications. Users can change the behavior of the feature either by checking the checkbox presented in the prompt or by checking the checkbox under “File->Options-> General -> Start up options-> Tell me …”\r\n        If the policy is Not Configured or disabled the checkbox is Enabled and Checked by default.",
    "helpText": "",
    "name": "L_AlertIfNotDefault",
    "displayName": "Prompt the user if Word is not the default application for its file extensions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_alertifnotdefault_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_alertifnotdefault_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_alertifnotdefault_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}