{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_SESSIONS_Idle_Limit_1",
        "Set time limit for active but idle Remote Desktop Services sessions",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Session Time Limits",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Session Time Limits",
        "Session Time Limits"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_SESSIONS_Idle_Limit_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1",
    "categoryId": "2cc013ad-e5a3-42d9-b2b6-2a872a4c086d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext",
    "description": null,
    "helpText": "",
    "name": "TS_SESSIONS_IdleLimitText",
    "displayName": "Idle session limit: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_0",
            "description": null,
            "helpText": null,
            "name": "Never",
            "displayName": "Never",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_60000",
            "description": null,
            "helpText": null,
            "name": "1 minute",
            "displayName": "1 minute",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "60000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_300000",
            "description": null,
            "helpText": null,
            "name": "5 minutes",
            "displayName": "5 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "300000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_600000",
            "description": null,
            "helpText": null,
            "name": "10 minutes",
            "displayName": "10 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "600000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_900000",
            "description": null,
            "helpText": null,
            "name": "15 minutes",
            "displayName": "15 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "900000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_1800000",
            "description": null,
            "helpText": null,
            "name": "30 minutes",
            "displayName": "30 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1800000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_3600000",
            "description": null,
            "helpText": null,
            "name": "1 hour",
            "displayName": "1 hour",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3600000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_7200000",
            "description": null,
            "helpText": null,
            "name": "2 hours",
            "displayName": "2 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7200000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_10800000",
            "description": null,
            "helpText": null,
            "name": "3 hours",
            "displayName": "3 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10800000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_21600000",
            "description": null,
            "helpText": null,
            "name": "6 hours",
            "displayName": "6 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "21600000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_28800000",
            "description": null,
            "helpText": null,
            "name": "8 hours",
            "displayName": "8 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "28800000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_43200000",
            "description": null,
            "helpText": null,
            "name": "12 hours",
            "displayName": "12 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "43200000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_57600000",
            "description": null,
            "helpText": null,
            "name": "16 hours",
            "displayName": "16 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "57600000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_64800000",
            "description": null,
            "helpText": null,
            "name": "18 hours",
            "displayName": "18 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "64800000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_86400000",
            "description": null,
            "helpText": null,
            "name": "1 day",
            "displayName": "1 day",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "86400000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_172800000",
            "description": null,
            "helpText": null,
            "name": "2 days",
            "displayName": "2 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "172800000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_259200000",
            "description": null,
            "helpText": null,
            "name": "3 days",
            "displayName": "3 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "259200000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_345600000",
            "description": null,
            "helpText": null,
            "name": "4 days",
            "displayName": "4 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "345600000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_ts_sessions_idlelimittext_432000000",
            "description": null,
            "helpText": null,
            "name": "5 days",
            "displayName": "5 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "432000000"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_sessions_idle_limit_1"
                }
            ],
            "dependedOnBy": []
        }
    ]
}