{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ProxySettings",
        "Proxy settings",
        "\\Microsoft Edge\\Proxy server",
        "Microsoft Edge\\Proxy server",
        "Proxy server"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~Proxy/ProxySettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~proxy_proxysettings",
    "categoryId": "fe845e81-5993-4a65-b22a-decfc5928c65",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~proxy_proxysettings",
    "description": "Configures the proxy settings for Microsoft Edge.\r\n\r\nIf you enable this policy, Microsoft Edge ignores all proxy-related options specified from the command line.\r\n\r\nIf you don't configure this policy, users can choose their own proxy settings.\r\n\r\nThis policy overrides the following individual policies:\r\n\r\n'ProxyMode' (Configure proxy server settings)\r\n'ProxyPacUrl' (Set the proxy .pac file URL)\r\n'ProxyServer' (Configure address or URL of proxy server)\r\n'ProxyBypassList' (Configure proxy bypass rules)\r\n\r\nThe ProxyMode field lets you specify the proxy server used by Microsoft Edge and prevents users from changing proxy settings.\r\n\r\nThe ProxyPacUrl field is a URL to a proxy .pac file.\r\n\r\nThe ProxyServer field is a URL for the proxy server.\r\n\r\nThe ProxyBypassList field is a list of proxy hosts that Microsoft Edge bypasses.\r\n\r\nIf you choose the 'direct' value as 'ProxyMode', a proxy is never used and all other fields are ignored.\r\n\r\nIf you choose the 'system' value as 'ProxyMode', the systems's proxy is used and all other fields are ignored.\r\n\r\nIf you choose the 'auto_detect' value as 'ProxyMode', all other fields are ignored.\r\n\r\nIf you choose the 'fixed_server' value as 'ProxyMode', the 'ProxyServer' and 'ProxyBypassList' fields are used.\r\n\r\nIf you choose the 'pac_script' value as 'ProxyMode', the 'ProxyPacUrl' and 'ProxyBypassList' fields are used.\r\n\r\nExample value:\r\n\r\n{\r\n  \"ProxyMode\": \"direct\", \r\n  \"ProxyPacUrl\": \"https://internal.site/example.pac\", \r\n  \"ProxyServer\": \"123.123.123.123:8080\", \r\n  \"ProxyBypassList\": \"https://www.example1.com,https://www.example2.com,https://internalsite/\"\r\n}",
    "helpText": "",
    "name": "ProxySettings",
    "displayName": "Proxy settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~proxy_proxysettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~proxy_proxysettings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~proxy_proxysettings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~proxy_proxysettings_proxysettings",
                    "required": true
                }
            ]
        }
    ]
}