{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShellRemovePublishToWeb_1",
        "Turn off the \"Publish to Web\" task for files and folders",
        "\\System\\Internet Communication Management\\Internet Communication settings",
        "Administrative Templates\\System\\Internet Communication Management\\Internet Communication settings",
        "Internet Communication settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-icm#admx-icm-shellremovepublishtoweb-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ICM/ShellRemovePublishToWeb_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_icm_shellremovepublishtoweb_1",
    "categoryId": "72dfdba4-e7bb-4f09-862c-e003ea763452",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_icm_shellremovepublishtoweb_1",
    "description": "This policy setting specifies whether the tasks \"Publish this file to the Web,\" \"Publish this folder to the Web,\" and \"Publish the selected items to the Web\" are available from File and Folder Tasks in Windows folders.\r\n\r\nThe Web Publishing Wizard is used to download a list of providers and allow users to publish content to the web.\r\n\r\nIf you enable this policy setting, these tasks are removed from the File and Folder tasks in Windows folders.\r\n\r\nIf you disable or do not configure this policy setting, the tasks are shown.\r\n ",
    "helpText": "",
    "name": "ShellRemovePublishToWeb_1",
    "displayName": "Turn off the \"Publish to Web\" task for files and folders (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_icm_shellremovepublishtoweb_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_icm_shellremovepublishtoweb_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_icm_shellremovepublishtoweb_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}