{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DefaultRecurrenceDuration",
        "Specify total number of days in a recurring meeting or appointment",
        "\\Microsoft Outlook 2016\\Outlook Options\\Preferences\\Calendar Options\\Recurring item configuration",
        "Microsoft Outlook 2016\\Outlook Options\\Preferences\\Calendar Options\\Recurring item configuration",
        "Recurring item configuration"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Preferences~L_Calendaroptions~L_RecurrenceOptions/L_DefaultRecurrenceDuration",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions~l_recurrenceoptions_l_defaultrecurrenceduration",
    "categoryId": "826db7fb-889b-4a99-80a6-38347ba37f21",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions~l_recurrenceoptions_l_defaultrecurrenceduration_l_defaultrecurrencedurationspinid",
    "description": "",
    "helpText": "",
    "name": "L_DefaultRecurrenceDurationSpinID",
    "displayName": "End recurrence after x days (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 720,
        "minimumValue": 2
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 180
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions~l_recurrenceoptions_l_defaultrecurrenceduration_1",
            "parentSettingId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions~l_recurrenceoptions_l_defaultrecurrenceduration"
        }
    ],
    "dependedOnBy": []
}