{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Taskbar Calendar",
        "Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Settings#configuretaskbarcalendar"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Settings/ConfigureTaskbarCalendar",
    "rootDefinitionId": "user_vendor_msft_policy_config_settings_configuretaskbarcalendar",
    "categoryId": "eec07ad3-24ef-4502-8125-9fc988650a7c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_settings_configuretaskbarcalendar",
    "description": "Allows IT Admins to configure the default setting for showing additional calendars (besides the default calendar for the locale) in the taskbar clock and calendar flyout. In this version of Windows 10, supported additional calendars are: Simplified or Traditional Chinese lunar calendar. Turning on one of these calendars will display Chinese lunar dates below the default calendar for the locale. Select Don't show additional calendars to prevent showing other calendars besides the default calendar for the locale.",
    "helpText": "",
    "name": "ConfigureTaskbarCalendar",
    "displayName": "Configure Taskbar Calendar (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_settings_configuretaskbarcalendar_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_settings_configuretaskbarcalendar_0",
            "description": "User will be allowed to configure the setting.",
            "helpText": null,
            "name": "User will be allowed to configure the setting.",
            "displayName": "User will be allowed to configure the setting.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_settings_configuretaskbarcalendar_1",
            "description": "Don't show additional calendars.",
            "helpText": null,
            "name": "Don't show additional calendars.",
            "displayName": "Don't show additional calendars.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_settings_configuretaskbarcalendar_2",
            "description": "Simplified Chinese (Lunar).",
            "helpText": null,
            "name": "Simplified Chinese (Lunar).",
            "displayName": "Simplified Chinese (Lunar).",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_settings_configuretaskbarcalendar_3",
            "description": "Traditional Chinese (Lunar).",
            "helpText": null,
            "name": "Traditional Chinese (Lunar).",
            "displayName": "Traditional Chinese (Lunar).",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}