{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RestrictUILangSelect",
        "Restrict selection of Windows menus and dialogs language",
        "\\Control Panel\\Regional and Language Options",
        "Administrative Templates\\Control Panel\\Regional and Language Options",
        "Regional and Language Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/RestrictUILangSelect",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect",
    "categoryId": "18db3d59-661b-47ec-900a-bf75495ca598",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect",
    "description": null,
    "helpText": "",
    "name": "UILangSelect",
    "displayName": "Restrict users to the following language: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000409",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000409",
            "description": null,
            "helpText": null,
            "name": "English",
            "displayName": "English",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000409"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000411",
            "description": null,
            "helpText": null,
            "name": "Japanese",
            "displayName": "Japanese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000411"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000412",
            "description": null,
            "helpText": null,
            "name": "Korean",
            "displayName": "Korean",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000412"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000407",
            "description": null,
            "helpText": null,
            "name": "German",
            "displayName": "German",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000407"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000804",
            "description": null,
            "helpText": null,
            "name": "Simplified Chinese",
            "displayName": "Simplified Chinese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000804"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000404",
            "description": null,
            "helpText": null,
            "name": "Traditional Chinese",
            "displayName": "Traditional Chinese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000404"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000040c",
            "description": null,
            "helpText": null,
            "name": "French",
            "displayName": "French",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000040c"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000c0a",
            "description": null,
            "helpText": null,
            "name": "Spanish",
            "displayName": "Spanish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000c0a"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000410",
            "description": null,
            "helpText": null,
            "name": "Italian",
            "displayName": "Italian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000410"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000041d",
            "description": null,
            "helpText": null,
            "name": "Swedish",
            "displayName": "Swedish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000041d"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000413",
            "description": null,
            "helpText": null,
            "name": "Dutch",
            "displayName": "Dutch",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000413"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000416",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Brazil)",
            "displayName": "Portuguese (Brazil)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000416"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000040b",
            "description": null,
            "helpText": null,
            "name": "Finnish",
            "displayName": "Finnish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000040b"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000414",
            "description": null,
            "helpText": null,
            "name": "Norwegian",
            "displayName": "Norwegian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000414"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000406",
            "description": null,
            "helpText": null,
            "name": "Danish",
            "displayName": "Danish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000406"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000040e",
            "description": null,
            "helpText": null,
            "name": "Hungarian",
            "displayName": "Hungarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000040e"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000415",
            "description": null,
            "helpText": null,
            "name": "Polish",
            "displayName": "Polish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000415"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000419",
            "description": null,
            "helpText": null,
            "name": "Russian",
            "displayName": "Russian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000419"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000405",
            "description": null,
            "helpText": null,
            "name": "Czech",
            "displayName": "Czech",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000405"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000408",
            "description": null,
            "helpText": null,
            "name": "Greek",
            "displayName": "Greek",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000408"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000816",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Portugal)",
            "displayName": "Portuguese (Portugal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000816"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000041f",
            "description": null,
            "helpText": null,
            "name": "Turkish",
            "displayName": "Turkish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000041f"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000401",
            "description": null,
            "helpText": null,
            "name": "Arabic",
            "displayName": "Arabic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000401"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000040d",
            "description": null,
            "helpText": null,
            "name": "Hebrew",
            "displayName": "Hebrew",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000040d"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000041b",
            "description": null,
            "helpText": null,
            "name": "Slovak",
            "displayName": "Slovak",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000041b"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000424",
            "description": null,
            "helpText": null,
            "name": "Slovenian",
            "displayName": "Slovenian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000424"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000418",
            "description": null,
            "helpText": null,
            "name": "Romanian",
            "displayName": "Romanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000418"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000041a",
            "description": null,
            "helpText": null,
            "name": "Croatian",
            "displayName": "Croatian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000041a"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000402",
            "description": null,
            "helpText": null,
            "name": "Bulgarian",
            "displayName": "Bulgarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000402"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000425",
            "description": null,
            "helpText": null,
            "name": "Estonian",
            "displayName": "Estonian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000425"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000427",
            "description": null,
            "helpText": null,
            "name": "Lithuanian",
            "displayName": "Lithuanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000427"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_00000426",
            "description": null,
            "helpText": null,
            "name": "Latvian",
            "displayName": "Latvian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "00000426"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_uilangselect_0000041e",
            "description": null,
            "helpText": null,
            "name": "Thai",
            "displayName": "Thai",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0000041e"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_restrictuilangselect"
                }
            ],
            "dependedOnBy": []
        }
    ]
}