{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SupressOfficesigningProviders",
        "Suppress Office Signing Providers",
        "\\Microsoft Office 2016\\Signing",
        "Microsoft Office 2016\\Signing",
        "Signing"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_Signing/L_SupressOfficesigningProviders",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_signing_l_supressofficesigningproviders",
    "categoryId": "23c09e06-5bee-4b20-a391-36549bf0f620",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_signing_l_supressofficesigningproviders",
    "description": "This policy setting controls whether users can apply a default Microsoft Office signature line to Word documents and Excel workbooks. Digital signatures provide assurances of authenticity, integrity, and non-repudiation to electronic documents. In Excel and Word, users can add visible representations of their signatures to a document at the same time that they add digital signatures. The ability to capture digital signatures by using signature lines in Office 2016 documents makes it possible for organizations to use paperless signing processes for documents such as contracts or other agreements. \r\n\r\nIf you enable this policy setting, you can choose from four options for enabling the default Microsoft Office 2016 signature lines: \r\n\r\n- Enable Western and East Asian - Both Microsoft Office Signature Line and Stamp Signature Line are available from the Signature Line drop-down menu on the Insert tab of the Ribbon. \r\n\r\n- Suppress default Western -  Users cannot add the Microsoft Office Signature Line to documents. \r\n\r\n- Suppress default East Asian - Users cannot add the Stamp Signature Line to documents. \r\n\r\n- Suppress both Western and East Asian. Neither of the default signature lines is available. This only takes affect if there is at least one other valid third party signature provider installed. \r\n\r\nIf you disable or do not configure this policy setting, Excel and Word include support for two kinds of signature lines, called Microsoft Office Signature Line and Stamp Signature Lines. The choice(s) available to the user vary according to the editing language(s) that are configured for the application at installation. \r\n\r\n- Microsoft Office Signature Line displays the letter \"X\" followed by a horizontal line, a familiar convention for handwritten signature lines. \r\n\r\n- Stamp Signature Line is only available to users of the Simplified Chinese, Traditional Chinese, Japanese, or Korean language versions of Office 2016, or to users who have installed Office 2016 Multi-Language Pack for one of these languages. This signature line displays a square, a convention in countries where rubber identity stamps (called hanko in Japan and South Korea) are used to sign documents. \r\n\r\nBoth kinds of signature lines allow signers to specify their name, title, and e-mail address. If neither kind of signature line is appropriate, third-party signature products can be added to Office applications to serve different needs. \r\n\r\nIf the correct signature line is not available for users to choose, they might be prevented from digitally signing documents. \r\n\r\nNote -  This policy setting only applies to visible signature lines in Excel workbooks and Word documents. It does not affect the ability of users to add invisible digital signatures to Excel workbooks, PowerPoint presentations, and Word documents.",
    "helpText": "",
    "name": "L_SupressOfficesigningProviders",
    "displayName": "Suppress Office Signing Providers (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_signing_l_supressofficesigningproviders_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_signing_l_supressofficesigningproviders_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_signing_l_supressofficesigningproviders_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_signing_l_supressofficesigningproviders_l_empty413",
                    "required": true
                }
            ]
        }
    ]
}