{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RetrievingCRLsCertificateRevocationLists",
        "Retrieving CRLs (Certificate Revocation Lists)",
        "\\Microsoft Outlook 2016\\Security\\Cryptography\\Signature Status dialog box",
        "Microsoft Outlook 2016\\Security\\Cryptography\\Signature Status dialog box",
        "Security Form Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_Security~L_Cryptography~L_SignatureStatusDialog/L_RetrievingCRLsCertificateRevocationLists",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_securityformsettings_l_outlooksecuritymode",
    "categoryId": "d4e5541e-ab77-4e6c-8046-1fb80ee705ad",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_l_empty31",
    "description": "",
    "helpText": "",
    "name": "L_empty31",
    "displayName": "",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_l_empty31_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_l_empty31_0",
            "description": null,
            "helpText": null,
            "name": "Use system Default",
            "displayName": "Use system Default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_1",
                    "parentSettingId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_l_empty31_1",
            "description": null,
            "helpText": null,
            "name": "When online always retreive the CRL",
            "displayName": "When online always retreive the CRL",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_1",
                    "parentSettingId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_l_empty31_2",
            "description": null,
            "helpText": null,
            "name": "Never retreive the CRL",
            "displayName": "Never retreive the CRL",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2_1",
                    "parentSettingId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography~l_signaturestatusdialog_l_retrievingcrlscertificaterevocationlists_v2"
                }
            ],
            "dependedOnBy": []
        }
    ]
}