{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RestrictCharacterCodeRangeOfConversion",
        "Restrict character code range of conversion",
        "\\Windows Components\\IME",
        "Administrative Templates\\Windows Components\\IME",
        "IME"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EAIME/L_RestrictCharacterCodeRangeOfConversion",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion",
    "categoryId": "ba1d333c-e19b-4470-bbab-d040a633c3a3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion_l_restrictcharactercoderangeofconversionid",
    "description": null,
    "helpText": "",
    "name": "L_RestrictCharacterCodeRangeOfConversionID",
    "displayName": "Character code range: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion"
        }
    ],
    "dependedOnBy": []
}