{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_EnforcePDFcompliancewithISO190051PDFA",
        "Enforce PDF compliance with ISO 19005-1 (PDF/A)",
        "\\Microsoft Office 2016\\Microsoft Save As PDF and XPS add-ins",
        "Microsoft Office 2016\\Microsoft Save As PDF and XPS add-ins",
        "Microsoft Save As PDF and XPS add-ins"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_PDFandXPS/L_EnforcePDFcompliancewithISO190051PDFA",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_enforcepdfcompliancewithiso190051pdfa",
    "categoryId": "5b1be2c5-9939-4b2e-b29b-b22069455c90",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_enforcepdfcompliancewithiso190051pdfa",
    "description": "Allows enforcement of ISO 19005-1 compliance in PDF output. The values for his setting are as follows:\r\n      \r\nDefault: Options UI defaults to not ISO compliant. User may override.\r\n\r\nEncourage: Options UI defaults to ISO compliance. User may override.\r\n\r\nPrevent: Not ISO compliant. No user override.\r\n\r\nEnforce: ISO compliant. No user override.\r\n\r\nSee Office Help for more details on the tradeoffs of choosing ISO 19005 compliance.",
    "helpText": "",
    "name": "L_EnforcePDFcompliancewithISO190051PDFA",
    "displayName": "Enforce PDF compliance with ISO 19005-1 (PDF/A) (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_enforcepdfcompliancewithiso190051pdfa_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_enforcepdfcompliancewithiso190051pdfa_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_enforcepdfcompliancewithiso190051pdfa_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_enforcepdfcompliancewithiso190051pdfa_l_empty417",
                    "required": true
                }
            ]
        }
    ]
}