{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_StopReadAloudEyesOffExperience",
        "Stop Read Aloud when app goes in background",
        "\\Microsoft Word 2016",
        "Microsoft Word 2016"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v12~Policy~L_MicrosoftOfficeWord/L_StopReadAloudEyesOffExperience",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v12~policy~l_microsoftofficeword_l_stopreadaloudeyesoffexperience",
    "categoryId": "fab15a0f-3aff-44b3-b1f3-6788bd60070f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v12~policy~l_microsoftofficeword_l_stopreadaloudeyesoffexperience",
    "description": "This policy prevents Read Aloud from reading text when app goes in background.\r\n\r\nIf you enable this policy setting, Read Aloud will be disabled and will stop reading the text when app is sent to background.\r\n\r\nIf you disable or do not configure this policy setting, Read Aloud will continue reading the text when app moves to background and user will be able to control Read Aloud via notification.",
    "helpText": "",
    "name": "L_StopReadAloudEyesOffExperience",
    "displayName": "Stop Read Aloud when app goes in background (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v12~policy~l_microsoftofficeword_l_stopreadaloudeyesoffexperience_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v12~policy~l_microsoftofficeword_l_stopreadaloudeyesoffexperience_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v12~policy~l_microsoftofficeword_l_stopreadaloudeyesoffexperience_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}