{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableinclusionofdocumentpropertiesinPDFandXPSoutput",
        "Disable inclusion of document properties in PDF and XPS output",
        "\\Microsoft Office 2016\\Microsoft Save As PDF and XPS add-ins",
        "Microsoft Office 2016\\Microsoft Save As PDF and XPS add-ins",
        "Microsoft Save As PDF and XPS add-ins"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_PDFandXPS/L_DisableinclusionofdocumentpropertiesinPDFandXPSoutput",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_disableinclusionofdocumentpropertiesinpdfandxpsoutput",
    "categoryId": "5b1be2c5-9939-4b2e-b29b-b22069455c90",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_disableinclusionofdocumentpropertiesinpdfandxpsoutput",
    "description": "This policy setting controls whether document metadata can be saved in PDF and XPS documents. \r\n\r\nIf you enable this policy setting, document properties metadata is not exported to PDF and XPS files. \r\n\r\nIf you disable this policy setting, document properties metadata will always be saved with PDF and XPS files, and users will not be able to override this configuration. \r\n\r\nIf you do not configure this policy setting, if the Microsoft Save as PDF or XPS Add-in for Microsoft Office Programs add-in is installed, document properties are saved as metadata when users save files using the PDF or XPS or Publish as PDF or XPS commands in Access, Excel, InfoPath, PowerPoint, and Word, unless the \"Document properties\" option is unchecked in the Options dialog.",
    "helpText": "",
    "name": "L_DisableinclusionofdocumentpropertiesinPDFandXPSoutput",
    "displayName": "Disable inclusion of document properties in PDF and XPS output (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_disableinclusionofdocumentpropertiesinpdfandxpsoutput_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_disableinclusionofdocumentpropertiesinpdfandxpsoutput_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_disableinclusionofdocumentpropertiesinpdfandxpsoutput_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}