{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Physical Device Access On Error Screens",
        "Cloud Desktop"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/CloudDesktop-csp/"
    ],
    "baseUri": "./User/Vendor/MSFT/CloudDesktop",
    "offsetUri": "/EnablePhysicalDeviceAccessOnErrorScreens",
    "rootDefinitionId": "user_vendor_msft_clouddesktop_enablephysicaldeviceaccessonerrorscreens",
    "categoryId": "39e4c352-be9c-4e75-8111-8236279c7f1e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_clouddesktop_enablephysicaldeviceaccessonerrorscreens",
    "description": "Configuring this node gives access to the physical devices used to boot to Cloud PCs from the error screens for specified users. This node supports these options: 0. Not enabled 1. Enabled.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "EnablePhysicalDeviceAccessOnErrorScreens",
    "displayName": "Enable Physical Device Access On Error Screens (User) (Windows Insiders only)",
    "defaultOptionId": "user_vendor_msft_clouddesktop_enablephysicaldeviceaccessonerrorscreens_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "2.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22635.4076",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "holographicForBusiness",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_clouddesktop_enablephysicaldeviceaccessonerrorscreens_false",
            "description": "Access to physical device on error screens disabled",
            "helpText": null,
            "name": "Access to physical device on error screens disabled",
            "displayName": "Access to physical device on error screens disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_clouddesktop_enablephysicaldeviceaccessonerrorscreens_true",
            "description": "Access to physical device on error screens enabled",
            "helpText": null,
            "name": "Access to physical device on error screens enabled",
            "displayName": "Access to physical device on error screens enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}