{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PreventPressAndHold_1",
        "Prevent press and hold",
        "\\Windows Components\\Tablet PC\\Hardware Buttons",
        "Administrative Templates\\Windows Components\\Tablet PC\\Hardware Buttons",
        "Hardware Buttons"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-tabletshell#admx-tabletshell-preventpressandhold-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TabletShell/PreventPressAndHold_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_tabletshell_preventpressandhold_1",
    "categoryId": "aa67f0c0-4eb0-492f-a528-decd3e256a22",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_tabletshell_preventpressandhold_1",
    "description": "Prevents press and hold actions on hardware buttons, so that only one action is available per button.\r\n\r\nIf you enable this policy, press and hold actions are unavailable, and the button configuration dialog will display the following text:  \"Some settings are controlled by Group Policy. If a setting is unavailable, contact your system administrator.\"\r\n\r\nIf you disable this policy, press and hold actions for buttons will be available.\r\n\r\nIf you do not configure this policy, press and hold actions will be available.\r\n ",
    "helpText": "",
    "name": "PreventPressAndHold_1",
    "displayName": "Prevent press and hold (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_tabletshell_preventpressandhold_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletshell_preventpressandhold_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletshell_preventpressandhold_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}