{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AccessRights_RebootTime_1",
        "Set time (in seconds) to force reboot",
        "\\System\\Removable Storage Access",
        "Administrative Templates\\System\\Removable Storage Access",
        "Removable Storage Access"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-removablestorage#admx-removablestorage-accessrights-reboottime-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemovableStorage/AccessRights_RebootTime_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_removablestorage_accessrights_reboottime_1",
    "categoryId": "180b2a03-16d4-43cd-ba84-9b4546753ef4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_removablestorage_accessrights_reboottime_1",
    "description": "This policy setting configures the amount of time (in seconds) that the operating system waits to reboot in order to enforce a change in access rights to removable storage devices.\r\n\r\nIf you enable this policy setting, you can set the number of seconds you want the system to wait until a reboot.\r\n\r\nIf you disable or do not configure this setting, the operating system does not force a reboot.\r\n\r\nNote: If no reboot is forced, the access right does not take effect until the operating system is restarted.\r\n ",
    "helpText": "",
    "name": "AccessRights_RebootTime_1",
    "displayName": "Set time (in seconds) to force reboot (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_removablestorage_accessrights_reboottime_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_accessrights_reboottime_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_accessrights_reboottime_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_removablestorage_accessrights_reboottime_1_accessrights_reboottime_seconds",
                    "required": true
                }
            ]
        }
    ]
}