{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebContentFilteringBlockedCategories",
        "Configure Web Content Filtering",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev135~Policy~microsoft_edge/WebContentFilteringBlockedCategories",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge_webcontentfilteringblockedcategories",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge_webcontentfilteringblockedcategories",
    "description": "You can configure this policy to block certain categories of URLs. Blocking a category prevents users in specified device groups from accessing URLs associated with the category.\r\n\r\nThe list of possible categories, their Category String, and their description are detailed at https://go.microsoft.com/fwlink/?linkid=2249965\r\n\r\nTo block a category, add the Category String of the category to the following List of blocked categories If you leave this policy unset or disable the policy, no URLs will be blocked.\r\n\r\nIf you want to block a specific URL without blocking an entire category, add the URL to the list of blocked URLs using the 'URLBlocklist' (Block access to a list of URLs) policy.\r\n\r\nIf you want a specific URL in a blocked category to be accessible, add the URL to the list of allowed URLs using the 'URLAllowlist' (Define a list of allowed URLs) policy.\r\n\r\nThis Web Content Filtering policy only works on Microsoft Edge on Windows 10 devices or above.\r\n\r\nPolicy options mapping:\r\n\r\n* chat (chat) = Chat\r\n\r\n* child_abuse_images (child_abuse_images) = Child Abuse Images\r\n\r\n* criminal_activity (criminal_activity) = Criminal Activity\r\n\r\n* download_sites (download_sites) = Download Sites\r\n\r\n* gambling (gambling) = Gambling\r\n\r\n* games (games) = Games\r\n\r\n* hacking (hacking) = Hacking\r\n\r\n* hate_and_intolerance (hate_and_intolerance) = Hate and Intolerance\r\n\r\n* illegal_drug (illegal_drug) = Illegal Drug\r\n\r\n* illegal_software (illegal_software) = Illegal Software\r\n\r\n* image_sharing (image_sharing) = Image Sharing\r\n\r\n* instant_messaging (instant_messaging) = Instant Messaging\r\n\r\n* nudity (nudity) = Nudity\r\n\r\n* peer_to_peer (peer_to_peer) = Peer to Peer\r\n\r\n* pornography_or_sexually_explicit (pornography_or_sexually_explicit) = Pornography or Sexually Explicit\r\n\r\n* professional_networking (professional_networking) = Professional Networking\r\n\r\n* self_harm (self_harm) = Self Harm\r\n\r\n* sex_education (sex_education) = Sex Education\r\n\r\n* social_networking (social_networking) = Social Networking\r\n\r\n* streaming_and_downloads (streaming_and_downloads) = Streaming Media and Downloads\r\n\r\n* tasteless (tasteless) = Tasteless\r\n\r\n* violence (violence) = Violence\r\n\r\n* weapons (weapons) = Weapons\r\n\r\n* web_based_email (web_based_email) = Web Based Email\r\n\r\n* none (none) = None\r\n\r\nUse the preceding information when configuring this policy.\r\n\r\nExample value:\r\n\r\ngambling\r\nstreaming_and_downloads\r\ngames",
    "helpText": "",
    "name": "WebContentFilteringBlockedCategories",
    "displayName": "Configure Web Content Filtering (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge_webcontentfilteringblockedcategories_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge_webcontentfilteringblockedcategories_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge_webcontentfilteringblockedcategories_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge_webcontentfilteringblockedcategories_webcontentfilteringblockedcategoriesdesc",
                    "required": true
                }
            ]
        }
    ]
}