{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoMyDocumentsIcon",
        "Remove My Documents icon on the desktop",
        "\\Desktop",
        "Administrative Templates\\Desktop",
        "Desktop"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-desktop#admx-desktop-nomydocumentsicon"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/NoMyDocumentsIcon",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_nomydocumentsicon",
    "categoryId": "6b8ac32e-6bda-4eb4-b9e3-3d39ad8ce623",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_desktop_nomydocumentsicon",
    "description": "Removes most occurrences of the My Documents icon.\r\n\r\nThis setting removes the My Documents icon from the desktop, from File Explorer, from programs that use the File Explorer windows, and from the standard Open dialog box.\r\n\r\nThis setting does not prevent the user from using other methods to gain access to the contents of the My Documents folder.\r\n\r\nThis setting does not remove the My Documents icon from the Start menu. To do so, use the \"Remove My Documents icon from Start Menu\" setting.\r\n\r\nNote: To make changes to this setting effective, you must log off from and log back on to Windows 2000 Professional.\n ",
    "helpText": "",
    "name": "NoMyDocumentsIcon",
    "displayName": "Remove My Documents icon on the desktop (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_desktop_nomydocumentsicon_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_nomydocumentsicon_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_nomydocumentsicon_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}