{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoPreviewPane",
        "Turn on or off details pane",
        "\\Windows Components\\File Explorer\\Explorer Frame Pane",
        "Administrative Templates\\Windows Components\\File Explorer\\Explorer Frame Pane",
        "Explorer Frame Pane"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FramePanes/NoPreviewPane",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane",
    "categoryId": "e21bab5b-308d-4dcd-b6bb-a019e7347373",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane_previewpane_dropdownlist_box",
    "description": null,
    "helpText": "",
    "name": "PreviewPane_Dropdownlist_Box",
    "displayName": "Configure details pane (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane_previewpane_dropdownlist_box_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane_previewpane_dropdownlist_box_1",
            "description": null,
            "helpText": null,
            "name": "Always hide",
            "displayName": "Always hide",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane_previewpane_dropdownlist_box_2",
            "description": null,
            "helpText": null,
            "name": "Always show",
            "displayName": "Always show",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_framepanes_nopreviewpane"
                }
            ],
            "dependedOnBy": []
        }
    ]
}