{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableIndexedLibraryExperience",
        "Turn off Windows Libraries features that rely on indexed file data",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsexplorer#admx-windowsexplorer-disableindexedlibraryexperience"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/DisableIndexedLibraryExperience",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsexplorer_disableindexedlibraryexperience",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsexplorer_disableindexedlibraryexperience",
    "description": "This policy setting allows you to turn off Windows Libraries features that need indexed file metadata to function properly.  If you enable this policy, some Windows Libraries features will be turned off to better handle included folders that have been redirected to non-indexed network locations.\r\nSetting this policy will:\r\n    * Disable all Arrangement views except for \"By Folder\"\r\n    * Disable all Search filter suggestions other than \"Date Modified\" and \"Size\"\r\n    * Disable view of file content snippets in Content mode when search results are returned\r\n    * Disable ability to stack in the Context menu and Column headers\r\n    * Exclude Libraries from the scope of Start search\r\nThis policy will not enable users to add unsupported locations to Libraries.\r\n\r\nIf you enable this policy, Windows Libraries features that rely on indexed file data will be disabled.\r\nIf you disable or do not configure this policy, all default Windows Libraries features will be enabled. \r\n ",
    "helpText": "",
    "name": "DisableIndexedLibraryExperience",
    "displayName": "Turn off Windows Libraries features that rely on indexed file data (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsexplorer_disableindexedlibraryexperience_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_disableindexedlibraryexperience_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_disableindexedlibraryexperience_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}