{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffCameraAndMicrophoneInApplicationGuard",
        "Turn off camera and microphone access for Office apps using Application Guard.",
        "\\Microsoft Office 2016\\Security Settings\\Trust Center\\Application Guard",
        "Microsoft Office 2016\\Security Settings\\Trust Center\\Application Guard",
        "Application Guard"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v7~Policy~L_MicrosoftOfficeSystem~L_SecuritySettings~L_trustcenter241~L_ApplicationGuard/L_TurnOffCameraAndMicrophoneInApplicationGuard",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffcameraandmicrophoneinapplicationguard",
    "categoryId": "517e55f5-729f-4b4d-9555-33baa95a0e5a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffcameraandmicrophoneinapplicationguard",
    "description": "The policy allows you to control whether Office apps using Application Guard can access the user's camera and microphone if they're enabled on the user's device.\r\n\r\nImportant: A compromised Application Guard container could bypass camera and microphone permissions and access the camera and microphone without the user’s knowledge. To prevent unauthorized access, we recommend that the camera and microphone be turned off on the user’s device when they aren’t needed.\r\n\r\nIf you enable this policy setting, Office apps using Application Guard won't be able to access the camera and microphone on the user’s device. \r\n\r\nIf you disable or don't configure this policy setting, Office apps using Application Guard will be able to access the camera and microphone on the user’s device.\r\n\r\nNote: This policy setting only applies to Microsoft 365 Apps for enterprise.",
    "helpText": "",
    "name": "L_TurnOffCameraAndMicrophoneInApplicationGuard",
    "displayName": "Turn off camera and microphone access for Office apps using Application Guard. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffcameraandmicrophoneinapplicationguard_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffcameraandmicrophoneinapplicationguard_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffcameraandmicrophoneinapplicationguard_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}