{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Always Enable Books Library",
        "Browser"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Browser#browser-alwaysenablebookslibrary"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Browser/AlwaysEnableBooksLibrary",
    "rootDefinitionId": "user_vendor_msft_policy_config_browser_alwaysenablebookslibrary",
    "categoryId": "5d835ac8-2e5e-4887-8e4d-0c3846d0ad9f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_browser_alwaysenablebookslibrary",
    "description": "Specifies whether the Books Library in Microsoft Edge will always be visible regardless of the country or region setting for the device.",
    "helpText": "",
    "name": "AlwaysEnableBooksLibrary",
    "displayName": "Always Enable Books Library (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_browser_alwaysenablebookslibrary_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_browser_alwaysenablebookslibrary_0",
            "description": "Show the Books Library only in countries or regions where supported.",
            "helpText": null,
            "name": "Show the Books Library only in countries or regions where supported.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_browser_alwaysenablebookslibrary_1",
            "description": "Show the Books Library, regardless of the device's country or region.",
            "helpText": null,
            "name": "Show the Books Library, regardless of the device's country or region.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}