{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PasswordSecurity_1",
        "Turn off password security in Input Panel",
        "\\Windows Components\\Tablet PC\\Input Panel",
        "Administrative Templates\\Windows Components\\Tablet PC\\Input Panel",
        "Input Panel"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TabletPCInputPanel/PasswordSecurity_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1",
    "categoryId": "575369a6-17a2-435e-81d4-71772e7d55b5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_passwordsecurity",
    "description": null,
    "helpText": "",
    "name": "PasswordSecurity",
    "displayName": "Turn off password security in Input Panel (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_passwordsecurity_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_passwordsecurity_1",
            "description": null,
            "helpText": null,
            "name": "Low",
            "displayName": "Low",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_passwordsecurity_2",
            "description": null,
            "helpText": null,
            "name": "Medium Low",
            "displayName": "Medium Low",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_passwordsecurity_3",
            "description": null,
            "helpText": null,
            "name": "Medium",
            "displayName": "Medium",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_passwordsecurity_4",
            "description": null,
            "helpText": null,
            "name": "Medium High",
            "displayName": "Medium High",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_passwordsecurity_5",
            "description": null,
            "helpText": null,
            "name": "High",
            "displayName": "High",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_tabletpcinputpanel_passwordsecurity_1"
                }
            ],
            "dependedOnBy": []
        }
    ]
}