{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AllowSaveTargetAsInIEMode",
        "Allow \"Save Target As\" in Internet Explorer mode",
        "\\Windows Components\\Internet Explorer",
        "Administrative Templates\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-allowsavetargetasiniemode"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/AllowSaveTargetAsInIEMode",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_allowsavetargetasiniemode",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_internetexplorer_allowsavetargetasiniemode",
    "description": "This policy setting allows admins to enable \"Save Target As\" context menu in Internet Explorer mode.\r\n\r\nIf you enable this policy, \"Save Target As\" will show up in the Internet Explorer mode context menu and work the same as Internet Explorer.\r\n\r\nIf you disable or do not configure this policy setting, \"Save Target As\" will not show up in the Internet Explorer mode context menu.\r\n\r\nFor more information, see https://go.microsoft.com/fwlink/?linkid=2102115",
    "helpText": "",
    "name": "AllowSaveTargetAsInIEMode",
    "displayName": "Allow \"Save Target As\" in Internet Explorer mode (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_allowsavetargetasiniemode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362.1350",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_allowsavetargetasiniemode_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_allowsavetargetasiniemode_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}