{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoAddPage",
        "Hide Add New Programs page",
        "\\Control Panel\\Add or Remove Programs",
        "Administrative Templates\\Control Panel\\Add or Remove Programs",
        "Add or Remove Programs"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-addremoveprograms#admx-addremoveprograms-noaddpage"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AddRemovePrograms/NoAddPage",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddpage",
    "categoryId": "a809df26-b5db-4af9-b247-a539ada4e869",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddpage",
    "description": "Removes the Add New Programs button from the Add or Remove Programs bar. As a result, users cannot view or change the attached page.\r\n\r\nThe Add New Programs button lets users install programs published or assigned by a system administrator.\r\n\r\nIf you disable this setting or do not configure it, the Add New Programs button is available to all users.\r\n\r\nThis setting does not prevent users from using other tools and methods to install programs.\r\n ",
    "helpText": "",
    "name": "NoAddPage",
    "displayName": "Hide Add New Programs page (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddpage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddpage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddpage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}