{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Hyperlinkcolor",
        "Hyperlink color",
        "\\Microsoft Access 2016\\Application Settings\\Web Options...\\General",
        "Microsoft Access 2016\\Application Settings\\Web Options...\\General",
        "General",
        "Web Options - General"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_ApplicationSettings~L_WebOptions~L_General/L_Hyperlinkcolor",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor",
    "categoryId": "cbb98485-6a36-47b8-b450-7821e08507ac",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3",
    "description": "",
    "helpText": "",
    "name": "L_hyperlinkcolor3",
    "displayName": "Hyperlink color (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_12",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_0",
            "description": null,
            "helpText": null,
            "name": "Black",
            "displayName": "Black",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_1",
            "description": null,
            "helpText": null,
            "name": "Maroon",
            "displayName": "Maroon",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_2",
            "description": null,
            "helpText": null,
            "name": "Green",
            "displayName": "Green",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_3",
            "description": null,
            "helpText": null,
            "name": "Olive",
            "displayName": "Olive",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_4",
            "description": null,
            "helpText": null,
            "name": "Dark Blue",
            "displayName": "Dark Blue",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_5",
            "description": null,
            "helpText": null,
            "name": "Violet",
            "displayName": "Violet",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_6",
            "description": null,
            "helpText": null,
            "name": "Teal",
            "displayName": "Teal",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_7",
            "description": null,
            "helpText": null,
            "name": "Gray",
            "displayName": "Gray",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_8",
            "description": null,
            "helpText": null,
            "name": "Silver",
            "displayName": "Silver",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_9",
            "description": null,
            "helpText": null,
            "name": "Red",
            "displayName": "Red",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "9"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_10",
            "description": null,
            "helpText": null,
            "name": "Bright Green",
            "displayName": "Bright Green",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_11",
            "description": null,
            "helpText": null,
            "name": "Yellow",
            "displayName": "Yellow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "11"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_12",
            "description": null,
            "helpText": null,
            "name": "Blue",
            "displayName": "Blue",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "12"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_13",
            "description": null,
            "helpText": null,
            "name": "Fuchsia",
            "displayName": "Fuchsia",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "13"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_14",
            "description": null,
            "helpText": null,
            "name": "Aqua",
            "displayName": "Aqua",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "14"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_l_hyperlinkcolor3_15",
            "description": null,
            "helpText": null,
            "name": "White",
            "displayName": "White",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "15"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor_1",
                    "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_hyperlinkcolor"
                }
            ],
            "dependedOnBy": []
        }
    ]
}