{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MobilityCenterEnable_1",
        "Turn off Windows Mobility Center",
        "\\Windows Components\\Windows Mobility Center",
        "Administrative Templates\\Windows Components\\Windows Mobility Center",
        "Windows Mobility Center"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-mobilepcmobilitycenter#admx-mobilepcmobilitycenter-mobilitycenterenable-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MobilePCMobilityCenter/MobilityCenterEnable_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_mobilepcmobilitycenter_mobilitycenterenable_1",
    "categoryId": "a1d83497-da94-407f-bbc5-9f65ebc5f9fb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_mobilepcmobilitycenter_mobilitycenterenable_1",
    "description": "This policy setting turns off Windows Mobility Center.\r\n\r\nIf you enable this policy setting, the user is unable to invoke Windows Mobility Center. The Windows Mobility Center UI is removed from all shell entry points and the .exe file does not launch it.\r\n\r\nIf you disable this policy setting, the user is able to invoke Windows Mobility Center and the .exe file launches it.\r\n\r\nIf you do not configure this policy setting, Windows Mobility Center is on by default.\r\n ",
    "helpText": "",
    "name": "MobilityCenterEnable_1",
    "displayName": "Turn off Windows Mobility Center (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_mobilepcmobilitycenter_mobilitycenterenable_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_mobilepcmobilitycenter_mobilitycenterenable_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_mobilepcmobilitycenter_mobilitycenterenable_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}