{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AD_QueryLimit",
        "Maximum size of Active Directory searches",
        "\\Desktop\\Active Directory",
        "Administrative Templates\\Desktop\\Active Directory",
        "Active Directory"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/AD_QueryLimit",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_ad_querylimit",
    "categoryId": "f4f0dfd7-4638-4173-8b3b-0f08608bf330",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_desktop_ad_querylimit_ad_querylimit_box",
    "description": null,
    "helpText": "",
    "name": "AD_QueryLimit_Box",
    "displayName": "Number of objects returned: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4000000000,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 10000
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_desktop_ad_querylimit_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_ad_querylimit"
        }
    ],
    "dependedOnBy": []
}