{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ShowOutlookLoopComponentsForSupportedApps",
        "Show Outlook Loop components for supported apps.",
        "\\Microsoft Outlook 2016\\Security\\Trust Center",
        "Microsoft Outlook 2016\\Security\\Trust Center",
        "Trust Center"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v13~Policy~L_MicrosoftOfficeOutlook~L_Security~L_TrustCenter/L_ShowOutlookLoopComponentsForSupportedApps",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v13~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_showoutlookloopcomponentsforsupportedapps",
    "categoryId": "c3db5686-3bb2-437c-8906-60da1a1fa844",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v13~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_showoutlookloopcomponentsforsupportedapps",
    "description": "This policy controls whether Outlook displays Loop components that are supported by installed apps without requiring users to explicitly choose to load them.\r\n\r\nIf you enable this policy setting by selecting \"Always show automatically\" or \"Only show automatically within tenant,\" Outlook will automatically display Loop components in emails. This applies to all messages or specifically to messages that originate within the recipient's local tenant or organization. This might involve contacting servers used by the installed apps to retrieve Loop components.\r\n\r\nIf you do not set this policy setting, Outlook will default to the \"Only show automatically within tenant\" setting. This ensures Loop components are automatically displayed in emails originating from the recipient's local tenant or organization.\r\n\r\nNote: Loop components included in messages located in the Junk Mail folder will not load automatically, regardless of the policy setting specified. Loop components will only be shown for apps that are installed, ensuring security and a tailored experience in Outlook.",
    "helpText": "",
    "name": "L_ShowOutlookLoopComponentsForSupportedApps",
    "displayName": "Show Outlook Loop components for supported apps. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v13~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_showoutlookloopcomponentsforsupportedapps_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v13~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_showoutlookloopcomponentsforsupportedapps_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v13~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_showoutlookloopcomponentsforsupportedapps_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v13~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_showoutlookloopcomponentsforsupportedapps_l_showoutlookloopcomponentsid",
                    "required": true
                }
            ]
        }
    ]
}