{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_NewOutlookAutoMigrationRetryIntervals",
        "Number of days \"New Outlook auto migration\" should be paused after user untoggling back to Outlook Desktop",
        "\\Microsoft Outlook 2016\\Outlook Options\\Other",
        "Microsoft Outlook 2016\\Outlook Options\\Other",
        "Other"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v14~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Other/L_NewOutlookAutoMigrationRetryIntervals",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals",
    "categoryId": "5e3f61b6-52b7-4c74-a101-33c1cf34a749",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals",
    "description": "This policy setting controls the number of days \"New Outlook auto migration\" should be paused after user untoggling back to Outlook Desktop.\r\n\r\nIf you don't set this or set this to -1, Outlook Desktop will stop executing \"New Outlook auto migration\" after user untoggling back to Outlook Desktop.\r\n\r\nIf you set this to 0, Outlook Desktop will execute \"New Outlook auto migration\" in the next boot.\r\n\r\nIf you set this to N (non-zero positive) value, Outlook Desktop will pause for N days before executing \"New Outlook auto migration\" again after user untoggling back to Outlook Desktop\r\n\r\nNote: This policy only applies to subscription-based Microsoft 365 Apps.\r\n      ",
    "helpText": "",
    "name": "L_NewOutlookAutoMigrationRetryIntervals",
    "displayName": "Number of days \"New Outlook auto migration\" should be paused after user untoggling back to Outlook Desktop (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals_l_newoutlookautomigrationretryintervalsid",
                    "required": true
                }
            ]
        }
    ]
}