{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_UserEnableWorkFolders",
        "Specify Work Folders settings",
        "\\Windows Components\\Work Folders",
        "Administrative Templates\\Windows Components\\Work Folders",
        "Work Folders"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WorkFoldersClient/Pol_UserEnableWorkFolders",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders",
    "categoryId": "a53581a1-e9d7-4ba4-9dea-cea90d40cca1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_localfolderpath_edit",
    "description": null,
    "helpText": "",
    "name": "Lbl_LocalFolderPath_Edit",
    "displayName": "Work Folders Local Path: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders"
        }
    ],
    "dependedOnBy": []
}