{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SetNumberOfPlacesInTheRecentPlacesList",
        "Number of folders in the Recent Folders list",
        "\\Microsoft Access 2016\\Application Settings\\General",
        "Microsoft Access 2016\\Application Settings\\General",
        "General"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_ApplicationSettings~L_general5/L_SetNumberOfPlacesInTheRecentPlacesList",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_general5_l_setnumberofplacesintherecentplaceslist",
    "categoryId": "bd1dad69-5cbe-415e-8565-e87b15cd4431",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_general5_l_setnumberofplacesintherecentplaceslist_l_setnumberofplacesintherecentplaceslistspinid",
    "description": "",
    "helpText": "",
    "name": "L_SetNumberOfPlacesInTheRecentPlacesListSpinID",
    "displayName": "Number of folders: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 20,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 5
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_general5_l_setnumberofplacesintherecentplaceslist_1",
            "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_general5_l_setnumberofplacesintherecentplaceslist"
        }
    ],
    "dependedOnBy": []
}