{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WerDefaultConsent_1",
        "Configure Default consent",
        "\\Windows Components\\Windows Error Reporting\\Consent",
        "Administrative Templates\\Windows Components\\Windows Error Reporting\\Consent",
        "Consent"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ErrorReporting/WerDefaultConsent_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1",
    "categoryId": "e781bfae-233f-463f-a85b-7299ce5a87c5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_werconsent",
    "description": null,
    "helpText": "",
    "name": "WerConsent",
    "displayName": "Consent level (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_werconsent_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_werconsent_1",
            "description": null,
            "helpText": null,
            "name": "Always ask before sending data",
            "displayName": "Always ask before sending data",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_werconsent_2",
            "description": null,
            "helpText": null,
            "name": "Send parameters",
            "displayName": "Send parameters",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_werconsent_3",
            "description": null,
            "helpText": null,
            "name": "Send parameters and safe additional data",
            "displayName": "Send parameters and safe additional data",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_werconsent_4",
            "description": null,
            "helpText": null,
            "name": "Send all data",
            "displayName": "Send all data",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_errorreporting_werdefaultconsent_1"
                }
            ],
            "dependedOnBy": []
        }
    ]
}