{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoRecentDocsMenu",
        "Remove Recent Items menu from Start Menu",
        "\\Start Menu and Taskbar",
        "Administrative Templates\\Start Menu and Taskbar",
        "Start Menu and Taskbar"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-startmenu#admx-startmenu-norecentdocsmenu"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_StartMenu/NoRecentDocsMenu",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_startmenu_norecentdocsmenu",
    "categoryId": "5161db41-7947-49ea-b9b3-dd92539e6783",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_startmenu_norecentdocsmenu",
    "description": "Removes the Recent Items menu from the Start menu.  Removes the Documents menu from the classic Start menu.\r\n\r\nThe Recent Items menu contains links to the non-program files that users have most recently opened. It appears so that users can easily reopen their documents.\r\n\r\nIf you enable this setting, the system saves document shortcuts but does not display the Recent Items menu in the Start Menu, and users cannot turn the menu on.\r\n\r\nIf you later disable the setting, so that the Recent Items menu appears in the Start Menu, the document shortcuts saved before the setting was enabled and while it was in effect appear in the Recent Items menu.\r\n\r\nWhen the setting is disabled, the Recent Items menu appears in the Start Menu, and users cannot remove it.\r\n\r\nIf the setting is not configured, users can turn the Recent Items menu on and off.\r\n\r\nNote: This setting does not prevent Windows programs from displaying shortcuts to recently opened documents. See the \"Do not keep history of recently opened documents\" setting.\r\n\r\nThis setting also does not hide document shortcuts displayed in the Open dialog box. See the \"Hide the dropdown list of recent files\" setting.\r\n ",
    "helpText": "",
    "name": "NoRecentDocsMenu",
    "displayName": "Remove Recent Items menu from Start Menu (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_startmenu_norecentdocsmenu_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_norecentdocsmenu_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_norecentdocsmenu_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}