{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_EndEarlyLong",
        "Reduce the end time of long appointments and meetings by a specified number of minutes",
        "\\Microsoft Outlook 2016\\Outlook Options\\Preferences\\Calendar Options",
        "Microsoft Outlook 2016\\Outlook Options\\Preferences\\Calendar Options",
        "Calendar Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Preferences~L_Calendaroptions/L_EndEarlyLong",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions_l_endearlylong",
    "categoryId": "decab1d2-3474-4727-87c0-d0bc648f2458",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions_l_endearlylong",
    "description": "\r\n        This policy setting allows you to specify how many minutes to reduce the end time of a long appointment or meeting by when a user creates an appointment or meeting. A long appointment or meeting is one that lasts for one hour or longer.\r\n\r\n        If you enable this policy setting, you specify the number of minutes to reduce the end time of a long appointment or meeting by when a user creates an appointment or meeting. The user won’t be able to change this value by going to File > Options > Calendar.\r\n\r\n        Note: You should also enable the “End appointments and meetings early” policy setting\r\n\r\n        If you disable or don’t configure this policy setting, the default value of 10 minutes is used or whatever the user specifies by going to File > Options > Calendar.\r\n\r\n        Note: This policy setting only applies to subscription versions of Office, such as Office 365 ProPlus.\r\n      ",
    "helpText": "",
    "name": "L_EndEarlyLong",
    "displayName": "Reduce the end time of long appointments and meetings by a specified number of minutes (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions_l_endearlylong_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions_l_endearlylong_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions_l_endearlylong_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_calendaroptions_l_endearlylong_l_endearlylongspinid",
                    "required": true
                }
            ]
        }
    ]
}