{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_GATEWAY_POLICY_AUTH_METHOD",
        "Set RD Gateway authentication method",
        "\\Windows Components\\Remote Desktop Services\\RD Gateway",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\RD Gateway",
        "RD Gateway"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-terminalserver#admx-terminalserver-ts-gateway-policy-auth-method"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_GATEWAY_POLICY_AUTH_METHOD",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method",
    "categoryId": "85c586a6-6b68-48b2-8050-c4fb86aff486",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method",
    "description": "Specifies the authentication method that clients must use when attempting to connect to an RD Session Host server through an RD Gateway server. You can enforce this policy setting or you can allow users to overwrite this policy setting. By default, when you enable this policy setting, it is enforced. When this policy setting is enforced, users cannot override this setting, even if they select the \"Use these RD Gateway server settings\" option on the client.\r\n\r\nTo allow users to overwrite this policy setting, select the \"Allow users to change this setting\" check box. When you do this, users can specify an alternate authentication method by configuring settings on the client, using an RDP file, or using an HTML script. If users do not specify an alternate authentication method, the authentication method that you specify in this policy setting is used by default.\r\n\r\nIf you disable or do not configure this policy setting, the authentication method that is specified by the user is used, if one is specified. If an authentication method is not specified, the Negotiate protocol that is enabled on the client or a smart card can be used for authentication.\r\n ",
    "helpText": "",
    "name": "TS_GATEWAY_POLICY_AUTH_METHOD",
    "displayName": "Set RD Gateway authentication method (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_override",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode",
                    "required": true
                }
            ]
        }
    ]
}