{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoBalloonTip",
        "Remove Balloon Tips on Start Menu items",
        "\\Start Menu and Taskbar",
        "Administrative Templates\\Start Menu and Taskbar",
        "Start Menu and Taskbar"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-startmenu#admx-startmenu-noballoontip"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_StartMenu/NoBalloonTip",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_startmenu_noballoontip",
    "categoryId": "5161db41-7947-49ea-b9b3-dd92539e6783",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_startmenu_noballoontip",
    "description": "Hides pop-up text on the Start menu and in the notification area.\r\n\r\nWhen you hold the cursor over an item on the Start menu or in the notification area, the system displays pop-up text providing additional information about the object.\r\n\r\nIf you enable this setting, some of this pop-up text is not displayed. The pop-up text affected by this setting includes \"Click here to begin\" on the Start button, \"Where have all my programs gone\" on the Start menu, and \"Where have my icons gone\" in the notification area.\r\n\r\nIf you disable this setting or do not configure it, all pop-up text is displayed on the Start menu and in the notification area.\r\n ",
    "helpText": "",
    "name": "NoBalloonTip",
    "displayName": "Remove Balloon Tips on Start Menu items (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_startmenu_noballoontip_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_noballoontip_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_noballoontip_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}