{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeletingUndecryptablePasswordsEnabled",
        "Enable deleting undecryptable passwords",
        "\\Microsoft Edge\\Password manager and protection",
        "Microsoft Edge\\Password manager and protection",
        "Password manager and protection"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev132~Policy~microsoft_edge~PasswordManager/DeletingUndecryptablePasswordsEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~passwordmanager_deletingundecryptablepasswordsenabled",
    "categoryId": "3ba8106d-4b2f-4775-939d-1cc8703a41dc",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~passwordmanager_deletingundecryptablepasswordsenabled",
    "description": "This policy controls whether the built-in password manager can delete undecryptable passwords from its database. This is required to restore the full functionality of the built-in password manager, but it may include a permanent data loss. Undecryptable password values will not become decryptable on their own.\r\n\r\nIf fixing them is possible, it usually requires complex user actions.\r\n\r\nEnabling this policy or leaving it unset means that users with undecryptable passwords saved to the built-in password manager will lose them. Passwords that are still in a working state will remain untouched.\r\n\r\nDisabling this policy means users will have their password manager data untouched, but will experience a broken password manager functionality.\r\n\r\nIf the policy is set, users can't override it in Microsoft Edge.",
    "helpText": "",
    "name": "DeletingUndecryptablePasswordsEnabled",
    "displayName": "Enable deleting undecryptable passwords (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~passwordmanager_deletingundecryptablepasswordsenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~passwordmanager_deletingundecryptablepasswordsenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~passwordmanager_deletingundecryptablepasswordsenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}