{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SetDefaultCompatibilityModeOnFileCreation",
        "Set default compatibility mode on file creation",
        "\\Microsoft Word 2016\\Word Options\\Save",
        "Microsoft Word 2016\\Word Options\\Save",
        "Save"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_Save/L_SetDefaultCompatibilityModeOnFileCreation",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_setdefaultcompatibilitymodeonfilecreation",
    "categoryId": "89be4acb-fdf9-447b-ad16-9a5af1d68b8b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_setdefaultcompatibilitymodeonfilecreation",
    "description": "This policy setting allows you to specify the default compatibility mode when creating new files in Word. There are four modes:\r\n\r\n1. Word 2003: This mode disables features in Word that are not compatible with Word 2003.\r\n2. Word 2007: This mode disables features in Word that are not compatible with Word 2007.\r\n3. Word 2010: This mode disables features in Word that are not compatible with Word 2010.\r\n4. Full functionality mode: This mode ensures that all new features remain enabled. This is the default setting for Word. \r\n\r\nNote: Not all file formats support all four Compatibility Modes. Open XML file formats such as .docx and .dotx, support all four modes.",
    "helpText": "",
    "name": "L_SetDefaultCompatibilityModeOnFileCreation",
    "displayName": "Set default compatibility mode on file creation (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_setdefaultcompatibilitymodeonfilecreation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_setdefaultcompatibilitymodeonfilecreation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_setdefaultcompatibilitymodeonfilecreation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_setdefaultcompatibilitymodeonfilecreation_l_setdefaultcompatibilitymodeonfilecreationdropid",
                    "required": true
                }
            ]
        }
    ]
}