{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Run_Logon_Script_Visible",
        "Display instructions in logon scripts as they run",
        "\\System\\Scripts",
        "Administrative Templates\\System\\Scripts",
        "Scripts"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-scripts#admx-scripts-run-logon-script-visible"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Scripts/Run_Logon_Script_Visible",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_scripts_run_logon_script_visible",
    "categoryId": "9329c2bd-9e56-4394-9c89-5726e8b76f2f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_scripts_run_logon_script_visible",
    "description": "This policy setting displays the instructions in logon scripts as they run.\r\n\r\nLogon scripts are batch files of instructions that run when the user logs on. By default, the system does not display the instructions in logon scripts.\r\n\r\nIf you enable this policy setting, the system displays each instruction in the logon script as it runs. The instructions appear in a command window. This policy setting is designed for advanced users.\r\n\r\nIf you disable or do not configure this policy setting, the instructions are suppressed.\r\n ",
    "helpText": "",
    "name": "Run_Logon_Script_Visible",
    "displayName": "Display instructions in logon scripts as they run (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_scripts_run_logon_script_visible_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_scripts_run_logon_script_visible_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_scripts_run_logon_script_visible_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}