{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ServiceLevelOptions",
        "Service Level Options",
        "\\Microsoft Office 2016\\Tools | Options | General | Service Options...\\Online Content",
        "Microsoft Office 2016\\Tools | Options | General | Service Options...\\Online Content",
        "Online Content"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ToolsOptionsGeneralServiceOptions~L_OnlineContent/L_ServiceLevelOptions",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralserviceoptions~l_onlinecontent_l_serviceleveloptions",
    "categoryId": "91041ad3-e0a6-43fd-bc7b-ad4c7dda5765",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralserviceoptions~l_onlinecontent_l_serviceleveloptions",
    "description": "This policy setting controls the types of services that can be used by the online features of Office 2016.\r\n      \r\nIf you enable this policy setting, you can choose one of three options for gating access to online services based on the owner of the service:\r\n\r\n* Office services only - Office 2016 applications on the computer communicate only with Office-owned services.  All other Microsoft or third-party service integration in Office 2016 is disabled on the computer. This is the most restrictive option.\r\n\r\n* Microsoft services only - Office 2016 applications on the computer communicate only with Microsoft-owned services.  All third-party service integration in Office 2016 is disabled on the computer.\r\n\r\n* All services - All service integration in Office 2016 is enabled on the computer.  This is also the default configuration.\r\n\r\nIf you disable or do not configure this policy setting, Office 2016 client applications allow all service integrations. Individual users can manage the set of services they use through the new My Office place in Office Backstage view.",
    "helpText": "",
    "name": "L_ServiceLevelOptions",
    "displayName": "Service Level Options (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralserviceoptions~l_onlinecontent_l_serviceleveloptions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralserviceoptions~l_onlinecontent_l_serviceleveloptions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralserviceoptions~l_onlinecontent_l_serviceleveloptions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralserviceoptions~l_onlinecontent_l_serviceleveloptions_l_serviceleveloptionsdropid",
                    "required": true
                }
            ]
        }
    ]
}