{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_CLIENT_CLIPBOARDRESTRICTION_SC",
        "Restrict clipboard transfer from server to client",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Device and Resource Redirection",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Device and Resource Redirection",
        "Device and Resource Redirection"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteDesktopServices/LimitServerToClientClipboardRedirection",
    "rootDefinitionId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection",
    "categoryId": "fe52de11-190e-4429-96c1-106b22724456",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text",
    "description": "",
    "helpText": "",
    "name": "TS_SC_CLIPBOARD_RESTRICTION_Text",
    "displayName": "Restrict clipboard transfer from server to client: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.20348.2523",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text_0",
            "description": null,
            "helpText": null,
            "name": "Disable clipboard transfers from server to client",
            "displayName": "Disable clipboard transfers from server to client",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_1",
                    "parentSettingId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text_1",
            "description": null,
            "helpText": null,
            "name": "Allow plain text",
            "displayName": "Allow plain text",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_1",
                    "parentSettingId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text_2",
            "description": null,
            "helpText": null,
            "name": "Allow plain text and images",
            "displayName": "Allow plain text and images",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_1",
                    "parentSettingId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text_3",
            "description": null,
            "helpText": null,
            "name": "Allow plain text, images and Rich Text Format",
            "displayName": "Allow plain text, images and Rich Text Format",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_1",
                    "parentSettingId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text_4",
            "description": null,
            "helpText": null,
            "name": "Allow plain text, images, Rich Text Format and HTML",
            "displayName": "Allow plain text, images, Rich Text Format and HTML",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_1",
                    "parentSettingId": "user_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection"
                }
            ],
            "dependedOnBy": []
        }
    ]
}