{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "IESF_PolicyExplorerProcesses_12",
        "Internet Explorer Processes",
        "\\Windows Components\\Internet Explorer\\Security Features\\Restrict File Download",
        "Restrict File Download"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-restrictfiledownloadinternetexplorerprocesses"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/RestrictFileDownloadInternetExplorerProcesses",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_restrictfiledownloadinternetexplorerprocesses",
    "categoryId": "91ed1812-8841-4eb3-b24e-a5e1f4eaa6c8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_internetexplorer_restrictfiledownloadinternetexplorerprocesses",
    "description": "This policy setting enables blocking of file download prompts that are not user initiated.\r\n\r\nIf you enable this policy setting, file download prompts that are not user initiated will be blocked for Internet Explorer processes.\r\n\r\nIf you disable this policy setting, prompting will occur for file downloads that are not user initiated for Internet Explorer processes.\r\n\r\nIf you do not configure this policy setting, the user's preference determines whether to prompt for file downloads that are not user initiated for Internet Explorer processes.",
    "helpText": "",
    "name": "IESF_PolicyExplorerProcesses_12",
    "displayName": "Internet Explorer Processes (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_restrictfiledownloadinternetexplorerprocesses_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_restrictfiledownloadinternetexplorerprocesses_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_restrictfiledownloadinternetexplorerprocesses_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}