{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Translationdirection",
        "Translation direction",
        "\\Microsoft Word 2016\\Review Tab\\Chinese Conversion | Convert with Options",
        "Microsoft Word 2016\\Review Tab\\Chinese Conversion | Convert with Options",
        "Chinese Conversion | Convert with Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_ReviewTab~L_ReviewChineseTranslation/L_Translationdirection",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection",
    "categoryId": "7bee4dea-82a4-4a03-b903-654b374819b1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection_l_translationdirection96",
    "description": "",
    "helpText": "",
    "name": "L_translationdirection96",
    "displayName": "Translation direction (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection_l_translationdirection96_2052",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection_l_translationdirection96_2052",
            "description": null,
            "helpText": null,
            "name": "Traditional Chinese to Simplified Chinese",
            "displayName": "Traditional Chinese to Simplified Chinese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2052"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection_1",
                    "parentSettingId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection_l_translationdirection96_1028",
            "description": null,
            "helpText": null,
            "name": "Simplified Chinese to Traditional Chinese",
            "displayName": "Simplified Chinese to Traditional Chinese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1028"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection_1",
                    "parentSettingId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_translationdirection"
                }
            ],
            "dependedOnBy": []
        }
    ]
}