{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ConfigureHTTPProxySettings",
        "Configure HTTP Proxy",
        "\\Windows Components\\Windows Media Player\\Networking",
        "Administrative Templates\\Windows Components\\Windows Media Player\\Networking",
        "Networking"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsmediaplayer#admx-windowsmediaplayer-configurehttpproxysettings"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/ConfigureHTTPProxySettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings",
    "categoryId": "c7c32942-a139-4d7e-a19e-3495d5e372e7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings",
    "description": "This policy setting allows you to specify the HTTP proxy settings for Windows Media Player.\r\n\r\nIf you enable this policy setting, select one of the following proxy types:\r\n\r\n- Autodetect: the proxy settings are automatically detected.\r\n- Custom: unique proxy settings are used.\r\n- Use browser proxy settings: browser's proxy settings are used.\r\n\r\nIf the Custom proxy type is selected, the rest of the options on the Setting tab must be specified because no default settings are used for the proxy. The options are ignored if Autodetect or Browser is selected.\r\n\r\nThe Configure button on the Network tab in the Player is not available for the HTTP protocol and the proxy cannot be configured. If the \"Hide network tab\" policy setting is also enabled, the entire Network tab is hidden.\r\n\r\nThis policy is ignored if the \"Streaming media protocols\" policy setting is enabled and HTTP is not selected.\r\n\r\nIf you disable this policy setting, the HTTP proxy server cannot be used and the user cannot configure the HTTP proxy.\r\n\r\nIf you do not configure this policy setting, users can configure the HTTP proxy settings.\r\n      \r\n ",
    "helpText": "",
    "name": "ConfigureHTTPProxySettings",
    "displayName": "Configure HTTP Proxy (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_proxytype",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_proxyaddress",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_proxyport",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_bypassproxylocal",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configurehttpproxysettings_donotuseproxylocal",
                    "required": true
                }
            ]
        }
    ]
}