{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffSmartDeleteBehaviorOfConnectorsWhenDeletingShapes",
        "Turn off smart delete behavior of connectors when deleting shapes",
        "\\Microsoft Visio 2016\\Visio Options\\Advanced\\Editing Options",
        "Microsoft Visio 2016\\Visio Options\\Advanced\\Editing Options",
        "Editing Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/visio16v2~Policy~L_MicrosoftVisio~L_VisioOptions~L_Advanced~L_EditingOptions/L_TurnOffSmartDeleteBehaviorOfConnectorsWhenDeletingShapes",
    "rootDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_advanced~l_editingoptions_l_turnoffsmartdeletebehaviorofconnectorswhendeletingshapes",
    "categoryId": "bec8c55d-5aee-4d87-a17d-34d5b3b78f19",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_advanced~l_editingoptions_l_turnoffsmartdeletebehaviorofconnectorswhendeletingshapes",
    "description": "This policy setting turns off smart delete behavior of connectors when deleting shapes.\r\n\r\nIf you enable this policy setting, connectors are not deleted when shapes are deleted.\r\n\r\nIf you disable or do not configure this policy setting, connectors are deleted when shapes are deleted.",
    "helpText": "",
    "name": "L_TurnOffSmartDeleteBehaviorOfConnectorsWhenDeletingShapes",
    "displayName": "Turn off smart delete behavior of connectors when deleting shapes (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_advanced~l_editingoptions_l_turnoffsmartdeletebehaviorofconnectorswhendeletingshapes_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_advanced~l_editingoptions_l_turnoffsmartdeletebehaviorofconnectorswhendeletingshapes_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_advanced~l_editingoptions_l_turnoffsmartdeletebehaviorofconnectorswhendeletingshapes_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}