{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_RasAllUserProperties",
        "Ability to change properties of an all user remote access connection",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-networkconnections#admx-networkconnections-nc-rasalluserproperties"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_RasAllUserProperties",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasalluserproperties",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasalluserproperties",
    "description": "Determines whether a user can view and change the properties of remote access connections that are available to all users of the computer.\r\n\r\nTo create an all-user remote access connection, on the Connection Availability page in the New Connection Wizard, click the \"For all users\" option.\r\n\r\nThis setting determines whether the Properties menu item is enabled, and thus, whether the Remote Access Connection Properties dialog box is available to users.\r\n\r\nIf you enable this setting, a Properties menu item appears when any user right-clicks the icon for a remote access connection. Also, when any user selects the connection, Properties appears on the File menu.\r\n\r\nIf you disable this setting (and enable the \"Enable Network Connections settings for Administrators\" setting), the Properties menu items are disabled, and users (including administrators) cannot open the remote access connection properties dialog box.\r\n\r\nImportant: If the \"Enable Network Connections settings for Administrators\" is disabled or not configured, this setting will not apply to administrators on post-Windows 2000 computers.\r\n\r\nIf you do not configure this setting, only Administrators and Network Configuration Operators can change properties of all-user remote access connections.\r\n\r\nNote: This setting takes precedence over settings that manipulate the availability of features inside the Remote Access Connection Properties dialog box. If this setting is disabled, nothing within the properties dialog box for a remote access connection will be available to users.\r\n\r\nNote: This setting does not prevent users from using other programs, such as Internet Explorer, to bypass this setting.\r\n ",
    "helpText": "",
    "name": "NC_RasAllUserProperties",
    "displayName": "Ability to change properties of an all user remote access connection (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasalluserproperties_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasalluserproperties_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_rasalluserproperties_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}