{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IntensiveWakeUpThrottlingEnabled",
        "Control the IntensiveWakeUpThrottling feature.",
        "\\Google\\Google Chrome",
        "Administrative Templates\\Google\\Google Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome/IntensiveWakeUpThrottlingEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_intensivewakeupthrottlingenabled",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_intensivewakeupthrottlingenabled",
    "description": "When enabled the IntensiveWakeUpThrottling feature causes Javascript timers in background tabs to be aggressively throttled and coalesced, running no more than once per minute after a page has been backgrounded for 5 minutes or more.\r\n\r\nThis is a web standards compliant feature, but it may break functionality\r\non some websites by causing certain actions to be delayed by up to a\r\nminute. However, it results in significant CPU and battery savings when\r\nenabled. See https://bit.ly/30b1XR4 for more details.\r\n\r\nIf this policy is set to enabled then the feature will be force enabled, and\r\nusers will not be able to override this.\r\n\r\nIf this policy is set to disabled then the feature will be force disabled, and\r\nusers will not be able to override this.\r\n\r\nIf this policy is left unset then the feature will be controlled by its\r\nown internal logic, which can be manually configured by users.\r\n\r\nNote that the policy is applied per renderer process, with the most recent\r\nvalue of the policy setting in force when a renderer process starts. A full\r\nrestart is required to ensure that all loaded tabs receive a consistent\r\npolicy setting. It is harmless for processes to be running with different\r\nvalues of this policy.\r\n",
    "helpText": "",
    "name": "IntensiveWakeUpThrottlingEnabled",
    "displayName": "Control the IntensiveWakeUpThrottling feature. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_intensivewakeupthrottlingenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_intensivewakeupthrottlingenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_intensivewakeupthrottlingenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}