{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Specifytypesoffixedformatoptionsavailabletotheuser",
        "Disable Microsoft Save As PDF and XPS add-ins",
        "\\Microsoft Office 2016\\Microsoft Save As PDF and XPS add-ins",
        "Microsoft Office 2016\\Microsoft Save As PDF and XPS add-ins",
        "Microsoft Save As PDF and XPS add-ins"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_PDFandXPS/L_Specifytypesoffixedformatoptionsavailabletotheuser",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_specifytypesoffixedformatoptionsavailabletotheuser",
    "categoryId": "5b1be2c5-9939-4b2e-b29b-b22069455c90",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_specifytypesoffixedformatoptionsavailabletotheuser",
    "description": "Allows the user or administrator to specify which of the installed Microsoft PDF and XPS add-ins are available. \r\n\r\nWhen this setting is not configured, installed Microsoft PDF and XPS add-ins are visible to users. \r\n\r\nDefault: same as not configured. \r\n\r\nDisable XPS: Hides and disables the Microsoft Save As XPS add-in. \r\n\r\nDisable PDF: Hides and disables the Microsoft Save As PDF add-in. \r\n\r\nDisable XPS and PDF: Hides and disables both the Microsoft Save As PDF and Save As XPS add-ins.",
    "helpText": "",
    "name": "L_Specifytypesoffixedformatoptionsavailabletotheuser",
    "displayName": "Disable Microsoft Save As PDF and XPS add-ins (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_specifytypesoffixedformatoptionsavailabletotheuser_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_specifytypesoffixedformatoptionsavailabletotheuser_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_specifytypesoffixedformatoptionsavailabletotheuser_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_pdfandxps_l_specifytypesoffixedformatoptionsavailabletotheuser_l_empty418",
                    "required": true
                }
            ]
        }
    ]
}