{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DoNotAutomaticallyMergeServerAndLocalDocument",
        "Do not automatically merge server and local document",
        "\\Microsoft Word 2016\\Collaboration Settings\\Co-authoring",
        "Microsoft Word 2016\\Collaboration Settings\\Co-authoring",
        "Co-authoring"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_CollaborationSettings~L_Coauthoring/L_DoNotAutomaticallyMergeServerAndLocalDocument",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_collaborationsettings~l_coauthoring_l_donotautomaticallymergeserverandlocaldocument",
    "categoryId": "e522c142-5666-4090-a7f4-1da1487f5384",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_collaborationsettings~l_coauthoring_l_donotautomaticallymergeserverandlocaldocument",
    "description": "This policy setting determines if changes made to a server document should be automatically merged with the locally-cached copy of the document on the next save. This policy pertains to the co-authoring experience in Word.\r\n\r\nIf you enable this policy setting, then changes made to a server document will not be automatically merged with the locally-cached copy of the document on the next save. \r\n\r\nIf you disable or do not configure this policy setting, then changes made to a server document will be automatically merged with the locally-cached copy of the document on the next save.",
    "helpText": "",
    "name": "L_DoNotAutomaticallyMergeServerAndLocalDocument",
    "displayName": "Do not automatically merge server and local document (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_collaborationsettings~l_coauthoring_l_donotautomaticallymergeserverandlocaldocument_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_collaborationsettings~l_coauthoring_l_donotautomaticallymergeserverandlocaldocument_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_collaborationsettings~l_coauthoring_l_donotautomaticallymergeserverandlocaldocument_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}