{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Set Allowed Storage Locations",
        "File Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-FileExplorer#fileexplorer-setallowedstoragelocations"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FileExplorer/SetAllowedStorageLocations",
    "rootDefinitionId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations",
    "categoryId": "63b9904f-bbdf-4461-954a-c1d67fa8b357",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations",
    "description": "A value that can represent one or more storage locations in File Explorer. If not specified, the default is access to all storage locations.",
    "helpText": "",
    "name": "SetAllowedStorageLocations",
    "displayName": "Set Allowed Storage Locations (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_0",
            "description": "Access to all storage locations.",
            "helpText": null,
            "name": "Access to all storage locations.",
            "displayName": "Access to all storage locations.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_1",
            "description": "Removable Drives",
            "helpText": null,
            "name": "Removable Drives",
            "displayName": "Removable Drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_2",
            "description": "Sync roots",
            "helpText": null,
            "name": "Sync roots",
            "displayName": "Sync roots",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_3",
            "description": "Removable Drives, Sync roots",
            "helpText": null,
            "name": "Removable Drives, Sync roots",
            "displayName": "Removable Drives, Sync roots",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_4",
            "description": "Local Drives",
            "helpText": null,
            "name": "Local Drives",
            "displayName": "Local Drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_5",
            "description": "Removable Drives, Local Drives",
            "helpText": null,
            "name": "Removable Drives, Local Drives",
            "displayName": "Removable Drives, Local Drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_6",
            "description": "Sync Roots, Local Drives",
            "helpText": null,
            "name": "Sync Roots, Local Drives",
            "displayName": "Sync Roots, Local Drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 6
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedstoragelocations_7",
            "description": "Removable Drives, Sync Roots, Local Drives",
            "helpText": null,
            "name": "Removable Drives, Sync Roots, Local Drives",
            "displayName": "Removable Drives, Sync Roots, Local Drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 7
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}