{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TryHarderPinnedLibrary",
        "Pin Libraries or Search Connectors to the \"Search again\" links and the Start menu",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsexplorer#admx-windowsexplorer-tryharderpinnedlibrary"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/TryHarderPinnedLibrary",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary",
    "description": "This policy setting allows up to five Libraries or Search Connectors to be pinned to the \"Search again\" links and the Start menu links. The \"Search again\" links at the bottom of the Search Results view allow the user to reconduct a search but in a different location.  To add a Library or Search Connector link, specify the path of the .Library-ms or .searchConnector-ms file in the \"Location\" text box (for example, \"C:\\sampleLibrary.Library-ms\" for the Documents library, or \"C:\\sampleSearchConnector.searchConnector-ms\" for a Search Connector). The pinned link will only work if this path is valid and the location contains the specified .Library-ms or .searchConnector-ms file.\r\n\r\nYou can add up to five additional links to the \"Search again\" links at the bottom of results returned in File Explorer after a search is executed.  These links will be shared between Internet search sites and Search Connectors/Libraries.  Search Connector/Library links take precedence over Internet search links.\r\n\r\nThe first several links will also be pinned to the Start menu.  A total of four links can be included on the Start menu.  The \"See more results\" link will be pinned first by default, unless it is disabled via Group Policy.  The \"Search the Internet\" link is pinned second, if it is pinned via Group Policy (though this link is disabled by default).  If a custom Internet search link is pinned using the \"Custom Internet search provider\" Group Policy, this link will be pinned third on the Start menu.  The remaining link(s) will be shared between pinned Search Connectors/Libraries and pinned Internet/intranet search links.  Search Connector/Library links take precedence over Internet/intranet search links.\r\n\r\nIf you enable this policy setting, the specified Libraries or Search Connectors will appear in the \"Search again\" links and the Start menu links.\r\n\r\nIf you disable or do not configure this policy setting, no Libraries or Search Connectors will appear in the \"Search again\" links or the Start menu links.\r\n ",
    "helpText": "",
    "name": "TryHarderPinnedLibrary",
    "displayName": "Pin Libraries or Search Connectors to the \"Search again\" links and the Start menu (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_library0",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_library1",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_library2",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_library3",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsexplorer_tryharderpinnedlibrary_library4",
                    "required": true
                }
            ]
        }
    ]
}