{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "ProcessMitigationOptions",
        "Process Mitigation Options",
        "\\System\\Mitigation Options",
        "Administrative Templates\\System\\Mitigation Options",
        "Mitigation Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/ProcessMitigationOptions",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions",
    "categoryId": "80ed7629-87dd-4bb1-8ea0-555f20d3b156",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions_processmitigationoptionslist",
    "description": null,
    "helpText": "",
    "name": "ProcessMitigationOptionsList",
    "displayName": "Process Mitigation Options (User)",
    "childIds": [
        "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions_processmitigationoptionslist_key",
        "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions_processmitigationoptionslist_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions_processmitigationoptionslist_key",
            "required": true
        },
        {
            "dependedOnBy": "user_vendor_msft_policy_config_admx_grouppolicy_processmitigationoptions_processmitigationoptionslist_value",
            "required": true
        }
    ]
}