{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "WerConsentCustomize_1",
        "Customize consent settings",
        "\\Windows Components\\Windows Error Reporting\\Consent",
        "Administrative Templates\\Windows Components\\Windows Error Reporting\\Consent",
        "Consent"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ErrorReporting/WerConsentCustomize_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1",
    "categoryId": "e781bfae-233f-463f-a85b-7299ce5a87c5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1_werconsentcustomize",
    "description": null,
    "helpText": "",
    "name": "WerConsentCustomize",
    "displayName": "Customize consent settings (User)",
    "childIds": [
        "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1_werconsentcustomize_key",
        "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1_werconsentcustomize_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1_werconsentcustomize_key",
            "required": true
        },
        {
            "dependedOnBy": "user_vendor_msft_policy_config_admx_errorreporting_werconsentcustomize_1_werconsentcustomize_value",
            "required": true
        }
    ]
}