{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RemovableDisks_DenyRead_Access_1",
        "Removable Disks: Deny read access",
        "\\System\\Removable Storage Access",
        "Administrative Templates\\System\\Removable Storage Access",
        "Removable Storage Access"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-removablestorage#admx-removablestorage-removabledisks-denyread-access-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemovableStorage/RemovableDisks_DenyRead_Access_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_removablestorage_removabledisks_denyread_access_1",
    "categoryId": "180b2a03-16d4-43cd-ba84-9b4546753ef4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_removablestorage_removabledisks_denyread_access_1",
    "description": "This policy setting denies read access to removable disks.\r\n\r\nIf you enable this policy setting, read access is denied to this removable storage class.\r\n\r\nIf you disable or do not configure this policy setting, read access is allowed to this removable storage class.\r\n ",
    "helpText": "",
    "name": "RemovableDisks_DenyRead_Access_1",
    "displayName": "Removable Disks: Deny read access (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_removablestorage_removabledisks_denyread_access_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_removabledisks_denyread_access_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_removabledisks_denyread_access_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}