{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DownlevelBrowse",
        "Browse the network to find printers",
        "\\Control Panel\\Printers",
        "Administrative Templates\\Control Panel\\Printers",
        "Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-printing#admx-printing-downlevelbrowse"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing/DownlevelBrowse",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_printing_downlevelbrowse",
    "categoryId": "684799ba-398b-4728-aa21-40c8469cbe87",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_printing_downlevelbrowse",
    "description": "Allows users to use the Add Printer Wizard to search the network for shared printers.\r\n\r\nIf you enable this setting or do not configure it, when users choose to add a network printer by selecting the \"A network printer, or a printer attached to another computer\" radio button on Add Printer Wizard's page 2, and also check the \"Connect to this printer (or to browse for a printer, select this option and click Next)\" radio button on Add Printer Wizard's page 3, and do not specify a printer name in the adjacent \"Name\" edit box, then Add Printer Wizard displays the list of shared printers on the network and invites to choose a printer from the shown list.\r\n\r\nIf you disable this setting, the network printer browse page is removed from within the Add Printer Wizard, and users cannot search the network but must type a printer name.\r\n\r\nNote: This setting affects the Add Printer Wizard only. It does not prevent users from using other programs to search for shared printers or to connect to network printers.\r\n ",
    "helpText": "",
    "name": "DownlevelBrowse",
    "displayName": "Browse the network to find printers (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_printing_downlevelbrowse_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_printing_downlevelbrowse_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_printing_downlevelbrowse_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}