{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOnFileSynchronizationViaSOAPOverHTTP",
        "Turn on file synchronization via SOAP over HTTP",
        "\\Microsoft Office 2016\\Server Settings",
        "Microsoft Office 2016\\Server Settings",
        "Server Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ServerSettings/L_TurnOnFileSynchronizationViaSOAPOverHTTP",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_turnonfilesynchronizationviasoapoverhttp",
    "categoryId": "6aeb1df3-d796-4c5b-921d-9f3970a754cc",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_turnonfilesynchronizationviasoapoverhttp",
    "description": "This policy setting controls file synchronization via SOAP over HTTP.\r\n\r\nIf you enable or do not configure this policy setting, file synchronization via SOAP over HTTP is turned on.  Turning file synchronization on here will still allow application-specific file synchronization to be turned off.\r\n\r\nIf you disable this policy setting this policy setting, file synchronization via SOAP over HTTP is turned off.  You will turn off file synchronization via SOAP over HTTP for other applications even if the application-specific file synchronization is turned on.\r\n\r\nImportant: If you disable this policy setting, which will turn off file synchronization via SOAP over HTTP, you will also prevent co-authoring for Word and PowerPoint, and it will adversely affect the behavior of SharePoint Workspaces.",
    "helpText": "",
    "name": "L_TurnOnFileSynchronizationViaSOAPOverHTTP",
    "displayName": "Turn on file synchronization via SOAP over HTTP (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_turnonfilesynchronizationviasoapoverhttp_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_turnonfilesynchronizationviasoapoverhttp_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_turnonfilesynchronizationviasoapoverhttp_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}