{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NeedEdgeBrowser",
        "Configure which channel of Microsoft Edge to use for opening redirected sites",
        "\\Windows Components\\Internet Explorer",
        "Administrative Templates\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/ConfigureEdgeRedirectChannel",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3",
    "description": "",
    "helpText": "",
    "name": "NeedEdgeBrowser3",
    "displayName": "Third choice (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3_",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362.1350",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3_",
            "description": null,
            "helpText": null,
            "name": "",
            "displayName": "",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": ""
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3_1",
            "description": null,
            "helpText": null,
            "name": "Microsoft Edge Stable",
            "displayName": "Microsoft Edge Stable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3_2",
            "description": null,
            "helpText": null,
            "name": "Microsoft Edge Beta version 77 or later",
            "displayName": "Microsoft Edge Beta version 77 or later",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3_3",
            "description": null,
            "helpText": null,
            "name": "Microsoft Edge Dev version 77 or later",
            "displayName": "Microsoft Edge Dev version 77 or later",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3_4",
            "description": null,
            "helpText": null,
            "name": "Microsoft Edge Canary version 77 or later",
            "displayName": "Microsoft Edge Canary version 77 or later",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_neededgebrowser3_0",
            "description": null,
            "helpText": null,
            "name": "Microsoft Edge version 45 or earlier",
            "displayName": "Microsoft Edge version 45 or earlier",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_configureedgeredirectchannel"
                }
            ],
            "dependedOnBy": []
        }
    ]
}