{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Personal Data Encryption",
        "PDE",
        "Personal Data Encryption"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/personaldataencryption-csp/"
    ],
    "baseUri": "./User/Vendor/MSFT/PDE",
    "offsetUri": "/EnablePersonalDataEncryption",
    "rootDefinitionId": "user_vendor_msft_pde_enablepersonaldataencryption",
    "categoryId": "1d5e7986-870c-444b-bf09-78bbf82a53fa",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_pde_enablepersonaldataencryption",
    "description": "Allows the Admin to enable Personal Data Encryption. Set to '1' to set this policy.",
    "helpText": "",
    "name": "EnablePersonalDataEncryption",
    "displayName": "Enable Personal Data Encryption (User)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "holographicForBusiness",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_pde_enablepersonaldataencryption_0",
            "description": "Disable Personal Data Encryption.",
            "helpText": null,
            "name": "Disable Personal Data Encryption.",
            "displayName": "Disable Personal Data Encryption.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_pde_enablepersonaldataencryption_1",
            "description": "Enable Personal Data Encryption.",
            "helpText": null,
            "name": "Enable Personal Data Encryption.",
            "displayName": "Enable Personal Data Encryption.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_pde_protectfolders_protectdocuments",
                    "required": false
                },
                {
                    "dependedOnBy": "user_vendor_msft_pde_protectfolders_protectdesktop",
                    "required": false
                },
                {
                    "dependedOnBy": "user_vendor_msft_pde_protectfolders_protectpictures",
                    "required": false
                }
            ]
        }
    ]
}