{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Volumepreference",
        "Volume preference",
        "\\Microsoft Word 2016\\Miscellaneous",
        "Microsoft Word 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_miscellaneous178/L_Volumepreference",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178_l_volumepreference",
    "categoryId": "320ccaa3-a391-4d29-a9c4-594561f4104d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178_l_volumepreference",
    "description": "This policy setting allows you to configure Microsoft Word to retain file path information when you work with files on a network server, either as a mapped drive (Z:\\Folder_Name\\File_Name) or as Universal Naming Convention (UNC) (\\\\Share_Name\\File_Name).\r\n\r\nIf you enable this policy setting, you may select one of these options:\r\n- Use Drive letter or UNC as entered\r\n- Convert Drive letter to UNC\r\n- Convert UNC to Drive letter\r\n\r\nIf you disable or do not configure this policy setting, the default option is \"Use Drive letter or UNC as entered.\"",
    "helpText": "",
    "name": "L_Volumepreference",
    "displayName": "Volume preference (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178_l_volumepreference_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178_l_volumepreference_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178_l_volumepreference_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178_l_volumepreference_l_volumepreference179",
                    "required": true
                }
            ]
        }
    ]
}