{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RemovableStorageClasses_DenyAll_Access_1",
        "All Removable Storage classes: Deny all access",
        "\\System\\Removable Storage Access",
        "Administrative Templates\\System\\Removable Storage Access",
        "Removable Storage Access"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-removablestorage#admx-removablestorage-removablestorageclasses-denyall-access-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemovableStorage/RemovableStorageClasses_DenyAll_Access_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_removablestorage_removablestorageclasses_denyall_access_1",
    "categoryId": "180b2a03-16d4-43cd-ba84-9b4546753ef4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_removablestorage_removablestorageclasses_denyall_access_1",
    "description": "Configure access to all removable storage classes.\r\n\r\nThis policy setting takes precedence over any individual removable storage policy settings. To manage individual classes, use the policy settings available for each class.\r\n\r\nIf you enable this policy setting, no access is allowed to any removable storage class.\r\n\r\nIf you disable or do not configure this policy setting, write and read accesses are allowed to all removable storage classes.\r\n ",
    "helpText": "",
    "name": "RemovableStorageClasses_DenyAll_Access_1",
    "displayName": "All Removable Storage classes: Deny all access (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_removablestorage_removablestorageclasses_denyall_access_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_removablestorageclasses_denyall_access_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_removablestorage_removablestorageclasses_denyall_access_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}