{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SearchOrder",
        "Specify the order in which Windows Installer searches for installation files",
        "\\Windows Components\\Windows Installer",
        "Administrative Templates\\Windows Components\\Windows Installer",
        "Windows Installer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-msi#admx-msi-searchorder"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MSI/SearchOrder",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_msi_searchorder",
    "categoryId": "ce0b1189-57ea-4444-a93e-e4be17160f18",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_msi_searchorder",
    "description": "This policy setting specifies the order in which Windows Installer searches for installation files.\r\n\r\nIf you disable or do not configure this policy setting, by default, the Windows Installer searches the network first, then removable media (floppy drive, CD-ROM, or DVD), and finally, the Internet (URL).\r\n\r\nIf you enable this policy setting, you can change the search order by specifying the letters representing each file source in the order that you want Windows Installer to search:\r\n\r\n--   \"n\" represents the network;\r\n\r\n--   \"m\" represents media;\r\n\r\n--   \"u\" represents URL, or the Internet.\r\n\r\nTo exclude a file source, omit or delete the letter representing that source type.\r\n ",
    "helpText": "",
    "name": "SearchOrder",
    "displayName": "Specify the order in which Windows Installer searches for installation files (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_msi_searchorder_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_msi_searchorder_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_msi_searchorder_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_msi_searchorder_searchorder",
                    "required": true
                }
            ]
        }
    ]
}