{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "IZ_PolicyFontDownload_9",
        "Allow font downloads",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Local Machine Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Local Machine Zone",
        "Local Machine Zone"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/LocalMachineZoneAllowFontDownloads",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads",
    "categoryId": "80f5fb2f-e74a-4533-81aa-a92163f49e16",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_iz_partname1604",
    "description": "",
    "helpText": "",
    "name": "IZ_Partname1604",
    "displayName": "Allow font downloads (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_iz_partname1604_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_iz_partname1604_0",
            "description": null,
            "helpText": null,
            "name": "Enable",
            "displayName": "Enable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_iz_partname1604_3",
            "description": null,
            "helpText": null,
            "name": "Disable",
            "displayName": "Disable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_iz_partname1604_1",
            "description": null,
            "helpText": null,
            "name": "Prompt",
            "displayName": "Prompt",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_localmachinezoneallowfontdownloads"
                }
            ],
            "dependedOnBy": []
        }
    ]
}