{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Wallpaper",
        "Desktop Wallpaper",
        "\\Desktop\\Desktop",
        "Administrative Templates\\Desktop\\Desktop",
        "Desktop"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/Wallpaper",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_wallpaper",
    "categoryId": "a69e7a98-5af7-4834-bae1-2a1047663a71",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle",
    "description": null,
    "helpText": "",
    "name": "WallpaperStyle",
    "displayName": "Wallpaper Style: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle_0",
            "description": null,
            "helpText": null,
            "name": "Center",
            "displayName": "Center",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_desktop_wallpaper_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_wallpaper"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle_1",
            "description": null,
            "helpText": null,
            "name": "Tile",
            "displayName": "Tile",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_desktop_wallpaper_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_wallpaper"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle_2",
            "description": null,
            "helpText": null,
            "name": "Stretch",
            "displayName": "Stretch",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_desktop_wallpaper_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_wallpaper"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle_3",
            "description": null,
            "helpText": null,
            "name": "Fit",
            "displayName": "Fit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_desktop_wallpaper_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_wallpaper"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle_4",
            "description": null,
            "helpText": null,
            "name": "Fill",
            "displayName": "Fill",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_desktop_wallpaper_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_wallpaper"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_wallpaper_wallpaperstyle_5",
            "description": null,
            "helpText": null,
            "name": "Span",
            "displayName": "Span",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_desktop_wallpaper_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_wallpaper"
                }
            ],
            "dependedOnBy": []
        }
    ]
}