{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ClearRecentDocsOnExit",
        "Clear history of recently opened documents on exit",
        "\\Start Menu and Taskbar",
        "Administrative Templates\\Start Menu and Taskbar",
        "Start Menu and Taskbar"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-startmenu#admx-startmenu-clearrecentdocsonexit"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_StartMenu/ClearRecentDocsOnExit",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_startmenu_clearrecentdocsonexit",
    "categoryId": "5161db41-7947-49ea-b9b3-dd92539e6783",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_startmenu_clearrecentdocsonexit",
    "description": "Clear history of recently opened documents on exit.\r\n\r\nIf you enable this setting, the system deletes shortcuts to recently used document files when the user logs off. As a result, the Recent Items menu on the Start menu is always empty when the user logs on. In addition, recently and frequently used items in the Jump Lists off of programs in the Start Menu and Taskbar will be cleared when the user logs off.\r\n\r\nIf you disable or do not configure this setting, the system retains document shortcuts, and when a user logs on, the Recent Items menu and the Jump Lists appear just as it did when the user logged off.\r\n\r\nNote: The system saves document shortcuts in the user profile in the System-drive\\Users\\User-name\\Recent folder.\r\n\r\nAlso, see the \"Remove Recent Items menu from Start Menu\" and \"Do not keep history of recently opened documents\" policies in this folder. The system only uses this setting when neither of these related settings are selected.\r\n\r\nThis setting does not clear the list of recent files that Windows programs display at the bottom of the File menu. See the \"Do not keep history of recently opened documents\" setting.\r\n\r\nThis policy setting also does not hide document shortcuts displayed in the Open dialog box. See the \"Hide the dropdown list of recent files\" setting.\r\n\r\nThis policy also does not clear items that the user may have pinned to the Jump Lists, or Tasks that the application has provided for their menu. See the \"Do not allow pinning items in Jump Lists\" setting.\r\n ",
    "helpText": "",
    "name": "ClearRecentDocsOnExit",
    "displayName": "Clear history of recently opened documents on exit (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_startmenu_clearrecentdocsonexit_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_clearrecentdocsonexit_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_clearrecentdocsonexit_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}