{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_NewOutlookAutoMigrationUserSettingPolicy",
        "Manage user setting for new Outlook automatic migration",
        "\\Microsoft Outlook 2016\\Outlook Options\\Other",
        "Microsoft Outlook 2016\\Outlook Options\\Other",
        "Other"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v16~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Other/L_NewOutlookAutoMigrationUserSettingPolicy",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v16~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationusersettingpolicy",
    "categoryId": "5e3f61b6-52b7-4c74-a101-33c1cf34a749",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v16~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationusersettingpolicy_l_newoutlookautomigrationusersettingpolicyid",
    "description": "",
    "helpText": "",
    "name": "L_NewOutlookAutoMigrationUserSettingPolicyId",
    "displayName": "New Outlook Auto Migration User Setting: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_outlk16v16~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationusersettingpolicy_1",
            "parentSettingId": "user_vendor_msft_policy_config_outlk16v16~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationusersettingpolicy"
        }
    ],
    "dependedOnBy": []
}