{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Underlinehyperlinks",
        "Underline hyperlinks",
        "\\Microsoft Access 2016\\Application Settings\\Web Options...\\General",
        "Microsoft Access 2016\\Application Settings\\Web Options...\\General",
        "General",
        "Web Options - General"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_ApplicationSettings~L_WebOptions~L_General/L_Underlinehyperlinks",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_underlinehyperlinks",
    "categoryId": "cbb98485-6a36-47b8-b450-7821e08507ac",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_underlinehyperlinks",
    "description": "This policy setting controls whether hyperlinks in Access tables, queries, forms, and reports are underlined. \r\n      \r\nIf you enable this policy setting, Access underlines all hyperlinks in tables, queries, forms, and reports when they are created, overriding any configuration changes on the users' computers. \r\n      \r\nIf you disable this policy setting, Access does not underline hyperlinks in tables, queries, forms and reports. \r\n      \r\nIf you do not configure this policy setting, Access underlines hyperlinks that appear in tables, queries, forms, and reports. \r\n      \r\nEnabling this policy setting enforces the default configuration in Access, and is therefore unlikely to cause a significant usability issue for most users. If this configuration is changed, users might click on dangerous hyperlinks without realizing it, which could pose a security risk.",
    "helpText": "",
    "name": "L_Underlinehyperlinks",
    "displayName": "Underline hyperlinks (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_underlinehyperlinks_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_underlinehyperlinks_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_weboptions~l_general_l_underlinehyperlinks_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}