{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffBlockingOfUnsupportedFileTypesInApplicationGuard",
        "Turn off protection of unsupported file types in Application Guard for Office.",
        "\\Microsoft Office 2016\\Security Settings\\Trust Center\\Application Guard",
        "Microsoft Office 2016\\Security Settings\\Trust Center\\Application Guard",
        "Application Guard"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v9~Policy~L_MicrosoftOfficeSystem~L_SecuritySettings~L_trustcenter241~L_ApplicationGuard/L_TurnOffBlockingOfUnsupportedFileTypesInApplicationGuard",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v9~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffblockingofunsupportedfiletypesinapplicationguard",
    "categoryId": "517e55f5-729f-4b4d-9555-33baa95a0e5a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v9~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffblockingofunsupportedfiletypesinapplicationguard",
    "description": "This policy setting controls whether Application Guard for Office will block unsupported file types from being opened in Office apps or if it will enable the redirection to Protected View.\r\n\r\nIf you enable this setting, Application Guard for Office will redirect unsupported file types to Protected View in Office apps.\r\n\r\nImportant: Be aware that enabling this policy setting might pose a risk to the user's device.\r\n\r\nIf you disable or don't configure this setting, Application Guard for Office will block unsupported file types in Office apps.\r\n\r\nNote: This policy setting only applies to Microsoft 365 Apps for enterprise.",
    "helpText": "",
    "name": "L_TurnOffBlockingOfUnsupportedFileTypesInApplicationGuard",
    "displayName": "Turn off protection of unsupported file types in Application Guard for Office. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v9~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffblockingofunsupportedfiletypesinapplicationguard_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v9~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffblockingofunsupportedfiletypesinapplicationguard_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v9~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_applicationguard_l_turnoffblockingofunsupportedfiletypesinapplicationguard_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}