{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PublishSharedFolders",
        "Allow shared folders to be published",
        "\\Shared Folders",
        "Administrative Templates\\Shared Folders",
        "Shared Folders"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-sharedfolders#admx-sharedfolders-publishsharedfolders"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_SharedFolders/PublishSharedFolders",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_sharedfolders_publishsharedfolders",
    "categoryId": "f8bb78a3-d1e4-4c5d-8b0a-904a83830519",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_sharedfolders_publishsharedfolders",
    "description": "This policy setting determines whether the user can publish shared folders in Active Directory Domain Services (AD DS).\r\n\r\nIf you enable or do not configure this policy setting, users can use the \"Publish in Active Directory\" option in the Shared Folders snap-in to publish shared folders in AD DS.\r\n\r\nIf you disable this policy setting, users cannot publish shared folders in AD DS, and the \"Publish in Active Directory\" option is disabled. Note: The default is to allow shared folders to be published when this setting is not configured.\r\n ",
    "helpText": "",
    "name": "PublishSharedFolders",
    "displayName": "Allow shared folders to be published (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_sharedfolders_publishsharedfolders_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_sharedfolders_publishsharedfolders_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_sharedfolders_publishsharedfolders_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}