{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Set Maximum Storage Space For Recall Snapshots",
        "Windows AI"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-WindowsAI#setmaximumstoragespaceforrecallsnapshots"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/WindowsAI/SetMaximumStorageSpaceForRecallSnapshots",
    "rootDefinitionId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_v2",
    "categoryId": "33a43c22-104b-4683-995b-5652cfd5b490",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_v2",
    "description": "This policy setting allows you to control the maximum amount of disk space that can be used by Windows to save snapshots for Recall. The default value of '0' will let the OS configure the amount of storage allocated to snapshots. When the default value of '0' is used, the OS configures the storage allocation for snapshots based on the device storage capacity. 25 GB is allocated when the device storage capacity is 256 GB. 75 GB is allocated when the device storage capacity is 512 GB. 150 GB is allocated when the device storage capacity is 1 TB or higher.\r\n ",
    "helpText": "",
    "name": "SetMaximumStorageSpaceForRecallSnapshots",
    "displayName": "Set Maximum Storage Space For Recall Snapshots (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100.3912",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_0",
            "description": "Let the OS define the maximum storage amount based on hard drive storage size",
            "helpText": null,
            "name": "Let the OS define the maximum storage amount based on hard drive storage size",
            "displayName": "Let the OS define the maximum storage amount based on hard drive storage size",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_10240",
            "description": "10GB",
            "helpText": null,
            "name": "10GB",
            "displayName": "10GB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 10240
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_25600",
            "description": "25GB",
            "helpText": null,
            "name": "25GB",
            "displayName": "25GB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 25600
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_51200",
            "description": "50GB",
            "helpText": null,
            "name": "50GB",
            "displayName": "50GB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 51200
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_76800",
            "description": "75GB",
            "helpText": null,
            "name": "75GB",
            "displayName": "75GB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 76800
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_102400",
            "description": "100GB",
            "helpText": null,
            "name": "100GB",
            "displayName": "100GB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 102400
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_windowsai_setmaximumstoragespaceforrecallsnapshots_153600",
            "description": "150GB",
            "helpText": null,
            "name": "150GB",
            "displayName": "150GB",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 153600
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}