{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "RestrictApps",
        "Run only specified Windows applications",
        "\\System",
        "Administrative Templates\\System",
        "System"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ShellCommandPromptRegEditTools/RestrictApps",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_shellcommandpromptregedittools_restrictapps",
    "categoryId": "fd66cd4e-474b-4d6c-8dec-65a6a49e75d7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_shellcommandpromptregedittools_restrictapps_restrictapps_restrictappslist",
    "description": null,
    "helpText": "",
    "name": "RestrictApps_RestrictAppsList",
    "displayName": "List of allowed applications (User)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_shellcommandpromptregedittools_restrictapps_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_shellcommandpromptregedittools_restrictapps"
        }
    ],
    "dependedOnBy": []
}