{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AuthNegotiateDelegateAllowlist",
        "Kerberos delegation server allowlist",
        "\\Google\\Google Chrome\\HTTP authentication",
        "Administrative Templates\\Google\\Google Chrome\\HTTP authentication",
        "HTTP authentication"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~HTTPAuthentication/AuthNegotiateDelegateAllowlist",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authnegotiatedelegateallowlist",
    "categoryId": "93ed2300-658d-40f3-8211-9295a240579c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authnegotiatedelegateallowlist_authnegotiatedelegateallowlist",
    "description": "",
    "helpText": "",
    "name": "AuthNegotiateDelegateAllowlist",
    "displayName": "Kerberos delegation server allowlist (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1000000,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authnegotiatedelegateallowlist_1",
            "parentSettingId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authnegotiatedelegateallowlist"
        }
    ],
    "dependedOnBy": []
}