{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PreventBackEscMapping_1",
        "Prevent Back-ESC mapping",
        "\\Windows Components\\Tablet PC\\Hardware Buttons",
        "Administrative Templates\\Windows Components\\Tablet PC\\Hardware Buttons",
        "Hardware Buttons"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-tabletshell#admx-tabletshell-preventbackescmapping-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TabletShell/PreventBackEscMapping_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_tabletshell_preventbackescmapping_1",
    "categoryId": "aa67f0c0-4eb0-492f-a528-decd3e256a22",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_tabletshell_preventbackescmapping_1",
    "description": "Removes the Back->ESC mapping that normally occurs when menus are visible, and for applications that subscribe to this behavior.\r\n\r\nIf you enable this policy, a button assigned to Back will not map to ESC.\r\n\r\nIf you disable this policy, Back->ESC mapping will occur.\r\n\r\nIf you do not configure this policy, Back->ESC mapping will occur.\r\n ",
    "helpText": "",
    "name": "PreventBackEscMapping_1",
    "displayName": "Prevent Back-ESC mapping (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_tabletshell_preventbackescmapping_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletshell_preventbackescmapping_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletshell_preventbackescmapping_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}