{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableFRAdminPin",
        "Do not automatically make all redirected folders available offline",
        "\\System\\Folder Redirection",
        "Administrative Templates\\System\\Folder Redirection",
        "Folder Redirection"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-folderredirection#admx-folderredirection-disablefradminpin"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FolderRedirection/DisableFRAdminPin",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpin",
    "categoryId": "41081a6b-ec9f-4b4f-b6ae-1d4dda162654",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpin",
    "description": "This policy setting allows you to control whether all redirected shell folders, such as Contacts, Documents, Desktop, Favorites, Music, Pictures, Videos, Start Menu, and AppData\\Roaming, are available offline by default.\r\n\r\nIf you enable this policy setting, users must manually select the files they wish to make available offline.  \r\n\r\nIf you disable or do not configure this policy setting, redirected shell folders are automatically made available offline. All subfolders within the redirected folders are also made available offline.  \r\n\r\nNote: This policy setting does not prevent files from being automatically cached if the network share is configured for \"Automatic Caching\", nor does it affect the availability of the \"Always available offline\" menu option in the user interface.  \r\n\r\nNote: Do not enable this policy setting if users will need access to their redirected files if the network or server holding the redirected files becomes unavailable.\r\n\r\nNote: If one or more valid folder GUIDs are specified in the policy setting \"Do not automatically make specific redirected folders available offline\", that setting will override the configured value of \"Do not automatically make all redirected folders available offline\".\r\n      \r\n ",
    "helpText": "",
    "name": "DisableFRAdminPin",
    "displayName": "Do not automatically make all redirected folders available offline (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpin_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpin_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}