{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DwmDisallowAnimations_1",
        "Do not allow window animations",
        "\\Windows Components\\Desktop Window Manager",
        "Administrative Templates\\Windows Components\\Desktop Window Manager",
        "Desktop Window Manager"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-dwm#admx-dwm-dwmdisallowanimations-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DWM/DwmDisallowAnimations_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowanimations_1",
    "categoryId": "be6b97de-f120-4d89-b7c9-b548d061bac8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowanimations_1",
    "description": "This policy setting controls the appearance of window animations such as those found when restoring, minimizing, and maximizing windows. \r\n\r\nIf you enable this policy setting, window animations are turned off. \r\n\r\nIf you disable or do not configure this policy setting, window animations are turned on. \r\n\r\nChanging this policy setting requires a logoff for it to be applied.\r\n ",
    "helpText": "",
    "name": "DwmDisallowAnimations_1",
    "displayName": "Do not allow window animations (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowanimations_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowanimations_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowanimations_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}