{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOnLexiconUpdate",
        "Turn on lexicon update",
        "\\Windows Components\\IME",
        "Administrative Templates\\Windows Components\\IME",
        "IME"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eaime#admx-eaime-l-turnonlexiconupdate"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EAIME/L_TurnOnLexiconUpdate",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_eaime_l_turnonlexiconupdate",
    "categoryId": "ba1d333c-e19b-4470-bbab-d040a633c3a3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_eaime_l_turnonlexiconupdate",
    "description": "This policy setting controls the lexicon update feature, which downloads hot and popular words lexicon to local PC.\r\n\r\nIf you enable this policy setting, the functionality associated with this feature is turned on, hot and popular words lexicon can be downloaded to local PC, the user is able to turn it on or off in settings.\r\n\r\nIf you disable this policy setting, the functionality associated with this feature is turned off, and the user won't be able to turn it on.\r\n\r\nIf you don't configure this policy setting, it will be turned on by default, and the user can turn on and turn off the lexicon udpate feature.\r\n\r\nThis Policy setting applies only to Microsoft CHS Pinyin IME.\r\n ",
    "helpText": "",
    "name": "L_TurnOnLexiconUpdate",
    "displayName": "Turn on lexicon update (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_eaime_l_turnonlexiconupdate_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_turnonlexiconupdate_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_turnonlexiconupdate_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}