{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_CLIENT_TRUSTED_CERTIFICATE_THUMBPRINTS_2",
        "Specify SHA1 thumbprints of certificates representing trusted .rdp publishers",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Connection Client",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Connection Client",
        "Remote Desktop Connection Client"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_CLIENT_TRUSTED_CERTIFICATE_THUMBPRINTS_2",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_client_trusted_certificate_thumbprints_2",
    "categoryId": "a4877a42-7e62-4216-a477-0b35357ab313",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_terminalserver_ts_client_trusted_certificate_thumbprints_2_trusted_certificate_thumbprints",
    "description": null,
    "helpText": "",
    "name": "TRUSTED_CERTIFICATE_THUMBPRINTS",
    "displayName": "Comma-separated list of SHA1 trusted certificate thumbprints: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_client_trusted_certificate_thumbprints_2_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_client_trusted_certificate_thumbprints_2"
        }
    ],
    "dependedOnBy": []
}