{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SettingsStoragePath",
        "Settings storage path",
        "\\Windows Components\\Microsoft User Experience Virtualization",
        "Administrative Templates\\Windows Components\\Microsoft User Experience Virtualization",
        "Microsoft User Experience Virtualization"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserExperienceVirtualization/SettingsStoragePath",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_settingsstoragepath",
    "categoryId": "9e857bed-81f8-4dfc-b049-c93eb68b4064",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_settingsstoragepath_settingsstoragepath",
    "description": null,
    "helpText": "",
    "name": "SettingsStoragePath",
    "displayName": "Settings storage path (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_settingsstoragepath_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_settingsstoragepath"
        }
    ],
    "dependedOnBy": []
}