{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_AllowUserDefinedFileShareCatalogs",
        "Allow users to control the Trusted Shared Folder Catalogs",
        "\\Microsoft Office 2016\\Security Settings\\Trust Center\\Trusted Catalogs",
        "Microsoft Office 2016\\Security Settings\\Trust Center\\Trusted Catalogs",
        "Trusted Catalogs"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v16~Policy~L_MicrosoftOfficeSystem~L_SecuritySettings~L_trustcenter241~L_TrustedCatalogs/L_AllowUserDefinedFileShareCatalogs",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_allowuserdefinedfilesharecatalogs",
    "categoryId": "24f6d328-64e7-4490-be38-452ac3b61f6f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_allowuserdefinedfilesharecatalogs",
    "description": "\r\nThis policy setting allows users to control all the Trusted Shared Folder Catalogs when other policy settings in the Trusted Catalogs folder are set by policy. \r\n\r\nNote: This setting only applies to Version 2308 or later of Office.\r\n\r\nIf you enable this policy setting, users can set their own Trusted Shared Folder Catalogs including the Default Shared Folder location. Shared Folder Catalogs defined by policy will not be used.\r\n\r\nIf you disable this policy setting, then all Trusted Shared Folders Catalogs are policy controlled.\r\n\r\nIf you do not configure this policy setting but do configure other policy settings in the Trusted Catalogs folder, the Trusted Shared Folder Catalogs are policy controlled. If you do not configure this policy setting or any other policy setting in the Trusted Catalogs folder, users can set their own Trusted Shared Folder locations.",
    "helpText": "",
    "name": "L_AllowUserDefinedFileShareCatalogs",
    "displayName": "Allow users to control the Trusted Shared Folder Catalogs (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_allowuserdefinedfilesharecatalogs_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_allowuserdefinedfilesharecatalogs_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241~l_trustedcatalogs_l_allowuserdefinedfilesharecatalogs_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}