{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableWindowsOSSettings",
        "Synchronize Windows settings",
        "\\Windows Components\\Microsoft User Experience Virtualization",
        "Administrative Templates\\Windows Components\\Microsoft User Experience Virtualization",
        "Microsoft User Experience Virtualization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-userexperiencevirtualization#admx-userexperiencevirtualization-disablewindowsossettings"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserExperienceVirtualization/DisableWindowsOSSettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings",
    "categoryId": "9e857bed-81f8-4dfc-b049-c93eb68b4064",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings",
    "description": "\r\nThis policy setting configures the synchronization of Windows settings between computers.\r\nCertain Windows settings will synchronize between computers by default. These settings include Windows themes, Windows desktop settings, Ease of Access settings, and network printers. Use this policy setting to specify which Windows settings synchronize between computers. You can also use these settings to enable synchronization of users' sign-in information for certain apps, networks, and certificates.\r\nIf you enable this policy setting, only the selected Windows settings synchronize. Unselected Windows settings are excluded from settings synchronization.\r\nIf you disable this policy setting, all Windows Settings are excluded from the settings synchronization.\r\nIf you do not configure this policy setting, any defined values will be deleted.\r\n      \r\n ",
    "helpText": "",
    "name": "DisableWindowsOSSettings",
    "displayName": "Synchronize Windows settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_desktopsettings",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_easeofaccesssettings",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_themesettings",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_roamingcredentialsettings",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_disablewindowsossettings_networkprinters",
                    "required": true
                }
            ]
        }
    ]
}