{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffFileSynchronizationViaSOAPOverHTTP",
        "Turn off file synchronization via SOAP over HTTP",
        "\\Microsoft Word 2016\\Miscellaneous\\Server Settings",
        "Microsoft Word 2016\\Miscellaneous\\Server Settings",
        "Server Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_miscellaneous178~L_ServerSettings/L_TurnOffFileSynchronizationViaSOAPOverHTTP",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp",
    "categoryId": "b206e4ef-a288-4fb7-a7ee-4a30b4df3b98",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp",
    "description": "This policy setting controls file synchronization via SOAP over HTTP for Word.\r\n\r\nIf you enable this policy setting, file synchronization via SOAP over HTTP is turned off for Word.\r\n\r\nIf you disable or do not configure this policy setting this policy setting, file synchronization via SOAP over HTTP is turned on for Word.\r\n\r\nNote: Turning off file synchronization via SOAP over HTTP will also prevent co-authoring and adversely affect the behavior of SharePoint Workspaces.",
    "helpText": "",
    "name": "L_TurnOffFileSynchronizationViaSOAPOverHTTP",
    "displayName": "Turn off file synchronization via SOAP over HTTP (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_miscellaneous178~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}