{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SaveWordfilesas",
        "Default file format",
        "\\Microsoft Word 2016\\Word Options\\Save",
        "Microsoft Word 2016\\Word Options\\Save",
        "Save"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_Save/L_SaveWordfilesas",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_savewordfilesas",
    "categoryId": "89be4acb-fdf9-447b-ad16-9a5af1d68b8b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_savewordfilesas",
    "description": "This policy setting determines the default file format for saving files in Word.\r\n\r\nIf you enable this policy setting, you can set the default file format from among the following options: \r\n\r\n- Word Document (*.docx): This option is the default configuration in Word.\r\n- Single Files Web Page (*.mht)\r\n- Web Page (*.htm; *.html)\r\n- Web Page, Filtered (*.htm, *.html)\r\n- Rich Text Format (*.rtf)\r\n- Plain Text  (*.txt)\r\n- Word 6.0/95 (*.doc)\r\n- Word 6.0/95 - Chinese (Simplified) (*.doc)\r\n- Word 6.0/95 - Chinese (Traditional) (*.doc)\r\n- Word 6.0/95 - Japanese (*.doc)\r\n- Word 6.0/95 - Korean (*.doc)\r\n- Word 97-2002 and 6.0/95 - RTF\r\n- Word 5.1 for Macintosh (*.mcw)\r\n- Word 5.0 for Macintosh (*.mcw)\r\n- Word 2.x for Windows (*.doc)\r\n- Works 4.0 for Windows (*.wps)\r\n- WordPerfect 5.x for Windows (*.doc)\r\n- WordPerfect 5.1 for DOS (*.doc)\r\n- Word Macro-Enabled Document (*.docm)\r\n- Word Template (*.dotx)\r\n- Word Macro-Enabled Template (*.dotm)\r\n- Word 97 - 2003 Document (*.doc)\r\n- Word 97 - 2003 Template (*.dot)\r\n- Word XML Document (*.xml)\r\n- Strict Open XML Document (*.docx)\r\n- OpenDocument Text (*.odt)\r\n\r\nUsers can choose to save presentations or documents in a different file format than the default.\r\n\r\nIf you disable or do not configure this policy setting, Word saves new files in the Office Open XML format: Word files have a .docx extension. For users who run recent versions of Word, Microsoft offers the Microsoft Office Compatibility Pack, which enables them to open and save Office Open XML files. If some users in your organization cannot install the Compatibility Pack, or are running versions of Word older than Microsoft Office 2000 with Service Pack 3, they might not be able to access Office Open XML files.\r\n\r\nThis policy setting is often set in combination with the \"Save As Open XML in Compatibility Mode\" policy setting.",
    "helpText": "",
    "name": "L_SaveWordfilesas",
    "displayName": "Default file format (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_savewordfilesas_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_savewordfilesas_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_savewordfilesas_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_save_l_savewordfilesas_l_savewordfilesas3",
                    "required": true
                }
            ]
        }
    ]
}