{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PenTrainingOff_1",
        "Turn off Tablet PC Pen Training",
        "\\Windows Components\\Tablet PC\\Tablet PC Pen Training",
        "Administrative Templates\\Windows Components\\Tablet PC\\Tablet PC Pen Training",
        "Tablet PC Pen Training"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-pentraining#admx-pentraining-pentrainingoff-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PenTraining/PenTrainingOff_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_pentraining_pentrainingoff_1",
    "categoryId": "3e98c3bc-254c-445f-a1c8-4a93c2e0fcf2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_pentraining_pentrainingoff_1",
    "description": "Turns off Tablet PC Pen Training.\r\n\r\nIf you enable this policy setting, users cannot open Tablet PC Pen Training.\r\n\r\nIf you disable or do not configure this policy setting, users can open Tablet PC Pen Training.\r\n ",
    "helpText": "",
    "name": "PenTrainingOff_1",
    "displayName": "Turn off Tablet PC Pen Training (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_pentraining_pentrainingoff_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_pentraining_pentrainingoff_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_pentraining_pentrainingoff_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}