{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LockUserUILanguage",
        "Restricts the UI languages Windows should use for the selected user",
        "\\Control Panel\\Regional and Language Options",
        "Administrative Templates\\Control Panel\\Regional and Language Options",
        "Regional and Language Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-lockuseruilanguage"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/LockUserUILanguage",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage",
    "categoryId": "18db3d59-661b-47ec-900a-bf75495ca598",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage",
    "description": "This policy setting restricts the Windows UI language for specific users.\r\n\r\nThis policy setting applies to computers with more than one UI language installed.\r\n\r\nIf you enable this policy setting, the UI language of Windows menus and dialogs for systems with more than one language is restricted to a specified language for the selected user. If the specified language is not installed on the target computer or you disable this policy setting, the language selection defaults to the language selected by the user.\r\n\r\nIf you disable or do not configure this policy setting, there is no restriction on which language users should use.\r\n\r\nTo enable this policy setting in Windows Server 2003, Windows XP, or Windows 2000, to use the \"Restrict selection of Windows menus and dialogs language\" policy setting.\r\n ",
    "helpText": "",
    "name": "LockUserUILanguage",
    "displayName": "Restricts the UI languages Windows should use for the selected user (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect",
                    "required": true
                }
            ]
        }
    ]
}