{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoMoreProgramsList",
        "Remove All Programs list from the Start menu",
        "\\Start Menu and Taskbar",
        "Administrative Templates\\Start Menu and Taskbar",
        "Start Menu and Taskbar"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_StartMenu/NoMoreProgramsList",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist",
    "categoryId": "5161db41-7947-49ea-b9b3-dd92539e6783",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_nomoreprogramslistdropdown",
    "description": null,
    "helpText": "",
    "name": "NoMoreProgramsListDropdown",
    "displayName": "Choose one of the following actions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_nomoreprogramslistdropdown_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_nomoreprogramslistdropdown_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_nomoreprogramslistdropdown_3",
            "description": null,
            "helpText": null,
            "name": "Collapse",
            "displayName": "Collapse",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_nomoreprogramslistdropdown_2",
            "description": null,
            "helpText": null,
            "name": "Collapse and disable setting",
            "displayName": "Collapse and disable setting",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_nomoreprogramslistdropdown_1",
            "description": null,
            "helpText": null,
            "name": "Remove and disable setting",
            "displayName": "Remove and disable setting",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_nomoreprogramslist"
                }
            ],
            "dependedOnBy": []
        }
    ]
}