{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultJavaScriptOptimizerSetting",
        "Control use of JavaScript optimizers",
        "\\Microsoft Edge\\Content settings",
        "Microsoft Edge\\Content settings",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev134~Policy~microsoft_edge~ContentSettings/DefaultJavaScriptOptimizerSetting",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~contentsettings_defaultjavascriptoptimizersetting",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~contentsettings_defaultjavascriptoptimizersetting",
    "description": "Allows you to set whether Microsoft Edge will run the v8 JavaScript engine with more advanced JavaScript optimizations enabled.\r\n\r\nDisabling JavaScript optimizations (by setting this policy's value to 2) will mean that Microsoft Edge may render web content more slowly.\r\n\r\nThis policy can be overridden for specific URL patterns using the 'JavaScriptOptimizerAllowedForSites' (Allow JavaScript optimization on these sites) and 'JavaScriptOptimizerBlockedForSites' (Block JavaScript optimizations on these sites) policies.\r\n\r\nIf you don't configure this policy, JavaScript optimizations are enabled.\r\n\r\nPolicy options mapping:\r\n\r\n* AllowJavaScriptOptimizer (1) = Enable advanced JavaScript optimizations on all sites\r\n\r\n* BlockJavaScriptOptimizer (2) = Disable advanced JavaScript optimizations on all sites\r\n\r\nUse the preceding information when configuring this policy.",
    "helpText": "",
    "name": "DefaultJavaScriptOptimizerSetting",
    "displayName": "Control use of JavaScript optimizers (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~contentsettings_defaultjavascriptoptimizersetting_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~contentsettings_defaultjavascriptoptimizersetting_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~contentsettings_defaultjavascriptoptimizersetting_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~contentsettings_defaultjavascriptoptimizersetting_defaultjavascriptoptimizersetting",
                    "required": true
                }
            ]
        }
    ]
}