{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_DeleteAllUserConnection",
        "Ability to delete all user remote access connections",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-networkconnections#admx-networkconnections-nc-deletealluserconnection"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_DeleteAllUserConnection",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_deletealluserconnection",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_networkconnections_nc_deletealluserconnection",
    "description": "Determines whether users can delete all user remote access connections.\r\n\r\nTo create an all-user remote access connection, on the Connection Availability page in the New Connection Wizard, click the \"For all users\" option.\r\n\r\nIf you enable this setting, all users can delete shared remote access connections. In addition, if your file system is NTFS, users need to have Write access to Documents and Settings\\All Users\\Application Data\\Microsoft\\Network\\Connections\\Pbk to delete a shared remote access connection.\r\n\r\nIf you disable this setting (and enable the \"Enable Network Connections settings for Administrators\" setting), users (including administrators) cannot delete all-user remote access connections. (By default, users can still delete their private connections, but you can change the default by using the \"Prohibit deletion of remote access connections\" setting.)\r\n\r\nImportant: If the \"Enable Network Connections settings for Administrators\" is disabled or not configured, this setting will not apply to administrators on post-Windows 2000 computers.\r\n\r\nIf you do not configure this setting, only Administrators and Network Configuration Operators can delete all user remote access connections.\r\n\r\nImportant: When enabled, the \"Prohibit deletion of remote access connections\" setting takes precedence over this setting. Users (including administrators) cannot delete any remote access connections, and this setting is ignored.\r\n\r\nNote: LAN connections are created and deleted automatically by the system when a LAN adapter is installed or removed. You cannot use the Network Connections folder to create or delete a LAN connection.\r\n\r\nNote: This setting does not prevent users from using other programs, such as Internet Explorer, to bypass this setting.\r\n ",
    "helpText": "",
    "name": "NC_DeleteAllUserConnection",
    "displayName": "Ability to delete all user remote access connections (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_deletealluserconnection_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_deletealluserconnection_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_deletealluserconnection_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}