{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Matchparentheses",
        "Match parentheses",
        "\\Microsoft Word 2016\\Word Options\\Proofing\\AutoFormat as you type\\Automatically as you type",
        "Microsoft Word 2016\\Word Options\\Proofing\\AutoFormat as you type\\Automatically as you type",
        "Automatically as you type"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_Proofing~L_AutoFormatasyoutype~L_Automaticallyasyoutype/L_Matchparentheses",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autoformatasyoutype~l_automaticallyasyoutype_l_matchparentheses",
    "categoryId": "e8ce968b-91cb-4301-ba98-b37d42bc5213",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autoformatasyoutype~l_automaticallyasyoutype_l_matchparentheses",
    "description": "This policy setting allows you to set the option \"Match opening and closing parentheses\" in Word Options | Proofing | AutoCorrect Options... | AutoFormat As You Type | Automatically as you type. This option may be hidden in Word until certain editing languages are enabled.\r\n\r\nIf you enable this policy setting, \"Match opening and closing parentheses\" will be set.\r\n\r\nIf you disable or do not configure this policy setting, \"Match opening and closing parentheses\" will not be set.",
    "helpText": "",
    "name": "L_Matchparentheses",
    "displayName": "Match parentheses (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autoformatasyoutype~l_automaticallyasyoutype_l_matchparentheses_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autoformatasyoutype~l_automaticallyasyoutype_l_matchparentheses_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autoformatasyoutype~l_automaticallyasyoutype_l_matchparentheses_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}