{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "IZ_PolicyJavaPermissions_1",
        "Java permissions",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Internet Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Internet Zone",
        "Internet Zone"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/InternetZoneJavaPermissions",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions",
    "categoryId": "ecfb5fea-26cc-494b-9e5e-88b5e51a5be0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00",
    "description": "",
    "helpText": "",
    "name": "IZ_Partname1C00",
    "displayName": "Java permissions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00_65536",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00_65536",
            "description": null,
            "helpText": null,
            "name": "High safety",
            "displayName": "High safety",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "65536"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00_131072",
            "description": null,
            "helpText": null,
            "name": "Medium safety",
            "displayName": "Medium safety",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "131072"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00_196608",
            "description": null,
            "helpText": null,
            "name": "Low safety",
            "displayName": "Low safety",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "196608"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00_8388608",
            "description": null,
            "helpText": null,
            "name": "Custom",
            "displayName": "Custom",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8388608"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00_0",
            "description": null,
            "helpText": null,
            "name": "Disable Java",
            "displayName": "Disable Java",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}