{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableWarningOnIncludeFieldsUpdate",
        "Don’t ask permission before updating IncludePicture and IncludeText fields in Word",
        "\\Microsoft Word 2016\\Word Options\\Security",
        "Microsoft Word 2016\\Word Options\\Security",
        "Security"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_Security/L_DisableWarningOnIncludeFieldsUpdate",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security_l_disablewarningonincludefieldsupdate",
    "categoryId": "ec8a2b7c-d8dd-49d8-af2a-3ae0ca8eac02",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security_l_disablewarningonincludefieldsupdate",
    "description": "This policy setting allows you to control whether Word prompts the user with a security message before updating IncludePicture and IncludeText fields in the document.\r\n\r\nBy default, the user is prompted with a security message before those fields are updated. But, the prompt might effect automated workflows that merge Word documents.\r\n\r\nImportant: Fields that contain IncludePicture and IncludeText references can be used for data exfiltration or phishing exploits. A field containing these references can be modified to point to external websites for content. If credentials are required for accessing the picture or text, the process of updating the field will request a sign-in from the user. While this is a legitimate scenario for trusted sources, it is vulnerable to phishing if the document is not from a trusted source.\r\n\r\nIf you enable this policy setting, the user won’t be prompted with a security message before those fields are updated. Enabling this policy setting is not recommended because of the possible security implications.\r\n\r\nIf you disable or don’t configure this policy setting, the user will be prompted with a security message before those fields are updated.\r\n      ",
    "helpText": "",
    "name": "L_DisableWarningOnIncludeFieldsUpdate",
    "displayName": "Don’t ask permission before updating IncludePicture and IncludeText fields in Word (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security_l_disablewarningonincludefieldsupdate_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security_l_disablewarningonincludefieldsupdate_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security_l_disablewarningonincludefieldsupdate_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}