{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Checkspellingasyoutype",
        "Check spelling as you type",
        "\\Microsoft Publisher 2016\\Publisher Options\\Proofing",
        "Microsoft Publisher 2016\\Publisher Options\\Proofing",
        "Proofing"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/pub16v2~Policy~L_MicrosoftOfficePublisher~L_PubOptions~L_Proofing/L_Checkspellingasyoutype",
    "rootDefinitionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_puboptions~l_proofing_l_checkspellingasyoutype",
    "categoryId": "51e0cebb-cac4-4905-9b31-539295e4b85b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_puboptions~l_proofing_l_checkspellingasyoutype",
    "description": "This policy setting allows you to configure options for spelling errors.\r\n\r\nIf you enable this policy setting, you may choose one of these options:\r\n-  Check spelling as you type: This option is checked.\r\n-  Hide spelling errors: This option is checked, but \"Check spelling as you type\" is unchecked.\r\n- Both: \"Check spelling as you type\" and \"Hide spelling errors\" are both checked.\r\n\r\nIf you disable or do not configure this policy setting, the \"Check spelling as you type\" option is checked.",
    "helpText": "",
    "name": "L_Checkspellingasyoutype",
    "displayName": "Check spelling as you type (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_puboptions~l_proofing_l_checkspellingasyoutype_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_puboptions~l_proofing_l_checkspellingasyoutype_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_puboptions~l_proofing_l_checkspellingasyoutype_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_puboptions~l_proofing_l_checkspellingasyoutype_l_checkspellingasyoutypedropid",
                    "required": true
                }
            ]
        }
    ]
}