{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DontShowWhatsNewInformationOutlook",
        "Don’t show the What’s New information for Outlook",
        "\\Microsoft Office 2016\\What's New",
        "Microsoft Office 2016\\What's New",
        "What's New"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_WhatsNew/L_DontShowWhatsNewInformationOutlook",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_whatsnew_l_dontshowwhatsnewinformationoutlook",
    "categoryId": "adf11731-7089-4e2e-8dde-4bd9ef86b067",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_whatsnew_l_dontshowwhatsnewinformationoutlook",
    "description": "This policy setting controls whether the What’s New information is shown when a user opens the desktop version of Outlook for the first time after Outlook has been updated with new features. By default, the What’s New information is shown.\r\n\r\nIf you enable this policy setting, the What’s New information isn’t shown. Also, the What’s New button in File > Office Account is disabled.\r\n\r\nIf you disable or don’t configure this policy setting, the What’s New information is shown.\r\n\r\nNote: There are separate policy settings for Word, Excel, PowerPoint, Outlook, OneNote, and Visio.\r\n      ",
    "helpText": "",
    "name": "L_DontShowWhatsNewInformationOutlook",
    "displayName": "Don’t show the What’s New information for Outlook (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_whatsnew_l_dontshowwhatsnewinformationoutlook_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_whatsnew_l_dontshowwhatsnewinformationoutlook_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_whatsnew_l_dontshowwhatsnewinformationoutlook_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}