{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LockUserUILanguage",
        "Restricts the UI languages Windows should use for the selected user",
        "\\Control Panel\\Regional and Language Options",
        "Administrative Templates\\Control Panel\\Regional and Language Options",
        "Regional and Language Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/LockUserUILanguage",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage",
    "categoryId": "18db3d59-661b-47ec-900a-bf75495ca598",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect",
    "description": null,
    "helpText": "",
    "name": "UILangSelect",
    "displayName": "Restrict users to the following language: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_en-us",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_en-us",
            "description": null,
            "helpText": null,
            "name": "English",
            "displayName": "English",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_ja-jp",
            "description": null,
            "helpText": null,
            "name": "Japanese",
            "displayName": "Japanese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ja-JP"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_ko-kr",
            "description": null,
            "helpText": null,
            "name": "Korean",
            "displayName": "Korean",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ko-KR"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_de-de",
            "description": null,
            "helpText": null,
            "name": "German",
            "displayName": "German",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-DE"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_zh-cn",
            "description": null,
            "helpText": null,
            "name": "Simplified Chinese",
            "displayName": "Simplified Chinese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-CN"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_zh-tw",
            "description": null,
            "helpText": null,
            "name": "Traditional Chinese (Taiwan)",
            "displayName": "Traditional Chinese (Taiwan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-TW"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_fr-fr",
            "description": null,
            "helpText": null,
            "name": "French",
            "displayName": "French",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-FR"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_es-es",
            "description": null,
            "helpText": null,
            "name": "Spanish",
            "displayName": "Spanish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-ES"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_it-it",
            "description": null,
            "helpText": null,
            "name": "Italian",
            "displayName": "Italian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-IT"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_sv-se",
            "description": null,
            "helpText": null,
            "name": "Swedish",
            "displayName": "Swedish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sv-SE"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_nl-nl",
            "description": null,
            "helpText": null,
            "name": "Dutch",
            "displayName": "Dutch",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nl-NL"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_pt-br",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Brazil)",
            "displayName": "Portuguese (Brazil)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-BR"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_fi-fi",
            "description": null,
            "helpText": null,
            "name": "Finnish",
            "displayName": "Finnish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fi-FI"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_nb-no",
            "description": null,
            "helpText": null,
            "name": "Norwegian",
            "displayName": "Norwegian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nb-NO"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_da-dk",
            "description": null,
            "helpText": null,
            "name": "Danish",
            "displayName": "Danish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "da-DK"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_hu-hu",
            "description": null,
            "helpText": null,
            "name": "Hungarian",
            "displayName": "Hungarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hu-HU"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_pl-pl",
            "description": null,
            "helpText": null,
            "name": "Polish",
            "displayName": "Polish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pl-PL"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_ru-ru",
            "description": null,
            "helpText": null,
            "name": "Russian",
            "displayName": "Russian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ru-RU"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_cs-cz",
            "description": null,
            "helpText": null,
            "name": "Czech",
            "displayName": "Czech",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "cs-CZ"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_el-gr",
            "description": null,
            "helpText": null,
            "name": "Greek",
            "displayName": "Greek",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "el-GR"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_pt-pt",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Portugal)",
            "displayName": "Portuguese (Portugal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_tr-tr",
            "description": null,
            "helpText": null,
            "name": "Turkish",
            "displayName": "Turkish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tr-TR"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_ar-sa",
            "description": null,
            "helpText": null,
            "name": "Arabic",
            "displayName": "Arabic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-SA"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_he-il",
            "description": null,
            "helpText": null,
            "name": "Hebrew",
            "displayName": "Hebrew",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "he-IL"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_sk-sk",
            "description": null,
            "helpText": null,
            "name": "Slovak",
            "displayName": "Slovak",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sk-SK"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_sl-si",
            "description": null,
            "helpText": null,
            "name": "Slovenian",
            "displayName": "Slovenian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sl-SI"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_ro-ro",
            "description": null,
            "helpText": null,
            "name": "Romanian",
            "displayName": "Romanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ro-RO"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_hr-hr",
            "description": null,
            "helpText": null,
            "name": "Croatian",
            "displayName": "Croatian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hr-HR"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_bg-bg",
            "description": null,
            "helpText": null,
            "name": "Bulgarian",
            "displayName": "Bulgarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bg-BG"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_et-ee",
            "description": null,
            "helpText": null,
            "name": "Estonian",
            "displayName": "Estonian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "et-EE"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_lt-lt",
            "description": null,
            "helpText": null,
            "name": "Lithuanian",
            "displayName": "Lithuanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lt-LT"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_lv-lv",
            "description": null,
            "helpText": null,
            "name": "Latvian",
            "displayName": "Latvian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lv-LV"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_th-th",
            "description": null,
            "helpText": null,
            "name": "Thai",
            "displayName": "Thai",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "th-TH"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_zh-hk",
            "description": null,
            "helpText": null,
            "name": "Traditional Chinese (Hong Kong)",
            "displayName": "Traditional Chinese (Hong Kong)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-HK"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_sr-latn-cs",
            "description": null,
            "helpText": null,
            "name": "Serbian (Latin)",
            "displayName": "Serbian (Latin)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Latn-CS"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_uilangselect_uk-ua",
            "description": null,
            "helpText": null,
            "name": "Ukrainian",
            "displayName": "Ukrainian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uk-UA"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_globalization_lockuseruilanguage"
                }
            ],
            "dependedOnBy": []
        }
    ]
}