{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrintPreviewStickySettings_recommended",
        "Configure the sticky print preview settings",
        "\\Microsoft Edge - Default Settings (users can override)\\Printing",
        "Microsoft Edge - Default Settings (users can override)\\Printing",
        "Printing"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev110~Policy~microsoft_edge_recommended~Printing_recommended/PrintPreviewStickySettings_recommended",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge_recommended~printing_recommended_printpreviewstickysettings_recommended",
    "categoryId": "6b71fbf6-7156-471a-b488-3eece04bda86",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge_recommended~printing_recommended_printpreviewstickysettings_recommended",
    "description": "Configuring  this  policy  sets  the  print  preview  settings  as  the  most  recent  choice  in  Print  Preview  instead  of  the  default  print  preview  settings .\r\n\r\nEach  item  of  this  policy  expects  a  boolean :\r\n\r\nLayout  specifies  if  the  webpage  layout  should  be  kept  sticky  or  not  in  print  preview  settings .  If  we  set  this  to  True  the  webpage  layout  uses  the  recent  choice  otherwise  it  will  set  to  default  value .\r\n\r\nSize  specifies  if  the  page  size  should  be  kept  sticky  or  not  in  print  preview  settings .  If  we  set  this  to  True  the  page  size  uses  the  recent  choice  otherwise  it  will  set  to  default  value .\r\n\r\nScale  Type  specifies  if  the  scaling  percentage  and  scale  type  should  be  kept  sticky  or  not  in  print  preview  settings .  If  we  set  this  to  True  the  scale  percentage  and  scale  type  both  uses  the  recent  choice  otherwise  it  will  set  to  default  value .\r\n\r\nMargins  specifies  if  the  page  margin  should  be  kept  sticky  or  not  in  print  preview  settings .  If  we  set  this  to  True  the  page  margins  uses  the  recent  choice  otherwise  it  will  set  to  default  value .\r\n\r\nIf  you  enable  this  policy ,  the  selected  values  will  use  the  most  recent  choice  in  Print  Preview .\r\n\r\nIf  you  disable  or  don't  configure  this  policy ,  print  preview  settings  will  not  be  impacted .\r\n\r\nExample value:\r\n\r\n{\r\n  \"layout\": false,\r\n  \"size\": true,\r\n  \"scaleType\": false,\r\n  \"margins\": true\r\n}\r\n\r\n\r\nCompact example value:\r\n\r\n{\"layout\": false, \"size\": true, \"scaleType\": false, \"margins\": true}",
    "helpText": "",
    "name": "PrintPreviewStickySettings_recommended",
    "displayName": "Configure the sticky print preview settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge_recommended~printing_recommended_printpreviewstickysettings_recommended_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge_recommended~printing_recommended_printpreviewstickysettings_recommended_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge_recommended~printing_recommended_printpreviewstickysettings_recommended_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge_recommended~printing_recommended_printpreviewstickysettings_recommended_printpreviewstickysettings",
                    "required": true
                }
            ]
        }
    ]
}