{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SetCommentFieldsForOutlookGlobalAddressListDictionary",
        "Set comment fields for Outlook Global Address List Dictionary",
        "\\Microsoft Office 2016\\IME (Japanese)",
        "Microsoft Office 2016\\IME (Japanese)",
        "IME (Japanese)"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_IMEJapanese/L_SetCommentFieldsForOutlookGlobalAddressListDictionary",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_imejapanese_l_setcommentfieldsforoutlookglobaladdresslistdictionary",
    "categoryId": "eb54e1fc-5780-445c-b9e3-9ceb7a4360d7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_imejapanese_l_setcommentfieldsforoutlookglobaladdresslistdictionary",
    "description": "This policy setting allows you to specify the fields to display in the comments in the Outlook Global Address List Dictionary. This policy setting applies to Japanese Microsoft IME only.\r\n\r\nIf you enable this policy setting, you can specify the fields to display by setting strings, which are represented by the following identification letter IDs. You must also use any IDs/strings in the following sequence.\r\n\r\nThe ID for each field is as follows:\r\na = Full Name\r\nc = Phonetic Name\r\ne = Company Name\r\nf = Department Name\r\ng = Title\r\nh = Office Location\r\nj = Email Address\r\nk = Business Telephone Number\r\nl = Business Address\r\n\r\nFor example, if you want to display Full Name, Phonetic Name and Company Name, specify 'ace'.\r\n\r\nIf you do not configure this policy setting, Full Name, Phonetic Name, Department Name, Job Title and Office Location are displayed in the comments, in this order.",
    "helpText": "",
    "name": "L_SetCommentFieldsForOutlookGlobalAddressListDictionary",
    "displayName": "Set comment fields for Outlook Global Address List Dictionary (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_imejapanese_l_setcommentfieldsforoutlookglobaladdresslistdictionary_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_imejapanese_l_setcommentfieldsforoutlookglobaladdresslistdictionary_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_imejapanese_l_setcommentfieldsforoutlookglobaladdresslistdictionary_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_imejapanese_l_setcommentfieldsforoutlookglobaladdresslistdictionary_l_setcommentfieldsforoutlookglobaladdresslistdictionaryid",
                    "required": true
                }
            ]
        }
    ]
}