{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DwmDisallowColorizationColorChanges_1",
        "Do not allow color changes",
        "\\Windows Components\\Desktop Window Manager\\Window Frame Coloring",
        "Administrative Templates\\Windows Components\\Desktop Window Manager\\Window Frame Coloring",
        "Window Frame Coloring"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-dwm#admx-dwm-dwmdisallowcolorizationcolorchanges-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DWM/DwmDisallowColorizationColorChanges_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowcolorizationcolorchanges_1",
    "categoryId": "b5234c18-e555-409e-9550-59b89d1672f1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowcolorizationcolorchanges_1",
    "description": "This policy setting controls the ability to change the color of window frames. \r\n\r\nIf you enable this policy setting, you prevent users from changing the default window frame color. \r\n\r\nIf you disable or do not configure this policy setting, you allow users to change the default window frame color. \r\n\r\nNote: This policy setting can be used in conjunction with the \"Specify a default color for window frames\" policy setting, to enforce a specific color for window frames that cannot be changed by users.\r\n ",
    "helpText": "",
    "name": "DwmDisallowColorizationColorChanges_1",
    "displayName": "Do not allow color changes (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowcolorizationcolorchanges_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowcolorizationcolorchanges_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_dwm_dwmdisallowcolorizationcolorchanges_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}