{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_GoOfflineAction_1",
        "Action on server disconnect",
        "\\Network\\Offline Files",
        "Administrative Templates\\Network\\Offline Files",
        "Offline Files"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-offlinefiles#admx-offlinefiles-pol-goofflineaction-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_OfflineFiles/Pol_GoOfflineAction_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1",
    "categoryId": "82a9c23f-2c09-4479-9cd3-e7f185d7676f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1",
    "description": "Determines whether network files remain available if the computer is suddenly disconnected from the server hosting the files.\r\n\r\nThis setting also disables the \"When a network connection is lost\" option on the Offline Files tab. This prevents users from trying to change the option while a setting controls it.\r\n\r\nIf you enable this setting, you can use the \"Action\" box to specify how computers in the group respond.\r\n\r\n--  \"Work offline\" indicates that the computer can use local copies of network files while the server is inaccessible.\r\n\r\n--  \"Never go offline\" indicates that network files are not available while the server is inaccessible.\r\n\r\nIf you disable this setting or select the \"Work offline\" option, users can work offline if disconnected.\r\n\r\nIf you do not configure this setting, users can work offline by default, but they can change this option.\r\n\r\nThis setting appears in the Computer Configuration and User Configuration folders. If both settings are configured, the setting in Computer  Configuration takes precedence over the setting in User Configuration.\r\n\r\nTip: To configure this setting without establishing a setting, in Windows Explorer, on the Tools menu, click Folder Options, click the Offline Files tab, click Advanced, and then select an option in the \"When a network connection is lost\" section.\r\n\r\nAlso, see the \"Non-default server disconnect actions\" setting.\r\n ",
    "helpText": "",
    "name": "Pol_GoOfflineAction_1",
    "displayName": "Action on server disconnect (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_lbl_goofflineactioncombo",
                    "required": true
                }
            ]
        }
    ]
}