{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ConfigureFastShutdownBehaviorForAddIns",
        "Configure fast shutdown behavior for add-ins",
        "\\Microsoft Outlook 2016\\Miscellaneous\\Miscellaneous",
        "Microsoft Outlook 2016\\Miscellaneous\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_Miscellaneous~L_Shutdown/L_ConfigureFastShutdownBehaviorForAddIns",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_miscellaneous~l_shutdown_l_configurefastshutdownbehaviorforaddins",
    "categoryId": "ffb0a109-2507-42b3-b26f-9f667f2d5029",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_miscellaneous~l_shutdown_l_configurefastshutdownbehaviorforaddins",
    "description": "This policy setting controls Outlook's \"fast shutdown\" behavior for add-ins.\r\n\r\nIf you enable this policy setting, the BeginShutdown and OnDisconnection events should always be called for all add-ins.  \r\n\r\nIf you disable or do not configure this policy setting, all Outlook addins should always use the Addin Fast Shutdown behavior and not have the BeginShutdown and OnDisconnection events called.",
    "helpText": "",
    "name": "L_ConfigureFastShutdownBehaviorForAddIns",
    "displayName": "Configure fast shutdown behavior for add-ins (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_miscellaneous~l_shutdown_l_configurefastshutdownbehaviorforaddins_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_miscellaneous~l_shutdown_l_configurefastshutdownbehaviorforaddins_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_miscellaneous~l_shutdown_l_configurefastshutdownbehaviorforaddins_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}