{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Printer Shared Name",
        "Printer Provisioning"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/PrinterProvisioning-csp/"
    ],
    "baseUri": "./User/Vendor/MSFT/PrinterProvisioning",
    "offsetUri": "/UPPrinterInstalls/{0}/PrinterSharedName",
    "rootDefinitionId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
    "categoryId": "56c54112-2991-4bda-9e01-e6868bd07726",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_printersharedname",
    "description": "Identifies the Universal Print printer, by its Share Name, you wish to install on the targeted user account. The printer's Share Name can be found in the printer's properties via the Universal Print portal. Note: the targeted user account must have access rights to both the printer and to the Universal Print service.",
    "helpText": "",
    "name": "PrinterSharedName",
    "displayName": "Printer Shared Name (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19044.1790",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
            "parentSettingId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}"
        }
    ],
    "dependedOnBy": []
}