{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AM_SetFileRiskLevel",
        "Default risk level for file attachments",
        "\\Windows Components\\Attachment Manager",
        "Administrative Templates\\Windows Components\\Attachment Manager",
        "Attachment Manager"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AttachmentManager/AM_SetFileRiskLevel",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel",
    "categoryId": "3f8299b3-6803-4576-be08-7c311d04b8b9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_am_risklevel",
    "description": null,
    "helpText": "",
    "name": "AM_RiskLevel",
    "displayName": "Set the default risk level (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_am_risklevel_6151",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_am_risklevel_6150",
            "description": null,
            "helpText": null,
            "name": "High Risk",
            "displayName": "High Risk",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6150"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_am_risklevel_6151",
            "description": null,
            "helpText": null,
            "name": "Moderate Risk",
            "displayName": "Moderate Risk",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6151"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_am_risklevel_6152",
            "description": null,
            "helpText": null,
            "name": "Low Risk",
            "displayName": "Low Risk",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6152"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setfilerisklevel"
                }
            ],
            "dependedOnBy": []
        }
    ]
}