{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SmartActionsBlockList",
        "Block smart actions  for a list of services",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev89~Policy~microsoft_edge/SmartActionsBlockList",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev89~policy~microsoft_edge_smartactionsblocklist",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev89~policy~microsoft_edge_smartactionsblocklist",
    "description": "List specific services, such as PDFs, that don't show smart actions. (Smart actions are actions like \"define\" which are available in full and mini context menus in Microsoft Edge.)\r\n\r\nIf you enable the policy: :\r\n   - The smart action in the mini and full context menu will be disabled for all profiles for services that match the given list.\r\n   - Users will not see the smart action in the mini and full context menu on text selection for services that match the given list.\r\n   - In Microsoft Edge settings, the smart action in the mini and full context menu will be disabled for services that match the given list.\r\n\r\nIf you disable or don't configure this policy:\r\n   - The smart action in the mini and full context menu will be enabled for all profiles.\r\n   - Users will see the smart action in the mini and full context menu on text selection.\r\n   - In Microsoft Edge settings, the smart action in the mini and full context menu will be enabled.\r\n\r\nPolicy options mapping:\r\n\r\n* smart_actions_pdf (smart_actions_pdf) = Smart actions in PDF\r\n\r\nUse the preceding information when configuring this policy.\r\n\r\nExample value:\r\n\r\nsmart_actions_pdf",
    "helpText": "",
    "name": "SmartActionsBlockList",
    "displayName": "Block smart actions  for a list of services (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev89~policy~microsoft_edge_smartactionsblocklist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev89~policy~microsoft_edge_smartactionsblocklist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev89~policy~microsoft_edge_smartactionsblocklist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev89~policy~microsoft_edge_smartactionsblocklist_smartactionsblocklistdesc",
                    "required": true
                }
            ]
        }
    ]
}