{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultCategory",
        "Specify default category for Add New Programs",
        "\\Control Panel\\Add or Remove Programs",
        "Administrative Templates\\Control Panel\\Add or Remove Programs",
        "Add or Remove Programs"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AddRemovePrograms/DefaultCategory",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_addremoveprograms_defaultcategory",
    "categoryId": "a809df26-b5db-4af9-b247-a539ada4e869",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_addremoveprograms_defaultcategory_defaultcategorybox",
    "description": null,
    "helpText": "",
    "name": "DefaultCategoryBox",
    "displayName": "Category: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_addremoveprograms_defaultcategory_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_addremoveprograms_defaultcategory"
        }
    ],
    "dependedOnBy": []
}