{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoAddFromInternet",
        "Hide the \"Add programs from Microsoft\" option",
        "\\Control Panel\\Add or Remove Programs",
        "Administrative Templates\\Control Panel\\Add or Remove Programs",
        "Add or Remove Programs"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-addremoveprograms#admx-addremoveprograms-noaddfrominternet"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AddRemovePrograms/NoAddFromInternet",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddfrominternet",
    "categoryId": "a809df26-b5db-4af9-b247-a539ada4e869",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddfrominternet",
    "description": "Removes the \"Add programs from Microsoft\" section from the Add New Programs page. This setting prevents users from using Add or Remove Programs to connect to Windows Update.\r\n\r\nIf you disable this setting or do not configure it, \"Add programs from Microsoft\" is available to all users.\r\n\r\nThis setting does not prevent users from using other tools and methods to connect to Windows Update.\r\n\r\nNote: If the \"Hide Add New Programs page\" setting is enabled, this setting is ignored.\r\n ",
    "helpText": "",
    "name": "NoAddFromInternet",
    "displayName": "Hide the \"Add programs from Microsoft\" option (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddfrominternet_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddfrominternet_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_noaddfrominternet_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}