{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableKnownFolders",
        "Disable Known Folders",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/DisableKnownFolders",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsexplorer_disableknownfolders",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_windowsexplorer_disableknownfolders_disableknownfolders_prompt",
    "description": null,
    "helpText": "",
    "name": "DisableKnownFolders_Prompt",
    "displayName": "Disable these Known Folders. (User)",
    "defaultValue": null,
    "maximumCount": 1000,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_disableknownfolders_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_disableknownfolders"
        }
    ],
    "dependedOnBy": []
}