{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_URLforlocationofdocumenttemplatesPolicy",
        "URL for location of document templates displayed when applications do not recognize rights-managed documents",
        "\\Microsoft Office 2016\\Manage Restricted Permissions",
        "Microsoft Office 2016\\Manage Restricted Permissions",
        "Manage Restricted Permissions"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ManageRestrictedPermissions/L_URLforlocationofdocumenttemplatesPolicy",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_managerestrictedpermissions_l_urlforlocationofdocumenttemplatespolicy",
    "categoryId": "042ab9cf-9524-4dd4-b049-4d5f4ff7053f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_managerestrictedpermissions_l_urlforlocationofdocumenttemplatespolicy",
    "description": "Provide the path to a folder with document, spreadsheet, and presentation files to be used as templates for a unencrypted wrapper for files with rights-managed content received by users with older versions of Office. Office includes plain-text wrapper documents that notify users about a rights-managed document in certain circumstances. If the user's application cannot recognize a document that includes rights-management, the user receives the wrapper document with information such as instructions for downloading a Rights Management Add-on for Windows Internet Explorer. You can provide a folder with customized templates for Office to use for these plain-text wrappers by using this setting to specify a URL to a folder.",
    "helpText": "",
    "name": "L_URLforlocationofdocumenttemplatesPolicy",
    "displayName": "URL for location of document templates displayed when applications do not recognize rights-managed documents (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_managerestrictedpermissions_l_urlforlocationofdocumenttemplatespolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_managerestrictedpermissions_l_urlforlocationofdocumenttemplatespolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_managerestrictedpermissions_l_urlforlocationofdocumenttemplatespolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_managerestrictedpermissions_l_urlforlocationofdocumenttemplatespolicy_l_enteraurl",
                    "required": true
                }
            ]
        }
    ]
}