{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "QuietHoursDailyBeginMinute",
        "Set the time Quiet Hours begins each day",
        "\\Start Menu and Taskbar\\Notifications",
        "Administrative Templates\\Start Menu and Taskbar\\Notifications",
        "Notifications"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-wpn#admx-wpn-quiethoursdailybeginminute"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WPN/QuietHoursDailyBeginMinute",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute",
    "categoryId": "cb98f9d4-d921-4a8b-a763-cf69ce2ada62",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute",
    "description": "\r\n        This policy setting specifies the number of minutes after midnight (local time) that Quiet Hours is to begin each day.\r\n\r\n        If you enable this policy setting, the specified time will be used, and users will not be able to customize any Quiet Hours settings.\r\n\r\n        If you disable this policy setting, a default value will be used, and users will not be able to change it or any other Quiet Hours setting.\r\n\r\n        If you do not configure this policy setting, a default value will be used, which administrators and users will be able to modify.\r\n      \r\n ",
    "helpText": "",
    "name": "QuietHoursDailyBeginMinute",
    "displayName": "Set the time Quiet Hours begins each day (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute_quiethoursdailybeginminutecontrol",
                    "required": true
                }
            ]
        }
    ]
}