{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_NoReminders_1",
        "Turn off reminder balloons",
        "\\Network\\Offline Files",
        "Administrative Templates\\Network\\Offline Files",
        "Offline Files"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-offlinefiles#admx-offlinefiles-pol-noreminders-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_OfflineFiles/Pol_NoReminders_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_noreminders_1",
    "categoryId": "82a9c23f-2c09-4479-9cd3-e7f185d7676f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_offlinefiles_pol_noreminders_1",
    "description": "Hides or displays reminder balloons, and prevents users from changing the setting.\r\n\r\nReminder balloons appear above the Offline Files icon in the notification area to notify users when they have lost the connection to a networked file and are working on a local copy of the file. Users can then decide how to proceed.\r\n\r\nIf you enable this setting, the system hides the reminder balloons, and prevents users from displaying them.\r\n\r\nIf you disable the setting, the system displays the reminder balloons and prevents users from hiding them.\r\n\r\nIf this setting is not configured, reminder balloons are displayed by default when you enable offline files, but users can change the setting.\r\n\r\nTo prevent users from changing the setting while a setting is in effect, the system disables the \"Enable reminders\" option on the Offline Files tab\r\n\r\nThis setting appears in the Computer Configuration and User Configuration folders. If both settings are configured, the setting in Computer Configuration takes precedence over the setting in User Configuration.\r\n\r\nTip: To display or hide reminder balloons without establishing a setting, in Windows Explorer, on the Tools menu, click Folder Options, and then click the Offline Files tab. This setting corresponds to the \"Enable reminders\" check box.\r\n ",
    "helpText": "",
    "name": "Pol_NoReminders_1",
    "displayName": "Turn off reminder balloons (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_noreminders_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_noreminders_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_noreminders_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}