{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OutlookActivationAlertThreshold",
        "Specify activation disabling threshold for web extensions",
        "\\Microsoft Outlook 2016\\Security\\Trust Center",
        "Microsoft Outlook 2016\\Security\\Trust Center",
        "Trust Center"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_Security~L_TrustCenter/L_OutlookActivationAlertThreshold",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookactivationalertthreshold",
    "categoryId": "c3db5686-3bb2-437c-8906-60da1a1fa844",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookactivationalertthreshold",
    "description": "This policy setting allows you to specify the threshold that Outlook refers to before disabling a web extension during activation. \r\n\r\nIf you enable this policy setting, you can specify a threshold (in milliseconds) for the activation manager retry limit during an Outlook session. If the web extension requires more than the specified threshold for the number of occurrences specified by the activation manager retry limit during an Outlook session, Outlook disables the web extension. \r\n\r\nIf you disable or do not configure this policy setting, Outlook uses the default activation alert threshold of 1000 milliseconds. The maximum activation alert threshold is 10000 milliseconds, and the minimum activation alert threshold is 100 milliseconds.",
    "helpText": "",
    "name": "L_OutlookActivationAlertThreshold",
    "displayName": "Specify activation disabling threshold for web extensions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookactivationalertthreshold_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookactivationalertthreshold_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookactivationalertthreshold_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookactivationalertthreshold_l_outlookactivationalertthresholdspinid",
                    "required": true
                }
            ]
        }
    ]
}