{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RelyonVMLfordisplayinggraphicsinbrowsers",
        "Rely on VML for displaying graphics in browsers",
        "\\Microsoft Office 2016\\Tools | Options | General | Web Options...\\Browsers",
        "Microsoft Office 2016\\Tools | Options | General | Web Options...\\Browsers",
        "Browsers"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ToolsOptionsGeneralWebOptions~L_Browsers/L_RelyonVMLfordisplayinggraphicsinbrowsers",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions~l_browsers_l_relyonvmlfordisplayinggraphicsinbrowsers",
    "categoryId": "8ee1d8d2-582f-401b-927a-993016f4290d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions~l_browsers_l_relyonvmlfordisplayinggraphicsinbrowsers",
    "description": "This policy setting controls whether Office 2016 applications save standard raster file format (GIF or PNG) copies of Vector Markup Language (VML) graphics when documents are saved as Web pages.\r\n\r\nIf you enable this policy setting, Office 2016 applications will not generate alternate files for VML graphics when documents are saved as Web pages. In addition, the \"Rely on VML for displaying graphics in browsers\" check box is checked in the Web Options dialog in Excel, PowerPoint, and Word, and users cannot change it.\r\n\r\nIf you disable this policy setting, Office 2016 applications also save copies of the graphics in a standard raster file format (GIF or PNG) for use by browsers that cannot display VML. In addition, the \"Rely on VML for displaying graphics in browsers\" check box is cleared in the Web Options dialog in Excel, PowerPoint, and Word, and users cannot change it.\r\n\r\nIf you do not configure this policy setting, when saving VML graphics, Office 2016 applications also save copies of the graphics in a standard raster file format (GIF or PNG) for use by browsers that cannot display VML. If the \"Rely on VML for displaying graphics in browsers\" check box in the Web Options dialog is selected, applications will not save raster copies of VML graphics, which means those graphics will not display in non-Microsoft browsers.",
    "helpText": "",
    "name": "L_RelyonVMLfordisplayinggraphicsinbrowsers",
    "displayName": "Rely on VML for displaying graphics in browsers (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions~l_browsers_l_relyonvmlfordisplayinggraphicsinbrowsers_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions~l_browsers_l_relyonvmlfordisplayinggraphicsinbrowsers_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsoptionsgeneralweboptions~l_browsers_l_relyonvmlfordisplayinggraphicsinbrowsers_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}