{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "sz_AdminComponents_Title",
        "Add/Delete items",
        "\\Desktop\\Desktop",
        "Administrative Templates\\Desktop\\Desktop",
        "Desktop"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/sz_AdminComponents_Title",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title",
    "categoryId": "a69e7a98-5af7-4834-bae1-2a1047663a71",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title_sz_atc_adminadditem",
    "description": null,
    "helpText": "",
    "name": "sz_ATC_AdminAddItem",
    "displayName": "Enter URL(s) of desktop item(s) to Add (space separated): (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title"
        }
    ],
    "dependedOnBy": []
}