{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "QuietHoursDailyBeginMinute",
        "Set the time Quiet Hours begins each day",
        "\\Start Menu and Taskbar\\Notifications",
        "Administrative Templates\\Start Menu and Taskbar\\Notifications",
        "Notifications"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WPN/QuietHoursDailyBeginMinute",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute",
    "categoryId": "cb98f9d4-d921-4a8b-a763-cf69ce2ada62",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute_quiethoursdailybeginminutecontrol",
    "description": null,
    "helpText": "",
    "name": "QuietHoursDailyBeginMinuteControl",
    "displayName": "Minutes after midnight: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 1439,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_wpn_quiethoursdailybeginminute"
        }
    ],
    "dependedOnBy": []
}