{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RestrictCharacterCodeRangeOfConversion",
        "Restrict character code range of conversion",
        "\\Windows Components\\IME",
        "Administrative Templates\\Windows Components\\IME",
        "IME"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eaime#admx-eaime-l-restrictcharactercoderangeofconversion"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EAIME/L_RestrictCharacterCodeRangeOfConversion",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion",
    "categoryId": "ba1d333c-e19b-4470-bbab-d040a633c3a3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion",
    "description": "This policy setting allows you to restrict character code range of conversion by setting character filter.\r\n\r\nIf you enable this policy setting, then only the character code ranges specified by this policy setting are used for conversion of IME.  You can specify multiple ranges by setting a value combined with a bitwise OR of following values:\r\n\r\n0x0001 // JIS208 area\r\n0x0002 // NEC special char code\r\n0x0004 // NEC selected IBM extended code\r\n0x0008 // IBM extended code\r\n0x0010 // Half width katakana code\r\n0x0100 // EUDC(GAIJI)\r\n0x0200 // S-JIS unmapped area\r\n0x0400 // Unicode char\r\n0x0800 // surrogate char\r\n0x1000 // IVS char\r\n0xFFFF // no definition.\r\n\r\nIf you disable or do not configure this policy setting, no range of characters are filtered by default.\r\n\r\nThis policy setting applies to Japanese Microsoft IME only.\r\n\r\nNote: Changes to this setting will not take effect until the user logs off.\r\n ",
    "helpText": "",
    "name": "L_RestrictCharacterCodeRangeOfConversion",
    "displayName": "Restrict character code range of conversion (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_eaime_l_restrictcharactercoderangeofconversion_l_restrictcharactercoderangeofconversionid",
                    "required": true
                }
            ]
        }
    ]
}