{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WerArchive_1",
        "Configure Report Archive",
        "\\Windows Components\\Windows Error Reporting\\Advanced Error Reporting Settings",
        "Administrative Templates\\Windows Components\\Windows Error Reporting\\Advanced Error Reporting Settings",
        "Advanced Error Reporting Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-errorreporting#admx-errorreporting-werarchive-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ErrorReporting/WerArchive_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_errorreporting_werarchive_1",
    "categoryId": "23e93393-4a75-44e6-9693-208eedb06976",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_errorreporting_werarchive_1",
    "description": "This policy setting controls the behavior of the Windows Error Reporting archive.\r\n\r\nIf you enable this policy setting, you can configure Windows Error Reporting archiving behavior. If Archive behavior is set to Store all, all data collected for each error report is stored in the appropriate location. If Archive behavior is set to Store parameters only, only the minimum information required to check for an existing solution is stored. The Maximum number of reports to store setting determines how many reports are stored before older reports are automatically deleted.\r\n\r\nIf you disable or do not configure this policy setting, no Windows Error Reporting information is stored.\r\n ",
    "helpText": "",
    "name": "WerArchive_1",
    "displayName": "Configure Report Archive (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_errorreporting_werarchive_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_errorreporting_werarchive_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_errorreporting_werarchive_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_errorreporting_werarchive_1_werarchivebehavior",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_errorreporting_werarchive_1_wermaxarchivecount",
                    "required": true
                }
            ]
        }
    ]
}