{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoGetPrograms",
        "Hide \"Get Programs\" page",
        "\\Control Panel\\Programs",
        "Administrative Templates\\Control Panel\\Programs",
        "Programs"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-programs#admx-programs-nogetprograms"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Programs/NoGetPrograms",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_programs_nogetprograms",
    "categoryId": "f4eaa5be-1498-482e-abe6-de4fed7e3302",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_programs_nogetprograms",
    "description": "Prevents users from viewing or installing published programs from the network.  \r\n\r\nThis setting prevents users from accessing the \"Get Programs\" page from the Programs Control Panel in Category View, Programs and Features in Classic View and the \"Install a program from the netowrk\" task.  The \"Get Programs\" page lists published programs and provides an easy way to install them.\r\n\r\nPublished programs are those programs that the system administrator has explicitly made available to the user with a tool such as Windows Installer.  Typically, system administrators publish programs to notify users of their availability, to recommend their use, or to enable users to install them without having to search for installation files.\r\n\r\nIf this setting is enabled, users cannot view the programs that have been published by the system administrator, and they cannot use the \"Get Programs\" page to install published programs.  Enabling this feature does not prevent users from installing programs by using other methods.  Users will still be able to view and installed assigned (partially installed) programs that are offered on the desktop or on the Start menu.\r\n\r\nIf this setting is disabled or is not configured, the \"Install a program from the network\" task to the \"Get Programs\" page will be available to all users.\r\n\r\nNote:  If the \"Hide Programs Control Panel\" setting is enabled, this setting is ignored.\n ",
    "helpText": "",
    "name": "NoGetPrograms",
    "displayName": "Hide \"Get Programs\" page (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_programs_nogetprograms_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_programs_nogetprograms_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_programs_nogetprograms_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}