{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Overridepublishedsyncinterval",
        "Override published sync interval",
        "\\Microsoft Outlook 2016\\Account Settings\\RSS Feeds",
        "Microsoft Outlook 2016\\Account Settings\\RSS Feeds",
        "RSS Feeds"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_ToolsAccounts~L_RSSSubscriptions/L_Overridepublishedsyncinterval",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_rsssubscriptions_l_overridepublishedsyncinterval",
    "categoryId": "4e349e4a-dd0b-4175-8974-a2a0f5e35b4d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_rsssubscriptions_l_overridepublishedsyncinterval",
    "description": "This policy setting allows you to ignore the synchronization interval specified by the RSS publisher.  By default, Outlook follows the synchronization interval specified by the RSS publisher and RSS Feeds will not be synchronized more often than allowed by the RSS publisher.  If Outlook does not follow the RSS publisher's synchronization interval, the RSS publisher may suspend Outlook from synchronizing the RSS Feed.\r\n\r\nIf you enable this policy setting, Outlook will always ignore the synchronization interval specified by the RSS publisher.\r\n\r\nIf you disable or do not configure this policy setting, Outlook will always follow the synchronization interval specified by the RSS publisher.",
    "helpText": "",
    "name": "L_Overridepublishedsyncinterval",
    "displayName": "Override published sync interval (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_rsssubscriptions_l_overridepublishedsyncinterval_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_rsssubscriptions_l_overridepublishedsyncinterval_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_rsssubscriptions_l_overridepublishedsyncinterval_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}