{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ConfigureMMSProxySettings",
        "Configure MMS Proxy",
        "\\Windows Components\\Windows Media Player\\Networking",
        "Administrative Templates\\Windows Components\\Windows Media Player\\Networking",
        "Networking"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/ConfigureMMSProxySettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings",
    "categoryId": "c7c32942-a139-4d7e-a19e-3495d5e372e7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_proxytype",
    "description": null,
    "helpText": "",
    "name": "Proxytype",
    "displayName": "Proxy type (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_proxytype_3",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_proxytype_3",
            "description": null,
            "helpText": null,
            "name": "Autodetect",
            "displayName": "Autodetect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_proxytype_2",
            "description": null,
            "helpText": null,
            "name": "Custom",
            "displayName": "Custom",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}