{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableFRAdminPinByFolder",
        "Do not automatically make specific redirected folders available offline",
        "\\System\\Folder Redirection",
        "Administrative Templates\\System\\Folder Redirection",
        "Folder Redirection"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-folderredirection#admx-folderredirection-disablefradminpinbyfolder"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FolderRedirection/DisableFRAdminPinByFolder",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder",
    "categoryId": "41081a6b-ec9f-4b4f-b6ae-1d4dda162654",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder",
    "description": "This policy setting allows you to control whether individual redirected shell folders are available offline by default.\r\n\r\nFor the folders affected by this setting, users must manually select the files they wish to make available offline.\r\n\r\nIf you disable or do not configure this policy setting, all redirected shell folders are automatically made available offline. All subfolders within the redirected folders are also made available offline.\r\n\r\nNote: This policy setting does not prevent files from being automatically cached if the network share is configured for \"Automatic Caching\", nor does it affect the availability of the \"Always available offline\" menu option in the user interface.\r\n\r\nNote: The configuration of this policy for any folder will override the configured value of \"Do not automatically make all redirected folders available offline\".\r\n ",
    "helpText": "",
    "name": "DisableFRAdminPinByFolder",
    "displayName": "Do not automatically make specific redirected folders available offline (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinappdataroaming",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepindesktop",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinstartmenu",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepindocuments",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinpictures",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinmusic",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinvideos",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinfavorites",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepincontacts",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepindownloads",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinlinks",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinsearches",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinsavedgames",
                    "required": true
                }
            ]
        }
    ]
}