{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_GATEWAY_POLICY_SERVER",
        "Set RD Gateway server address",
        "\\Windows Components\\Remote Desktop Services\\RD Gateway",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\RD Gateway",
        "RD Gateway"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_GATEWAY_POLICY_SERVER",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_server",
    "categoryId": "85c586a6-6b68-48b2-8050-c4fb86aff486",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_server_ts_gateway_server",
    "description": null,
    "helpText": "",
    "name": "TS_GATEWAY_SERVER",
    "displayName": "Set RD Gateway server address (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 260,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_server_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_server"
        }
    ],
    "dependedOnBy": []
}