{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Acronyms",
        "Remove the Acronyms command from the ribbon",
        "\\Microsoft Word 2016\\Word Options\\General",
        "Microsoft Word 2016\\Word Options\\General",
        "General"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v3~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_OptionsGeneral/L_Acronyms",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v3~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_acronyms",
    "categoryId": "bd69fa31-677f-4d3d-bd4c-91ab1cd0dcb4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v3~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_acronyms",
    "description": "This policy setting allows you to remove the Acronyms command from the ribbon. The Acronyms command appears on the References tab.\r\n\r\nIf you enable this policy setting, the Acronyms command is removed from the ribbon. Users won't be able to add the Acronyms command to the ribbon manually. Therefore users won't be able to use the Acronyms feature.\r\n\r\nIf you disable or don't configure this policy setting, the Acronyms command appears on the ribbon.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Office 365 ProPlus.\r\n      ",
    "helpText": "",
    "name": "L_Acronyms",
    "displayName": "Remove the Acronyms command from the ribbon (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v3~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_acronyms_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v3~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_acronyms_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v3~policy~l_microsoftofficeword~l_wordoptions~l_optionsgeneral_l_acronyms_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}