{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffFileSynchronizationViaSOAPOverHTTP",
        "Turn off file synchronization via SOAP over HTTP",
        "\\Microsoft PowerPoint 2016\\Miscellaneous\\Server Settings",
        "Microsoft PowerPoint 2016\\Miscellaneous\\Server Settings",
        "Server Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ppt16v2~Policy~L_MicrosoftOfficePowerPoint~L_miscellaneous160~L_ServerSettings/L_TurnOffFileSynchronizationViaSOAPOverHTTP",
    "rootDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_miscellaneous160~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp",
    "categoryId": "7aeaf6f8-5511-4216-9483-28f432a5a08f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_miscellaneous160~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp",
    "description": "This policy setting controls file synchronization via SOAP over HTTP for PowerPoint.\r\n\r\nIf you enable this policy setting, file synchronization via SOAP over HTTP is turned off for PowerPoint.\r\n\r\nIf you disable or do not configure this policy setting this policy setting, file synchronization via SOAP over HTTP is turned on for PowerPoint.\r\n\r\nNote: Turning off file synchronization via SOAP over HTTP will also prevent co-authoring and adversely affect the behavior of SharePoint Workspaces.",
    "helpText": "",
    "name": "L_TurnOffFileSynchronizationViaSOAPOverHTTP",
    "displayName": "Turn off file synchronization via SOAP over HTTP (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_miscellaneous160~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_miscellaneous160~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_miscellaneous160~l_serversettings_l_turnofffilesynchronizationviasoapoverhttp_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}