{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RefreshFrequencyLimit",
        "Set refresh frequency limit",
        "\\Microsoft Office 2016\\Business Data\\Synchronization",
        "Microsoft Office 2016\\Business Data\\Synchronization",
        "Synchronization"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_BusinessData~L_Synchronization/L_RefreshFrequencyLimit",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_businessdata~l_synchronization_l_refreshfrequencylimit",
    "categoryId": "a6e0cee7-34a0-4ca2-b4da-f819a057b532",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_businessdata~l_synchronization_l_refreshfrequencylimit",
    "description": "This policy setting allows you to enforce a lower limit in minutes for the refresh interval.  Refreshing subscriptions too frequently can overload the LOB systems or the network with too many requests.\r\n\r\nIf you enable this policy setting, you may specify the number of minutes for the refresh interval.  This limit prevents cache subscriptions from being refreshed more frequently, reducing the number of requests issued against the line-of-business (LOB) system.\r\n\r\nIf you disable or do not configure this policy setting, a default limit of 10 minutes will be used.",
    "helpText": "",
    "name": "L_RefreshFrequencyLimit",
    "displayName": "Set refresh frequency limit (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_businessdata~l_synchronization_l_refreshfrequencylimit_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_businessdata~l_synchronization_l_refreshfrequencylimit_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_businessdata~l_synchronization_l_refreshfrequencylimit_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_businessdata~l_synchronization_l_refreshfrequencylimit_l_refreshfrequencylimitdecimal",
                    "required": true
                }
            ]
        }
    ]
}