{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ConfigureMMSProxySettings",
        "Configure MMS Proxy",
        "\\Windows Components\\Windows Media Player\\Networking",
        "Administrative Templates\\Windows Components\\Windows Media Player\\Networking",
        "Networking"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/ConfigureMMSProxySettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings",
    "categoryId": "c7c32942-a139-4d7e-a19e-3495d5e372e7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_donotuseproxylocal",
    "description": null,
    "helpText": "",
    "name": "DoNotUseProxyLocal",
    "displayName": "Do not use proxy server for addresses beginning with (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_configuremmsproxysettings"
        }
    ],
    "dependedOnBy": []
}