{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MMC_GroupPolicyTab",
        "Group Policy tab for Active Directory Tools",
        "\\Windows Components\\Microsoft Management Console\\Restricted/Permitted snap-ins\\Group Policy",
        "Administrative Templates\\Windows Components\\Microsoft Management Console\\Restricted/Permitted snap-ins\\Group Policy",
        "Group Policy"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-mmcsnapins#admx-mmcsnapins-mmc-grouppolicytab"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MMCSnapins/MMC_GroupPolicyTab",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_mmcsnapins_mmc_grouppolicytab",
    "categoryId": "3d32fb39-ff23-48d9-9890-c8625d2d21e9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_mmcsnapins_mmc_grouppolicytab",
    "description": "Permits or prohibits use of the Group Policy tab in property sheets for the Active Directory Users and Computers and Active Directory Sites and Services snap-ins.\r\n\r\nIf you enable this setting, the Group Policy tab is displayed in the property sheet for a site, domain, or organizational unit displayed by the Active Directory Users and Computers and Active Directory Sites and Services snap-ins. If you disable the setting, the Group Policy tab is not displayed in those snap-ins.\r\n\r\nIf this setting is not configured, the setting of the \"Restrict users to the explicitly permitted list of snap-ins\" setting determines whether this tab is displayed.\r\n\r\n--  If \"Restrict users to the explicitly permitted list of snap-ins\" is enabled, users will not have access to the Group Policy tab.\r\n\r\n    To explicitly permit use of the Group Policy tab, enable this setting. If this setting is not configured (or disabled), the Group Policy tab is inaccessible.\r\n\r\n--  If \"Restrict users to the explicitly permitted list of snap-ins\" is disabled or not configured, users will have access to the Group Policy tab.\r\n\r\n    To explicitly prohibit use of the Group Policy tab, disable this setting. If this setting is not configured (or enabled), the Group Policy tab is accessible.\r\n\r\nWhen the Group Policy tab is inaccessible, it does not appear in the site, domain, or organizational unit property sheets.",
    "helpText": "",
    "name": "MMC_GroupPolicyTab",
    "displayName": "Group Policy tab for Active Directory Tools (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_mmcsnapins_mmc_grouppolicytab_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_mmcsnapins_mmc_grouppolicytab_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_mmcsnapins_mmc_grouppolicytab_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}