{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TurnOffHighlightMisspelledWords",
        "Turn off highlight misspelled words",
        "\\Control Panel\\Regional and Language Options",
        "Administrative Templates\\Control Panel\\Regional and Language Options",
        "Regional and Language Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-turnoffhighlightmisspelledwords"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/TurnOffHighlightMisspelledWords",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_globalization_turnoffhighlightmisspelledwords",
    "categoryId": "18db3d59-661b-47ec-900a-bf75495ca598",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_globalization_turnoffhighlightmisspelledwords",
    "description": "\r\n        This policy turns off the highlight misspelled words option. This does not, however, prevent the user or an application from changing the setting programmatically.\r\n\r\n        The highlight misspelled words option controls whether or next spelling errors in typed text will be highlighted.\r\n\r\n        If the policy is Enabled, then the option will be locked to not highlight misspelled words.\r\n\r\n        If the policy is Disabled or Not Configured, then the user will be free to change the setting according to their preference.\r\n\r\n        Note that the availability and function of this setting is dependent on supported languages being enabled.\r\n ",
    "helpText": "",
    "name": "TurnOffHighlightMisspelledWords",
    "displayName": "Turn off highlight misspelled words (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_globalization_turnoffhighlightmisspelledwords_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_turnoffhighlightmisspelledwords_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_turnoffhighlightmisspelledwords_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}