{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AutoLaunchProtocolsFromOrigins",
        "Define a list of protocols that can launch an external application from listed origins without prompting the user",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev85diff~Policy~microsoft_edge/AutoLaunchProtocolsFromOrigins",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev85diff~policy~microsoft_edge_autolaunchprotocolsfromorigins",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_microsoft_edgev85diff~policy~microsoft_edge_autolaunchprotocolsfromorigins",
    "description": "Allows you to set a list of protocols, and for each protocol an associated list of allowed origin patterns, that can launch an external application without prompting the user. The trailing separator should not be included when listing the protocol. For example, list \"skype\" instead of \"skype:\" or \"skype://\".\r\n\r\nIf you configure this policy, a protocol will only be permitted to launch an external application without prompting by policy if:\r\n\r\n- the protocol is listed\r\n\r\n- the origin of the site trying to launch the protocol matches one of the origin patterns in that protocol's allowed_origins list.\r\n\r\nIf either condition is false, the external protocol launch prompt will not be omitted by policy.\r\n\r\nIf you don't configure this policy, no protocols can launch without a prompt. Users can opt out of prompts on a per-protocol/per-site basis unless the 'ExternalProtocolDialogShowAlwaysOpenCheckbox' (Show an \"Always open\" checkbox in external protocol dialog) policy is set to Disabled. This policy has no impact on per-protocol/per-site prompt exemptions set by users.\r\n\r\nThe origin matching patterns use a similar format to those for the 'URLBlocklist' (Block access to a list of URLs) policy, which are documented at https://go.microsoft.com/fwlink/?linkid=2095322.\r\n\r\nHowever, origin matching patterns for this policy cannot contain \"/path\" or \"@query\" elements. Any pattern that does contain a \"/path\" or \"@query\" element will be ignored.\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"allowed_origins\": [\r\n      \"example.com\", \r\n      \"http://www.example.com:8080\"\r\n    ], \r\n    \"protocol\": \"spotify\"\r\n  }, \r\n  {\r\n    \"allowed_origins\": [\r\n      \"https://example.com\", \r\n      \"https://.mail.example.com\"\r\n    ], \r\n    \"protocol\": \"teams\"\r\n  }, \r\n  {\r\n    \"allowed_origins\": [\r\n      \"*\"\r\n    ], \r\n    \"protocol\": \"outlook\"\r\n  }\r\n]",
    "helpText": "",
    "name": "AutoLaunchProtocolsFromOrigins",
    "displayName": "Define a list of protocols that can launch an external application from listed origins without prompting the user (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev85diff~policy~microsoft_edge_autolaunchprotocolsfromorigins_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev85diff~policy~microsoft_edge_autolaunchprotocolsfromorigins_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev85diff~policy~microsoft_edge_autolaunchprotocolsfromorigins_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev85diff~policy~microsoft_edge_autolaunchprotocolsfromorigins_autolaunchprotocolsfromorigins",
                    "required": true
                }
            ]
        }
    ]
}