{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PW_PromptPasswordOnResume",
        "Prompt for password on resume from hibernate/suspend",
        "\\System\\Power Management",
        "Administrative Templates\\System\\Power Management",
        "Power Management"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-power#admx-power-pw-promptpasswordonresume"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/PW_PromptPasswordOnResume",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_power_pw_promptpasswordonresume",
    "categoryId": "62b373da-c112-40f4-9047-9cc3e8d8ab13",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_power_pw_promptpasswordonresume",
    "description": "This policy setting allows you to configure client computers to lock and prompt for a password when resuming from a hibernate or suspend state.\r\n\r\nIf you enable this policy setting, the client computer is locked and prompted for a password when it is resumed from a suspend or hibernate state.\r\n\r\nIf you disable or do not configure this policy setting, users control if their computer is automatically locked or not after performing a resume operation.\r\n ",
    "helpText": "",
    "name": "PW_PromptPasswordOnResume",
    "displayName": "Prompt for password on resume from hibernate/suspend (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_power_pw_promptpasswordonresume_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_power_pw_promptpasswordonresume_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_power_pw_promptpasswordonresume_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}