{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AutoImportAtFirstRun",
        "Automatically import another browser's data and settings at first run",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/AutoImportAtFirstRun",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_autoimportatfirstrun",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_autoimportatfirstrun",
    "description": "If you enable this policy, all supported datatypes and settings from the specified browser will be silently and automatically imported at first run. During the First Run Experience, the import section will also be skipped.\r\n\r\nThe browser data from Microsoft Edge Legacy will always be silently migrated at the first run, irrespective of the value of this policy. You can use the following values for this policy:\r\n\r\n* 0 = Automatically imports all supported datatypes and settings from the default browser\r\n\r\n* 1 = Automatically imports all supported datatypes and settings from Internet Explorer\r\n\r\n* 2 = Automatically imports all supported datatypes and settings from Google Chrome\r\n\r\n* 3 = Automatically imports all supported datatypes and settings from Safari\r\n\r\n* 4 = Disables automatic import, and the import section of the first-run experience is skipped\r\n\r\n* 5 = Automatically imports all supported datatypes and settings from Mozilla Firefox\r\n\r\nIf this policy is set to the default value (0), then the datatypes corresponding to the default browser on the managed device will be imported.\r\n\r\nIf the browser specified as the value of this policy is not present in the managed device, Microsoft Edge will simply skip the import without any notification to the user.\r\n\r\nIf you set this policy to 'DisabledAutoImport' (4), the import section of the first-run experience is skipped entirely and Microsoft Edge doesn't import browser data and settings automatically.\r\n\r\nIf this policy is set to the value of Internet Explorer (1), the following datatypes will be imported from Internet Explorer:\r\n1. Favorites or bookmarks\r\n2. Saved passwords\r\n3. Search engines\r\n4. Browsing history\r\n5. Home page\r\n\r\nIf this policy is set to the value of Google Chrome (2), the following datatypes will be imported from Google Chrome:\r\n1. Favorites\r\n2. Saved passwords\r\n3. Addresses and more\r\n4. Payment info\r\n5. Browsing history\r\n6. Settings\r\n7. Pinned and Open tabs\r\n8. Extensions\r\n9. Cookies\r\n\r\nNote: For more details on what is imported from Google Chrome, please see https://go.microsoft.com/fwlink/?linkid=2120835\r\n\r\nIf this policy is set to the value of Safari (3), the following datatypes will be imported from Safari:\r\n1. Favorites or bookmarks\r\n2. Browsing history\r\n\r\nStarting with Microsoft Edge version 83, if this policy is set to the value of Mozilla Firefox (5), the following datatypes will be imported from Mozilla Firefox:\r\n1. Favorites or bookmarks\r\n2. Saved passwords\r\n3. Addresses and more\r\n4. Browsing History\r\n\r\nIf you want to restrict specific datatypes from getting imported on the managed devices, you can use this policy with other policies such as 'ImportAutofillFormData' (Allow importing of autofill form data), 'ImportBrowserSettings' (Allow importing of browser settings), 'ImportFavorites' (Allow importing of favorites), and etc.",
    "helpText": "",
    "name": "AutoImportAtFirstRun",
    "displayName": "Automatically import another browser's data and settings at first run (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_autoimportatfirstrun_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_autoimportatfirstrun_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_autoimportatfirstrun_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_autoimportatfirstrun_autoimportatfirstrun",
                    "required": true
                }
            ]
        }
    ]
}