{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnforcePoliciesOnly",
        "Enforce Show Policies Only",
        "\\System\\Group Policy",
        "Administrative Templates\\System\\Group Policy",
        "Group Policy"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-grouppolicy#admx-grouppolicy-enforcepoliciesonly"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/EnforcePoliciesOnly",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_grouppolicy_enforcepoliciesonly",
    "categoryId": "deadde1d-7e7f-4577-bd6e-fc237c3854c5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_grouppolicy_enforcepoliciesonly",
    "description": "This policy setting prevents administrators from viewing or using Group Policy preferences.\r\n\r\nA Group Policy administration (.adm) file can contain both true settings and preferences. True settings, which are fully supported by Group Policy, must use registry entries in the Software\\Policies or Software\\Microsoft\\Windows\\CurrentVersion\\Policies registry subkeys. Preferences, which are not fully supported, use registry entries in other subkeys.\r\n\r\nIf you enable this policy setting, the \"Show Policies Only\" command is turned on, and administrators cannot turn it off. As a result, Group Policy Object Editor displays only true settings; preferences do not appear.\r\n\r\nIf you disable or do not configure this policy setting, the \"Show Policies Only\" command is turned on by default, but administrators can view preferences by turning off the \"Show Policies Only\" command.\r\n\r\nNote: To find the \"Show Policies Only\" command, in Group Policy Object Editor, click the Administrative Templates folder (either one), right-click the same folder, and then point to \"View.\"\r\n\r\nIn Group Policy Object Editor, preferences have a red icon to distinguish them from true settings, which have a blue icon.\r\n ",
    "helpText": "",
    "name": "EnforcePoliciesOnly",
    "displayName": "Enforce Show Policies Only (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_grouppolicy_enforcepoliciesonly_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_enforcepoliciesonly_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_enforcepoliciesonly_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}