{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SearchbarAllowed",
        "Enable the Search bar",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev117~Policy~microsoft_edge/SearchbarAllowed",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_searchbarallowed",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_searchbarallowed",
    "description": "Enables the search bar. When enabled, users can use the search bar to search the web from their desktop or from an application. The search bar provides a search box, powered by Edge default search engine, that shows web suggestions and opens all web searches in Microsoft Edge. The search bar can be launched from the \"More tools\" menu or jump list in Microsoft Edge.\r\n\r\nIf you enable or don't configure this policy:\r\nThe search bar will be automatically enabled for all profiles.\r\nThe option to enable the search bar at startup will be toggled on if the 'SearchbarIsEnabledOnStartup' (Allow the Search bar at Windows startup) policy is enabled.\r\nIf the 'SearchbarIsEnabledOnStartup' is disabled or not configured, the option to enable the search bar at startup will be toggled off.\r\nUsers will see the menu item to launch the search bar from the Microsoft Edge \"More tools\" menu. Users can launch the search bar from \"More tools\".\r\nUsers will see the menu item to launch the search bar from the Microsoft Edge jump list menu. Users can launch the search bar from the Microsoft Edge jump list menu.\r\nThe search bar can be turned off by the \"Quit\" option in the System tray or by closing the search bar from the 3 dot menu. The search bar will be restarted on system reboot if auto-start is enabled.\r\n\r\n\r\nIf you disable this policy:\r\nThe search bar will be disabled for all profiles.\r\nThe option to launch the search bar from Microsoft Edge \"More tools\" menu will be disabled.\r\nThe option to launch the search bar from Microsoft Edge jump list menu will be disabled.",
    "helpText": "",
    "name": "SearchbarAllowed",
    "displayName": "Enable the Search bar (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_searchbarallowed_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_searchbarallowed_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_searchbarallowed_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}