{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WindowsStreamingMediaProtocols",
        "Streaming Media Protocols",
        "\\Windows Components\\Windows Media Player\\Networking",
        "Administrative Templates\\Windows Components\\Windows Media Player\\Networking",
        "Networking"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsmediaplayer#admx-windowsmediaplayer-windowsstreamingmediaprotocols"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/WindowsStreamingMediaProtocols",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols",
    "categoryId": "c7c32942-a139-4d7e-a19e-3495d5e372e7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols",
    "description": "This policy setting allows you to specify that Windows Media Player can attempt to use selected protocols when receiving streaming media from a server running Windows Media Services.\r\n\r\nIf you enable this policy setting, the protocols that are selected on the Network tab of the Player are used to receive a stream initiated through an MMS or RTSP URL from a Windows Media server. If the RSTP/UDP check box is selected, a user can specify UDP ports in the Use ports check box. If the user does not specify UDP ports, the Player uses default ports when using the UDP protocol. This policy setting also specifies that multicast streams can be received if the \"Allow the Player to receive multicast streams\" check box on the Network tab is selected.\r\n\r\nIf you enable this policy setting, the administrator must also specify the protocols that are available to users on the Network tab. If the administrator does not specify any protocols, the Player cannot access an MMS or RTSP URL from a Windows Media server. If the \"Hide network tab\" policy setting is enabled, the entire Network tab is hidden.\r\n\r\nIf you do not configure this policy setting, users can select the protocols to use on the Network tab.\r\n\r\nIf you disable this policy setting, the Protocols for MMS URLs and Multicast streams areas of the Network tab are not available and the Player cannot receive an MMS or RTSP stream from a Windows Media server.\r\n ",
    "helpText": "",
    "name": "WindowsStreamingMediaProtocols",
    "displayName": "Streaming Media Protocols (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_multicastcheckbox",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_udpcheckbox",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_udpports",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_tcpcheckbox",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_windowsmediaplayer_windowsstreamingmediaprotocols_httpcheckbox",
                    "required": true
                }
            ]
        }
    ]
}