{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_LanChangeProperties",
        "Prohibit access to properties of components of a LAN connection",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-networkconnections#admx-networkconnections-nc-lanchangeproperties"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_LanChangeProperties",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_lanchangeproperties",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_networkconnections_nc_lanchangeproperties",
    "description": "Determines whether Administrators and Network Configuration Operators can change the properties of components used by a LAN connection.\r\n\r\nThis setting determines whether the Properties button for components of a LAN connection is enabled.\r\n\r\nIf you enable this setting (and enable the \"Enable Network Connections settings for Administrators\" setting), the Properties button is disabled for Administrators. Network Configuration Operators are prohibited from accessing connection components, regardless of the \"Enable Network Connections settings for Administrators\" setting.\r\n\r\nImportant: If the \"Enable Network Connections settings for Administrators\" is disabled or not configured, this setting does not apply to administrators on post-Windows 2000 computers.\r\n\r\nIf you disable this setting or do not configure it, the Properties button is enabled for administrators and Network Configuration Operators.\r\n\r\nThe Local Area Connection Properties dialog box includes a list of the network components that the connection uses. To view or change the properties of a component, click the name of the component, and then click the Properties button beneath the component list.\r\n\r\nNote: Not all network components have configurable properties. For components that are not configurable, the Properties button is always disabled.\r\n\r\nNote: When the \"Prohibit access to properties of a LAN connection\" setting is enabled, users are blocked from accessing the Properties button for LAN connection components.\r\n\r\nNote: Network Configuration Operators only have permission to change TCP/IP properties. Properties for all other components are unavailable to these users.\r\n\r\nNote: Nonadministrators are already prohibited from accessing properties of components for a LAN connection, regardless of this setting.\r\n ",
    "helpText": "",
    "name": "NC_LanChangeProperties",
    "displayName": "Prohibit access to properties of components of a LAN connection (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_lanchangeproperties_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_lanchangeproperties_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_lanchangeproperties_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}