{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PersonalizationHomeUseProgram",
        "Show in-product notifications for the Microsoft Home Use Program",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v7~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_PersonalizationHomeUseProgram",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_miscellaneous437_l_personalizationhomeuseprogram",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_miscellaneous437_l_personalizationhomeuseprogram",
    "description": "This policy setting controls whether notifications about the Microsoft Home Use Program (HUP) are displayed to end-users in Office applications.\r\n\r\nIf you enable this policy setting, Office will occasionally notify end-users if they are eligible to purchase an Office subscription for their personal use at a discount via the Microsoft Home Use Program. End-users can permanently opt-out of these notifications at any time using a button within the notification.\r\n\r\nIf you disable this policy setting, Office will not display any notifications related to the Microsoft Home Use Program.\r\n\r\nIf you don't configure this policy setting, Microsoft will control whether or not these notifications appear. Please check the Message Center in the Microsoft 365 admin center for updates on whether this feature has been enabled by Microsoft yet and the default setting for the notifications.\r\n\r\nFor more information, see https://aka.ms/huplearnmore.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise, and to subscription versions of Project and Visio.",
    "helpText": "",
    "name": "L_PersonalizationHomeUseProgram",
    "displayName": "Show in-product notifications for the Microsoft Home Use Program (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_miscellaneous437_l_personalizationhomeuseprogram_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_miscellaneous437_l_personalizationhomeuseprogram_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v7~policy~l_microsoftofficesystem~l_miscellaneous437_l_personalizationhomeuseprogram_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}