{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DoNotIncludeTheOnlineArchiveInAllMailItemSearch",
        "Do not include the Online Archive in All Mail Item search",
        "\\Microsoft Outlook 2016\\Outlook Options\\Preferences\\Search Options",
        "Microsoft Outlook 2016\\Outlook Options\\Preferences\\Search Options",
        "Search Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Preferences~L_SearchOptions/L_DoNotIncludeTheOnlineArchiveInAllMailItemSearch",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_searchoptions_l_donotincludetheonlinearchiveinallmailitemsearch",
    "categoryId": "d0a1763a-5cdf-4672-8596-435ec1d94b54",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_searchoptions_l_donotincludetheonlinearchiveinallmailitemsearch",
    "description": "This policy sets the default action in All Mail Item search to not include search results from the Online Archive.\r\n\r\nIf you enable this policy setting, search results from the Online Archive will not be included in an All Mail Item search in Outlook.\r\n\r\nIf you disable or do not configure this policy setting, search results from the Online Archive will be included in an All Mail Item search in Outlook.",
    "helpText": "",
    "name": "L_DoNotIncludeTheOnlineArchiveInAllMailItemSearch",
    "displayName": "Do not include the Online Archive in All Mail Item search (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_searchoptions_l_donotincludetheonlinearchiveinallmailitemsearch_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_searchoptions_l_donotincludetheonlinearchiveinallmailitemsearch_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_preferences~l_searchoptions_l_donotincludetheonlinearchiveinallmailitemsearch_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}