{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SpecifyWaitOnSendTimeoutForDLPEvaluation",
        "Specify wait time to evaluate sensitive content",
        "\\Microsoft Outlook 2016\\Outlook Options\\Mail\\Compose Messages",
        "Microsoft Outlook 2016\\Outlook Options\\Mail\\Compose Messages",
        "Compose Messages"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v11~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Mail~L_ComposeMessages/L_SpecifyWaitOnSendTimeoutForDLPEvaluation",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v11~policy~l_microsoftofficeoutlook~l_outlookoptions~l_mail~l_composemessages_l_specifywaitonsendtimeoutfordlpevaluation",
    "categoryId": "e87c8824-e7c4-4fca-a3c1-0376d45d7f9f",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v11~policy~l_microsoftofficeoutlook~l_outlookoptions~l_mail~l_composemessages_l_specifywaitonsendtimeoutfordlpevaluation_l_specifywaitonsendtimeoutfordlpevaluationspinid",
    "description": "",
    "helpText": "",
    "name": "L_SpecifyWaitOnSendTimeoutForDLPEvaluationSpinID",
    "displayName": "In seconds: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 10000,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 5
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_outlk16v11~policy~l_microsoftofficeoutlook~l_outlookoptions~l_mail~l_composemessages_l_specifywaitonsendtimeoutfordlpevaluation_1",
            "parentSettingId": "user_vendor_msft_policy_config_outlk16v11~policy~l_microsoftofficeoutlook~l_outlookoptions~l_mail~l_composemessages_l_specifywaitonsendtimeoutfordlpevaluation"
        }
    ],
    "dependedOnBy": []
}