{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ApprovedUsbPrintDevicesUser",
        "List of Approved USB-connected print devices",
        "\\Control Panel\\Printers",
        "Administrative Templates\\Control Panel\\Printers",
        "Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-printers#printers-approvedusbprintdevicesuser"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Printers/ApprovedUsbPrintDevicesUser",
    "rootDefinitionId": "user_vendor_msft_policy_config_printers_approvedusbprintdevicesuser",
    "categoryId": "684799ba-398b-4728-aa21-40c8469cbe87",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_printers_approvedusbprintdevicesuser",
    "description": "\r\n\r\n            This setting is a component of the Device Control Printing Restrictions. To use this setting, enable Device Control Printing by enabling the \"Enable Device Control Printing Restrictions\" setting.\r\n\r\n            When Device Control Printing is enabled, the system uses the specified list of vid/pid values to determine if the current USB connected printer is approved for local printing.\r\n\r\n            Type all the approved vid/pid combinations (separated by commas) that correspond to approved USB printer models. When a user tries to print to a USB printer queue the device vid/pid will be compared to the approved list.\r\n        ",
    "helpText": "",
    "name": "ApprovedUsbPrintDevicesUser",
    "displayName": "List of Approved USB-connected print devices (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_printers_approvedusbprintdevicesuser_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_printers_approvedusbprintdevicesuser_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_printers_approvedusbprintdevicesuser_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_printers_approvedusbprintdevicesuser_approvedusbprintdevices_list",
                    "required": true
                }
            ]
        }
    ]
}