{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableThumbsDBOnNetworkFolders",
        "Turn off the caching of thumbnails in hidden thumbs.db files",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-thumbnails#admx-thumbnails-disablethumbsdbonnetworkfolders"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Thumbnails/DisableThumbsDBOnNetworkFolders",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbsdbonnetworkfolders",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbsdbonnetworkfolders",
    "description": "Turns off the caching of thumbnails in hidden thumbs.db files.\r\n\r\nThis policy setting allows you to configure File Explorer to cache thumbnails of items residing in network folders in hidden thumbs.db files.\r\n\r\nIf you enable this policy setting, File Explorer does not create, read from, or write to thumbs.db files.\r\n\r\nIf you disable or do not configure this policy setting, File Explorer creates, reads from, and writes to thumbs.db files.\r\n\r\n ",
    "helpText": "",
    "name": "DisableThumbsDBOnNetworkFolders",
    "displayName": "Turn off the caching of thumbnails in hidden thumbs.db files (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbsdbonnetworkfolders_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbsdbonnetworkfolders_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbsdbonnetworkfolders_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}