{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOnContactTabMAPIReplaceWork2",
        "Replace MAPI - Work2",
        "\\Microsoft Office 2016\\Contact Card\\Contact Tab",
        "Microsoft Office 2016\\Contact Card\\Contact Tab",
        "Contact Tab"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ContactCard~L_ContactTab/L_TurnOnContactTabMAPIReplaceWork2",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabmapireplacework2",
    "categoryId": "20bacabf-cd07-48be-a184-f0ae76d31e4a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabmapireplacework2",
    "description": "\r\n\r\nIf you enable this policy setting, you can remove or change the default value \"work phone 2\".\r\n\r\nIt is recommended that you specify a MAPI property and a corresponding AD attribute.  The MAPI property should always be specified, unless Outlook is not installed, in which case only the AD attribute needs to be specified.  It must be entered in decimal format.  \r\n\r\nIf you know the MAPIHexadecimalPropertyTag, you should convert this to a decimal value.  Any properties entered which are binary or list box, cannot be displayed and thus are ignored.\r\n\r\nFor example, if you want to show the Assistant on the Contact Card, for MAPI, the PR_ASSISTANT hexadecimal property tag is 0x3A30001E.  In decimal format, it is 976224286.\r\n\r\nYou would enter: \r\n976224286.\r\n\r\nTo remove the value entirely you would enter null.\r\n\r\nNote that for Location and Calendar values on the default Contact Card, the defaults are not MAPI Properties or AD Attributes.\r\n\r\nRelated policy settings:  \r\nReplace AD attribute n, Turn On Contact Tab Calendar Line Move, Turn On Contact Tab Location Line Move.\r\n\r\nIf you disable or do not configure this policy setting, the default value of \"work phone 2\" is shown.",
    "helpText": "",
    "name": "L_TurnOnContactTabMAPIReplaceWork2",
    "displayName": "Replace MAPI - Work2 (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabmapireplacework2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabmapireplacework2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabmapireplacework2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabmapireplacework2_l_work2mapireplace",
                    "required": true
                }
            ]
        }
    ]
}