{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_GATEWAY_POLICY_AUTH_METHOD",
        "Set RD Gateway authentication method",
        "\\Windows Components\\Remote Desktop Services\\RD Gateway",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\RD Gateway",
        "RD Gateway"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_GATEWAY_POLICY_AUTH_METHOD",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method",
    "categoryId": "85c586a6-6b68-48b2-8050-c4fb86aff486",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode",
    "description": null,
    "helpText": "",
    "name": "TS_GATEWAY_AUTH_MODE",
    "displayName": "Set RD Gateway authentication method (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode_5",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode_5",
            "description": null,
            "helpText": null,
            "name": "Ask for credentials, use Negotiate protocol",
            "displayName": "Ask for credentials, use Negotiate protocol",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "5"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode_2",
            "description": null,
            "helpText": null,
            "name": "Ask for credentials, use NTLM protocol",
            "displayName": "Ask for credentials, use NTLM protocol",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode_1",
            "description": null,
            "helpText": null,
            "name": "Ask for credentials, use Basic protocol",
            "displayName": "Ask for credentials, use Basic protocol",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode_4",
            "description": null,
            "helpText": null,
            "name": "Use locally logged-on credentials",
            "displayName": "Use locally logged-on credentials",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_ts_gateway_auth_mode_3",
            "description": null,
            "helpText": null,
            "name": "Use smart-card",
            "displayName": "Use smart-card",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_terminalserver_ts_gateway_policy_auth_method"
                }
            ],
            "dependedOnBy": []
        }
    ]
}