{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "GeolocationDisable",
        "Turn off browser geolocation",
        "\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-disablegeolocation"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/DisableGeolocation",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_disablegeolocation",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_internetexplorer_disablegeolocation",
    "description": "This policy setting allows you to disable browser geolocation support. This will prevent websites from requesting location data about the user.\r\n\r\nIf you enable this policy setting, browser geolocation support is turned off.\r\n\r\nIf you disable this policy setting, browser geolocation support is turned on.\r\n\r\nIf you do not configure this policy setting, browser geolocation support can be turned on or off in Internet Options on the Privacy tab.",
    "helpText": "",
    "name": "GeolocationDisable",
    "displayName": "Turn off browser geolocation (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_disablegeolocation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disablegeolocation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disablegeolocation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}