{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LocaleUserRestrict_1",
        "Restrict user locales",
        "\\System\\Locale Services",
        "Administrative Templates\\System\\Locale Services",
        "Locale Services"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-localeuserrestrict-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/LocaleUserRestrict_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_globalization_localeuserrestrict_1",
    "categoryId": "2cbf2609-1f6a-4597-84e2-a57da0ad0472",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_globalization_localeuserrestrict_1",
    "description": "This policy setting restricts users on a computer to the specified list of user locales. If the list is empty, it locks all user locales to their current values. This policy setting does not change existing user locale settings; however, the next time a user attempts to change their user locale, their choices will be restricted to locales in this list.\r\n\r\nTo set this policy setting on a per-user basis, make sure that you do not configure the per-computer policy setting.\r\n\r\nThe locale list is specified using language tags, separated by a semicolon (;). For example, en-US is English (United States). Specifying \"en-CA;fr-CA\" would restrict the user locale to English (Canada) and French (Canada).\r\n\r\nIf you enable this policy setting, only locales in the specified locale list can be selected by users.\r\n\r\nIf you disable or do not configure this policy setting, users can select any locale installed on the computer, unless restricted by the \"Disallow selection of Custom Locales\" policy setting.\r\n\r\nIf this policy setting is enabled at the computer level, it cannot be disabled by a per-user policy. If this policy setting is disabled at the computer level, the per-user policy is ignored. If this policy setting is not configured at the computer level, restrictions are based on per-user policies.\r\n      \r\n ",
    "helpText": "",
    "name": "LocaleUserRestrict_1",
    "displayName": "Restrict user locales (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_globalization_localeuserrestrict_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_localeuserrestrict_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_localeuserrestrict_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_globalization_localeuserrestrict_1_allowableuserlocaletaglist",
                    "required": true
                }
            ]
        }
    ]
}