{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get",
    "keywords": [
        " Printer Shared ID",
        "Printer Provisioning"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/PrinterProvisioning",
    "offsetUri": "/UPPrinterInstalls/{0}",
    "rootDefinitionId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
    "categoryId": "56c54112-2991-4bda-9e01-e6868bd07726",
    "settingUsage": "configuration",
    "uxBehavior": "multiheaderGrid",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
    "description": "Identifies the Universal Print printer, by its Share ID, you wish to install on the targeted user account. The printer's Share ID can be found in the printer's properties via the Universal Print portal. Note: the targeted user account must have access rights to both the printer and to the Universal Print service.",
    "helpText": "",
    "name": "{PrinterSharedID}",
    "displayName": "Printer Shared ID (User)",
    "childIds": [
        "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_printersharedid",
        "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_clouddeviceid",
        "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_printersharedname",
        "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_install"
    ],
    "maximumCount": 100,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19044.1790",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_printersharedid",
            "required": true
        },
        {
            "dependedOnBy": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_clouddeviceid",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_printersharedname",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_install",
            "required": true
        }
    ]
}