{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Disallow Notification Mirroring",
        "Notifications"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Notifications#notifications-disallownotificationmirroring"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Notifications/DisallowNotificationMirroring",
    "rootDefinitionId": "user_vendor_msft_policy_config_notifications_disallownotificationmirroring",
    "categoryId": "cb1e177e-8f06-4a69-8215-ec1e91c19e30",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_notifications_disallownotificationmirroring",
    "description": "Boolean value that turns off notification mirroring. For each user logged into the device, if you enable this policy (set value to 1) the app and system notifications received by this user on this device will not get mirrored to other devices of the same logged in user. If you disable or do not configure this policy (set value to 0) the notifications received by this user on this device will be mirrored to other devices of the same logged in user. This feature can be turned off by apps that do not want to participate in Notification Mirroring. This feature can also be turned off by the user in the Cortana setting page. No reboot or service restart is required for this policy to take effect.",
    "helpText": "",
    "name": "DisallowNotificationMirroring",
    "displayName": "Disallow Notification Mirroring (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_notifications_disallownotificationmirroring_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_notifications_disallownotificationmirroring_0",
            "description": "Enable notification mirroring.",
            "helpText": null,
            "name": "Enable notification mirroring.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_notifications_disallownotificationmirroring_1",
            "description": "Disable notification mirroring.",
            "helpText": null,
            "name": "Disable notification mirroring.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}