{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AM_SetLowRiskInclusion",
        "Inclusion list for low file types",
        "\\Windows Components\\Attachment Manager",
        "Administrative Templates\\Windows Components\\Attachment Manager",
        "Attachment Manager"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AttachmentManager/AM_SetLowRiskInclusion",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setlowriskinclusion",
    "categoryId": "3f8299b3-6803-4576-be08-7c311d04b8b9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setlowriskinclusion_am_instructlowriskinclusionlist",
    "description": null,
    "helpText": "",
    "name": "AM_InstructLowRiskInclusionList",
    "displayName": "Specify low risk extensions (include a leading period, e.g. .bmp;.gif;). (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setlowriskinclusion_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_setlowriskinclusion"
        }
    ],
    "dependedOnBy": []
}