{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ImmersiveReaderPictureDictionaryEnabled",
        "Enable Picture Dictionary feature within Immersive Reader in Microsoft Edge",
        "\\Microsoft Edge\\Immersive Reader settings",
        "Microsoft Edge\\Immersive Reader settings",
        "Immersive Reader settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev110~Policy~microsoft_edge~ImmersiveReader/ImmersiveReaderPictureDictionaryEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~immersivereader_immersivereaderpicturedictionaryenabled",
    "categoryId": "8bcf8b08-35a3-49b7-8760-5fe3b767d6a6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~immersivereader_immersivereaderpicturedictionaryenabled",
    "description": "Enables the Picture Dictionary feature within Immersive Reader in Microsoft Edge.\r\nThis feature helps in reading comprehension by letting a user to click on any single word and see an illustration related to the meaning.\r\n\r\nIf you enable this policy or don't configure it, the Picture Dictionary option shows up within Immersive Reader.\r\nIf you disable this policy, users can't access the Picture Dictionary feature within Immersive Reader.",
    "helpText": "",
    "name": "ImmersiveReaderPictureDictionaryEnabled",
    "displayName": "Enable Picture Dictionary feature within Immersive Reader in Microsoft Edge (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~immersivereader_immersivereaderpicturedictionaryenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~immersivereader_immersivereaderpicturedictionaryenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~immersivereader_immersivereaderpicturedictionaryenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}