{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_AllowFileSynchronizationViaSOAPOnlyOnDomainNetworks",
        "Allow file synchronization via SOAP over HTTP only on domain networks",
        "\\Microsoft Office 2016\\Server Settings",
        "Microsoft Office 2016\\Server Settings",
        "Server Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ServerSettings/L_AllowFileSynchronizationViaSOAPOnlyOnDomainNetworks",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_allowfilesynchronizationviasoaponlyondomainnetworks",
    "categoryId": "6aeb1df3-d796-4c5b-921d-9f3970a754cc",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_allowfilesynchronizationviasoaponlyondomainnetworks",
    "description": "This policy setting controls file synchronization via SOAP over HTTP.\r\n\r\nIf you enable this policy setting, file synchronization via SOAP over HTTP is allowed only on domain networks. \r\n\r\nIf you disable or do not configure this policy setting, file synchronization via SOAP over HTTP functions on all networks.",
    "helpText": "",
    "name": "L_AllowFileSynchronizationViaSOAPOnlyOnDomainNetworks",
    "displayName": "Allow file synchronization via SOAP over HTTP only on domain networks (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_allowfilesynchronizationviasoaponlyondomainnetworks_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_allowfilesynchronizationviasoaponlyondomainnetworks_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_serversettings_l_allowfilesynchronizationviasoaponlyondomainnetworks_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}