{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableThumbnails",
        "Turn off the display of thumbnails and only display icons.",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-thumbnails#admx-thumbnails-disablethumbnails"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Thumbnails/DisableThumbnails",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbnails",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbnails",
    "description": "This policy setting allows you to configure how File Explorer displays thumbnail images or icons on the local computer.\r\n\r\nFile Explorer displays thumbnail images by default. \r\n\r\nIf you enable this policy setting, File Explorer displays only icons and never displays thumbnail images.\r\n\r\nIf you disable or do not configure this policy setting, File Explorer displays only thumbnail images.\r\n ",
    "helpText": "",
    "name": "DisableThumbnails",
    "displayName": "Turn off the display of thumbnails and only display icons. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbnails_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbnails_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_thumbnails_disablethumbnails_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}