{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_GoOfflineAction_1",
        "Action on server disconnect",
        "\\Network\\Offline Files",
        "Administrative Templates\\Network\\Offline Files",
        "Offline Files"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_OfflineFiles/Pol_GoOfflineAction_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1",
    "categoryId": "82a9c23f-2c09-4479-9cd3-e7f185d7676f",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_lbl_goofflineactioncombo",
    "description": null,
    "helpText": "",
    "name": "Lbl_GoOfflineActionCombo",
    "displayName": "Action: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_lbl_goofflineactioncombo_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_lbl_goofflineactioncombo_0",
            "description": null,
            "helpText": null,
            "name": "Work offline",
            "displayName": "Work offline",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_lbl_goofflineactioncombo_1",
            "description": null,
            "helpText": null,
            "name": "Never go offline",
            "displayName": "Never go offline",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_goofflineaction_1"
                }
            ],
            "dependedOnBy": []
        }
    ]
}