{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoViewOnDrive",
        "Prevent access to drives from My Computer",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/NoViewOnDrive",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown",
    "description": null,
    "helpText": "",
    "name": "NoDrivesDropdown",
    "displayName": "Pick one of the following combinations (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_67108863",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_3",
            "description": null,
            "helpText": null,
            "name": "Restrict A and B drives only",
            "displayName": "Restrict A and B drives only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_4",
            "description": null,
            "helpText": null,
            "name": "Restrict C drive only",
            "displayName": "Restrict C drive only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_8",
            "description": null,
            "helpText": null,
            "name": "Restrict D drive only",
            "displayName": "Restrict D drive only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_7",
            "description": null,
            "helpText": null,
            "name": "Restrict A, B and C drives only",
            "displayName": "Restrict A, B and C drives only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_15",
            "description": null,
            "helpText": null,
            "name": "Restrict A, B, C and D drives only",
            "displayName": "Restrict A, B, C and D drives only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "15"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_67108863",
            "description": null,
            "helpText": null,
            "name": "Restrict all drives",
            "displayName": "Restrict all drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "67108863"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_nodrivesdropdown_0",
            "description": null,
            "helpText": null,
            "name": "Do not restrict drives",
            "displayName": "Do not restrict drives",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_windowsexplorer_noviewondrive"
                }
            ],
            "dependedOnBy": []
        }
    ]
}