{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoReadingPane",
        "Turn off Preview Pane",
        "\\Windows Components\\File Explorer\\Explorer Frame Pane",
        "Administrative Templates\\Windows Components\\File Explorer\\Explorer Frame Pane",
        "Explorer Frame Pane"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-framepanes#admx-framepanes-noreadingpane"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FramePanes/NoReadingPane",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_framepanes_noreadingpane",
    "categoryId": "e21bab5b-308d-4dcd-b6bb-a019e7347373",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_framepanes_noreadingpane",
    "description": "Hides the Preview Pane in File Explorer.\r\n\r\nIf you enable this policy setting, the Preview Pane in File Explorer is hidden and cannot be turned on by the user.\r\n\r\nIf you disable, or do not configure this setting, the Preview Pane is hidden by default and can be displayed by the user.\r\n\r\n ",
    "helpText": "",
    "name": "NoReadingPane",
    "displayName": "Turn off Preview Pane (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_framepanes_noreadingpane_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_framepanes_noreadingpane_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_framepanes_noreadingpane_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}