{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisallowDownloadHeadersthenFullItemsFileCachedExchangeMode",
        "Disallow Download Headers then Full Items",
        "\\Microsoft Outlook 2016\\Account Settings\\Exchange\\Cached Exchange Mode",
        "Microsoft Outlook 2016\\Account Settings\\Exchange\\Cached Exchange Mode",
        "Cached Exchange Mode"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_ToolsAccounts~L_Exchangesettings~L_CachedExchangeMode/L_DisallowDownloadHeadersthenFullItemsFileCachedExchangeMode",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings~l_cachedexchangemode_l_disallowdownloadheadersthenfullitemsfilecachedexchangemode",
    "categoryId": "82ecfab7-b76a-4cec-8e76-859db4599ac2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings~l_cachedexchangemode_l_disallowdownloadheadersthenfullitemsfilecachedexchangemode",
    "description": "This policy setting allows you to turn off the \"Download Headers and then Full Items\" option.  Microsoft Exchange Server 2003 or later is required.\r\n\r\nIf you enable this policy setting, you will turn off the \"Download Headers and then Full Items\" option in the Download Preferences menu in the Send/Receive tab.\r\n\r\nIf you disable or do not configure this policy setting, you will allow the \"Download Headers and then Full Items\" option in the Download Preferences menu in the Send/Receive tab.",
    "helpText": "",
    "name": "L_DisallowDownloadHeadersthenFullItemsFileCachedExchangeMode",
    "displayName": "Disallow Download Headers then Full Items (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings~l_cachedexchangemode_l_disallowdownloadheadersthenfullitemsfilecachedexchangemode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings~l_cachedexchangemode_l_disallowdownloadheadersthenfullitemsfilecachedexchangemode_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings~l_cachedexchangemode_l_disallowdownloadheadersthenfullitemsfilecachedexchangemode_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}