{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CPL_Personalization_SetVisualStyle",
        "Force a specific visual style file or force Windows Classic",
        "\\Control Panel\\Personalization",
        "Administrative Templates\\Control Panel\\Personalization",
        "Personalization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-controlpaneldisplay#admx-controlpaneldisplay-cpl-personalization-setvisualstyle"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ControlPanelDisplay/CPL_Personalization_SetVisualStyle",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_setvisualstyle",
    "categoryId": "e6231142-3d39-44a7-9522-6a3357bd439f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_setvisualstyle",
    "description": "This setting allows you to force a specific visual style file by entering the path (location) of the visual style file.\r\n\r\nThis can be a local computer visual style (aero.msstyles), or a file located on a remote server using a UNC path (\\\\Server\\Share\\aero.msstyles).\r\n\r\nIf you enable this setting, the visual style file that you specify will be used. Also, a user may not apply a different visual style when changing themes.\r\n\r\nIf you disable or do not configure this setting, the users can select the visual style that they want to use by changing themes (if the Personalization Control Panel is available).\r\n\r\nNote: If this setting is enabled and the file is not available at user logon, the default visual style is loaded.\r\n\r\nNote: When running Windows XP, you can select the Luna visual style by typing %windir%\\resources\\Themes\\Luna\\Luna.msstyles\r\n\r\nNote: To select the Windows Classic visual style, leave the box blank beside \"Path to Visual Style:\" and enable this setting. When running Windows 8 or Windows RT, you cannot apply the Windows Classic visual style.\n ",
    "helpText": "",
    "name": "CPL_Personalization_SetVisualStyle",
    "displayName": "Force a specific visual style file or force Windows Classic (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_setvisualstyle_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_setvisualstyle_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_setvisualstyle_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_controlpaneldisplay_cpl_personalization_setvisualstyle_themes_name",
                    "required": true
                }
            ]
        }
    ]
}