{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_CorrectaccidentalusageofcAPSLOCKkey",
        "Correct accidental usage of cAPS LOCK key",
        "\\Microsoft Word 2016\\Word Options\\Proofing\\AutoCorrect",
        "Microsoft Word 2016\\Word Options\\Proofing\\AutoCorrect",
        "AutoCorrect"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_Proofing~L_AutoCorrect/L_CorrectaccidentalusageofcAPSLOCKkey",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autocorrect_l_correctaccidentalusageofcapslockkey",
    "categoryId": "e95db55a-8337-416d-a61f-e60f55cc0d13",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autocorrect_l_correctaccidentalusageofcapslockkey",
    "description": "This policy setting allows you to set the \"Correct accidental usage of cAPS LOCK key\" option in Word Options | Proofing | \"AutoCorrect Options...\" | AutoCorrect.\r\n\r\nIf you enable this policy setting, \"Correct accidental usage of cAPS LOCK key\" will be set.\r\n\r\nIf you disable or do not configure this policy setting, \"Correct accidental usage of cAPS LOCK key\" will not be set.y",
    "helpText": "",
    "name": "L_CorrectaccidentalusageofcAPSLOCKkey",
    "displayName": "Correct accidental usage of cAPS LOCK key (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autocorrect_l_correctaccidentalusageofcapslockkey_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autocorrect_l_correctaccidentalusageofcapslockkey_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_proofing~l_autocorrect_l_correctaccidentalusageofcapslockkey_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}