{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SetPasswordRulesLevel",
        "Set password rules level",
        "\\Microsoft Office 2016\\Security Settings",
        "Microsoft Office 2016\\Security Settings",
        "Security Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_SecuritySettings/L_SetPasswordRulesLevel",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_setpasswordruleslevel",
    "categoryId": "50b4bc60-802c-477a-9366-80e09154595f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_setpasswordruleslevel",
    "description": "This policy setting allows you to set the password rules level.\r\n\r\nIf you enable this policy setting, you may specify a password rules level:\r\n\r\n- No password checks: There are no complexity checks\r\n- Local length check: Minimum length checks\r\n- Local length and complexity checks: Minimum length checks plus 3 of 4 character groups checks.\r\n- Local length, local complexity, and domain policy checks: All the previous checks plus Windows domain password rules enforced.\r\n\r\nIf you select \"Local length and complexity checks\" or \"Local length, local complexity, and domain policy checks,\" then the password must contain characters from at least three of four character sets: lowercase a-z, uppercase A-Z, digits 0-9, or non-alphabetic characters.  When this complexity is enforced, the minimum password length needs to be at least 6, but can be more depending on the value set in the \"Set minimum password length\" policy setting.\r\n\r\nIf you select \"Local length, local complexity, and domain policy checks,\" then Microsoft Office will use the Windows domain policy as well as all the settings \"Local length and complexity checks.\"  This allows a custom password filter that is installed for Windows passwords to be used.  If you are offline or a domain controller cannot be contacted, then the Windows password settings are not used, and only the \"Local length and complexity checks\" settings are used.  If you don’t have a custom password filter, then \"Local length and complexity checks\" saves a trip across the network and would be the best choice.\r\n\r\nIf you disable or do not configure this policy setting, the behavior is the same as if this policy setting were enabled and \"No password checks\" selected.",
    "helpText": "",
    "name": "L_SetPasswordRulesLevel",
    "displayName": "Set password rules level (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_setpasswordruleslevel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_setpasswordruleslevel_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_setpasswordruleslevel_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_setpasswordruleslevel_l_setpasswordrulesleveldropid",
                    "required": true
                }
            ]
        }
    ]
}