{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "TamperProtection (Device)",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/defender-csp#:~:text=Configuration/TamperProtection"
    ],
    "baseUri": "./Vendor/MSFT/Defender",
    "offsetUri": "/Configuration/TamperProtectionOptions",
    "rootDefinitionId": "vendor_msft_defender_configuration_tamperprotection_options",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "vendor_msft_defender_configuration_tamperprotection_options",
    "description": "Tamper protection helps protect important security features from unwanted changes and interference. This includes real-time protection, behavior monitoring, and more. Accepts signed string to turn the feature on or off. Settings are configured with an MDM solution, such as Intune and is available in Windows 10 Enterprise E5 or equivalent subscriptions.",
    "helpText": null,
    "name": "TamperProtection",
    "displayName": "TamperProtection (Device)",
    "defaultOptionId": "vendor_msft_defender_configuration_tamperprotection_options_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_defender_configuration_tamperprotection_options_1",
            "description": null,
            "helpText": null,
            "name": "Offboarding",
            "displayName": "Off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Offboarding"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "vendor_msft_defender_configuration_tamperprotection_blob",
                    "required": false
                }
            ]
        },
        {
            "itemId": "vendor_msft_defender_configuration_tamperprotection_options_0",
            "description": null,
            "helpText": null,
            "name": "Onboarding",
            "displayName": "On",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Onboarding"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "vendor_msft_defender_configuration_tamperprotection_blob",
                    "required": false
                }
            ]
        }
    ]
}