{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "Direction",
        "Firewall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/HyperVFirewallRules/{0}/Direction",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_direction",
    "description": "The rule is enabled based on the traffic direction as following.\n\nIN - the rule applies to inbound traffic.\nOUT - the rule applies to outbound traffic.\n\nIf not specified the detault is OUT.",
    "helpText": "",
    "name": "Direction",
    "displayName": "Direction",
    "defaultOptionId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_direction_out",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_direction_in",
            "description": "The rule applies to inbound traffic.",
            "helpText": null,
            "name": "The rule applies to inbound traffic.",
            "displayName": "The rule applies to inbound traffic.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "IN"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_direction_out",
            "description": "The rule applies to outbound traffic.",
            "helpText": null,
            "name": "The rule applies to outbound traffic.",
            "displayName": "The rule applies to outbound traffic.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "OUT"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}