{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "Opportunistically Match Auth Set Per KM",
        "Firewall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/Global/OpportunisticallyMatchAuthSetPerKM",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm",
    "description": "This value is used as an on/off switch. When this option is false, keying modules MUST ignore the entire authentication set if they do not support all of the authentication suites specified in the set. When this option is true, keying modules MUST ignore only the authentication suites that they don’t support. For schema versions 0x0200, 0x0201, and 0x020A, this value is invalid and MUST NOT be used.",
    "helpText": "",
    "name": "OpportunisticallyMatchAuthSetPerKM",
    "displayName": "Opportunistically Match Auth Set Per KM",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm_false",
            "description": "FALSE",
            "helpText": null,
            "name": "FALSE",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm_true",
            "description": "TRUE",
            "helpText": null,
            "name": "TRUE",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}