{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Account Model",
        "SharedPC",
        "Shared PC"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/SharedPC",
    "offsetUri": "/AccountModel",
    "rootDefinitionId": "vendor_msft_sharedpc_accountmodel",
    "categoryId": "891d2958-5a8c-479c-aa68-69b1b6c735e1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "vendor_msft_sharedpc_accountmodel",
    "description": "Configures which type of accounts are allowed to use the PC. Allowed values: 0 (only guest), 1 (domain-joined only), 2 (domain-joined and guest).",
    "helpText": null,
    "name": "AccountModel",
    "displayName": "Account Model",
    "defaultOptionId": "vendor_msft_sharedpc_accountmodel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_sharedpc_accountmodel_0",
            "description": null,
            "helpText": null,
            "name": "only guest",
            "displayName": "Guest",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_sharedpc_accountmodel_1",
            "description": null,
            "helpText": null,
            "name": "domain-joined only",
            "displayName": "Domain",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_sharedpc_accountmodel_2",
            "description": null,
            "helpText": null,
            "name": "domain-joined and guest",
            "displayName": "Guest and Domain",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}