{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Company Logo Url",
        "Personalization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Personalization-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Personalization",
    "offsetUri": "/CompanyLogoUrl",
    "rootDefinitionId": "vendor_msft_personalization_companylogourl",
    "categoryId": "1dd655c9-a1f3-4780-befb-cab19922277d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "vendor_msft_personalization_companylogourl",
    "description": "A http or https Url to a jpg, jpeg or png image that neeeds to be downloaded and used as the Company Logo or a file Url to a local image on the file system that needs to be used as the Company Logo. This setting is currently available for boot to cloud shared pc mode only.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "CompanyLogoUrl",
    "displayName": "Company Logo Url (Windows Insiders only)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "2.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22635.2921",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}