{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,get,replace",
    "keywords": [
        "EnableFirewall",
        "Firewall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
    ],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/PrivateProfile/EnableFirewall",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
    "description": "This value is an on/off switch for the firewall and advanced security enforcement. If this value is false, the server MUST NOT block any network traffic, regardless of other policy settings.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
    "helpText": " ",
    "name": "EnableFirewall",
    "displayName": "Enable Private Network Firewall",
    "defaultOptionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_false",
            "description": "Disable Firewall",
            "helpText": null,
            "name": "Disable Firewall",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true",
            "description": "Enable Firewall",
            "helpText": null,
            "name": "Enable Firewall",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_shielded",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_logmaxfilesize",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_logfilepath",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption",
                    "required": false
                }
            ]
        }
    ]
}