{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Priority",
        "Firewall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/HyperVFirewallRules/{0}/Priority",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_priority",
    "description": "This value represents the order of rule enforcement. A lower priority rule is evaluated first. If not specified, block rules are evaluated before allow rules. If priority is configured, it is highly recommended to configure the value for ALL rules to ensure expected evaluation of rules.",
    "helpText": "",
    "name": "Priority",
    "displayName": "Priority",
    "defaultValue": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsNXT"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 65535,
        "minimumValue": 0
    },
    "dependentOn": [
        {
            "dependentOn": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
            "parentSettingId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}"
        }
    ],
    "dependedOnBy": []
}