{
    "@odata.type": "#microsoft.graph.announcement",
    "id": "2526daa6-6f5f-4fc7-8e7f-5b27a966c4d5",
    "changeItemService": "msGraph",
    "tags": [
        "Identity Modernization"
    ],
    "systemTags": [],
    "documentationUrls": [
        "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/important-update-deprecation-of-azure-ad-powershell-and-msonline/ba-p/4094536"
    ],
    "shortDescription": "",
    "title": "Important Update: AzureAD PowerShell and MSOnline PowerShell retirement ",
    "description": "As of March 30, 2024, the legacy Azure AD PowerShell, Azure AD PowerShell Preview, and MS Online modules are deprecated. These modules will continue to function through March 30, 2025, after which they will be retired and stop functioning. Microsoft Graph PowerShell SDK is the replacement for these modules and you should migrate your scripts to Microsoft Graph PowerShell SDK as soon as possible. \n \n To help you identify usage of Azure AD PowerShell in your tenant, you can use the Entra Recommendation titled Migrate Service Principals from the retiring Azure AD Graph APIs to Microsoft Graph. This recommendation will show vendor applications that are using Azure AD Graph APIs in your tenant, including AzureAD PowerShell. \n \n We are making substantial new and future investments in the PowerShell experience for managing Entra, with the recent Public Preview launch of the Microsoft Entra PowerShell module. This new module builds upon the Microsoft Graph PowerShell SDK and brings scenario-focused cmdlets. It’s fully interoperable with all cmdlets in the Microsoft Graph PowerShell SDK, enabling you to perform complex operations with simple, well documented commands. The module also offers a backward compatibility option to simplify migration from the deprecated AzureAD Module. \n \n Microsoft Graph APIs were recently made available to read and configure Per-user MFA settings for users, and availability in Microsoft Graph PowerShell SDK cmdlets is soon to follow.",
    "announcementDateTime": "2024-10-02T00:00:00Z",
    "targetDateTime": "2025-04-01T00:00:00Z",
    "impactLink": null,
    "changeType": "deprecation",
    "isCustomerActionRequired": true
}