{
    "@odata.type": "#microsoft.graph.announcement",
    "id": "274f4674-da3f-4bb9-b54f-e3f641456b33",
    "changeItemService": "other",
    "tags": [
        "Identity Modernization"
    ],
    "systemTags": [],
    "documentationUrls": [
        "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/important-update-deprecation-of-azure-ad-powershell-and-msonline/ba-p/4094536"
    ],
    "shortDescription": "Update on Azure AD Graph Powershell Module Deprecation",
    "title": "Important update: Azure AD PowerShell and MS Online PowerShell modules are deprecated",
    "description": "In 2021, we described our plans to invest in Microsoft Graph PowerShell SDK as the PowerShell experience for Entra going forward, and that we would wind-down investment in Azure AD and MS Online PowerShell modules. In June of 2023, we announced that the planned deprecation of Azure AD and MS Online PowerShell modules would be deferred to March 30, 2024. We have since made substantial progress closing remaining parity gaps in Microsoft Graph PowerShell SDK. \n \n As of March 30, 2024, these PowerShell modules are deprecated : \n - Azure AD PowerShell (AzureAD) \n - Azure AD PowerShell Preview (AzureADPreview) \n - MS Online (MSOnline) \n \n Microsoft Graph PowerShell SDK is the replacement for these modules and you should migrate your scripts to Microsoft Graph PowerShell SDK as soon as possible. Information about the retirement of these modules can be found below. Azure AD PowerShell, Azure AD PowerShell Preview, and MS Online will continue to function through March 30, 2025, when they are retired. Note: MS Online versions before 1.1.166.0 (2017) can no longer be maintained and use of these versions may experience disruptions after June 30, 2024. \n \n We are making substantial new and future investments in the PowerShell experience for managing Entra. Please continue to watch this space as we announce exciting improvements in the coming months.",
    "announcementDateTime": "2020-06-22T07:00:00Z",
    "targetDateTime": "2024-03-30T07:00:00Z",
    "impactLink": null,
    "changeType": "deprecation",
    "isCustomerActionRequired": true
}