{
    "@odata.type": "#microsoft.graph.announcement",
    "id": "68757354-d621-4d77-adfb-cb088acb96b5",
    "changeItemService": "other",
    "tags": [
        "Identity Modernization"
    ],
    "systemTags": [],
    "documentationUrls": [
        "https://techcommunity.microsoft.com/t5/copilot-for-microsoft-365/updates-to-microsoft-copilot-to-bring-enterprise-data-protection/ba-p/4217152"
    ],
    "shortDescription": "",
    "title": "Microsoft Copilot to update to enterprise data protection",
    "description": "Next month, we are making several updates to the free Microsoft Copilot service for users with a Microsoft Entra account to enhance data security, privacy, and compliance and simplify the user experience. For users signed in with an Entra account, Microsoft Copilot will offer enterprise data protection (EDP) and redirect users to a new simplified, ad-free user interface designed for work and education. \n \n With EDP in Microsoft Copilot, your data is private, it isn’t used to train foundation models, and we help protect it at rest and in transit with encryption. For more details on EDP, please see here (https://aka.ms/EDPLearn). \n \n If you or your users have a Microsoft 365 subscription in addition to an Entra account, you can enable in-app access by pinning Microsoft Copilot. If you elect to pin Microsoft Copilot for your users, it will appear in the Microsoft 365 app starting mid-September, and it will be coming soon to Microsoft Teams and Outlook. Additional functionality in Microsoft Copilot like chat history is also available for users with a Microsoft 365 subscription. \n \n For additional information about these changes, whether you or your users have a Microsoft 365 subscription or not, please visit our blog (https://aka.ms/MsftCopilot-MTCBlog) and FAQ (https://aka.ms/MsftCopilot-BlogFAQ). \n \n We hope you are as excited as we are for these updates to Microsoft Copilot. If you would like to try Microsoft Copilot updated with enterprise data protection prior to mid-September, a private preview is available (space limited). To apply, please visit here: https://aka.ms/CopilotPreviewSignup",
    "announcementDateTime": "2024-08-28T00:00:00Z",
    "targetDateTime": "2024-09-16T00:00:00Z",
    "impactLink": null,
    "changeType": "featureChange",
    "isCustomerActionRequired": false
}