{
    "@odata.type": "#microsoft.graph.announcement",
    "id": "90950226-c1da-445d-9df0-220a7fc5e940",
    "changeItemService": "msGraph",
    "tags": [
        "Identity Modernization"
    ],
    "systemTags": [],
    "documentationUrls": [
        "https://learn.microsoft.com/en-us/entra/identity/hybrid/decommission-connect-sync-v1"
    ],
    "shortDescription": "",
    "title": "Important Update: AzureAD and MSOnline PowerShell retirement",
    "description": "As of March 30, 2024, the legacy Azure AD PowerShell, Azure AD PowerShell Preview, and MS Online modules are deprecated. These modules will continue to function through March 30, 2025, when they are retired and stop functioning. Microsoft Graph PowerShell SDK is the replacement for these modules and you should migrate your scripts to Microsoft Graph PowerShell SDK as soon as possible. \n \n Note: as indicated in our April update, MS Online with 'Legacy Auth' will stop functioning in the weeks after June 30, 2024. Legacy Auth is typically associated with versions before 1.1.166.0, and involves use of MS Online PowerShell with the Microsoft Online Sign-In Assistant package installed. If you are using MS Online versions before 1.1.166.0 or MS Online with Legacy Auth, you should immediately migrate to Microsoft Graph PowerShell SDK or update the MS Online version to the latest version (1.1.183.81). \n \n To help you identify usage of Azure AD PowerShell in your tenant, you can use the Entra Recommendation titled Migrate Service Principals from the retiring Azure AD Graph APIs to Microsoft Graph. This recommendation will show vendor applications that are using Azure AD Graph APIs in your tenant, including AzureAD PowerShell. \n \n We are making substantial new and future investments in the PowerShell experience for managing Entra, with the recent Public Preview launch of the Microsoft Entra PowerShell module. This new module builds upon and is part of the Microsoft Graph PowerShell SDK. It is fully interoperable with all cmdlets in the Microsoft Graph PowerShell SDK, enabling you to perform complex operations with simple, well documented commands. The module also offers a backward compatibility option to simplify migration from the deprecated AzureAD Module. Additionally, we are aware that some of our customers were unable to fully migrate to scripts that managed Per-user MFA from MSOnline to Microsoft Graph PowerShell. Microsoft Graph APIs were recently made available to read and configure Per-user MFA settings for users, and availability in Microsoft Graph PowerShell SDK cmdlets is soon to follow. Read and configure Per-user MFA settings for users, and availability in Microsoft Graph PowerShell SDK cmdlets is coming soon.",
    "announcementDateTime": "2024-07-01T00:00:00Z",
    "targetDateTime": "2025-03-31T00:00:00Z",
    "impactLink": null,
    "changeType": "retirement",
    "isCustomerActionRequired": true
}