{
    "@odata.type": "#microsoft.graph.announcement",
    "id": "a6c5d63b-6a73-430a-bd3c-2392cc69019f",
    "changeItemService": "mfA",
    "tags": [
        "Identity Security"
    ],
    "systemTags": [],
    "documentationUrls": [
        "https://techcommunity.microsoft.com/t5/microsoft-entra-blog/update-to-security-defaults/ba-p/4044868"
    ],
    "shortDescription": "",
    "title": "Update to security defaults",
    "description": "As part of the Secure Future Initiative, we’ve evolved our security approach to align with three security principles: secure by design, secure by default, and secure operations. Secure by default means security protections are enabled and enforced by default. In Microsoft Entra, security defaults are an example demonstrating our secure by default approach. Security defaults are enabled for every new tenant. This provides a baseline level of protection for your Entra identities and resources. To make sure that organizations relying on security defaults are well protected, we’re updating a requirement for authentication method registration to help improve your security posture. \n We’re removing the option to skip multifactor authentication (MFA) registration for 14 days when security defaults are enabled. This means all users will be required to register for MFA on their first login after security defaults are turned on. This will help reduce the risk of account compromise during the 14-day window, as MFA can block over 99.2% of identity-based attacks. This change affects newly created tenants starting on December 2nd, 2024 and will be rolled out to existing tenants starting in January 2025. \n This update is part of our ongoing effort to provide you with a secure and reliable identity service. We recommend that you enable security defaults for your organization if you are not using Conditional Access, as security defaults offer a simple and effective way to protect your users and resources from common threats.",
    "announcementDateTime": "2024-10-31T00:00:00Z",
    "targetDateTime": "2024-12-03T00:00:00Z",
    "impactLink": null,
    "changeType": "featureChange",
    "isCustomerActionRequired": true
}