{
    "@odata.type": "#microsoft.graph.roadmap",
    "id": "a8e985eb-fd9e-4764-ac18-4376623d8b65",
    "changeItemService": "other",
    "tags": [
        ""
    ],
    "systemTags": [
        "entra_roadmap_highlight_product_news"
    ],
    "documentationUrls": [
        "https://techcommunity.microsoft.com/blog/identity/security-copilot-is-now-embedded-in-microsoft-entra/4289387"
    ],
    "shortDescription": "Security Copilot is now integrated into the Microsoft Entra admin center for easy access to identity skills.",
    "title": "Security Copilot is now embedded in Microsoft Entra",
    "description": "Today we’ve announced the public preview of Microsoft Security Copilot embedded in the Microsoft Entra admin center. This integration brings all identity skills previously made generally available for the Security Copilot standalone experience in April 2024, along with new identity capabilities for admins and security analysts to use directly within the Microsoft Entra admin center. We've also added brand new skills to help improve identity-related risk investigation. In December, we will broaden the scope even further to include a set of skills specifically for App Risk Management in both standalone and embedded experiences of Security Copilot and Microsoft Entra. These capabilities allow identity admins and security analysts better identify, understand, and remediate the risks impacting applications and workload identities registered in Microsoft Entra. \n \n With Security Copilot now embedded in Microsoft Entra, identity admins get AI-driven, natural-language summaries of identity context and insights tailored for handling security incidents, equipping them to better protect against identity compromise. The embedded experience also accelerates troubleshooting tasks like resolving identity-related risks and sign-in issues, without ever leaving the admin center.",
    "changeItemState": "available",
    "deliveryStage": "publicPreview",
    "category": "identitySecurityProtection",
    "publishedDateTime": "2024-11-19T21:00:00Z",
    "gotoLink": null
}