{
    "@odata.type": "#microsoft.graph.announcement",
    "id": "ce4d594b-b763-4deb-831a-6e91a14c696f",
    "changeItemService": "authenticationsLogins",
    "tags": [
        "Identity Security"
    ],
    "systemTags": [],
    "documentationUrls": [
        "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-33781"
    ],
    "shortDescription": "",
    "title": "Security update to Entra ID affecting clients which are running old, unpatched builds of Windows",
    "description": "We are making a security update to Entra ID such that use of older unpatched version of Windows which still use the less secure Key Derivation Function v1 (KDFv1) will no longer be supported. Once the update is rolled out, unsupported and unpatched Windows 10 and 11 clients will no longer be able to sign in to Entra ID. Globally, more than 99% of Windows clients signing in to Entra ID have the required security patches. \n \n Action required: \n \n If your Windows devices have Security Patches after July 2021 no action is required. If your Windows devices do not have security updates after July 2021, update Windows to the latest build of your currently supported Windows version to maintain access to Entra ID. All currently supported versions of Windows have the required patch. We recommend you keep Windows up to date with Security Updates. \n \n Background: \n \n A Security Update to Windows CVE-2021-33781 was issued in July 2021 to address a vulnerability where Primary Refresh Tokens were not stored sufficiently securely in the client. Once patched, Windows clients used the stronger KDFv2 algorithm. All versions of Windows released since that time have the update and handle the token securely. \n \n A small percentage of Windows devices have not yet been updated and are still using the older v1 key derivation function. To improve security of the system, unpatched devices using the KDFv1 algorithm will no longer be able to sign in to Entra ID using Primary Refresh Tokens. \n \n What is the user experience on unsupported Windows devices when this change is rolled out? \n \n Users of Windows devices which haven’t been updated with patches since July 2021 may experience sign in failures with their Entra ID user accounts on joined or hybrid joined Windows device. \n \n How do I diagnose this situation? \n \n The error code, which will show in sign in logs, is 'AADSTS5000611: Symmetric Key Derivation Function version 'KDFV1' is invalid. Update the device for the latest updates.",
    "announcementDateTime": "2024-07-01T00:00:00Z",
    "targetDateTime": "2024-08-01T00:00:00Z",
    "impactLink": null,
    "changeType": "breakingChange",
    "isCustomerActionRequired": true
}