{
    "@odata.type": "#microsoft.graph.roadmap",
    "id": "cfd31b6d-46e3-4461-b3ce-4cc1cf239d92",
    "changeItemService": "other",
    "tags": [
        ""
    ],
    "systemTags": [],
    "documentationUrls": [
        "https://learn.microsoft.com/en-us/entra/permissions-management/permissions-management-for-defender-for-cloud"
    ],
    "shortDescription": "",
    "title": "Integration of Microsoft Entra Permissions Management with Microsoft Defender for Cloud (MDC)",
    "description": "Microsoft Defender for Cloud's integration with Microsoft Entra Permissions Management (Permissions Management) provides a Cloud Infrastructure Entitlement Management (CIEM) security model that helps organizations manage and control user access and entitlements in their cloud infrastructure. CIEM is a critical component of the Cloud Native Application Protection Platform (CNAPP) solution that provides visibility into who or what has access to specific resources. CIEM ensures that access rights adhere to the principle of least privilege (PoLP), where users or workload identities, such as apps and services, receive only the minimum levels of access necessary to perform their tasks. CIEM also helps organizations to monitor and manage permissions across multiple cloud environments, including Azure, AWS, and GCP. \n \n Integrating Permissions Management with Defender for Cloud (CNAPP) strengthens cloud security by preventing security breaches caused by excessive permissions or misconfigurations. Permissions Management continuously monitors and manages cloud entitlements, helping to discover attack surfaces, detect threats, right-size access permissions, and maintain compliance. This integration enhances the capabilities of Defender for Cloud in securing cloud-native applications and protecting sensitive data.",
    "changeItemState": "available",
    "deliveryStage": "ga",
    "category": "permissionsManagement",
    "publishedDateTime": "2024-05-25T07:00:00Z",
    "gotoLink": null
}