{
    "@odata.type": "#microsoft.graph.announcement",
    "id": "ddde9e3b-7ee4-4066-a62e-fb1fc5fb87a1",
    "changeItemService": "mfA",
    "tags": [
        "Identity Security"
    ],
    "systemTags": [
        "entra_roadmap_highlight_change_announcement"
    ],
    "documentationUrls": [
        "https://learn.microsoft.com/en-us/entra/identity/authentication/concept-mandatory-multifactor-authentication"
    ],
    "shortDescription": "Learn how multifactor authentication (MFA) can protect your data and identity and get ready for upcoming MFA requirement.",
    "title": "Upcoming MFA Enforcement on Microsoft Entra admin center",
    "description": "As part of our commitment to providing our customers with the highest level of security, we previously announced that Microsoft will require multi-factor authentication (MFA) for users signing into Azure. We would like to share an update that the scope of MFA enforcement includes Microsoft Entra admin center in addition to the Azure portal and Intune admin center. This change will be rolled out in phases, allowing organizations time to plan their implementation: \n Phase 1: Starting in the second half of the calendar year 2024, MFA will be required to sign in to the Entra admin center, Azure portal, and Intune admin center. The enforcement will gradually roll out to all tenants worldwide. This phase will not impact other Azure clients such as the Azure Command Line Interface, Azure PowerShell, Azure mobile app, and Infrastructure as Code (IaC) tools. \n Phase 2: Beginning in early 2025, gradual enforcement of MFA at sign-in for the Azure CLI, Azure PowerShell, Azure mobile app, and Infrastructure as Code (IaC) tools will commence. \n Microsoft will send a 60-day advance notice to all Entra global admins by email and through Azure Service Health Notifications to notify them of the start date of enforcement and required actions. Additional notifications will be sent through the Azure portal, Entra admin center, and the M365 message center. \n We understand that some customers may need additional time to prepare for this MFA requirement. Therefore, Microsoft will allow extended time for customers with complex environments or technical barriers. The notification from us will also include details about how customers can postpone the start date of enforcement for their tenants, the duration of the postponement, and a link to apply.",
    "announcementDateTime": "2024-08-16T00:00:00Z",
    "targetDateTime": "2024-08-16T00:00:00Z",
    "impactLink": null,
    "changeType": "breakingChange",
    "isCustomerActionRequired": true
}