{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "admx--microsoftedgeAuthSchemes_AuthSchemes",
    "valueType": "collection",
    "displayName": "Supported authentication schemes",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "admx--microsoftedgeAuthSchemes_AuthSchemes_element",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "admx--microsoftedge_AuthSchemes",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
                    "values": [
                        {
                            "value": "enabled",
                            "displayName": null
                        }
                    ]
                }
            ]
        }
    ]
}