{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsPhoneEASEmailProfileConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_userDomainNameSource",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_syncCalendar",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_customDomainName",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_usernameAADSource",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_usernameSource",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_applyOnlyToWindowsPhone81",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_emailAddressSource",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_syncTasks",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_requireSsl",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_accountName",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_hostName",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_syncContacts",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_emailSyncSchedule",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_durationOfEmailToSync",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_applyToWindows10",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_assignmentProgress",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}