{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10PolicyOverrideConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10PolicyOverrideConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10PolicyOverrideConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10PolicyOverrideConfiguration_preferMdmOverGroupPolicy",
        "deviceConfiguration--windows10PolicyOverrideConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10PolicyOverrideConfiguration_scenarioType",
        "deviceConfiguration--windows10PolicyOverrideConfiguration_preferMdmOverGroupPolicyInternal",
        "deviceConfiguration--windows10PolicyOverrideConfiguration_assignmentProgress",
        "deviceConfiguration--windows10PolicyOverrideConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}