{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_stayOnModes",
    "valueType": "collection",
    "displayName": "Screen on while device plugged in",
    "isTopLevel": true,
    "description": "The battery plugged in modes for which the device stays on. When using this setting, it is recommended to clear the Time to lock screen setting so that the device doesn't lock itself while it stays on.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_stayOnModes_element",
    "constraints": [],
    "dependencies": []
}