{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--hardwareDeviceInstallationBlocked",
    "valueType": "complex",
    "displayName": "Yes",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--hardwareDeviceInstallationBlocked_removeMatchingHardwareDevices",
        "deviceConfiguration--hardwareDeviceInstallationBlocked_identifiers"
    ],
    "constraints": [],
    "dependencies": []
}