{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iOSSingleSignOnExtension",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSSingleSignOnExtension_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSAzureAdSingleSignOnExtension",
        "deviceConfiguration--iOSCredentialSingleSignOnExtension",
        "deviceConfiguration--iOSRedirectSingleSignOnExtension",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension"
    ],
    "constraints": [],
    "dependencies": []
}