{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--unsupportedDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__unsupportedDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--unsupportedDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--unsupportedDeviceConfiguration_details",
        "deviceConfiguration--unsupportedDeviceConfiguration_originalEntityTypeName",
        "deviceConfiguration--unsupportedDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--unsupportedDeviceConfiguration_scenarioType",
        "deviceConfiguration--unsupportedDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--unsupportedDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}