{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidCompliancePolicy_restrictedApps",
    "valueType": "collection",
    "displayName": "Restricted apps",
    "isTopLevel": true,
    "description": "Add bundle IDs for apps that should be restricted. A device that has at least one app installed which is found on the restricted apps list will be marked as non-compliant.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [],
    "dependencies": []
}