{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10AssociatedApps",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10AssociatedApps_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10AssociatedApps_appType",
        "deviceConfiguration--windows10AssociatedApps_identifier"
    ],
    "constraints": [],
    "dependencies": []
}