{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskProfile_appConfiguration",
    "valueType": "abstractComplex",
    "displayName": "App Configuration Settings",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--windowsKioskMultipleApps",
        "deviceConfiguration--windowsKioskSingleUWPApp"
    ],
    "constraints": [],
    "dependencies": []
}