{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsKioskConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskConfiguration_kioskBrowserBlockedUrlExceptions",
        "deviceConfiguration--windowsKioskConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsKioskConfiguration_kioskBrowserEnableNavigationButtons",
        "deviceConfiguration--windowsKioskConfiguration_edgeKioskEnablePublicBrowsing",
        "deviceConfiguration--windowsKioskConfiguration_kioskProfiles",
        "deviceConfiguration--windowsKioskConfiguration_edgeKioskResetAfterIdleTimeInMinutes",
        "deviceConfiguration--windowsKioskConfiguration_kioskBrowserRestartOnIdleTimeInMinutes",
        "deviceConfiguration--windowsKioskConfiguration_kioskBrowserEnableHomeButton",
        "deviceConfiguration--windowsKioskConfiguration_windowsKioskForceUpdateSchedule",
        "deviceConfiguration--windowsKioskConfiguration_kioskBrowserBlockedURLs",
        "deviceConfiguration--windowsKioskConfiguration_kioskBrowserDefaultUrl",
        "deviceConfiguration--windowsKioskConfiguration_kioskBrowserEnableEndSessionButton",
        "deviceConfiguration--windowsKioskConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsKioskConfiguration_scenarioType",
        "deviceConfiguration--windowsKioskConfiguration_assignedAccessConfigurationRS3",
        "deviceConfiguration--windowsKioskConfiguration_assignedAccessSingleKioskMode",
        "deviceConfiguration--windowsKioskConfiguration_assignmentProgress",
        "deviceConfiguration--windowsKioskConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}