{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--proxiedDomain",
    "valueType": "complex",
    "displayName": "Cloud resources",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--proxiedDomain_iPAddressOrFQDN",
        "deviceConfiguration--proxiedDomain_proxy"
    ],
    "constraints": [],
    "dependencies": []
}