{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--deliveryOptimizationBandwidthHoursWithPercentage",
    "valueType": "complex",
    "displayName": "Percentage with business hours",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deliveryOptimizationBandwidthHoursWithPercentage_bandwidthForegroundPercentageHours",
        "deviceConfiguration--deliveryOptimizationBandwidthHoursWithPercentage_bandwidthBackgroundPercentageHours"
    ],
    "constraints": [],
    "dependencies": []
}