{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkPkcsCertificateProfile_rootCertificate",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkPkcsCertificateProfile_rootCertificate_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkTrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkTrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--androidForWorkTrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkTrustedRootCertificate_certFileName",
        "deviceConfiguration--androidForWorkTrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--androidForWorkTrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}