{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_bluetoothAllowedServices",
    "valueType": "collection",
    "displayName": "Bluetooth allowed services",
    "isTopLevel": true,
    "description": "Using hex formatted strings, specify a list of allowed Bluetooth services and profiles.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_bluetoothAllowedServices_element",
    "constraints": [],
    "dependencies": []
}