{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidEnterpriseWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidEnterpriseWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_usernameFormatString",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_authenticationMethod",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_eapType",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_ssid",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_networkName",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_innerAuthenticationProtocolForEapTtls",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_innerAuthenticationProtocolForPeap",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForEapTtls",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForPeap",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_outerIdentityPrivacyTemporaryValue",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_enableOuterIdentityPrivacy",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_preSharedKeySet",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_preSharedKey",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_passwordFormatString",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_rootCertificateForServerValidation",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}