{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdditionalGuardedFolders",
    "valueType": "collection",
    "displayName": "List of additional folders that need to be protected",
    "isTopLevel": true,
    "description": "Define a list of disk locations that will be protected from untrusted applications.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=872617",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdditionalGuardedFolders_element",
    "constraints": [],
    "dependencies": []
}