{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSUpdateConfiguration_scheduledInstallDays",
    "valueType": "collection",
    "displayName": "Scheduled install days",
    "isTopLevel": true,
    "description": "Scheduled install days",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSUpdateConfiguration_scheduledInstallDays_element",
    "constraints": [],
    "dependencies": []
}