{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--deliveryOptimizationBandwidthHoursWithPercentage_bandwidthForegroundPercentageHours",
    "valueType": "complex",
    "displayName": "Maximum foreground download bandwidth",
    "isTopLevel": false,
    "description": "Maximum foreground download bandwidth",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deliveryOptimizationBandwidthBusinessHoursLimit_bandwidthBeginBusinessHours",
        "deviceConfiguration--deliveryOptimizationBandwidthBusinessHoursLimit_bandwidthEndBusinessHours",
        "deviceConfiguration--deliveryOptimizationBandwidthBusinessHoursLimit_bandwidthPercentageOutsideBusinessHours",
        "deviceConfiguration--deliveryOptimizationBandwidthBusinessHoursLimit_bandwidthPercentageDuringBusinessHours"
    ],
    "constraints": [],
    "dependencies": []
}