{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileVpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileVpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileVpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_customKeyValueData",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_identityCertificate",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_servers",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_fingerprint",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_role",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_connectionType",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_connectionName",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_realm",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_authenticationMethod",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_customData",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_assignmentProgress",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_proxyServer",
        "deviceConfiguration--androidWorkProfileVpnConfiguration_targetedPackageIds"
    ],
    "constraints": [],
    "dependencies": []
}