{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--appleVpnAlwaysOnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__appleVpnAlwaysOnConfiguration_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_tunnelConfiguration",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_userToggleEnabled",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_voicemailExceptionAction",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_airPrintExceptionAction",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_cellularExceptionAction",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_allowedCaptiveNetworkPlugins",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_allowCaptiveWebSheet",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_nATKeepAliveIntervalInSeconds",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_nATKeepAliveOffloadEnable",
        "deviceConfiguration--appleVpnAlwaysOnConfiguration_allowAllCaptiveNetworkPlugins"
    ],
    "constraints": [],
    "dependencies": []
}