{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidPkcsCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidPkcsCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidPkcsCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidPkcsCertificateProfile_certificationAuthority",
        "deviceConfiguration--androidPkcsCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidPkcsCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidPkcsCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidPkcsCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidPkcsCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidPkcsCertificateProfile_certificateTemplateName",
        "deviceConfiguration--androidPkcsCertificateProfile_certificationAuthorityName",
        "deviceConfiguration--androidPkcsCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidPkcsCertificateProfile_rootCertificate",
        "deviceConfiguration--androidPkcsCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidPkcsCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidPkcsCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidPkcsCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}