{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsFirewallNetworkProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsFirewallNetworkProfile_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_unicastResponsesToMulticastBroadcastsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_unicastResponsesToMulticastBroadcastsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_stealthModeRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_securedPacketExemptionAllowed",
        "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_authorizedApplicationRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_globalPortRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_globalPortRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_stealthModeBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
        "deviceConfiguration--windowsFirewallNetworkProfile_authorizedApplicationRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_securedPacketExemptionBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_incomingTrafficRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_incomingTrafficBlocked"
    ],
    "constraints": [],
    "dependencies": []
}