{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSVpnConfiguration_derivedCredentialSettings",
    "valueType": "complex",
    "displayName": "Derived Credential Settings",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementDerivedCredentialSettings_helpUrl",
        "deviceConfiguration--deviceManagementDerivedCredentialSettings_id",
        "deviceConfiguration--deviceManagementDerivedCredentialSettings_notificationType",
        "deviceConfiguration--deviceManagementDerivedCredentialSettings_issuer",
        "deviceConfiguration--deviceManagementDerivedCredentialSettings_displayName"
    ],
    "constraints": [],
    "dependencies": []
}