{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81GeneralConfiguration_compliantAppsList",
    "valueType": "collection",
    "displayName": "Apps list",
    "isTopLevel": true,
    "description": "Enter the Microsoft Store URL of the app you want. For example, to specify the Microsoft Remote Desktop app for Windows Phone, enter https://www.microsoft.com/en-us/store/apps/remote-desktop/9wzdncrfj3ps. To find the URL of an app, use a search engine to locate the store page. For example, to find the Remote Desktop app, you could search Microsoft Remote Desktop Microsoft Store.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--windowsPhone81GeneralConfiguration_compliantAppListType",
            "constraints": []
        }
    ]
}