{
    "id": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptInitiatedWindows",
    "valueType": "string",
    "displayName": "Internet Explorer internet zone script initiated windows",
    "isTopLevel": true,
    "description": "This policy setting allows you to manage restrictions on script-initiated pop-up windows and windows that include the title and status bars.\r\n\r\nIf you enable this policy setting, Windows Restrictions security will not apply in this zone. The security zone runs without the added layer of security provided by this feature.\r\n\r\nIf you disable this policy setting, the possible harmful actions contained in script-initiated pop-up windows and windows that include the title and status bars cannot be run. This Internet Explorer security feature will be on in this zone as dictated by the Scripted Windows Security Restrictions feature control setting for the process.\r\n\r\nIf you do not configure this policy setting, the possible harmful actions contained in script-initiated pop-up windows and windows that include the title and status bars cannot be run. This Internet Explorer security feature will be on in this zone as dictated by the Scripted Windows Security Restrictions feature control setting for the process.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067088",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
            "values": [
                {
                    "value": "notConfigured",
                    "displayName": "Not configured"
                },
                {
                    "value": "enabled",
                    "displayName": "Enabled"
                },
                {
                    "value": "disabled",
                    "displayName": "Disabled"
                }
            ]
        }
    ],
    "dependencies": []
}