{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration_identityCertificate",
    "valueType": "abstractComplex",
    "displayName": "Identity certificate",
    "isTopLevel": true,
    "description": "Identity certificate",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--windows10ImportedPFXCertificateProfile",
        "deviceConfiguration--windows10PkcsCertificateProfile",
        "deviceConfiguration--windows81SCEPCertificateProfile",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}