{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10CompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10CompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10CompliancePolicy_configurationManagerComplianceRequired",
        "deviceConfiguration--windows10CompliancePolicy_id",
        "deviceConfiguration--windows10CompliancePolicy_deviceThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--windows10CompliancePolicy_passwordBlockSimple",
        "deviceConfiguration--windows10CompliancePolicy_bitLockerEnabled",
        "deviceConfiguration--windows10CompliancePolicy_codeIntegrityEnabled",
        "deviceConfiguration--windows10CompliancePolicy_defenderEnabled",
        "deviceConfiguration--windows10CompliancePolicy_uacRequired",
        "deviceConfiguration--windows10CompliancePolicy_earlyLaunchAntiMalwareDriverEnabled",
        "deviceConfiguration--windows10CompliancePolicy_passwordRequiredType",
        "deviceConfiguration--windows10CompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--windows10CompliancePolicy_validOperatingSystemBuildRanges",
        "deviceConfiguration--windows10CompliancePolicy_advancedThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--windows10CompliancePolicy_passwordRequiredToUnlockFromIdle",
        "deviceConfiguration--windows10CompliancePolicy_deviceThreatProtectionEnabled",
        "deviceConfiguration--windows10CompliancePolicy_antivirusRequireCurrentSignature",
        "deviceConfiguration--windows10CompliancePolicy_antiSpywareRequired",
        "deviceConfiguration--windows10CompliancePolicy_signatureOutOfDate",
        "deviceConfiguration--windows10CompliancePolicy_antivirusRequired",
        "deviceConfiguration--windows10CompliancePolicy_requireHealthyDeviceReport",
        "deviceConfiguration--windows10CompliancePolicy_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--windows10CompliancePolicy_passwordMinimumCharacterSetCount",
        "deviceConfiguration--windows10CompliancePolicy_tpmRequired",
        "deviceConfiguration--windows10CompliancePolicy_secureBootEnabled",
        "deviceConfiguration--windows10CompliancePolicy_rtpEnabled",
        "deviceConfiguration--windows10CompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--windows10CompliancePolicy_passwordRequired",
        "deviceConfiguration--windows10CompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--windows10CompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--windows10CompliancePolicy_activeFirewallRequired",
        "deviceConfiguration--windows10CompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--windows10CompliancePolicy_antiSpywareRequireCurrentSignature",
        "deviceConfiguration--windows10CompliancePolicy_osMinimumVersion",
        "deviceConfiguration--windows10CompliancePolicy_osMaximumVersion",
        "deviceConfiguration--windows10CompliancePolicy_mobileOsMinimumVersion",
        "deviceConfiguration--windows10CompliancePolicy_mobileOsMaximumVersion",
        "deviceConfiguration--windows10CompliancePolicy_defenderVersion",
        "deviceConfiguration--windows10CompliancePolicy_minimumUpdateAutoInstallClassification",
        "deviceConfiguration--windows10CompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10CompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--windows10CompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}