{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration_associatedApps",
    "valueType": "collection",
    "displayName": "Associated apps",
    "isTopLevel": true,
    "description": "Associated apps",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10AssociatedApps",
    "constraints": [],
    "dependencies": []
}