{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--deviceComplianceScheduledActionForRule",
    "valueType": "complex",
    "displayName": "Scheduled action for rule",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceComplianceScheduledActionForRule_ruleName",
        "deviceConfiguration--deviceComplianceScheduledActionForRule_scheduledActionConfigurations",
        "deviceConfiguration--deviceComplianceScheduledActionForRule_id"
    ],
    "constraints": [],
    "dependencies": []
}