{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerImportedPFXCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_rootCertificate",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_intendedPurpose",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}