{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSAppleEventReceiver",
    "valueType": "complex",
    "displayName": "Apple event receiver",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSAppleEventReceiver_identifier",
        "deviceConfiguration--macOSAppleEventReceiver_identifierType",
        "deviceConfiguration--macOSAppleEventReceiver_codeRequirement",
        "deviceConfiguration--macOSAppleEventReceiver_allowed"
    ],
    "constraints": [],
    "dependencies": []
}