{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10NetworkBoundaryConfiguration_windowsNetworkIsolationPolicy",
    "valueType": "complex",
    "displayName": "Windows network isolation policy",
    "isTopLevel": true,
    "description": "Windows network isolation policy",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseIPRanges",
        "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseCloudResources",
        "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseNetworkDomainNames",
        "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseProxyServers",
        "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseInternalProxyServers",
        "deviceConfiguration--windowsNetworkIsolationPolicy_neutralDomainResources",
        "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseProxyServersAreAuthoritative",
        "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseIPRangesAreAuthoritative"
    ],
    "constraints": [],
    "dependencies": []
}