{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--omaSettingDateTime",
    "valueType": "complex",
    "displayName": "Date and time",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--omaSettingDateTime_displayName",
        "deviceConfiguration--omaSettingDateTime_description",
        "deviceConfiguration--omaSettingDateTime_omaUri",
        "deviceConfiguration--omaSettingDateTime_value"
    ],
    "constraints": [],
    "dependencies": []
}