{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSEnterpriseWiFiConfiguration_trustedServerCertificateNames",
    "valueType": "collection",
    "displayName": "Trusted server certificate names",
    "isTopLevel": true,
    "description": "Trusted server certificate names",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSEnterpriseWiFiConfiguration_trustedServerCertificateNames_element",
    "constraints": [],
    "dependencies": []
}