{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81GeneralConfiguration_appsComplianceList",
    "valueType": "collection",
    "displayName": "Apps compliance list",
    "isTopLevel": true,
    "description": "Apps compliance list",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appsComplianceListItem",
    "constraints": [],
    "dependencies": []
}