{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEduDeviceConfiguration_studentCertificateSettings",
    "valueType": "complex",
    "displayName": "Student certificate settings",
    "isTopLevel": true,
    "description": "Student certificate settings",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSEduCertificateSettings_certificationAuthorityName",
        "deviceConfiguration--iOSEduCertificateSettings_certificationAuthority",
        "deviceConfiguration--iOSEduCertificateSettings_certificateTemplateName",
        "deviceConfiguration--iOSEduCertificateSettings_certificateValidityPeriodScale",
        "deviceConfiguration--iOSEduCertificateSettings_certificateValidityPeriodValue",
        "deviceConfiguration--iOSEduCertificateSettings_renewalThresholdPercentage",
        "deviceConfiguration--iOSEduCertificateSettings_trustedRootCertificate",
        "deviceConfiguration--iOSEduCertificateSettings_certFileName"
    ],
    "constraints": [],
    "dependencies": []
}