{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkWiFiConfiguration_ssid",
        "deviceConfiguration--androidForWorkWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidForWorkWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidForWorkWiFiConfiguration_networkName",
        "deviceConfiguration--androidForWorkWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidForWorkWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidForWorkWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}