{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSImportedPFXCertificateProfile",
    "valueType": "complex",
    "displayName": "iOS Imported PFX Certificate Profile",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSImportedPFXCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSImportedPFXCertificateProfile_intendedPurpose",
        "deviceConfiguration--iOSImportedPFXCertificateProfile_scenarioType",
        "deviceConfiguration--iOSImportedPFXCertificateProfile_assignmentProgress",
        "deviceConfiguration--iOSImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}