{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallRules",
    "valueType": "collection",
    "displayName": "Firewall rules",
    "isTopLevel": true,
    "description": "Create Windows Firewall rules. One Endpoint Protection profile may contain up to 150 rules.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsFirewallRule",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": null,
            "maximumLength": 150
        }
    ],
    "dependencies": []
}