{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsAssignedAccessProfile_desktopAppPaths",
    "valueType": "collection",
    "displayName": "Desktop app paths",
    "isTopLevel": false,
    "description": "Desktop app paths",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsAssignedAccessProfile_desktopAppPaths_element",
    "constraints": [],
    "dependencies": []
}