{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSScepCertificateProfile",
    "valueType": "complex",
    "displayName": "iOS Scep Certificate Profile",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSScepCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--iOSScepCertificateProfile_subjectNameFormat",
        "deviceConfiguration--iOSScepCertificateProfile_scepServerUrls",
        "deviceConfiguration--iOSScepCertificateProfile_rootCertificate",
        "deviceConfiguration--iOSScepCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--iOSScepCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--iOSScepCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--iOSScepCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--iOSScepCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--iOSScepCertificateProfile_keySize",
        "deviceConfiguration--iOSScepCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSScepCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--iOSScepCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSScepCertificateProfile_keyUsage",
        "deviceConfiguration--iOSScepCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--iOSScepCertificateProfile_certificateStore",
        "deviceConfiguration--iOSScepCertificateProfile_assignmentProgress",
        "deviceConfiguration--iOSScepCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}