{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--macOSWiFiConfiguration_ssid",
        "deviceConfiguration--macOSWiFiConfiguration_proxyAutomaticConfigurationUrl",
        "deviceConfiguration--macOSWiFiConfiguration_networkName",
        "deviceConfiguration--macOSWiFiConfiguration_preSharedKey",
        "deviceConfiguration--macOSWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--macOSWiFiConfiguration_proxyManualPort",
        "deviceConfiguration--macOSWiFiConfiguration_preSharedKeySet",
        "deviceConfiguration--macOSWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--macOSWiFiConfiguration_proxySettings",
        "deviceConfiguration--macOSWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSWiFiConfiguration_proxyManualAddress",
        "deviceConfiguration--macOSWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--macOSWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}