{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordBlockKeyguardFeatures",
    "valueType": "collection",
    "displayName": "Disabled lock screen features",
    "isTopLevel": true,
    "description": "These features are accessible to users when the device is locked. Users will not be able to see or access disabled features.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordBlockKeyguardFeatures_element",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordBlockKeyguard",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementSettingBooleanConstraint",
                    "value": false
                }
            ]
        }
    ]
}