{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSWebContentFilterAutoFilter_allowedUrls",
    "valueType": "collection",
    "displayName": "Permitted URLs",
    "isTopLevel": false,
    "description": "Use this filtering system to explicitly allow URLs that bypass the Apple’s built in AutoFilter. URLs added here will be allowed access even if they might get blocked by the Apple AutoFilter.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSWebContentFilterAutoFilter_allowedUrls_element",
    "constraints": [],
    "dependencies": []
}