{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidForWorkPkcsCertificateProfile_customSubjectAlternativeNames",
    "valueType": "collection",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkPkcsCertificateProfile_customSubjectAlternativeNames_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--customSubjectAlternativeName",
    "constraints": [],
    "dependencies": []
}