{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEnterpriseWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSEnterpriseWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_ssid",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_usernameFormatString",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForEapTtls",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_proxySettings",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_networkName",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_preSharedKey",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_proxyManualAddress",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_enableOuterIdentityPrivacy",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_authenticationMethod",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_eapType",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_preSharedKeySet",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_derivedCredentialSettings",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_passwordFormatString",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_innerAuthenticationProtocolForEapTtls",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_rootCertificatesForServerValidation",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_proxyManualPort",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_trustedServerCertificateNames",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_proxyAutomaticConfigurationUrl",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_eapFastConfiguration",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_outerIdentityPrivacyTemporaryValue",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}