{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPrivacyDataAccessControlItem",
    "valueType": "complex",
    "displayName": "Data access control",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsPrivacyDataAccessControlItem_dataCategory",
        "deviceConfiguration--windowsPrivacyDataAccessControlItem_accessLevel",
        "deviceConfiguration--windowsPrivacyDataAccessControlItem_id",
        "deviceConfiguration--windowsPrivacyDataAccessControlItem_appPackageFamilyName",
        "deviceConfiguration--windowsPrivacyDataAccessControlItem_appDisplayName"
    ],
    "constraints": [],
    "dependencies": []
}