{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--hardwareDeviceInstallation",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__hardwareDeviceInstallation_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--hardwareDeviceInstallationAllowed",
        "deviceConfiguration--hardwareDeviceInstallationBlocked",
        "deviceConfiguration--allowDeviceInstallation"
    ],
    "constraints": [],
    "dependencies": []
}