{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration_routes",
    "valueType": "collection",
    "displayName": "Split tunneling routes for this VPN connection",
    "isTopLevel": true,
    "description": "Optional - for third-party providers.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--vpnRoute",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--windows81VpnConfiguration_enableSplitTunneling",
            "constraints": []
        },
        {
            "definitionId": "deviceConfiguration--windows10VpnConfiguration_enableSplitTunneling",
            "constraints": []
        }
    ]
}