{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsFirewallRule_interfaceTypes",
    "valueType": "collection",
    "displayName": "Interface types",
    "isTopLevel": false,
    "description": "Specifies the interface types to which the rule belongs: \"Remote access\", \"Wireless\", or \"Local area network.\" If none selected, the rule applies to all interface types.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsFirewallRule_interfaceTypes_element",
    "constraints": [],
    "dependencies": []
}