{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidVpnConfiguration_servers",
    "valueType": "collection",
    "displayName": "IP address or FQDN",
    "isTopLevel": true,
    "description": "This is the fully qualified domain name or IP address of your VPN server on the network. Make sure that end-users can access this network location.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--vpnServer",
    "constraints": [],
    "dependencies": []
}