{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidImportedPFXCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidImportedPFXCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidImportedPFXCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidImportedPFXCertificateProfile_rootCertificate",
        "deviceConfiguration--androidImportedPFXCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidImportedPFXCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidImportedPFXCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidImportedPFXCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidImportedPFXCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidImportedPFXCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidImportedPFXCertificateProfile_intendedPurpose",
        "deviceConfiguration--androidImportedPFXCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}