{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_deviceThreatProtectionEnabled",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_securityRequireSafetyNetAttestationBasicIntegrity",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordRequired",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinimumUpperCaseCharacters",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinimumSymbolCharacters",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordPreviousPasswordCountToBlock",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_advancedThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_id",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_deviceThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordRequiredType",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinimumLetterCharacters",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinimumLowerCaseCharacters",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_securityRequireSafetyNetAttestationCertifiedDevice",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinimumNumericCharacters",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordMinimumNonLetterCharacters",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_securityBlockJailbrokenDevices",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_minAndroidSecurityPatchLevel",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_osMinimumVersion",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_osMaximumVersion",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidDeviceOwnerCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}