{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSVpnConfiguration_onDemandRules",
    "valueType": "collection",
    "displayName": "DNS Triggers",
    "isTopLevel": true,
    "description": "DNS Triggers are for per-APP VPN. For iOS, they only apply when authentication is set to certificates.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--vpnOnDemandRule",
    "constraints": [],
    "dependencies": []
}