{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSWebContentFilterAutoFilter_blockedUrls",
    "valueType": "collection",
    "displayName": "Blocked URLs",
    "isTopLevel": false,
    "description": "Use this filtering system to only block URLs that you don’t want students to access. Any URL not in this list will be accessible by students.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSWebContentFilterAutoFilter_blockedUrls_element",
    "constraints": [],
    "dependencies": []
}