{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_printerNames",
    "valueType": "collection",
    "displayName": "Printers",
    "isTopLevel": true,
    "description": "Automatically provision printers based on their names (network host names).",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_printerNames_element",
    "constraints": [],
    "dependencies": []
}