{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSWebContentFilterSpecificWebsitesAccess",
    "valueType": "complex",
    "displayName": "Specific websites only",
    "isTopLevel": false,
    "description": "These URLs are added to the browser’s bookmarks, and the user is not allowed to visit any sites other than these. This is the most stringent method of filtering web content – use this only if you know the exact list of URLs that can be accessed by users",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSWebContentFilterSpecificWebsitesAccess_specificWebsitesOnly",
        "deviceConfiguration--iOSWebContentFilterSpecificWebsitesAccess_websiteList"
    ],
    "constraints": [],
    "dependencies": []
}