{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths",
    "valueType": "abstractComplex",
    "displayName": "Configure secure access to UNC paths",
    "isTopLevel": true,
    "description": "This policy setting configures secure access to UNC paths.\r\nIf you enable this policy, Windows only allows access to the specified UNC paths after fulfilling additional security requirements.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067243",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--hardenedUncPathDisabled",
        "deviceConfiguration--hardenedUncPathEnabled"
    ],
    "constraints": [],
    "dependencies": []
}