{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--defenderDetectedMalwareActions",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__defenderDetectedMalwareActions_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--defenderDetectedMalwareActions_lowSeverity",
        "deviceConfiguration--defenderDetectedMalwareActions_highSeverity",
        "deviceConfiguration--defenderDetectedMalwareActions_severeSeverity",
        "deviceConfiguration--defenderDetectedMalwareActions_moderateSeverity"
    ],
    "constraints": [],
    "dependencies": []
}