{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_globalProxy",
    "valueType": "abstractComplex",
    "displayName": "Global proxy type",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--androidDeviceOwnerGlobalProxyDirect",
        "deviceConfiguration--androidDeviceOwnerGlobalProxyAutoConfig"
    ],
    "constraints": [],
    "dependencies": []
}