{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeApps",
    "valueType": "collection",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerGeneralDeviceConfiguration_kioskModeApps_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeUseMangedHomeScreenApp",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
                    "values": [
                        {
                            "value": "enabled",
                            "displayName": null
                        },
                        {
                            "value": "disabled",
                            "displayName": null
                        }
                    ]
                }
            ]
        }
    ]
}