{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--vpnOnDemandRule_dnsSearchDomains",
    "valueType": "collection",
    "displayName": "Dns search domains",
    "isTopLevel": false,
    "description": "Dns search domains",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--vpnOnDemandRule_dnsSearchDomains_element",
    "constraints": [],
    "dependencies": []
}