{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidForWorkCustomConfiguration_omaSettings",
    "valueType": "collection",
    "displayName": "OMA-URI Settings",
    "isTopLevel": true,
    "description": "OMA settings",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--omaSetting",
    "constraints": [],
    "dependencies": []
}