{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkEnterpriseWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_enableOuterIdentityPrivacy",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_outerIdentityPrivacyTemporaryValue",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_eapType",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_ssid",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_innerAuthenticationProtocolForPeap",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_innerAuthenticationProtocolForEapTtls",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForPeap",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_authenticationMethod",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForEapTtls",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_networkName",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_rootCertificateForServerValidation",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}