{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSGeneralDeviceConfiguration_emailInDomainSuffixes",
    "valueType": "collection",
    "displayName": "Unmarked Email Domains",
    "isTopLevel": true,
    "description": "Emails that the user sends or receives which don't match the domains you specify here will be marked as untrusted.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSGeneralDeviceConfiguration_emailInDomainSuffixes_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "MacOSUserApprovedEnrollment",
                "MacOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}