{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerDerivedCredentialAuthenticationConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration_derivedCredentialSettings",
        "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration_scenarioType",
        "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}