{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomain",
    "valueType": "complex",
    "displayName": "Firewall profile domain",
    "isTopLevel": true,
    "description": "Specifies the profiles to which the rule belongs: Domain, Private, Public. This value represents the profile for networks that are connected to domains.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2066796",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_unicastResponsesToMulticastBroadcastsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_unicastResponsesToMulticastBroadcastsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_stealthModeRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_securedPacketExemptionAllowed",
        "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_authorizedApplicationRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_globalPortRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_globalPortRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_stealthModeBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
        "deviceConfiguration--windowsFirewallNetworkProfile_authorizedApplicationRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_securedPacketExemptionBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_incomingTrafficRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_incomingTrafficBlocked"
    ],
    "constraints": [],
    "dependencies": []
}