{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--defaultDeviceCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__defaultDeviceCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--defaultDeviceCompliancePolicy_id",
        "deviceConfiguration--defaultDeviceCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--defaultDeviceCompliancePolicy_requireRemainContact",
        "deviceConfiguration--defaultDeviceCompliancePolicy_requireDeviceCompliancePolicyAssigned",
        "deviceConfiguration--defaultDeviceCompliancePolicy_requireUserExistence",
        "deviceConfiguration--defaultDeviceCompliancePolicy_adminConfiguredCompliance",
        "deviceConfiguration--defaultDeviceCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--defaultDeviceCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--defaultDeviceCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--defaultDeviceCompliancePolicy_oSVersion"
    ],
    "constraints": [],
    "dependencies": []
}