{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--hardenedUncPathEnabled_hardenedUncPaths",
    "valueType": "collection",
    "displayName": "Hardened UNC path list",
    "isTopLevel": false,
    "description": "Specify UNC paths and additional security requirements before allowing access",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--hardenedUncPathElement",
    "constraints": [],
    "dependencies": []
}