{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--vpnTrafficRule",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__vpnTrafficRule_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnTrafficRule_remotePortRanges",
        "deviceConfiguration--vpnTrafficRule_routingPolicyType",
        "deviceConfiguration--vpnTrafficRule_name",
        "deviceConfiguration--vpnTrafficRule_appType",
        "deviceConfiguration--vpnTrafficRule_localAddressRanges",
        "deviceConfiguration--vpnTrafficRule_protocols",
        "deviceConfiguration--vpnTrafficRule_localPortRanges",
        "deviceConfiguration--vpnTrafficRule_appId",
        "deviceConfiguration--vpnTrafficRule_claims",
        "deviceConfiguration--vpnTrafficRule_remoteAddressRanges"
    ],
    "constraints": [],
    "dependencies": []
}