{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSFirewallApplication",
    "valueType": "complex",
    "displayName": "MacOS Firewall Application",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSFirewallApplication_allowsIncomingConnections",
        "deviceConfiguration--macOSFirewallApplication_bundleId"
    ],
    "constraints": [],
    "dependencies": []
}