{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--operatingSystemVersionRange",
    "valueType": "complex",
    "displayName": "Operating System version range",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--operatingSystemVersionRange_description",
        "deviceConfiguration--operatingSystemVersionRange_lowestVersion",
        "deviceConfiguration--operatingSystemVersionRange_highestVersion"
    ],
    "constraints": [],
    "dependencies": []
}