{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsDomainJoinConfiguration_networkAccessConfigurations",
    "valueType": "collection",
    "displayName": "Network access configurations",
    "isTopLevel": true,
    "description": "Network access configurations",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--deviceConfiguration",
    "constraints": [],
    "dependencies": []
}