{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsFirewallRule",
    "valueType": "complex",
    "displayName": "Windows Firewall Rule",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsFirewallRule_displayName",
        "deviceConfiguration--windowsFirewallRule_description",
        "deviceConfiguration--windowsFirewallRule_trafficDirection",
        "deviceConfiguration--windowsFirewallRule_action",
        "deviceConfiguration--windowsFirewallRule_profileTypes",
        "deviceConfiguration--windowsFirewallRule_packageFamilyName",
        "deviceConfiguration--windowsFirewallRule_filePath",
        "deviceConfiguration--windowsFirewallRule_serviceName",
        "deviceConfiguration--windowsFirewallRule_useAnyLocalAddressRange",
        "deviceConfiguration--windowsFirewallRule_actualLocalAddressRanges",
        "deviceConfiguration--windowsFirewallRule_useAnyRemoteAddressRange",
        "deviceConfiguration--windowsFirewallRule_actualRemoteAddressRanges",
        "deviceConfiguration--windowsFirewallRule_protocol",
        "deviceConfiguration--windowsFirewallRule_localPortRanges",
        "deviceConfiguration--windowsFirewallRule_remotePortRanges",
        "deviceConfiguration--windowsFirewallRule_interfaceTypes",
        "deviceConfiguration--windowsFirewallRule_localUserAuthorizations"
    ],
    "constraints": [],
    "dependencies": []
}