{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSSoftwareUpdateConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSSoftwareUpdateConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_allOtherUpdateBehavior",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_updateScheduleType",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_firmwareUpdateBehavior",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_criticalUpdateBehavior",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_configDataUpdateBehavior",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_customUpdateTimeWindows",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_updateTimeWindowUtcOffsetInMinutes",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_assignmentProgress",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}