{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSHomeScreenFolderPage_apps",
    "valueType": "collection",
    "displayName": "List of apps",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSHomeScreenApp",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": 1,
            "maximumLength": 60
        }
    ],
    "dependencies": []
}