{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSKerberosSingleSignOnExtension",
    "valueType": "complex",
    "displayName": "Kerberos",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_realm",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_domains",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_blockAutomaticLogin",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_requireUserPresence",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_isDefaultRealm",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_blockActiveDirectorySiteAutoDiscovery",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_userPrincipalName",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_activeDirectorySiteCode",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_cacheName",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_credentialBundleIdAccessControlList",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_domainRealms",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordBlockModification",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordExpirationDays",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordExpirationNotificationDays",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordRequireActiveDirectoryComplexity",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordMinimumLength",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordMinimumAgeDays",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordRequirementsDescription",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordEnableLocalSync",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension_passwordChangeUrl"
    ],
    "constraints": [],
    "dependencies": []
}