{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationByDeviceIdentifiers",
    "valueType": "abstractComplex",
    "displayName": "Block hardware device installation by device identifiers",
    "isTopLevel": true,
    "description": "This policy setting allows you to specify a list of Plug and Play hardware IDs and compatible IDs for devices that Windows is prevented from installing. This policy setting takes precedence over any other policy setting that allows Windows to install a device.\r\n\r\nIf you block installation, Windows is prevented from installing a device whose hardware ID or compatible ID appears in the list you create. If you enable this policy setting on a remote desktop server, the policy setting affects redirection of the specified devices from a remote desktop client to the remote desktop server.\r\n\r\nIf you allow installation, devices can be installed and updated as allowed or prevented by other policy settings.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2066794",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--hardwareDeviceInstallationAllowed",
        "deviceConfiguration--hardwareDeviceInstallationBlocked"
    ],
    "constraints": [],
    "dependencies": []
}