{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10MobileCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10MobileCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10MobileCompliancePolicy_activeFirewallRequired",
        "deviceConfiguration--windows10MobileCompliancePolicy_codeIntegrityEnabled",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordRequiredType",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordBlockSimple",
        "deviceConfiguration--windows10MobileCompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--windows10MobileCompliancePolicy_bitLockerEnabled",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordRequireToUnlockFromIdle",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordRequired",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--windows10MobileCompliancePolicy_uacRequired",
        "deviceConfiguration--windows10MobileCompliancePolicy_validOperatingSystemBuildRanges",
        "deviceConfiguration--windows10MobileCompliancePolicy_secureBootEnabled",
        "deviceConfiguration--windows10MobileCompliancePolicy_id",
        "deviceConfiguration--windows10MobileCompliancePolicy_earlyLaunchAntiMalwareDriverEnabled",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--windows10MobileCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--windows10MobileCompliancePolicy_passwordMinimumCharacterSetCount",
        "deviceConfiguration--windows10MobileCompliancePolicy_osMinimumVersion",
        "deviceConfiguration--windows10MobileCompliancePolicy_osMaximumVersion",
        "deviceConfiguration--windows10MobileCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10MobileCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--windows10MobileCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}