{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile",
    "valueType": "complex",
    "displayName": "windowsPhone81ImportedPFXCertificateProfile",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_subjectNameFormat",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_keyStorageProvider",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_intendedPurpose",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_assignmentProgress",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}