{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSDeviceFeaturesConfiguration_autoLaunchItems",
    "valueType": "collection",
    "displayName": "Add the files, folders, and custom apps that will launch at login",
    "isTopLevel": true,
    "description": "Enter the path of the file, folder, or custom app that you want to open at login. Apps that have been built or customized for your org are typically located in the Applications folder, with a path that looks like /Applications/Example.app",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSLaunchItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "MacOSDeviceEnrollment",
                "MacOSAutoDeviceEnrollment",
                "MacOSUserEnrollment",
                "MacOSUserApprovedEnrollment"
            ]
        }
    ],
    "dependencies": []
}