{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkCustomConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkCustomConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkCustomConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkCustomConfiguration_omaSettings",
        "deviceConfiguration--androidForWorkCustomConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkCustomConfiguration_scenarioType",
        "deviceConfiguration--androidForWorkCustomConfiguration_assignmentProgress",
        "deviceConfiguration--androidForWorkCustomConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}