{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10PkcsCertificateProfile",
    "valueType": "complex",
    "displayName": "windows10PkcsCertificateProfile",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10PkcsCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--windows10PkcsCertificateProfile_subjectNameFormat",
        "deviceConfiguration--windows10PkcsCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--windows10PkcsCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--windows10PkcsCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--windows10PkcsCertificateProfile_keyStorageProvider",
        "deviceConfiguration--windows10PkcsCertificateProfile_certificationAuthorityName",
        "deviceConfiguration--windows10PkcsCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--windows10PkcsCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--windows10PkcsCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--windows10PkcsCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10PkcsCertificateProfile_certificateStore",
        "deviceConfiguration--windows10PkcsCertificateProfile_certificationAuthority",
        "deviceConfiguration--windows10PkcsCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10PkcsCertificateProfile_certificateTemplateName",
        "deviceConfiguration--windows10PkcsCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--windows10PkcsCertificateProfile_assignmentProgress",
        "deviceConfiguration--windows10PkcsCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}