{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSDeviceFeaturesConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSDeviceFeaturesConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_singleSignOnExtension",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_authorizedUsersListShowOtherManagedUsers",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_authorizedUsersListHidden",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_autoLaunchItems",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_consoleAccessDisabled",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_authorizedUsersListIncludeNetworkUsers",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_logOutDisabledWhileLoggedIn",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_authorizedUsersListHideMobileAccounts",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_restartDisabledWhileLoggedIn",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_sleepDisabled",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_restartDisabled",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_associatedDomains",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_shutDownDisabled",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_loginWindowText",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_adminShowHostInfo",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_authorizedUsersListHideLocalUsers",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_screenLockDisableImmediate",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_powerOffDisabledWhileLoggedIn",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_shutDownDisabledWhileLoggedIn",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_airPrintDestinations",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_authorizedUsersListHideAdminUsers",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_singleSignOnExtensionPkinitCertificate",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_scenarioType",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_assignmentProgress",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_macOSSingleSignOnExtension",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_associatedDomainsCustomWrapper",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration_singleSignOnExtensionPkinitCertificateId"
    ],
    "constraints": [],
    "dependencies": []
}