{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsUpdateState",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsUpdateState_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsUpdateState_userId",
        "deviceConfiguration--windowsUpdateState_status",
        "deviceConfiguration--windowsUpdateState_lastScanDateTime",
        "deviceConfiguration--windowsUpdateState_lastSyncDateTime",
        "deviceConfiguration--windowsUpdateState_deviceId",
        "deviceConfiguration--windowsUpdateState_id",
        "deviceConfiguration--windowsUpdateState_userPrincipalName"
    ],
    "constraints": [],
    "dependencies": []
}