{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkGeneralDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkGeneralDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordPreviousPasswordBlockCount",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinNumericCharacters",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockAddingAccounts",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordRequiredType",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockCrossProfileCopyPaste",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinSymbolCharacters",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_requireAppVerify",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinNonLetterCharacters",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordRequiredType",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinLetterCharacters",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_securityRequireVerifyApps",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordBlockTrustAgents",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordBlockTrustAgents",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockCamera",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordMinimumLength",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordBlockFingerprintUnlock",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinLowerCaseCharacters",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordBlockFingerprintUnlock",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinimumLength",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockScreenCapture",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileDefaultAppPermissionPolicy",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBluetoothEnableContactSharing",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordExpirationDays",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_blockCrossProfileCopyPaste",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_vpnEnableAlwaysOnLockdownMode",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockNotificationsWhileDeviceLocked",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordExpirationDays",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_vpnAlwaysOnPackageIdentifier",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileAllowWidgets",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfilePasswordMinUpperCaseCharacters",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileDataSharingType",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockCrossProfileContactsSearch",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileRequirePassword",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockCrossProfileCallerId",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_workProfileBlockPersonalAppInstallsFromUnknownSources",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_scenarioType",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration_numberOfPasswordsToRemember"
    ],
    "constraints": [],
    "dependencies": []
}