{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_windows10AppsForceUpdateSchedule",
    "valueType": "complex",
    "displayName": "Forced update schedule for apps on Windows 10 and later",
    "isTopLevel": true,
    "description": "Sets a recurring or one time date to restart apps whose update failed due to the app being in use, allowing the update to be applied.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10AppsForceUpdateSchedule_runImmediatelyIfAfterStartDateTime",
        "deviceConfiguration--windows10AppsForceUpdateSchedule_recurrence"
    ],
    "constraints": [],
    "dependencies": []
}