{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidForWorkVpnConfiguration_customData",
    "valueType": "collection",
    "displayName": "Custom data",
    "isTopLevel": true,
    "description": "Custom data",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--keyValue",
    "constraints": [],
    "dependencies": []
}