{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--hardenedUncPathElement",
    "valueType": "complex",
    "displayName": "Hardened UNC Path",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--hardenedUncPathElement_securityFlags",
        "deviceConfiguration--hardenedUncPathElement_serverPath"
    ],
    "constraints": [],
    "dependencies": []
}