{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsWifiEnterpriseEAPConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_sSID",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_eapType",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_connectAutomatically",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_networkName",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_wifiSecurityType",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_innerAuthenticationProtocolForEAPTTLS",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_maximumPairwiseMasterKeyCacheTimeInMinutes",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_networkSingleSignOn",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_enablePreAuthentication",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_connectToPreferredNetwork",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_meteredConnectionLimit",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_proxyManualPort",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_trustedServerCertificateNames",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_maximumPreAuthenticationAttempts",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_enablePairwiseMasterKeyCaching",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_maximumAuthenticationTimeoutInSeconds",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_proxyManualAddress",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_proxyAutomaticConfigurationUrl",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_authenticationMethod",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_rootCertificatesForServerValidation",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_outerIdentityPrivacyTemporaryValue",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_proxySetting",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_forceFIPSCompliance",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_promptForAdditionalAuthenticationCredentials",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_maximumNumberOfPairwiseMasterKeysInCache",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_preSharedKey",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_meteredConnectionLimitPcl",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_assignmentProgress",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration_rootCertificateForClientValidation"
    ],
    "constraints": [],
    "dependencies": []
}