{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSScepCertificateProfile_extendedKeyUsages",
    "valueType": "collection",
    "displayName": "Extended key usage",
    "isTopLevel": true,
    "description": "Extended key usages",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--extendedKeyUsage",
    "constraints": [],
    "dependencies": []
}