{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSExtensionsConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSExtensionsConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSExtensionsConfiguration_kernelExtensionAllowedTeamIdentifiers",
        "deviceConfiguration--macOSExtensionsConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSExtensionsConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSExtensionsConfiguration_kernelExtensionOverridesAllowed",
        "deviceConfiguration--macOSExtensionsConfiguration_kernelExtensionsAllowed",
        "deviceConfiguration--macOSExtensionsConfiguration_scenarioType",
        "deviceConfiguration--macOSExtensionsConfiguration_assignmentProgress",
        "deviceConfiguration--macOSExtensionsConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--macOSExtensionsConfiguration_systemExtensionsBlockOverride",
        "deviceConfiguration--macOSExtensionsConfiguration_systemExtensionsAllowedTeamIdentifiers",
        "deviceConfiguration--macOSExtensionsConfiguration_systemExtensionsAllowed",
        "deviceConfiguration--macOSExtensionsConfiguration_systemExtensionsAllowedTypes"
    ],
    "constraints": [],
    "dependencies": []
}