{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iOSDeviceFeaturesConfiguration_singleSignOnExtensionPkinitCertificate",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSDeviceFeaturesConfiguration_singleSignOnExtensionPkinitCertificate_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSPkcsCertificateProfile",
        "deviceConfiguration--iOSScepCertificateProfile"
    ],
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSUserEnrollment",
                "IOSDeviceEnrollment",
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}