{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidCompliancePolicy_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--androidCompliancePolicy_requireUpToDateSecurityProviders",
        "deviceConfiguration--androidCompliancePolicy_requireAppVerify",
        "deviceConfiguration--androidCompliancePolicy_passwordRequired",
        "deviceConfiguration--androidCompliancePolicy_securityRequireGooglePlayServices",
        "deviceConfiguration--androidCompliancePolicy_minAndroidSecurityPatchLevel",
        "deviceConfiguration--androidCompliancePolicy_passwordRequiredType",
        "deviceConfiguration--androidCompliancePolicy_advancedThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--androidCompliancePolicy_securityDisableUsbDebugging",
        "deviceConfiguration--androidCompliancePolicy_deviceThreatProtectionEnabled",
        "deviceConfiguration--androidCompliancePolicy_securityRequireUpToDateSecurityProviders",
        "deviceConfiguration--androidCompliancePolicy_id",
        "deviceConfiguration--androidCompliancePolicy_deviceThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--androidCompliancePolicy_requireSafetyNetAttestationCertifiedDevice",
        "deviceConfiguration--androidCompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--androidCompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--androidCompliancePolicy_conditionStatementId",
        "deviceConfiguration--androidCompliancePolicy_requireGooglePlayServices",
        "deviceConfiguration--androidCompliancePolicy_securityPreventInstallAppsFromUnknownSources",
        "deviceConfiguration--androidCompliancePolicy_securityRequireVerifyApps",
        "deviceConfiguration--androidCompliancePolicy_securityRequireSafetyNetAttestationCertifiedDevice",
        "deviceConfiguration--androidCompliancePolicy_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--androidCompliancePolicy_securityRequireCompanyPortalAppIntegrity",
        "deviceConfiguration--androidCompliancePolicy_localActions",
        "deviceConfiguration--androidCompliancePolicy_securityRequireSafetyNetAttestationBasicIntegrity",
        "deviceConfiguration--androidCompliancePolicy_securityBlockJailbrokenDevices",
        "deviceConfiguration--androidCompliancePolicy_requireCompanyPortalAppIntegrity",
        "deviceConfiguration--androidCompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--androidCompliancePolicy_requireSafetyNetAttestationBasicIntegrity",
        "deviceConfiguration--androidCompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--androidCompliancePolicy_restrictedApps",
        "deviceConfiguration--androidCompliancePolicy_securityBlockDeviceAdministratorManagedDevices",
        "deviceConfiguration--androidCompliancePolicy_osMinimumVersion",
        "deviceConfiguration--androidCompliancePolicy_osMaximumVersion",
        "deviceConfiguration--androidCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}