{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--keyValuePair",
    "valueType": "complex",
    "displayName": "Key Value Pair",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--keyValuePair_name",
        "deviceConfiguration--keyValuePair_value"
    ],
    "constraints": [],
    "dependencies": []
}