{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSKerberosSingleSignOnExtension_credentialBundleIdAccessControlList",
    "valueType": "collection",
    "displayName": "App bundle IDs",
    "isTopLevel": false,
    "description": "The bundle IDs of the apps that are allowed to access the Kerberos ticket granting ticket (TGT).",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSKerberosSingleSignOnExtension_credentialBundleIdAccessControlList_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": null,
            "maximumLength": 500
        }
    ],
    "dependencies": []
}