{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkGmailEasConfiguration_identityCertificate",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkGmailEasConfiguration_identityCertificate_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--androidForWorkPkcsCertificateProfile",
        "deviceConfiguration--androidForWorkScepCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}