{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkGmailEasConfiguration_deviceManagementApplicabilityRuleDeviceMode",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkGmailEasConfiguration_deviceManagementApplicabilityRuleDeviceMode_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementApplicabilityRuleDeviceMode_ruleType",
        "deviceConfiguration--deviceManagementApplicabilityRuleDeviceMode_name",
        "deviceConfiguration--deviceManagementApplicabilityRuleDeviceMode_deviceMode"
    ],
    "constraints": [],
    "dependencies": []
}