{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--deliveryOptimizationBandwidthPercentage",
    "valueType": "complex",
    "displayName": "Percentage",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deliveryOptimizationBandwidthPercentage_maximumForegroundBandwidthPercentage",
        "deviceConfiguration--deliveryOptimizationBandwidthPercentage_maximumBackgroundBandwidthPercentage"
    ],
    "constraints": [],
    "dependencies": []
}