{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--keyTypedValuePair",
    "valueType": "abstractComplex",
    "displayName": "Type",
    "isTopLevel": false,
    "description": "Choose the type of key value pair to pass to the app extension.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--keyBooleanValuePair",
        "deviceConfiguration--keyIntegerValuePair",
        "deviceConfiguration--keyStringValuePair",
        "deviceConfiguration--keyRealValuePair"
    ],
    "constraints": [],
    "dependencies": []
}