{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingFrance",
    "valueType": "complex",
    "displayName": "Ratings region - France",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--mediaContentRatingFrance_movieRating",
        "deviceConfiguration--mediaContentRatingFrance_tVRating"
    ],
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingCountryOrRegion",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
                    "values": [
                        {
                            "value": "fr",
                            "displayName": null
                        }
                    ]
                }
            ]
        }
    ]
}