{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--unsupportedDeviceConfigurationDetail",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__unsupportedDeviceConfigurationDetail_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--unsupportedDeviceConfigurationDetail_message",
        "deviceConfiguration--unsupportedDeviceConfigurationDetail_propertyName"
    ],
    "constraints": [],
    "dependencies": []
}