{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAttackSurfaceReductionExcludedPaths",
    "valueType": "collection",
    "displayName": "Exclude files and paths from attack surface reduction rules",
    "isTopLevel": true,
    "description": "Declare files and folders that are excluded from configured Attack Surface Reduction rules.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=872981",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAttackSurfaceReductionExcludedPaths_element",
    "constraints": [],
    "dependencies": []
}