{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsCreateGlobalObjects",
    "valueType": "complex",
    "displayName": "User rights create global objects",
    "isTopLevel": true,
    "description": "This security setting determines whether users can create global objects that are available to all sessions. Users can still create objects that are specific to their own session if they do not have this user right. Users who can create global objects could affect processes that run under other users' sessions, which could lead to application failure or data corruption. Caution: Assigning this user right can be a security risk. Assign this user right only to trusted users.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067230",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementUserRightsSetting_state",
        "deviceConfiguration--deviceManagementUserRightsSetting_localUsersOrGroups"
    ],
    "constraints": [],
    "dependencies": []
}