{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileCompliancePolicy_requireSafetyNetAttestationBasicIntegrity",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_restrictedApps",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_deviceThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_id",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_advancedThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityRequireVerifyApps",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_passwordRequiredType",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_passwordRequired",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityRequireSafetyNetAttestationCertifiedDevice",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_requireCompanyPortalAppIntegrity",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_requireUpToDateSecurityProviders",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityRequireUpToDateSecurityProviders",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityPreventInstallAppsFromUnknownSources",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_requireSafetyNetAttestationCertifiedDevice",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityDisableUsbDebugging",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_requireGooglePlayServices",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityRequireSafetyNetAttestationBasicIntegrity",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_deviceThreatProtectionEnabled",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityBlockJailbrokenDevices",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityRequireCompanyPortalAppIntegrity",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_minAndroidSecurityPatchLevel",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_requireAppVerify",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_securityRequireGooglePlayServices",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_osMinimumVersion",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_osMaximumVersion",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidWorkProfileCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}