{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration_dnsRules",
    "valueType": "collection",
    "displayName": "Name Resolution Policy table (NRPT) rules",
    "isTopLevel": true,
    "description": "Name Resolution Policy table (NRPT) rules define how the DNS resolves names when connected to the VPN. Each row in the table specifies a domain and the DNS suffixes or web proxy server to use to resolve that domain.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--vpnDnsRule",
    "constraints": [],
    "dependencies": []
}