{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSGeneralDeviceConfiguration_privacyAccessControls",
    "valueType": "collection",
    "displayName": "Apps and processes",
    "isTopLevel": true,
    "description": "Configure an app's access to specific data, folders, and apps on a device. These settings apply to devices running macOS Mojave 10.14 and later.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSPrivacyAccessControlItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "MacOSAutoDeviceEnrollment",
                "MacOSUserApprovedEnrollment"
            ]
        }
    ],
    "dependencies": []
}