{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkImportedPFXCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkImportedPFXCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_rootCertificate",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_intendedPurpose",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}