{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_appManagementPackageFamilyNamesToLaunchAfterLogOn",
    "valueType": "collection",
    "displayName": "Startup apps",
    "isTopLevel": true,
    "description": "This policy allows the IT admin to specify a list of applications that users can run after logging on to the device.​For this policy to work, the Windows apps need to declare in their manifest that they will use the start up task",
    "placeholderText": "Enter a semicolon-delimited list of Windows apps Package Family Names",
    "documentationUrl": "https://aka.ms/startupapps",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_appManagementPackageFamilyNamesToLaunchAfterLogOn_element",
    "constraints": [],
    "dependencies": []
}