{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--deviceManagementApplicabilityRuleOsEdition_osEditionTypes",
    "valueType": "collection",
    "displayName": "O/S versions",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--deviceManagementApplicabilityRuleOsEdition_osEditionTypes_element",
    "constraints": [],
    "dependencies": []
}