{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--singleSignOnExtension",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__singleSignOnExtension_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSAzureAdSingleSignOnExtension",
        "deviceConfiguration--iOSCredentialSingleSignOnExtension",
        "deviceConfiguration--iOSRedirectSingleSignOnExtension",
        "deviceConfiguration--macOSCredentialSingleSignOnExtension",
        "deviceConfiguration--macOSRedirectSingleSignOnExtension",
        "deviceConfiguration--iOSKerberosSingleSignOnExtension",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension",
        "deviceConfiguration--redirectSingleSignOnExtension",
        "deviceConfiguration--credentialSingleSignOnExtension"
    ],
    "constraints": [],
    "dependencies": []
}