{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSWiFiConfiguration_proxySettings",
        "deviceConfiguration--iOSWiFiConfiguration_preSharedKeySet",
        "deviceConfiguration--iOSWiFiConfiguration_preSharedKey",
        "deviceConfiguration--iOSWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--iOSWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--iOSWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--iOSWiFiConfiguration_proxyManualPort",
        "deviceConfiguration--iOSWiFiConfiguration_proxyAutomaticConfigurationUrl",
        "deviceConfiguration--iOSWiFiConfiguration_networkName",
        "deviceConfiguration--iOSWiFiConfiguration_ssid",
        "deviceConfiguration--iOSWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSWiFiConfiguration_proxyManualAddress",
        "deviceConfiguration--iOSWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--iOSWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}