{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsIdentityProtectionConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsIdentityProtectionConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinExpirationInDays",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinMaximumLength",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinPreviousBlockCount",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_scenarioType",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_assignmentProgress",
        "deviceConfiguration--windowsIdentityProtectionConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}