{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSVpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSVpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSVpnConfiguration_enablePerApp",
        "deviceConfiguration--iOSVpnConfiguration_loginGroupOrDomain",
        "deviceConfiguration--iOSVpnConfiguration_authenticationMethod",
        "deviceConfiguration--iOSVpnConfiguration_proxyServer",
        "deviceConfiguration--iOSVpnConfiguration_connectionName",
        "deviceConfiguration--iOSVpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSVpnConfiguration_excludeList",
        "deviceConfiguration--iOSVpnConfiguration_derivedCredentialSettings",
        "deviceConfiguration--iOSVpnConfiguration_customKeyValueData",
        "deviceConfiguration--iOSVpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--iOSVpnConfiguration_strictEnforcement",
        "deviceConfiguration--iOSVpnConfiguration_role",
        "deviceConfiguration--iOSVpnConfiguration_onDemandRules",
        "deviceConfiguration--iOSVpnConfiguration_server",
        "deviceConfiguration--iOSVpnConfiguration_userDomain",
        "deviceConfiguration--iOSVpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSVpnConfiguration_customData",
        "deviceConfiguration--iOSVpnConfiguration_identityCertificate",
        "deviceConfiguration--iOSVpnConfiguration_connectionType",
        "deviceConfiguration--iOSVpnConfiguration_providerType",
        "deviceConfiguration--iOSVpnConfiguration_safariDomains",
        "deviceConfiguration--iOSVpnConfiguration_cloudName",
        "deviceConfiguration--iOSVpnConfiguration_optInToDeviceIdSharing",
        "deviceConfiguration--iOSVpnConfiguration_identifier",
        "deviceConfiguration--iOSVpnConfiguration_realm",
        "deviceConfiguration--iOSVpnConfiguration_optInToDeviceIdSharingInternal",
        "deviceConfiguration--iOSVpnConfiguration_assignmentProgress",
        "deviceConfiguration--iOSVpnConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--iOSVpnConfiguration_targetedMobileAppIds"
    ],
    "constraints": [],
    "dependencies": []
}