{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--omaSettingString",
    "valueType": "complex",
    "displayName": "String",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--omaSettingString_displayName",
        "deviceConfiguration--omaSettingString_description",
        "deviceConfiguration--omaSettingString_omaUri",
        "deviceConfiguration--omaSettingString_value"
    ],
    "constraints": [],
    "dependencies": []
}