{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSVpnConfiguration_customKeyValueData",
    "valueType": "collection",
    "displayName": "Custom key value data",
    "isTopLevel": true,
    "description": "Custom key value data",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--keyValuePair",
    "constraints": [],
    "dependencies": []
}