{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileEnterpriseWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForEapTtls",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_networkName",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_proxyAutomaticConfigurationUrl",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_proxySettings",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_enableOuterIdentityPrivacy",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_eapType",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForPeap",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_innerAuthenticationProtocolForEapTtls",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_outerIdentityPrivacyTemporaryValue",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_innerAuthenticationProtocolForPeap",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_authenticationMethod",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_ssid",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_rootCertificateForServerValidation",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}