{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_edgeSearchEngine",
    "valueType": "abstractComplex",
    "displayName": "Default search engine",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--edgeSearchEngine",
        "deviceConfiguration--edgeSearchEngineCustom"
    ],
    "constraints": [],
    "dependencies": []
}