{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--bitLockerRecoveryOptions",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__bitLockerRecoveryOptions_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--bitLockerRecoveryOptions_recoveryKeyUsage",
        "deviceConfiguration--bitLockerRecoveryOptions_recoveryInformationToStore",
        "deviceConfiguration--bitLockerRecoveryOptions_enableRecoveryInformationSaveToStore",
        "deviceConfiguration--bitLockerRecoveryOptions_recoveryPasswordUsage",
        "deviceConfiguration--bitLockerRecoveryOptions_hideRecoveryOptions",
        "deviceConfiguration--bitLockerRecoveryOptions_enableBitLockerAfterRecoveryInformationToStore",
        "deviceConfiguration--bitLockerRecoveryOptions_blockDataRecoveryAgent"
    ],
    "constraints": [],
    "dependencies": []
}