{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderFileExtensionsToExclude",
    "valueType": "collection",
    "displayName": "File extensions to exclude from scans and real-time protection",
    "isTopLevel": true,
    "description": "Specify a list of file type extensions to ignore during a scan.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderFileExtensionsToExclude_element",
    "constraints": [],
    "dependencies": []
}