{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--vpnTrafficRule_remotePortRanges",
    "valueType": "collection",
    "displayName": "Remote port ranges",
    "isTopLevel": false,
    "description": "Remote port ranges",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--numberRange",
    "constraints": [],
    "dependencies": []
}