{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10DeviceFirmwareConfigurationInterface_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_changeUefiSettingsPermission",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_bootFromBuiltInNetworkAdapters",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_virtualizationOfCpuAndIO",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_bootFromExternalMedia",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_microphonesAndSpeakers",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_radios",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_cameras",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_scenarioType",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_assignmentProgress",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}