{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultSelectedRecoveryKeyTypes",
    "valueType": "collection",
    "displayName": "Recovery key type",
    "isTopLevel": true,
    "description": "Determine which type(s) of recovery key should be generated for this device.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultSelectedRecoveryKeyTypes_element",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultEnabled",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementSettingBooleanConstraint",
                    "value": true
                }
            ]
        }
    ]
}