{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--remoteAssistanceSolicitedSetting",
    "valueType": "complex",
    "displayName": "Enable Remote Assistance",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--remoteAssistanceSolicitedSetting_permission",
        "deviceConfiguration--remoteAssistanceSolicitedSetting_maximumTicketTimeValue",
        "deviceConfiguration--remoteAssistanceSolicitedSetting_maximumTicketTimeUnit",
        "deviceConfiguration--remoteAssistanceSolicitedSetting_emailInvitationMethod"
    ],
    "constraints": [],
    "dependencies": []
}