{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10ImportedPFXCertificateProfile",
    "valueType": "complex",
    "displayName": "windows10ImportedPFXCertificateProfile",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_keyStorageProvider",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_subjectNameFormat",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_intendedPurpose",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_assignmentProgress",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}