{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_factoryResetDeviceAdministratorEmails",
    "valueType": "collection",
    "displayName": "Factory reset protection emails",
    "isTopLevel": true,
    "description": "Email addresses of device admins for factory reset protection. When a device is factory reset, it will require that one of these admins log in with their Google account to unlock the device. If none are specified, factory reset protection is not enabled.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_factoryResetDeviceAdministratorEmails_element",
    "constraints": [],
    "dependencies": []
}