{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsManageAuditingAndSecurityLogs",
    "valueType": "complex",
    "displayName": "User rights manage auditing and security logs",
    "isTopLevel": true,
    "description": "This user right determines which users can specify object access auditing options for individual resources, such as files, Active Directory objects, and registry keys. This security setting does not allow a user to enable file and object access auditing in general. You can view audited events in the security log of the Event Viewer. A user with this privilege can also view and clear the security log.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067317",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementUserRightsSetting_state",
        "deviceConfiguration--deviceManagementUserRightsSetting_localUsersOrGroups"
    ],
    "constraints": [],
    "dependencies": []
}