{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsDelegation",
    "valueType": "complex",
    "displayName": "User rights delegation",
    "isTopLevel": true,
    "description": "This user right determines which users can set the Trusted for Delegation setting on a user or computer object. The user or object that is granted this privilege must have write access to the account control flags on the user or computer object. A server process running on a computer (or under a user context) that is trusted for delegation can access resources on another computer using delegated credentials of a client, as long as the client account does not have the Account cannot be delegated account control flag set. Caution: Misuse of this user right, or of the Trusted for Delegation setting, could make the network vulnerable to sophisticated attacks using Trojan horse programs that impersonate incoming clients and use their credentials to gain access to network resources.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067316",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementUserRightsSetting_state",
        "deviceConfiguration--deviceManagementUserRightsSetting_localUsersOrGroups"
    ],
    "constraints": [],
    "dependencies": []
}