{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSNetworkUsageRule_managedApps",
    "valueType": "collection",
    "displayName": "Managed apps",
    "isTopLevel": false,
    "description": "Managed apps",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingAppConstraint",
            "supportedTypes": [
                "managedIOSLobApp",
                "managedIOSStoreApp"
            ]
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": 0,
            "maximumLength": 500
        }
    ],
    "dependencies": []
}