{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_networkName",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_preSharedKeyIsSet",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_ssid",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_preSharedKey",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}