{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--bitLockerSystemDrivePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__bitLockerSystemDrivePolicy_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationRequired",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmKeyUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmPinUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmPinAndKeyUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationBlockWithoutTpmChip",
        "deviceConfiguration--bitLockerSystemDrivePolicy_recoveryOptions",
        "deviceConfiguration--bitLockerSystemDrivePolicy_encryptionMethod",
        "deviceConfiguration--bitLockerSystemDrivePolicy_minimumPinLength",
        "deviceConfiguration--bitLockerSystemDrivePolicy_prebootRecoveryEnableMessageAndUrl",
        "deviceConfiguration--bitLockerSystemDrivePolicy_prebootRecoveryMessage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_prebootRecoveryUrl"
    ],
    "constraints": [],
    "dependencies": []
}