{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81SCEPCertificateProfile_rootCertificate",
    "valueType": "complex",
    "displayName": "Root certificate",
    "isTopLevel": true,
    "description": "Root certificate",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsPhone81TrustedRootCertificate_certFileName",
        "deviceConfiguration--windowsPhone81TrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--windowsPhone81TrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsPhone81TrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsPhone81TrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--windowsPhone81TrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}