{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerTrustedRootCertificate_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate_certFileName",
        "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}