{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidVpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidVpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidVpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidVpnConfiguration_role",
        "deviceConfiguration--androidVpnConfiguration_servers",
        "deviceConfiguration--androidVpnConfiguration_identityCertificate",
        "deviceConfiguration--androidVpnConfiguration_customData",
        "deviceConfiguration--androidVpnConfiguration_connectionType",
        "deviceConfiguration--androidVpnConfiguration_fingerprint",
        "deviceConfiguration--androidVpnConfiguration_connectionName",
        "deviceConfiguration--androidVpnConfiguration_realm",
        "deviceConfiguration--androidVpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidVpnConfiguration_authenticationMethod",
        "deviceConfiguration--androidVpnConfiguration_customKeyValueData",
        "deviceConfiguration--androidVpnConfiguration_assignmentProgress",
        "deviceConfiguration--androidVpnConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}