{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSVpnSecurityAssociationParameters",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSVpnSecurityAssociationParameters_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_securityDiffieHellmanGroup",
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_lifetimeInMinutes",
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_securityIntegrityAlgorithm",
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_securityEncryptionAlgorithm"
    ],
    "constraints": [],
    "dependencies": []
}