{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSAzureAdSingleSignOnExtension",
    "valueType": "complex",
    "displayName": "Microsoft Azure AD",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSAzureAdSingleSignOnExtension_enableSharedDeviceMode",
        "deviceConfiguration--iOSAzureAdSingleSignOnExtension_configurations"
    ],
    "constraints": [],
    "dependencies": []
}