{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskDesktopApp",
    "valueType": "complex",
    "displayName": "Desktop App",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskDesktopApp_appType",
        "deviceConfiguration--windowsKioskDesktopApp_name",
        "deviceConfiguration--windowsKioskDesktopApp_autoLaunch",
        "deviceConfiguration--windowsKioskDesktopApp_startLayoutTileSize",
        "deviceConfiguration--windowsKioskDesktopApp_desktopApplicationLinkPath",
        "deviceConfiguration--windowsKioskDesktopApp_path",
        "deviceConfiguration--windowsKioskDesktopApp_desktopApplicationId"
    ],
    "constraints": [],
    "dependencies": []
}