{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration_dnsSuffixes",
    "valueType": "collection",
    "displayName": "DNS suffix search list",
    "isTopLevel": true,
    "description": "Specify DNS suffixes to add to the DNS search list to properly route short names. The first suffix in the list is also used as the primary connection-specific DNS suffix for the VPN interface.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10VpnConfiguration_dnsSuffixes_element",
    "constraints": [],
    "dependencies": []
}