{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskProfile",
    "valueType": "complex",
    "displayName": "Kiosk profile",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskProfile_profileId",
        "deviceConfiguration--windowsKioskProfile_appConfiguration",
        "deviceConfiguration--windowsKioskProfile_profileName",
        "deviceConfiguration--windowsKioskProfile_userAccountsConfiguration"
    ],
    "constraints": [],
    "dependencies": []
}