{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--silverlightMobileDeviceSecurity",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__silverlightMobileDeviceSecurity_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--silverlightMobileDeviceSecurity_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--silverlightMobileDeviceSecurity_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--silverlightMobileDeviceSecurity_scenarioType",
        "deviceConfiguration--silverlightMobileDeviceSecurity_assignmentProgress",
        "deviceConfiguration--silverlightMobileDeviceSecurity_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}