{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windowsUpdateForBusinessConfiguration_installationSchedule",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsUpdateForBusinessConfiguration_installationSchedule_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--windowsUpdateActiveHoursInstall",
        "deviceConfiguration--windowsUpdateScheduledInstall"
    ],
    "constraints": [],
    "dependencies": []
}