{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81VpnConfiguration_proxyServer",
    "valueType": "complex",
    "displayName": "Use proxy server",
    "isTopLevel": true,
    "description": "Proxy used when profile is active.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81VpnProxyServer_bypassProxyServerForLocalAddress",
        "deviceConfiguration--windows81VpnProxyServer_automaticConfigurationScriptUrl",
        "deviceConfiguration--windows81VpnProxyServer_automaticallyDetectProxySettings",
        "deviceConfiguration--windows81VpnProxyServer_port",
        "deviceConfiguration--windows81VpnProxyServer_address"
    ],
    "constraints": [],
    "dependencies": []
}