{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10SecureAssessmentConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10SecureAssessmentConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10SecureAssessmentConfiguration_blockTextSuggestion",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_localGuestAccountName",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_assessmentAppUserModelId",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_allowPrinting",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_configurationAccount",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_configurationAccountType",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_blockScreenCapture",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_allowTextSuggestion",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_launchUri",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_allowScreenCapture",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_blockPrinting",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_scenarioType",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_assignmentProgress",
        "deviceConfiguration--windows10SecureAssessmentConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}