{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10TeamGeneralConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10TeamGeneralConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10TeamGeneralConfiguration_miracastChannel",
        "deviceConfiguration--windows10TeamGeneralConfiguration_maintenanceWindowStartTime",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsBlockSigninSuggestions",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceAccountBlockExchangeServices",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsDefaultVolume",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsSleepTimeoutInMinutes",
        "deviceConfiguration--windows10TeamGeneralConfiguration_azureOperationalInsightsBlockTelemetry",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceAccountEmailAddress",
        "deviceConfiguration--windows10TeamGeneralConfiguration_azureOperationalInsightsWorkspaceKey",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceAccountRequirePasswordRotation",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceAccountExchangeServerAddress",
        "deviceConfiguration--windows10TeamGeneralConfiguration_maintenanceWindowBlocked",
        "deviceConfiguration--windows10TeamGeneralConfiguration_miracastRequirePin",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceAccountSessionInitiationProtocolAddress",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsBlockSessionResume",
        "deviceConfiguration--windows10TeamGeneralConfiguration_connectAppBlockAutoLaunch",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsScreenTimeoutInMinutes",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsBlockMyMeetingsAndFiles",
        "deviceConfiguration--windows10TeamGeneralConfiguration_welcomeScreenMeetingInformation",
        "deviceConfiguration--windows10TeamGeneralConfiguration_welcomeScreenBlockAutomaticWakeUp",
        "deviceConfiguration--windows10TeamGeneralConfiguration_miracastBlocked",
        "deviceConfiguration--windows10TeamGeneralConfiguration_azureOperationalInsightsWorkspaceId",
        "deviceConfiguration--windows10TeamGeneralConfiguration_welcomeScreenBackgroundImageUrl",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10TeamGeneralConfiguration_maintenanceWindowDurationInHours",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsSessionTimeoutInMinutes",
        "deviceConfiguration--windows10TeamGeneralConfiguration_scenarioType",
        "deviceConfiguration--windows10TeamGeneralConfiguration_settingsDeviceName",
        "deviceConfiguration--windows10TeamGeneralConfiguration_assignmentProgress",
        "deviceConfiguration--windows10TeamGeneralConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}