{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy",
    "valueType": "complex",
    "displayName": "BitLocker system drive policy",
    "isTopLevel": true,
    "description": "This policy setting is used to control the encryption method and cipher strength. The values of this policy determine the strength of the cipher that BitLocker uses for encryption. Enterprises may want to control the encryption level for increased security (AES-256 is stronger than AES-128).\r\n\r\nIf you enable this setting, you will be able to configure an encryption algorithm and key cipher strength for fixed data drives, operating system drives, and removable data drives individually. For fixed and operating system drives, we recommend that you use the XTS-AES algorithm. For removable drives, you should use AES-CBC 128-bit or AES-CBC 256-bit if the drive will be used in other devices that are not running Windows 10, version 1511 or later, or Windows 11.\r\n\r\nChanging the encryption method has no effect if the drive is already encrypted or if encryption is in progress. In these cases, this policy setting is ignored.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067025",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationRequired",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmPinUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmKeyUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationTpmPinAndKeyUsage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_startupAuthenticationBlockWithoutTpmChip",
        "deviceConfiguration--bitLockerSystemDrivePolicy_prebootRecoveryEnableMessageAndUrl",
        "deviceConfiguration--bitLockerSystemDrivePolicy_prebootRecoveryMessage",
        "deviceConfiguration--bitLockerSystemDrivePolicy_prebootRecoveryUrl",
        "deviceConfiguration--bitLockerSystemDrivePolicy_recoveryOptions",
        "deviceConfiguration--bitLockerSystemDrivePolicy_encryptionMethod",
        "deviceConfiguration--bitLockerSystemDrivePolicy_minimumPinLength"
    ],
    "constraints": [],
    "dependencies": []
}