{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--partnerWindows10CompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__partnerWindows10CompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--partnerWindows10CompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--partnerWindows10CompliancePolicy_id",
        "deviceConfiguration--partnerWindows10CompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--partnerWindows10CompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--partnerWindows10CompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}