{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSEndpointProtectionConfiguration_firewallApplications",
    "valueType": "collection",
    "displayName": "Firewall apps",
    "isTopLevel": true,
    "description": "Set rules for incoming connections for the following apps.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSFirewallApplication",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--macOSEndpointProtectionConfiguration_firewallEnabled",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementSettingBooleanConstraint",
                    "value": true
                }
            ]
        }
    ]
}