{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSUpdateConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSUpdateConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSUpdateConfiguration_enforcedSoftwareUpdateDelayInDays",
        "deviceConfiguration--iOSUpdateConfiguration_scheduledInstallDays",
        "deviceConfiguration--iOSUpdateConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSUpdateConfiguration_utcTimeOffsetInMinutes",
        "deviceConfiguration--iOSUpdateConfiguration_isEnabled",
        "deviceConfiguration--iOSUpdateConfiguration_activeHoursEnd",
        "deviceConfiguration--iOSUpdateConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSUpdateConfiguration_activeHoursStart",
        "deviceConfiguration--iOSUpdateConfiguration_scenarioType",
        "deviceConfiguration--iOSUpdateConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--iOSUpdateConfiguration_assignmentProgress",
        "deviceConfiguration--iOSUpdateConfiguration_desiredOsVersion",
        "deviceConfiguration--iOSUpdateConfiguration_updateScheduleType",
        "deviceConfiguration--iOSUpdateConfiguration_customUpdateTimeWindows"
    ],
    "constraints": [],
    "dependencies": []
}