{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSCompliancePolicy_gatekeeperAllowedAppSource",
        "deviceConfiguration--macOSCompliancePolicy_deviceThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--macOSCompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--macOSCompliancePolicy_advancedThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--macOSCompliancePolicy_passwordBlockSimple",
        "deviceConfiguration--macOSCompliancePolicy_passwordRequired",
        "deviceConfiguration--macOSCompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--macOSCompliancePolicy_firewallEnableStealthMode",
        "deviceConfiguration--macOSCompliancePolicy_passwordMinimumCharacterSetCount",
        "deviceConfiguration--macOSCompliancePolicy_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--macOSCompliancePolicy_firewallBlockAllIncoming",
        "deviceConfiguration--macOSCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--macOSCompliancePolicy_deviceThreatProtectionEnabled",
        "deviceConfiguration--macOSCompliancePolicy_firewallEnabled",
        "deviceConfiguration--macOSCompliancePolicy_id",
        "deviceConfiguration--macOSCompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--macOSCompliancePolicy_systemIntegrityProtectionEnabled",
        "deviceConfiguration--macOSCompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--macOSCompliancePolicy_passwordRequiredType",
        "deviceConfiguration--macOSCompliancePolicy_osMinimumVersion",
        "deviceConfiguration--macOSCompliancePolicy_osMaximumVersion",
        "deviceConfiguration--macOSCompliancePolicy_osMinimumBuildVersion",
        "deviceConfiguration--macOSCompliancePolicy_osMaximumBuildVersion",
        "deviceConfiguration--macOSCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--macOSCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSCompliancePolicy_numberOfPasswordsToRemember"
    ],
    "constraints": [],
    "dependencies": []
}