{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSCustomConfiguration",
    "valueType": "complex",
    "displayName": "iOS/iPadOS custom configuration",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSCustomConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSCustomConfiguration_payload",
        "deviceConfiguration--iOSCustomConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSCustomConfiguration_payloadName",
        "deviceConfiguration--iOSCustomConfiguration_payloadFileName",
        "deviceConfiguration--iOSCustomConfiguration_scenarioType",
        "deviceConfiguration--iOSCustomConfiguration_assignmentProgress",
        "deviceConfiguration--iOSCustomConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}