{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerVpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerVpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_servers",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_realm",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_authenticationMethod",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_identityCertificate",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_role",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_connectionName",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_connectionType",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_derivedCredentialSettings",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_proxyServer",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration_targetedPackageIds"
    ],
    "constraints": [],
    "dependencies": []
}