{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--omaSettingInteger",
    "valueType": "complex",
    "displayName": "Integer",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--omaSettingInteger_displayName",
        "deviceConfiguration--omaSettingInteger_description",
        "deviceConfiguration--omaSettingInteger_omaUri",
        "deviceConfiguration--omaSettingInteger_value",
        "deviceConfiguration--omaSettingInteger_isReadOnly"
    ],
    "constraints": [],
    "dependencies": []
}