{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--vpnTrafficRule_remoteAddressRanges",
    "valueType": "collection",
    "displayName": "Remote address ranges",
    "isTopLevel": false,
    "description": "Remote address ranges",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iPv4Range",
    "constraints": [],
    "dependencies": []
}