{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileGmailEasConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileGmailEasConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_usernameSource",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_durationOfEmailToSync",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_authenticationMethod",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_identityCertificate",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_hostName",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_requireSsl",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_emailAddressSource",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_assignmentProgress",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}