{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--androidVpnConfiguration_identityCertificate",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidVpnConfiguration_identityCertificate_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile",
        "deviceConfiguration--androidImportedPFXCertificateProfile",
        "deviceConfiguration--androidPkcsCertificateProfile",
        "deviceConfiguration--androidScepCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}