{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--sharedPCAccountManagerPolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__sharedPCAccountManagerPolicy_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--sharedPCAccountManagerPolicy_accountDeletionPolicy",
        "deviceConfiguration--sharedPCAccountManagerPolicy_removeAccountsBelowDiskFreePercentage",
        "deviceConfiguration--sharedPCAccountManagerPolicy_inactiveThresholdDays",
        "deviceConfiguration--sharedPCAccountManagerPolicy_cacheAccountsAboveDiskFreePercentage"
    ],
    "constraints": [],
    "dependencies": []
}