{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskUser",
    "valueType": "abstractComplex",
    "displayName": "User for the Kiosk",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--windowsKioskLocalUser",
        "deviceConfiguration--windowsKioskAzureADUser",
        "deviceConfiguration--windowsKioskAzureADGroup",
        "deviceConfiguration--windowsKioskActiveDirectoryGroup",
        "deviceConfiguration--windowsKioskLocalGroup",
        "deviceConfiguration--windowsKioskAutologon",
        "deviceConfiguration--windowsKioskVisitor"
    ],
    "constraints": [],
    "dependencies": []
}