{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_networkName",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_ssid",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}