{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows81VpnProxyServer",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows81VpnProxyServer_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81VpnProxyServer_bypassProxyServerForLocalAddress",
        "deviceConfiguration--windows81VpnProxyServer_automaticConfigurationScriptUrl",
        "deviceConfiguration--windows81VpnProxyServer_automaticallyDetectProxySettings",
        "deviceConfiguration--windows81VpnProxyServer_port",
        "deviceConfiguration--windows81VpnProxyServer_address"
    ],
    "constraints": [],
    "dependencies": []
}