{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEducationDeviceConfiguration_studentIdentityCertificate",
    "valueType": "abstractComplex",
    "displayName": "Student identity certificate",
    "isTopLevel": true,
    "description": "Student identity certificate",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSPkcsCertificateProfile",
        "deviceConfiguration--iOSScepCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}