{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--bitLockerFixedDrivePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__bitLockerFixedDrivePolicy_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--bitLockerFixedDrivePolicy_recoveryOptions",
        "deviceConfiguration--bitLockerFixedDrivePolicy_requireEncryptionForWriteAccess",
        "deviceConfiguration--bitLockerFixedDrivePolicy_encryptionMethod"
    ],
    "constraints": [],
    "dependencies": []
}