{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSScepCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSScepCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSScepCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--macOSScepCertificateProfile_keySize",
        "deviceConfiguration--macOSScepCertificateProfile_subjectNameFormat",
        "deviceConfiguration--macOSScepCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--macOSScepCertificateProfile_keyUsage",
        "deviceConfiguration--macOSScepCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSScepCertificateProfile_certificateStore",
        "deviceConfiguration--macOSScepCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--macOSScepCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSScepCertificateProfile_scepServerUrls",
        "deviceConfiguration--macOSScepCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--macOSScepCertificateProfile_rootCertificate",
        "deviceConfiguration--macOSScepCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--macOSScepCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--macOSScepCertificateProfile_hashAlgorithm",
        "deviceConfiguration--macOSScepCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--macOSScepCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--macOSScepCertificateProfile_assignmentProgress",
        "deviceConfiguration--macOSScepCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}