{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSDeviceFeaturesConfiguration_airPrintDestinations",
    "valueType": "collection",
    "displayName": "AirPrint destinations",
    "isTopLevel": true,
    "description": "Use these settings to configure iOS devices to automatically connect to AirPrint compatible printers on your network. You'll need the IP address and resource path of your printers.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2100064",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--airPrintDestination",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "MacOSDeviceEnrollment",
                "MacOSUserApprovedEnrollment",
                "MacOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}