{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsHealthMonitoringConfiguration_configDeviceHealthMonitoringScope",
    "valueType": "collection",
    "displayName": "Configure device health monitoring scope",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsHealthMonitoringConfiguration_configDeviceHealthMonitoringScope_element",
    "constraints": [],
    "dependencies": []
}