{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileScepCertificateProfile_scepServerUrls",
    "valueType": "collection",
    "displayName": "SCEP Server URLs",
    "isTopLevel": true,
    "description": "SCEP server urls",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--androidWorkProfileScepCertificateProfile_scepServerUrls_element",
    "constraints": [],
    "dependencies": []
}