{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSVpnConfiguration_server",
    "valueType": "complex",
    "displayName": "IP address or FQDN",
    "isTopLevel": true,
    "description": "This is the fully qualified domain name or IP address of your VPN server on the network. Make sure that end-users can access this network location.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnServer_isDefaultServer",
        "deviceConfiguration--vpnServer_address",
        "deviceConfiguration--vpnServer_iPAddressOrFqdn",
        "deviceConfiguration--vpnServer_description"
    ],
    "constraints": [],
    "dependencies": []
}