{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSExtensionsConfiguration_kernelExtensionsAllowed",
    "valueType": "collection",
    "displayName": "Allowed kernel extensions",
    "isTopLevel": true,
    "description": "Bundle identifier and team identifiers of kernel extensions that will be allowed. Use an empty team identifier for unsigned legacy kernel extensions.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSKernelExtension",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "MacOSAutoDeviceEnrollment",
                "MacOSUserApprovedEnrollment"
            ]
        }
    ],
    "dependencies": []
}