{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSVpnConfiguration_safariDomains",
    "valueType": "collection",
    "displayName": "Safari domains",
    "isTopLevel": true,
    "description": "Safari domains",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSVpnConfiguration_safariDomains_element",
    "constraints": [],
    "dependencies": []
}