{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10GeneralConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderSettings",
        "deviceConfiguration--windows10GeneralConfiguration_defenderMonitorFileActivity",
        "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumCharacterSetCount",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanScriptsLoadedInInternetExplorer",
        "deviceConfiguration--windows10GeneralConfiguration_edgeFavoritesBarVisibility",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUpdatesToStatusBarViaScript",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragAndDropOrCopyAndPasteFiles",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockFullScreenMode",
        "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAllowUserControlOverInstall",
        "deviceConfiguration--windows10GeneralConfiguration_connectedDevicesServiceBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDotNetFrameworkReliantComponents",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanIncomingMail",
        "deviceConfiguration--windows10GeneralConfiguration_windowsLogOnLocalUsersOnDomainJoinedComputers",
        "deviceConfiguration--windows10GeneralConfiguration_assignedAccessSingleModeUserName",
        "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockDiscoverableMode",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneDoNotRunAntimalwareAgainstActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAccessToDataSources",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsWithinWindows",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideSleep",
        "deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType",
        "deviceConfiguration--windows10GeneralConfiguration_defenderRequireNetworkInspectionSystem",
        "deviceConfiguration--windows10GeneralConfiguration_edgeHomeButtonConfigurationEnabled",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCertificateAddressMismatchWarning",
        "deviceConfiguration--windows10GeneralConfiguration_storageBlockRemovableStorage",
        "deviceConfiguration--windows10GeneralConfiguration_appManagementPackageFamilyNamesToLaunchAfterLogOn",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideRestartOptions",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLessPrivilegedSites",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenBlockToastNotifications",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAutomaticPromptForFileDownloads",
        "deviceConfiguration--windows10GeneralConfiguration_accountsBlockAddingNonMicrosoftAccountEmail",
        "deviceConfiguration--windows10GeneralConfiguration_defenderSignatureUpdateIntervalInHours",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockRemoveProvisioningPackage",
        "deviceConfiguration--windows10GeneralConfiguration_defenderPromptForSampleSubmission",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDotNetFrameworkReliantComponents",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptInitiatedWindows",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockTailoredExperiences",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneIncludeLocalPathWhenUploadingFilesToServer",
        "deviceConfiguration--windows10GeneralConfiguration_authenticationWebSignIn",
        "deviceConfiguration--windows10GeneralConfiguration_edgeAllowStartPagesModification",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDisableProcessesInEnhancedProtectedMode",
        "deviceConfiguration--windows10GeneralConfiguration_wirelessDisplayBlockUserInputFromReceiver",
        "deviceConfiguration--windows10GeneralConfiguration_edgeFirstRunUrl",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIgnoreCertificateErrors",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenCamera",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLoadingOfXamlFiles",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanEnableLowCpuPriority",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAutomaticPromptForFileDownloads",
        "deviceConfiguration--windows10GeneralConfiguration_autoPlayDefaultAutoRunBehavior",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSecurityWarningForPotentiallyUnsafeFiles",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenBlockActionCenterNotifications",
        "deviceConfiguration--windows10GeneralConfiguration_cellularBlockVpnWhenRoaming",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockJavaScript",
        "deviceConfiguration--windows10GeneralConfiguration_defenderBlockOnAccessProtection",
        "deviceConfiguration--windows10GeneralConfiguration_edgeKioskResetAfterIdleTimeInMinutes",
        "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhilePluggedIn",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCrossSiteScriptingFilter",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerFallbackToSsl3",
        "deviceConfiguration--windows10GeneralConfiguration_appsAllowTrustedAppsSideloading",
        "deviceConfiguration--windows10GeneralConfiguration_authenticationAllowFIDODevice",
        "deviceConfiguration--windows10GeneralConfiguration_enterpriseCloudPrintDiscoveryMaxLimit",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEncryptionSupport",
        "deviceConfiguration--windows10GeneralConfiguration_passwordExpirationDays",
        "deviceConfiguration--windows10GeneralConfiguration_startBlockUnpinningAppsFromTaskbar",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownInternetZoneSmartScreen",
        "deviceConfiguration--windows10GeneralConfiguration_messagingBlockRichCommunicationServices",
        "deviceConfiguration--windows10GeneralConfiguration_defenderDisableCatchupFullScan",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockExtensions",
        "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockAdvertising",
        "deviceConfiguration--windows10GeneralConfiguration_defenderFileExtensionsToExclude",
        "deviceConfiguration--windows10GeneralConfiguration_storageRequireMobileDeviceEncryption",
        "deviceConfiguration--windows10GeneralConfiguration_experienceBlockWindowsSpotlight",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideUserTile",
        "deviceConfiguration--windows10GeneralConfiguration_inkWorkspaceAccess",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideRecentlyAddedApps",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLaunchApplicationsAndFilesInAnIFrame",
        "deviceConfiguration--windows10GeneralConfiguration_searchDisableIndexingEncryptedItems",
        "deviceConfiguration--windows10GeneralConfiguration_searchDisableUseLocation",
        "deviceConfiguration--windows10GeneralConfiguration_systemBootStartDriverInitialization",
        "deviceConfiguration--windows10GeneralConfiguration_internetSharingBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_powerButtonActionPluggedIn",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockSearchSuggestions",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarningsAboutUncommonFiles",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZonePopupBlocker",
        "deviceConfiguration--windows10GeneralConfiguration_defenderCloudExtendedTimeoutInSeconds",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesConsistentMimeHandling",
        "deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanType",
        "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhileOnBattery",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanDownloads",
        "deviceConfiguration--windows10GeneralConfiguration_safeSearchFilter",
        "deviceConfiguration--windows10GeneralConfiguration_taskManagerBlockEndTask",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockChangePowerSleep",
        "deviceConfiguration--windows10GeneralConfiguration_cellularBlockDataWhenRoaming",
        "deviceConfiguration--windows10GeneralConfiguration_defenderDaysBeforeDeletingQuarantinedMalware",
        "deviceConfiguration--windows10GeneralConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10GeneralConfiguration_messagingBlockMMS",
        "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockPrePairing",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_experienceBlockTaskSwitcher",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerActiveXControlsInProtectedMode",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLoadingOfXamlFiles",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesScriptedWindowSecurityRestrictions",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockTimeLanguagePage",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunActiveXControlsAndPlugins",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptActiveXControlsMarkedSafeForScripting",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockSideloadingExtensions",
        "deviceConfiguration--windows10GeneralConfiguration_powerButtonActionOnBattery",
        "deviceConfiguration--windows10GeneralConfiguration_powerLidCloseActionOnBattery",
        "deviceConfiguration--windows10GeneralConfiguration_windowsStoreBlockAutoUpdate",
        "deviceConfiguration--windows10GeneralConfiguration_defenderFilesAndFoldersToExclude",
        "deviceConfiguration--windows10GeneralConfiguration_bluetoothDeviceName",
        "deviceConfiguration--windows10GeneralConfiguration_networkProxyAutomaticConfigurationUrl",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockSendingIntranetTrafficToInternetExplorer",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLogonOptions",
        "deviceConfiguration--windows10GeneralConfiguration_searchBlockWebResults",
        "deviceConfiguration--windows10GeneralConfiguration_powerLidCloseActionPluggedIn",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime",
        "deviceConfiguration--windows10GeneralConfiguration_wiFiBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay",
        "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAlwaysInstallWithElevatedPrivileges",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockCompatibilityList",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenBlockCortana",
        "deviceConfiguration--windows10GeneralConfiguration_searchDisableAutoLanguageDetection",
        "deviceConfiguration--windows10GeneralConfiguration_privacyBlockInputPersonalization",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
        "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlockPromptedProximalConnections",
        "deviceConfiguration--windows10GeneralConfiguration_bluetoothBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_automaticUpdateTime",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightConfigureOnLockScreen",
        "deviceConfiguration--windows10GeneralConfiguration_defenderRequireCloudProtection",
        "deviceConfiguration--windows10GeneralConfiguration_antiTheftModeBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_wiFiBlockAutomaticConnectHotspots",
        "deviceConfiguration--windows10GeneralConfiguration_autoPlayMode",
        "deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppAction",
        "deviceConfiguration--windows10GeneralConfiguration_edgeSyncFavoritesWithInternetExplorer",
        "deviceConfiguration--windows10GeneralConfiguration_webRtcBlockLocalhostIpAddress",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockAccountsPage",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockAddressBarDropdown",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckServerCertificateRevocation",
        "deviceConfiguration--windows10GeneralConfiguration_storageRestrictAppInstallToSystemVolume",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLessPrivilegedSites",
        "deviceConfiguration--windows10GeneralConfiguration_networkProxyApplySettingsDeviceWide",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockPrinting",
        "deviceConfiguration--windows10GeneralConfiguration_assignedAccessSingleModeAppUserModelId",
        "deviceConfiguration--windows10GeneralConfiguration_searchDisableLocation",
        "deviceConfiguration--windows10GeneralConfiguration_storageRestrictAppDataToSystemVolume",
        "deviceConfiguration--windows10GeneralConfiguration_passwordRequiredType",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneFileDownloads",
        "deviceConfiguration--windows10GeneralConfiguration_edgeEnterpriseModeSiteListLocation",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventPerUserInstallationOfActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
        "deviceConfiguration--windows10GeneralConfiguration_edgeRequireSmartScreen",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventManagingSmartScreenFilter",
        "deviceConfiguration--windows10GeneralConfiguration_defenderCloudExtendedTimeout",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMimeSniffingSafetyFeature",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadSignedActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuMode",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockSettingsApp",
        "deviceConfiguration--windows10GeneralConfiguration_enterpriseCloudPrintResourceIdentifier",
        "deviceConfiguration--windows10GeneralConfiguration_privacyAutoAcceptPairingAndConsentPrompts",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockChangeSystemTime",
        "deviceConfiguration--windows10GeneralConfiguration_messagingBlockSync",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderFileExplorer",
        "deviceConfiguration--windows10GeneralConfiguration_edgeFavoritesListLocation",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerAutoComplete",
        "deviceConfiguration--windows10GeneralConfiguration_searchDisableIndexingRemovableDrive",
        "deviceConfiguration--windows10GeneralConfiguration_smartScreenAppInstallControl",
        "deviceConfiguration--windows10GeneralConfiguration_authenticationAllowSecondaryDevice",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowVBScriptToRun",
        "deviceConfiguration--windows10GeneralConfiguration_voiceRecordingBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_experienceBlockDeviceDiscovery",
        "deviceConfiguration--windows10GeneralConfiguration_printerDefaultName",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderMusic",
        "deviceConfiguration--windows10GeneralConfiguration_defenderDisableCatchupQuickScan",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_searchEnableAutomaticIndexSizeManangement",
        "deviceConfiguration--windows10GeneralConfiguration_tenantLockdownRequireNetworkDuringOutOfBoxExperience",
        "deviceConfiguration--windows10GeneralConfiguration_automaticUpdateSchedule",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneDoNotRunAntimalwareAgainstActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideHibernate",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanArchiveFiles",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockGamingPage",
        "deviceConfiguration--windows10GeneralConfiguration_powerSleepButtonActionOnBattery",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockSavingHistory",
        "deviceConfiguration--windows10GeneralConfiguration_powerHybridSleepPluggedIn",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneDoNotRunAntimalwareAgainstActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_networkProxyServer",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockThirdPartyNotifications",
        "deviceConfiguration--windows10GeneralConfiguration_edgeCookiePolicy",
        "deviceConfiguration--windows10GeneralConfiguration_edgeShowMessageWhenOpeningInternetExplorerSites",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptlets",
        "deviceConfiguration--windows10GeneralConfiguration_networkProxyDisableAutoDetect",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideChangeAccountSettings",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuAppListVisibility",
        "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhilePluggedIn",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesNotificationBar",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadSignedActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSmartScreen",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRemoveRunThisTimeButtonForOutdatedActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLaunchApplicationsAndFilesInAnIFrame",
        "deviceConfiguration--windows10GeneralConfiguration_passwordRequireWhenResumeFromIdleState",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockWindowsTips",
        "deviceConfiguration--windows10GeneralConfiguration_developerUnlockSetting",
        "deviceConfiguration--windows10GeneralConfiguration_defenderSystemScanSchedule",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideSwitchAccount",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderNetwork",
        "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumLength",
        "deviceConfiguration--windows10GeneralConfiguration_privacyAdvertisingId",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneNavigateWindowsAndFramesAcrossDifferentDomains",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSmartScreen",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownTrustedZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_authenticationPreferredAzureADTenantDomainName",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderVideos",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckSignaturesOnDownloadedPrograms",
        "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationByDeviceIdentifiers",
        "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverride",
        "deviceConfiguration--windows10GeneralConfiguration_edgeHomepageUrls",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfWebBrowserControls",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockAppsPage",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockNetworkInternetPage",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCrossSiteScriptingFilter",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneBinaryAndScriptBehaviors",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockEaseOfAccessPage",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockSearchEngineCustomization",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockPopups",
        "deviceConfiguration--windows10GeneralConfiguration_defenderRequireBehaviorMonitoring",
        "deviceConfiguration--windows10GeneralConfiguration_defenderProcessesToExclude",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecuritySettingsCheck",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSecurityWarningForPotentiallyUnsafeFiles",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderDocuments",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderHomeGroup",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_appsBlockWindowsStoreOriginatedApps",
        "deviceConfiguration--windows10GeneralConfiguration_deviceManagementBlockFactoryResetOnMobile",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBlockOutdatedActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZonePopupBlocker",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideFrequentlyUsedApps",
        "deviceConfiguration--windows10GeneralConfiguration_deviceManagementBlockManualUnenroll",
        "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverrideForFiles",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanNetworkFiles",
        "deviceConfiguration--windows10GeneralConfiguration_powerSleepButtonActionPluggedIn",
        "deviceConfiguration--windows10GeneralConfiguration_cortanaBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_displayAppListWithGdiDPIScalingTurnedOn",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockOnActionCenter",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideLock",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenTimeoutInSeconds",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockPasswordManager",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockConsumerSpecificFeatures",
        "deviceConfiguration--windows10GeneralConfiguration_experienceDoNotSyncBrowserSettings",
        "deviceConfiguration--windows10GeneralConfiguration_defenderDetectedMalwareActions",
        "deviceConfiguration--windows10GeneralConfiguration_enterpriseCloudPrintMopriaDiscoveryResourceIdentifier",
        "deviceConfiguration--windows10GeneralConfiguration_passwordRequired",
        "deviceConfiguration--windows10GeneralConfiguration_experienceBlockConsumerSpecificFeatures",
        "deviceConfiguration--windows10GeneralConfiguration_windows10AppsForceUpdateSchedule",
        "deviceConfiguration--windows10GeneralConfiguration_experienceBlockErrorDialogWhenNoSIM",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMKProtocolSecurityRestriction",
        "deviceConfiguration--windows10GeneralConfiguration_searchEnableRemoteQueries",
        "deviceConfiguration--windows10GeneralConfiguration_assignedAccessMultiModeProfiles",
        "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhileOnBattery",
        "deviceConfiguration--windows10GeneralConfiguration_edgeTelemetryForMicrosoft365Analytics",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenSlideShow",
        "deviceConfiguration--windows10GeneralConfiguration_passwordBlockSimple",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockLiveTileDataCollection",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfJavaApplets",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderDownloads",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockSendingDoNotTrackHeader",
        "deviceConfiguration--windows10GeneralConfiguration_systemTelemetryProxyServer",
        "deviceConfiguration--windows10GeneralConfiguration_diagnosticsDataSubmissionMode",
        "deviceConfiguration--windows10GeneralConfiguration_usbBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_searchBlockDiacritics",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIncludeAllNetworkPaths",
        "deviceConfiguration--windows10GeneralConfiguration_enterpriseCloudPrintOAuthClientIdentifier",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenActivateAppsWithVoice",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneProtectedMode",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneSmartScreen",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCrashDetection",
        "deviceConfiguration--windows10GeneralConfiguration_privacyDisableLaunchExperience",
        "deviceConfiguration--windows10GeneralConfiguration_inkWorkspaceAccessState",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenAllowTimeoutConfiguration",
        "deviceConfiguration--windows10GeneralConfiguration_resetProtectionModeBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockTabPreloading",
        "deviceConfiguration--windows10GeneralConfiguration_wiFiScanInterval",
        "deviceConfiguration--windows10GeneralConfiguration_prereleaseFeatures",
        "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockWelcomeExperience",
        "deviceConfiguration--windows10GeneralConfiguration_microsoftAccountBlockSettingsSync",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockWebContentOnNewTabPage",
        "deviceConfiguration--windows10GeneralConfiguration_energySaverOnBatteryThresholdPercentage",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockAutofill",
        "deviceConfiguration--windows10GeneralConfiguration_smartScreenEnableAppInstallControl",
        "deviceConfiguration--windows10GeneralConfiguration_microsoftAccountBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_sharedUserAppDataAllowed",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneActiveScripting",
        "deviceConfiguration--windows10GeneralConfiguration_inkWorkspaceBlockSuggestedApps",
        "deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppActionSetting",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockEditDeviceName",
        "deviceConfiguration--windows10GeneralConfiguration_wirelessDisplayRequirePinForPairing",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLogonOptions",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowVBScriptToRun",
        "deviceConfiguration--windows10GeneralConfiguration_edgeSendIntranetTrafficToInternetExplorer",
        "deviceConfiguration--windows10GeneralConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockSystemPage",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsAcrossWindows",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
        "deviceConfiguration--windows10GeneralConfiguration_cameraBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDownloadEnclosures",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHidePowerButton",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockUpdateSecurityPage",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadUnsignedActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideShutDown",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsWithinWindows",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictActiveXInstall",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderPictures",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockPersonalizationPage",
        "deviceConfiguration--windows10GeneralConfiguration_windowsStoreEnablePrivateStoreOnly",
        "deviceConfiguration--windows10GeneralConfiguration_cellularBlockVpn",
        "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumAgeInDays",
        "deviceConfiguration--windows10GeneralConfiguration_dataProtectionBlockDirectMemoryAccess",
        "deviceConfiguration--windows10GeneralConfiguration_edgeRequiredExtensionPackageFamilyNames",
        "deviceConfiguration--windows10GeneralConfiguration_defenderCloudBlockLevel",
        "deviceConfiguration--windows10GeneralConfiguration_cellularData",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptlets",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragAndDropOrCopyAndPasteFiles",
        "deviceConfiguration--windows10GeneralConfiguration_enterpriseCloudPrintOAuthAuthority",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSoftwareWhenSignatureIsInvalid",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockInPrivateBrowsing",
        "deviceConfiguration--windows10GeneralConfiguration_edgeClearBrowsingDataOnExit",
        "deviceConfiguration--windows10GeneralConfiguration_nfcBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_edgeSearchEngine",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuLayoutEdgeAssetsXml",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCopyAndPasteViaScript",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsAcrossWindows",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersAddingSites",
        "deviceConfiguration--windows10GeneralConfiguration_edgeDisableFirstRunPage",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptInitiatedWindows",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecurityZonesUseOnlyMachineSettings",
        "deviceConfiguration--windows10GeneralConfiguration_locationServicesBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_edgeOpensWith",
        "deviceConfiguration--windows10GeneralConfiguration_securityBlockAzureADJoinedDevicesAutoEncryption",
        "deviceConfiguration--windows10GeneralConfiguration_edgePreventCertificateErrorOverride",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownLocalMachineZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_screenCaptureBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDoNotRunAntimalwareAgainstActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_microsoftAccountSignInAssistantSettings",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockPrivacyPage",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
        "deviceConfiguration--windows10GeneralConfiguration_edgeNewTabPageURL",
        "deviceConfiguration--windows10GeneralConfiguration_enterpriseCloudPrintDiscoveryEndPoint",
        "deviceConfiguration--windows10GeneralConfiguration_energySaverPluggedInThresholdPercentage",
        "deviceConfiguration--windows10GeneralConfiguration_privacyAccessControls",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAccessToDataSources",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideSignOut",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuHideRecentJumpLists",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockDevicesPage",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDoNotRunAntimalwareAgainstActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_searchDisableIndexerBackoff",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCopyAndPasteViaScript",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUseActiveXInstallerService",
        "deviceConfiguration--windows10GeneralConfiguration_personalizationDesktopImageUrl",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesProtectionFromZoneElevation",
        "deviceConfiguration--windows10GeneralConfiguration_copyPasteBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_printerBlockAddition",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadUnsignedActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockEditFavorites",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockChangeRegion",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneNavigateWindowsAndFramesAcrossDifferentDomains",
        "deviceConfiguration--windows10GeneralConfiguration_windowsStoreBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_wiFiBlockManualConfiguration",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUpdatesToStatusBarViaScript",
        "deviceConfiguration--windows10GeneralConfiguration_edgeKioskModeRestriction",
        "deviceConfiguration--windows10GeneralConfiguration_bluetoothAllowedServices",
        "deviceConfiguration--windows10GeneralConfiguration_printerNames",
        "deviceConfiguration--windows10GeneralConfiguration_personalizationLockScreenImageUrl",
        "deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring",
        "deviceConfiguration--windows10GeneralConfiguration_automaticUpdateMode",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneIncludeLocalPathWhenUploadingFilesToServer",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanMaxCpu",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockChangeLanguage",
        "deviceConfiguration--windows10GeneralConfiguration_cryptographyAllowFipsAlgorithmPolicy",
        "deviceConfiguration--windows10GeneralConfiguration_settingsBlockAddProvisioningPackage",
        "deviceConfiguration--windows10GeneralConfiguration_logonBlockFastUserSwitching",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictFileDownload",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScanMappedNetworkDrivesDuringFullScan",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockAccessToAboutFlags",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseActiveXControls",
        "deviceConfiguration--windows10GeneralConfiguration_lockScreenHideNetworkSelectionUI",
        "deviceConfiguration--windows10GeneralConfiguration_autoPlayForNonVolumeDevices",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuLayoutXml",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
        "deviceConfiguration--windows10GeneralConfiguration_powerHybridSleepOnBattery",
        "deviceConfiguration--windows10GeneralConfiguration_defenderBlockEndUserAccess",
        "deviceConfiguration--windows10GeneralConfiguration_wirelessDisplayBlockProjectionToThisDevice",
        "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationBySetupClasses",
        "deviceConfiguration--windows10GeneralConfiguration_gameDvrBlocked",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledQuickScanTime",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockPrelaunch",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuPinnedFolderPersonalFolder",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersChangingPolicies",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneProtectedMode",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUserDataPersistence",
        "deviceConfiguration--windows10GeneralConfiguration_edgeBlockDeveloperTools",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptingOfWebBrowserControls",
        "deviceConfiguration--windows10GeneralConfiguration_privacyBlockActivityFeed",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUserDataPersistence",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownIntranetZoneJavaPermissions",
        "deviceConfiguration--windows10GeneralConfiguration_certificatesBlockManualRootCertificateInstallation",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEnhancedProtectedMode",
        "deviceConfiguration--windows10GeneralConfiguration_edgeHomeButtonConfiguration",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarnings",
        "deviceConfiguration--windows10GeneralConfiguration_privacyBlockPublishUserActivities",
        "deviceConfiguration--windows10GeneralConfiguration_oneDriveDisableFileSync",
        "deviceConfiguration--windows10GeneralConfiguration_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--windows10GeneralConfiguration_enableAutomaticRedeployment",
        "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneMetaRefresh",
        "deviceConfiguration--windows10GeneralConfiguration_displayAppListWithGdiDPIScalingTurnedOff",
        "deviceConfiguration--windows10GeneralConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--windows10GeneralConfiguration_scenarioType",
        "deviceConfiguration--windows10GeneralConfiguration_assignedAccessSingleKioskMode",
        "deviceConfiguration--windows10GeneralConfiguration_assignedAccessConfiguration",
        "deviceConfiguration--windows10GeneralConfiguration_edgeSearchEngineString",
        "deviceConfiguration--windows10GeneralConfiguration_defenderThreatSeverityDefaultAction",
        "deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppActionPcl",
        "deviceConfiguration--windows10GeneralConfiguration_privacy_LetAppsAccess_ItemList",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessAccountInfo",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessAccountInfoForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessAccountInfoForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessAccountInfoUserInControlTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCalendar",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCalendarForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCalendarForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCalendarUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCallHistory",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCallHistoryForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCallHistoryForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCallHistoryUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCamera",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCameraForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCameraForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessCameraUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessContacts",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessContactsForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessContactsForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessContactsUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessEmail",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessEmailForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessEmailForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessEmailUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessLocation",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessLocationForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessLocationForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessLocationUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMessaging",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMessagingForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMessagingForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMessagingUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMicrophone",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMicrophoneForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMicrophoneForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMicrophoneUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMotion",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMotionForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMotionForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessMotionUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessNotifications",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessNotificationsForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessNotificationsForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessNotificationsUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessPhone",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessPhoneForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessPhoneForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessPhoneUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessRadios",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessRadiosForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessRadiosForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessRadiosUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTasks",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTasksForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTasksForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTasksUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTrustedDevices",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTrustedDevicesForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTrustedDevicesForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsAccessTrustedDevicesUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsGetDiagnosticInfo",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsGetDiagnosticInfoForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsGetDiagnosticInfoForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsGetDiagnosticInfoUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsRunInBackground",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsRunInBackgroundForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsRunInBackgroundForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsRunInBackgroundUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsSyncWithDevices",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsSyncWithDevicesForceAllowTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsSyncWithDevicesForceDenyTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_privacyLetAppsSyncWithDevicesUserInControlOfTheseApps",
        "deviceConfiguration--windows10GeneralConfiguration_uninstallBuiltInApps",
        "deviceConfiguration--windows10GeneralConfiguration_enableOnAccessProtection",
        "deviceConfiguration--windows10GeneralConfiguration_scheduleAQuickScan",
        "deviceConfiguration--windows10GeneralConfiguration_quickScanSchTime",
        "deviceConfiguration--windows10GeneralConfiguration_assignmentProgress",
        "deviceConfiguration--windows10GeneralConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--windows10GeneralConfiguration_edgeHomepageUrlString",
        "deviceConfiguration--windows10GeneralConfiguration_pageVisibilityList",
        "deviceConfiguration--windows10GeneralConfiguration_printerNamesString",
        "deviceConfiguration--windows10GeneralConfiguration_findMyFiles",
        "deviceConfiguration--windows10GeneralConfiguration_activateAppsWithVoice",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuLayoutXmlCustom",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuAppListVisibilityCustom",
        "deviceConfiguration--windows10GeneralConfiguration_configureTimeZone",
        "deviceConfiguration--windows10GeneralConfiguration_defenderRealTimeScanDirectionPcl",
        "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledQuickScanTimePcl",
        "deviceConfiguration--windows10GeneralConfiguration_startMenuLayoutEdgeAssetsXmlCustom",
        "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditCredentialValidation",
        "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditKerberosAuthenticationService",
        "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditAccountLockout",
        "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditGroupMembership",
        "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditLogon",
        "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditOtherLogonLogoffEvents",
        "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditSpecialLogon",
        "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditSecurityGroupManagement",
        "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditUserAccountManagement",
        "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditPNPActivity",
        "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditProcessCreation",
        "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditDetailedFileShare",
        "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditFileShare",
        "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditOtherObjectAccessEvents",
        "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditRemovableStorage",
        "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditAuthenticationPolicyChange",
        "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditMPSSVCRuleLevelPolicyChange",
        "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditOtherPolicyChangeEvents",
        "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditPolicyChange",
        "deviceConfiguration--windows10GeneralConfiguration_privilegeUseAuditSensitivePrivilegeUse",
        "deviceConfiguration--windows10GeneralConfiguration_systemAuditOtherSystemEvents",
        "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecurityStateChange",
        "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecuritySystemExtension",
        "deviceConfiguration--windows10GeneralConfiguration_systemAuditSystemIntegrity",
        "deviceConfiguration--windows10GeneralConfiguration_allowHardwareDeviceInstallationByDeviceIdentifiers",
        "deviceConfiguration--windows10GeneralConfiguration_allowHardwareDeviceInstallationBySetupClasses",
        "deviceConfiguration--windows10GeneralConfiguration_preventHardwareDeviceInstallationByDeviceInstanceIdentifiers",
        "deviceConfiguration--windows10GeneralConfiguration_allowHardwareDeviceInstallationByDeviceInstanceIdentifiers"
    ],
    "constraints": [],
    "dependencies": []
}