{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidGeneralDeviceConfiguration_appsHideList",
    "valueType": "collection",
    "displayName": "Apps hidden from user (Samsung KNOX Standard only)",
    "isTopLevel": true,
    "description": "Specify the apps that will be hidden on the device. Users cannot discover or run these apps.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingAppConstraint",
            "supportedTypes": [
                "androidLobApp",
                "androidStoreApp",
                "managedAndroidStoreApp",
                "managedAndroidLobApp"
            ]
        }
    ],
    "dependencies": []
}