{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--partnerMacOSCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__partnerMacOSCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--partnerMacOSCompliancePolicy_id",
        "deviceConfiguration--partnerMacOSCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--partnerMacOSCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--partnerMacOSCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--partnerMacOSCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}