{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--allowDeviceInstallation_identifiers",
    "valueType": "collection",
    "displayName": "Allow list",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--allowDeviceInstallation_identifiers_element",
    "constraints": [],
    "dependencies": []
}