{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10NetworkProxyServer_exceptions",
    "valueType": "collection",
    "displayName": "Proxy exceptions",
    "isTopLevel": false,
    "description": "Addresses that should not use the proxy server. The system will not use the proxy server for addresses beginning with what is specified in this node. Use semicolons (;) to separate entries.",
    "placeholderText": "Not configured",
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10NetworkProxyServer_exceptions_element",
    "constraints": [],
    "dependencies": []
}