{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iPv6Range",
    "valueType": "complex",
    "displayName": "IPv6 range",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iPv6Range_upperAddress",
        "deviceConfiguration--iPv6Range_lowerAddress"
    ],
    "constraints": [],
    "dependencies": []
}