{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSNotificationSettings",
    "valueType": "complex",
    "displayName": "iOS Notification Settings",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSNotificationSettings_enabled",
        "deviceConfiguration--iOSNotificationSettings_bundleID",
        "deviceConfiguration--iOSNotificationSettings_appName",
        "deviceConfiguration--iOSNotificationSettings_badgesEnabled",
        "deviceConfiguration--iOSNotificationSettings_publisher",
        "deviceConfiguration--iOSNotificationSettings_showInNotificationCenter",
        "deviceConfiguration--iOSNotificationSettings_alertType",
        "deviceConfiguration--iOSNotificationSettings_showOnLockScreen",
        "deviceConfiguration--iOSNotificationSettings_soundsEnabled"
    ],
    "constraints": [],
    "dependencies": []
}