{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10NetworkProxyServer",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10NetworkProxyServer_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10NetworkProxyServer_address",
        "deviceConfiguration--windows10NetworkProxyServer_exceptions",
        "deviceConfiguration--windows10NetworkProxyServer_useForLocalAddresses"
    ],
    "constraints": [],
    "dependencies": []
}