{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsNetworkIsolationPolicy_enterpriseCloudResources",
    "valueType": "collection",
    "displayName": "Cloud resources",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--proxiedDomain",
    "constraints": [],
    "dependencies": []
}