{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEduDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSEduDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSEduDeviceConfiguration_studentCertificateSettings",
        "deviceConfiguration--iOSEduDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSEduDeviceConfiguration_deviceCertificateSettings",
        "deviceConfiguration--iOSEduDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSEduDeviceConfiguration_teacherCertificateSettings",
        "deviceConfiguration--iOSEduDeviceConfiguration_scenarioType",
        "deviceConfiguration--iOSEduDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--iOSEduDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}