{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsKioskConfiguration_kioskBrowserBlockedURLs",
    "valueType": "collection",
    "displayName": "Blocked websites",
    "isTopLevel": true,
    "description": "Block websites from user access in the kiosk browser app.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsKioskConfiguration_kioskBrowserBlockedURLs_element",
    "constraints": [],
    "dependencies": []
}