{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--customSubjectAlternativeName",
    "valueType": "complex",
    "displayName": "Custom Subject Alternative Name",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--customSubjectAlternativeName_name",
        "deviceConfiguration--customSubjectAlternativeName_sanType"
    ],
    "constraints": [],
    "dependencies": []
}