{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iOSDeviceFeaturesConfiguration_contentFilterSettings",
    "valueType": "abstractComplex",
    "displayName": "Filter type",
    "isTopLevel": true,
    "description": "The filtering mechanism that would be employed in determining whether a URL is accessible or not. You can choose to use Apple’s AutoFilter or specify the exact list of URLs or block all URLs.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=845201",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSWebContentFilterAutoFilter",
        "deviceConfiguration--iOSWebContentFilterSpecificWebsitesAccess"
    ],
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}