{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSDerivedCredentialAuthenticationConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSDerivedCredentialAuthenticationConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSDerivedCredentialAuthenticationConfiguration_derivedCredentialSettings",
        "deviceConfiguration--iOSDerivedCredentialAuthenticationConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSDerivedCredentialAuthenticationConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSDerivedCredentialAuthenticationConfiguration_assignmentProgress",
        "deviceConfiguration--iOSDerivedCredentialAuthenticationConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}