{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSGeneralDeviceConfiguration_appsSingleAppModeList",
    "valueType": "collection",
    "displayName": "App list",
    "isTopLevel": true,
    "description": "Apps you add to this list and assign to a device can lock the device to run only that app once launched, or lock the device while a certain action is running (for example, taking a test). Once the action is complete, or you remove the restriction, the device returns to its normal state.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}