{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceComplianceLocalActionLockDeviceWithPasscode",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceComplianceLocalActionLockDeviceWithPasscode_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceComplianceLocalActionLockDeviceWithPasscode_gracePeriodInMinutes",
        "deviceConfiguration--androidDeviceComplianceLocalActionLockDeviceWithPasscode_passcode",
        "deviceConfiguration--androidDeviceComplianceLocalActionLockDeviceWithPasscode_passcodeSignInFailureCountBeforeWipe",
        "deviceConfiguration--androidDeviceComplianceLocalActionLockDeviceWithPasscode_id"
    ],
    "constraints": [],
    "dependencies": []
}