{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--sharedPCConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__sharedPCConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--sharedPCConfiguration_allowedAccounts",
        "deviceConfiguration--sharedPCConfiguration_maintenanceStartTime",
        "deviceConfiguration--sharedPCConfiguration_disablePowerPolicies",
        "deviceConfiguration--sharedPCConfiguration_allowLocalStorage",
        "deviceConfiguration--sharedPCConfiguration_disableAccountManager",
        "deviceConfiguration--sharedPCConfiguration_idleTimeBeforeSleepInSeconds",
        "deviceConfiguration--sharedPCConfiguration_fastFirstSignIn",
        "deviceConfiguration--sharedPCConfiguration_enabled",
        "deviceConfiguration--sharedPCConfiguration_setEduPolicies",
        "deviceConfiguration--sharedPCConfiguration_accountManagerPolicy",
        "deviceConfiguration--sharedPCConfiguration_disableSignInOnResume",
        "deviceConfiguration--sharedPCConfiguration_localStorage",
        "deviceConfiguration--sharedPCConfiguration_disableEduPolicies",
        "deviceConfiguration--sharedPCConfiguration_setPowerPolicies",
        "deviceConfiguration--sharedPCConfiguration_signInOnResume",
        "deviceConfiguration--sharedPCConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--sharedPCConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--sharedPCConfiguration_setAccountManager",
        "deviceConfiguration--sharedPCConfiguration_kioskAppUserModelId",
        "deviceConfiguration--sharedPCConfiguration_scenarioType",
        "deviceConfiguration--sharedPCConfiguration_kioskAppDisplayName",
        "deviceConfiguration--sharedPCConfiguration_scheduleAccountDeletionCustom",
        "deviceConfiguration--sharedPCConfiguration_setAccountManagerCustom",
        "deviceConfiguration--sharedPCConfiguration_setEduPoliciesCustom",
        "deviceConfiguration--sharedPCConfiguration_setPowerPoliciesCustom",
        "deviceConfiguration--sharedPCConfiguration_restrictLocalStorageCustom",
        "deviceConfiguration--sharedPCConfiguration_setSignInOnResumeCustom",
        "deviceConfiguration--sharedPCConfiguration_enableProfileManager",
        "deviceConfiguration--sharedPCConfiguration_accountManagementDeletionPolicy",
        "deviceConfiguration--sharedPCConfiguration_storageCapacityStartDeletion",
        "deviceConfiguration--sharedPCConfiguration_storageCapacityStopDeletion",
        "deviceConfiguration--sharedPCConfiguration_profileInactivityThreshold",
        "deviceConfiguration--sharedPCConfiguration_allowedAccountsCustom",
        "deviceConfiguration--sharedPCConfiguration_cacheAccountsAboveDiskFreePercentageCustom",
        "deviceConfiguration--sharedPCConfiguration_inactiveThresholdDaysCustom",
        "deviceConfiguration--sharedPCConfiguration_maintenanceStartTimeCustom",
        "deviceConfiguration--sharedPCConfiguration_removeAccountsBelowDiskFreePercentageCustom",
        "deviceConfiguration--sharedPCConfiguration_assignmentProgress",
        "deviceConfiguration--sharedPCConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}