{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81GeneralConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsPhone81GeneralConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsPhone81GeneralConfiguration_wifiBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_cameraBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_cellularBlockWifiTethering",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordBlockSimple",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_storageBlockRemovableStorage",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_windowsStoreBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_applyToWindows10Mobile",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordMinimumLength",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordRequiredType",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_appsComplianceListType",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_compliantAppsList",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_microsoftAccountBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_emailBlockAddingAccounts",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordMinimumCharacterSetCount",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_wifiBlockAutomaticConnectHotspots",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_applyOnlyToWindowsPhone81",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_compliantAppListType",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordExpirationDays",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_wifiBlockHotspotReporting",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_diagnosticDataBlockSubmission",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_webBrowserBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_bluetoothBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_screenCaptureBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_locationServicesBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_storageRequireEncryption",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_nfcBlocked",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_appsBlockCopyPaste",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_appsComplianceList",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_passwordRequired",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_scenarioType",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_assignmentProgress",
        "deviceConfiguration--windowsPhone81GeneralConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}