{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSPkcsCertificateProfile",
    "valueType": "complex",
    "displayName": "iOS Pkcs Certificate Profile",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSPkcsCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSPkcsCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--iOSPkcsCertificateProfile_certificateStore",
        "deviceConfiguration--iOSPkcsCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--iOSPkcsCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSPkcsCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--iOSPkcsCertificateProfile_certificationAuthorityName",
        "deviceConfiguration--iOSPkcsCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--iOSPkcsCertificateProfile_subjectNameFormat",
        "deviceConfiguration--iOSPkcsCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--iOSPkcsCertificateProfile_certificationAuthority",
        "deviceConfiguration--iOSPkcsCertificateProfile_certificateTemplateName",
        "deviceConfiguration--iOSPkcsCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--iOSPkcsCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--iOSPkcsCertificateProfile_assignmentProgress",
        "deviceConfiguration--iOSPkcsCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}