{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEnterpriseWiFiConfiguration_identityCertificateForClientAuthentication",
    "valueType": "abstractComplex",
    "displayName": "Identity certificate for client authentication",
    "isTopLevel": true,
    "description": "Identity certificate for client authentication",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSPkcsCertificateProfile",
        "deviceConfiguration--iOSScepCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}