{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSDeviceFeaturesConfiguration_singleSignOnSettings",
    "valueType": "complex",
    "displayName": "Single sign-on",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSSingleSignOnSettings_kerberosRealm",
        "deviceConfiguration--iOSSingleSignOnSettings_kerberosPrincipalName",
        "deviceConfiguration--iOSSingleSignOnSettings_allowedAppsList",
        "deviceConfiguration--iOSSingleSignOnSettings_allowedUrls",
        "deviceConfiguration--iOSSingleSignOnSettings_displayName"
    ],
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSDeviceEnrollment",
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}