{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidEasEmailProfileConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidEasEmailProfileConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidEasEmailProfileConfiguration_emailSyncSchedule",
        "deviceConfiguration--androidEasEmailProfileConfiguration_userDomainNameSource",
        "deviceConfiguration--androidEasEmailProfileConfiguration_accountName",
        "deviceConfiguration--androidEasEmailProfileConfiguration_smimeSigningCertificate",
        "deviceConfiguration--androidEasEmailProfileConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidEasEmailProfileConfiguration_requireSmime",
        "deviceConfiguration--androidEasEmailProfileConfiguration_usernameSource",
        "deviceConfiguration--androidEasEmailProfileConfiguration_syncContacts",
        "deviceConfiguration--androidEasEmailProfileConfiguration_emailAddressSource",
        "deviceConfiguration--androidEasEmailProfileConfiguration_syncTasks",
        "deviceConfiguration--androidEasEmailProfileConfiguration_durationOfEmailToSync",
        "deviceConfiguration--androidEasEmailProfileConfiguration_syncCalendar",
        "deviceConfiguration--androidEasEmailProfileConfiguration_syncNotes",
        "deviceConfiguration--androidEasEmailProfileConfiguration_identityCertificate",
        "deviceConfiguration--androidEasEmailProfileConfiguration_customDomainName",
        "deviceConfiguration--androidEasEmailProfileConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidEasEmailProfileConfiguration_authenticationMethod",
        "deviceConfiguration--androidEasEmailProfileConfiguration_requireSsl",
        "deviceConfiguration--androidEasEmailProfileConfiguration_hostName",
        "deviceConfiguration--androidEasEmailProfileConfiguration_assignmentProgress",
        "deviceConfiguration--androidEasEmailProfileConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}