{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSIKEv2VpnConfiguration_server",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSIKEv2VpnConfiguration_server_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnServer_isDefaultServer",
        "deviceConfiguration--vpnServer_address",
        "deviceConfiguration--vpnServer_iPAddressOrFqdn",
        "deviceConfiguration--vpnServer_description"
    ],
    "constraints": [],
    "dependencies": []
}