{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskConfiguration_windowsKioskForceUpdateSchedule",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsKioskConfiguration_windowsKioskForceUpdateSchedule_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskForceUpdateSchedule_dayofWeek",
        "deviceConfiguration--windowsKioskForceUpdateSchedule_recurrence",
        "deviceConfiguration--windowsKioskForceUpdateSchedule_dayofMonth",
        "deviceConfiguration--windowsKioskForceUpdateSchedule_runImmediatelyIfAfterStartDateTime"
    ],
    "constraints": [],
    "dependencies": []
}