{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSImportedPFXCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSImportedPFXCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSImportedPFXCertificateProfile_subjectNameFormat",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_intendedPurpose",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_assignmentProgress",
        "deviceConfiguration--macOSImportedPFXCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}