{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkCompliancePolicy_id",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityBlockJailbrokenDevices",
        "deviceConfiguration--androidForWorkCompliancePolicy_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityRequireUpToDateSecurityProviders",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityRequireSafetyNetAttestationBasicIntegrity",
        "deviceConfiguration--androidForWorkCompliancePolicy_requireCompanyPortalAppIntegrity",
        "deviceConfiguration--androidForWorkCompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityRequireSafetyNetAttestationCertifiedDevice",
        "deviceConfiguration--androidForWorkCompliancePolicy_minAndroidSecurityPatchLevel",
        "deviceConfiguration--androidForWorkCompliancePolicy_requireAppVerify",
        "deviceConfiguration--androidForWorkCompliancePolicy_deviceThreatProtectionEnabled",
        "deviceConfiguration--androidForWorkCompliancePolicy_requireGooglePlayServices",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityRequireCompanyPortalAppIntegrity",
        "deviceConfiguration--androidForWorkCompliancePolicy_requireSafetyNetAttestationCertifiedDevice",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityDisableUsbDebugging",
        "deviceConfiguration--androidForWorkCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--androidForWorkCompliancePolicy_passwordRequiredType",
        "deviceConfiguration--androidForWorkCompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--androidForWorkCompliancePolicy_deviceThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--androidForWorkCompliancePolicy_requireSafetyNetAttestationBasicIntegrity",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityRequireGooglePlayServices",
        "deviceConfiguration--androidForWorkCompliancePolicy_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityRequireVerifyApps",
        "deviceConfiguration--androidForWorkCompliancePolicy_securityPreventInstallAppsFromUnknownSources",
        "deviceConfiguration--androidForWorkCompliancePolicy_requireUpToDateSecurityProviders",
        "deviceConfiguration--androidForWorkCompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--androidForWorkCompliancePolicy_passwordRequired",
        "deviceConfiguration--androidForWorkCompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--androidForWorkCompliancePolicy_restrictedApps",
        "deviceConfiguration--androidForWorkCompliancePolicy_osMinimumVersion",
        "deviceConfiguration--androidForWorkCompliancePolicy_osMaximumVersion",
        "deviceConfiguration--androidForWorkCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidForWorkCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}