{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSGeneralDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSGeneralDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordBlockFingerprintUnlock",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iTunesBlockMusicService",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_cameraBlocked",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordBlockAutoFill",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockCalendar",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordBlockModification",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iTunesBlockFileSharing",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_compliantAppsList",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_compliantAppListType",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordMinimumCharacterSetCount",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_siriBlocked",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockDocumentSync",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_classroomForceUnpromptedAppAndDeviceLock",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_keyboardBlockDictation",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_airPrintBlockiBeaconDiscovery",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_softwareUpdatesEnforcedDelayInDays",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockReminders",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_classroomAppBlockRemoteScreenObservation",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_spotlightBlockInternetResults",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_emailInDomainSuffixes",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockPhotoLibrary",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockBookmarks",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_softwareUpdatesForceDelayed",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_classroomAppForceUnpromptedScreenObservation",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordBlockAirDropSharing",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordExpirationDays",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordRequired",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_appsComplianceList",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_safariBlockAutofill",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordBlockProximityRequests",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_definitionLookupBlocked",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockNotes",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_airPrintBlocked",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_airDropBlocked",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockActivityContinuation",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_keychainBlockCloudSync",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_appleWatchBlockAutoUnlock",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_contentCachingBlocked",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_classroomForceAutomaticallyJoinClasses",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_screenCaptureBlocked",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_appsComplianceListType",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordMinimumLength",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockAddressBook",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordBlockSimple",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_iCloudBlockMail",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_airPrintForceTrustedTLS",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_passwordRequiredType",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_classroomForceRequestPermissionToLeaveClasses",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_privacyAccessControls",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_scenarioType",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--macOSGeneralDeviceConfiguration_compliantAppsListWrapper"
    ],
    "constraints": [],
    "dependencies": []
}