{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidGeneralDeviceConfiguration_kioskModeApps",
    "valueType": "collection",
    "displayName": "Apps to use in kiosk mode (Samsung KNOX Standard only)",
    "isTopLevel": true,
    "description": "Kiosk mode apps",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingAppConstraint",
            "supportedTypes": [
                "androidLobApp",
                "androidStoreApp",
                "managedAndroidStoreApp",
                "managedAndroidLobApp"
            ]
        }
    ],
    "dependencies": []
}