{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSNetworkUsageRule",
    "valueType": "complex",
    "displayName": "Network useage rule",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSNetworkUsageRule_cellularDataBlocked",
        "deviceConfiguration--iOSNetworkUsageRule_managedApps",
        "deviceConfiguration--iOSNetworkUsageRule_cellularDataBlockWhenRoaming"
    ],
    "constraints": [],
    "dependencies": []
}