{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidGeneralDeviceConfiguration_compliantAppsList",
    "valueType": "collection",
    "displayName": "Apps list",
    "isTopLevel": true,
    "description": "Enter the Google Play Store URL of the app you want. For example, to specify the Microsoft Remote Desktop app for Android, enter https://play.google.com/store/apps/details?id=com.microsoft.rdc.android. To find the URL of an app, use a search engine to locate the store page. For example, to find the Remote Desktop app, you could search Microsoft Remote Desktop Play Store.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--androidGeneralDeviceConfiguration_compliantAppListType",
            "constraints": []
        }
    ]
}