{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSGeneralDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSGeneralDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeBlockScreenRotation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeRequireVoiceOver",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeSignInFailureCountBeforeWipe",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_classroomAppBlockRemoteScreenObservation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodePreviousPasscodeBlockCount",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iTunesBlockRadio",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_diagnosticDataBlockSubmission",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariRequireFraudWarning",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudBlockPhotoStreamSync",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeRequireAssistiveTouch",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_findMyFriendsBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_keyboardBlockDictation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cellularBlockPersonalHotspotModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appStoreRequirePassword",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_continuousPathKeyboardBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_classroomForceRequestPermissionToLeaveClasses",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_wallpaperBlockModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowTouchscreen",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingJapan",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_classroomAppForceUnpromptedScreenObservation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_keyboardBlockShortcuts",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowVoiceOverSettings",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeRequireMonoAudio",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_enterpriseBookBlockMetadataSync",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariManagedDomains",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAppStoreUrl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_classroomForceUnpromptedAppAndDeviceLock",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cellularBlockVoiceRoaming",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_lockScreenBlockControlCenter",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeBlockModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_airPrintBlockiBeaconDiscovery",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeRequiredType",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_enterpriseAppBlockTrust",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudBlockPhotoLibrary",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_hostPairingBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_airDropBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingUnitedStates",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudBlockManagedAppsSync",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iTunesBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_autoFillForceAuthentication",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_airPrintForceTrustedTLS",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowVolumeButtons",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_softwareUpdatesForceDelayed",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cellularBlockPerAppDataModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_dateAndTimeForceSetAutomatically",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowAutoLock",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_airPrintBlockCredentialsStorage",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_podcastsBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_bluetoothBlockModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_diagnosticDataBlockSubmissionModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudRequireEncryptedBackup",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_contactsAllowManagedToUnmanagedWrite",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cellularBlockPersonalHotspot",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_certificatesBlockUntrustedTlsCertificates",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeBuiltInAppId",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appsVisibilityList",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_accountBlockModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_keyboardBlockPredictive",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingAustralia",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_activationLockAllowWhenSupervised",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowScreenRotation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_deviceBlockEraseContentAndSettings",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowZoomSettings",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_enterpriseBookBlockBackup",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_spotlightBlockInternetResults",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariBlockJavaScript",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_findMyFriendsInFindMyAppBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeMinimumCharacterSetCount",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_findMyDeviceInFindMyAppBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_deviceBlockEnableRestrictions",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_keyboardBlockSpellCheck",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appStoreBlockAutomaticDownloads",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeBlockVolumeButtons",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeBlockSleepButton",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_screenTimeBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeBlockTouchscreen",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_faceTimeBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_usbRestrictedModeBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appsComplianceListType",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iBooksStoreBlockErotica",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingUnitedKingdom",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_compliantAppListType",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_airPlayForcePairingPasswordForOutgoingRequests",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_lockScreenBlockTodayView",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_softwareUpdatesEnforcedDelayInDays",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeMinimumLength",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariCookieSettings",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_pKIBlockOTAUpdates",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeManagedAppId",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iTunesBlockMusicService",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowAssistiveTouchSettings",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowRingerSwitch",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudBlockBackup",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appleNewsBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_emailInDomainSuffixes",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_definitionLookupBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_lockScreenBlockNotificationView",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_siriDisableServerLogging",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_gameCenterBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowSleepButton",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_siriBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cellularBlockGlobalBackgroundFetchWhileRoaming",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_siriBlockedWhenLocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cellularBlockPlanModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_proximityBlockSetupToNewDevice",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appStoreBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingApps",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_gamingBlockGameCenterFriends",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeBlockFingerprintUnlock",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudBlockActivityContinuation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appStoreBlockUIAppInstallation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_siriBlockUserGeneratedContent",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_keychainBlockCloudSync",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingCanada",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeMinutesOfInactivityBeforeLock",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowColorInversionSettings",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passwordBlockAirDropSharing",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeBlockSimple",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appsSingleAppModeList",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeBlockFingerprintModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_wiFiConnectOnlyToConfiguredNetworks",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_lockScreenBlockPassbook",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_airDropForceUnmanagedDropTarget",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeBlockAutoLock",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowVoiceControlModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_gamingBlockMultiplayer",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeRequireColorInversion",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAllowAssistiveSpeak",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_enterpriseAppBlockTrustModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_screenCaptureBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_privacyForceLimitAdTracking",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_voiceDialingBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingNewZealand",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appRemovalBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_keyboardBlockAutoCorrect",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeRequireZoom",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iTunesBlockExplicitContent",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_siriRequireProfanityFilter",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_deviceBlockNameModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_airPrintBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudBlockSharedPhotoStream",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeRequired",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appsComplianceList",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iBooksStoreBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_documentsBlockUnmanagedDocumentsInManagedApps",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_blockSystemAppRemoval",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cameraBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_configurationProfileBlockChanges",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appsVisibilityListType",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_wiFiBlockPowerModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_vPNBlockCreation",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_networkUsageRules",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariPasswordAutoFillDomains",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingIreland",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_documentsBlockManagedDocumentsInUnmanagedApps",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_compliantAppsList",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeEnableVoiceControl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariBlockAutofill",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_iCloudBlockDocumentSync",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appStoreBlockInAppPurchases",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingFrance",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_classroomForceAutomaticallyJoinClasses",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passwordBlockAutoFill",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_contactsAllowUnmanagedToManagedRead",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_eSIMBlockModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appleWatchBlockPairing",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passwordBlockProximityRequests",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingGermany",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_cellularBlockDataRoaming",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_messagesBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeExpirationDays",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeBlockRingerSwitch",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_notificationsBlockSettingsModification",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_appleWatchForceWristDetection",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_safariBlockPopups",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_filesNetworkDriveAccessBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_filesUsbDriveAccessBlocked",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_wifiPowerOnForced",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_scenarioType",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeExpirationDaysPcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeMinutesOfInactivityBeforeLockPcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeSignInFailureCountBeforeWipePcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeRequiredTypePcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeAppType",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeBlockSimplePcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeMinutesOfInactivityBeforeScreenTimeoutPcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_numberOfPasswordsToRemember",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesAustralia",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsAustralia",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesCanada",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsCanada",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesFrance",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsFrance",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesGermany",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsGermany",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesIreland",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsIreland",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesJapan",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsJapan",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesNewZealand",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsNewZealand",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesUnitedKingdom",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsUnitedKingdom",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingMoviesUnitedStates",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingTVShowsUnitedStates",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_ratingApps",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingCountryOrRegion",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_networkUsageRuleList",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_kioskModeRequireZoomPcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_passcodeMinimumLengthPcl",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_autonomousSingleAppModeWrapper",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_visibileAppListWrapper",
        "deviceConfiguration--iOSGeneralDeviceConfiguration_compliantAppsListWrapper"
    ],
    "constraints": [],
    "dependencies": []
}