{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsAllowAccessFromNetwork",
    "valueType": "complex",
    "displayName": "User rights allow access from network",
    "isTopLevel": true,
    "description": "This user right determines which users and groups are allowed to connect to the computer over the network. Remote Desktop Services are not affected by this user right.Note: Remote Desktop Services was called Terminal Services in previous versions of Windows Server.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067313",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementUserRightsSetting_state",
        "deviceConfiguration--deviceManagementUserRightsSetting_localUsersOrGroups"
    ],
    "constraints": [],
    "dependencies": []
}