{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSKerberosSingleSignOnExtension_domainRealms",
    "valueType": "collection",
    "displayName": "Domain realm mapping",
    "isTopLevel": false,
    "description": "Create a custom domain-realm mapping for Kerberos. This is used when the DNS names of hosts do not match the realm name. Most administrators do not need to customize this.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSKerberosSingleSignOnExtension_domainRealms_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": null,
            "maximumLength": 500
        }
    ],
    "dependencies": []
}