{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSExpeditedCheckinConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSExpeditedCheckinConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSExpeditedCheckinConfiguration_enableExpeditedCheckin",
        "deviceConfiguration--iOSExpeditedCheckinConfiguration_assignmentProgress",
        "deviceConfiguration--iOSExpeditedCheckinConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSExpeditedCheckinConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--iOSExpeditedCheckinConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSExpeditedCheckinConfiguration_scenarioType"
    ],
    "constraints": [],
    "dependencies": []
}