{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSSingleSignOnSettings_allowedUrls",
    "valueType": "collection",
    "displayName": "URL prefixes",
    "isTopLevel": false,
    "description": "The list of URL prefixes that must be matched in order to use this account for Kerberos authentication over HTTP. The URL must begin with either http:// or https://.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSSingleSignOnSettings_allowedUrls_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": null,
            "maximumLength": 1000
        }
    ],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--iOSSingleSignOnSettings_kerberosPrincipalName",
            "constraints": []
        }
    ]
}