{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSSingleSignOnSettings",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSSingleSignOnSettings_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSSingleSignOnSettings_displayName",
        "deviceConfiguration--iOSSingleSignOnSettings_kerberosPrincipalName",
        "deviceConfiguration--iOSSingleSignOnSettings_kerberosRealm",
        "deviceConfiguration--iOSSingleSignOnSettings_allowedUrls",
        "deviceConfiguration--iOSSingleSignOnSettings_allowedAppsList"
    ],
    "constraints": [],
    "dependencies": []
}