{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsDeliveryOptimizationConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsDeliveryOptimizationConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_minimumRamAllowedToPeerInGigabytes",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_cacheServerBackgroundDownloadFallbackToHttpDelayInSeconds",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_bandwidthMode",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_cacheServerHostNames",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_modifyCacheLocation",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_deliveryOptimizationMode",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_minimumDiskSizeAllowedToPeerInGigabytes",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_groupIdSource",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_vpnPeerCaching",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_foregroundDownloadFromHttpDelayInSeconds",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_minimumFileSizeToCacheInMegabytes",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_maximumCacheAgeInDays",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_restrictPeerSelectionBy",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_cacheServerForegroundDownloadFallbackToHttpDelayInSeconds",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_maximumCacheSize",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_minimumBatteryPercentageAllowedToUpload",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_backgroundDownloadFromHttpDelayInSeconds",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_scenarioType",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_assignmentProgress",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}