{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_startMenuAppListVisibility",
    "valueType": "collection",
    "displayName": "Hide app list",
    "isTopLevel": true,
    "description": "Setting the value of this collapses the app list, removes the app list entirely, or disables the corresponding toggle in the Settings app.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_startMenuAppListVisibility_element",
    "constraints": [],
    "dependencies": []
}