{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows81GeneralConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows81GeneralConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81GeneralConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows81GeneralConfiguration_updatesRequireAutomaticUpdates",
        "deviceConfiguration--windows81GeneralConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--windows81GeneralConfiguration_browserIntranetSecurityLevel",
        "deviceConfiguration--windows81GeneralConfiguration_cellularBlockDataRoaming",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockPlugins",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockEnterpriseModeAccess",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockPopups",
        "deviceConfiguration--windows81GeneralConfiguration_passwordRequiredType",
        "deviceConfiguration--windows81GeneralConfiguration_applyToWindows10",
        "deviceConfiguration--windows81GeneralConfiguration_passwordBlockPicturePasswordAndPin",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockSendingDoNotTrackHeader",
        "deviceConfiguration--windows81GeneralConfiguration_userAccountControlSettings",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockAutomaticDetectionOfIntranetSites",
        "deviceConfiguration--windows81GeneralConfiguration_passwordExpirationDays",
        "deviceConfiguration--windows81GeneralConfiguration_workFoldersUrl",
        "deviceConfiguration--windows81GeneralConfiguration_minimumAutoInstallClassification",
        "deviceConfiguration--windows81GeneralConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows81GeneralConfiguration_browserInternetSecurityLevel",
        "deviceConfiguration--windows81GeneralConfiguration_browserRequireHighSecurityForRestrictedSites",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockJavaScript",
        "deviceConfiguration--windows81GeneralConfiguration_browserLoggingReportLocation",
        "deviceConfiguration--windows81GeneralConfiguration_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--windows81GeneralConfiguration_browserRequireFraudWarning",
        "deviceConfiguration--windows81GeneralConfiguration_passwordMinimumLength",
        "deviceConfiguration--windows81GeneralConfiguration_storageRequireDeviceEncryption",
        "deviceConfiguration--windows81GeneralConfiguration_applyOnlyToWindows81",
        "deviceConfiguration--windows81GeneralConfiguration_accountsBlockAddingNonMicrosoftAccountEmail",
        "deviceConfiguration--windows81GeneralConfiguration_browserRequireFirewall",
        "deviceConfiguration--windows81GeneralConfiguration_browserEnterpriseModeSiteListLocation",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockAutofill",
        "deviceConfiguration--windows81GeneralConfiguration_passwordMinimumCharacterSetCount",
        "deviceConfiguration--windows81GeneralConfiguration_updatesMinimumAutoInstallClassification",
        "deviceConfiguration--windows81GeneralConfiguration_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--windows81GeneralConfiguration_browserRequireSmartScreen",
        "deviceConfiguration--windows81GeneralConfiguration_browserBlockSingleWordEntryOnIntranetSites",
        "deviceConfiguration--windows81GeneralConfiguration_browserTrustedSitesSecurityLevel",
        "deviceConfiguration--windows81GeneralConfiguration_diagnosticsBlockDataSubmission",
        "deviceConfiguration--windows81GeneralConfiguration_scenarioType",
        "deviceConfiguration--windows81GeneralConfiguration_assignmentProgress",
        "deviceConfiguration--windows81GeneralConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}