{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--specifiedCaptiveNetworkPlugins_allowedBundleIdentifiers",
    "valueType": "collection",
    "displayName": "LOC NEEDED: deviceConfiguration__specifiedCaptiveNetworkPlugins_allowedBundleIdentifiers_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--specifiedCaptiveNetworkPlugins_allowedBundleIdentifiers_element",
    "constraints": [],
    "dependencies": []
}