{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkNineWorkEasConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkNineWorkEasConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_requireSsl",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_syncCalendar",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_syncContacts",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_emailAddressSource",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_identityCertificate",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_syncTasks",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_usernameSource",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_durationOfEmailToSync",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_authenticationMethod",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_hostName",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_assignmentProgress",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}