{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSPkcsCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSPkcsCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSPkcsCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--macOSPkcsCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--macOSPkcsCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--macOSPkcsCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--macOSPkcsCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSPkcsCertificateProfile_certificateStore",
        "deviceConfiguration--macOSPkcsCertificateProfile_certificateTemplateName",
        "deviceConfiguration--macOSPkcsCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--macOSPkcsCertificateProfile_allowAllAppsAccess",
        "deviceConfiguration--macOSPkcsCertificateProfile_subjectNameFormat",
        "deviceConfiguration--macOSPkcsCertificateProfile_certificationAuthorityName",
        "deviceConfiguration--macOSPkcsCertificateProfile_certificationAuthority",
        "deviceConfiguration--macOSPkcsCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSPkcsCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--macOSPkcsCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--macOSPkcsCertificateProfile_assignmentProgress",
        "deviceConfiguration--macOSPkcsCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}