{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--redirectSingleSignOnExtension",
    "valueType": "complex",
    "displayName": "Redirect single sign-on extension",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--redirectSingleSignOnExtension_extensionIdentifier",
        "deviceConfiguration--redirectSingleSignOnExtension_teamIdentifier",
        "deviceConfiguration--redirectSingleSignOnExtension_configurations",
        "deviceConfiguration--redirectSingleSignOnExtension_urlPrefixes"
    ],
    "constraints": [],
    "dependencies": []
}