{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--deliveryOptimizationMaxCacheSize",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__deliveryOptimizationMaxCacheSize_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--deliveryOptimizationMaxCacheSizeAbsolute",
        "deviceConfiguration--deliveryOptimizationMaxCacheSizePercentage"
    ],
    "constraints": [],
    "dependencies": []
}