{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSIKEv2VpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSIKEv2VpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSIKEv2VpnConfiguration_proxyServer",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_customKeyValueData",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_allowDefaultSecurityAssociationParameters",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_connectionName",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_allowDefaultChildSecurityAssociationParameters",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_localIdentifier",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_strictEnforcement",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_remoteIdentifier",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_derivedCredentialSettings",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_excludeList",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_userDomain",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_realm",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_clientAuthenticationType",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_role",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_enableEAP",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_cloudName",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_loginGroupOrDomain",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_authenticationMethod",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_disableMobilityAndMultihoming",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_enableUseInternalSubnetAttributes",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_securityAssociationParameters",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_serverCertificateIssuerCommonName",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_sharedSecret",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_childSecurityAssociationParameters",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_enableCertificateRevocationCheck",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_providerType",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_onDemandRules",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_serverCertificateType",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_customData",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_server",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_safariDomains",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_disableRedirect",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_serverCertificateCommonName",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_sharedSecretSet",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_deadPeerDetectionRate",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_connectionType",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_enablePerApp",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_enablePerfectForwardSecrecy",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_identifier",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_optInToDeviceIdSharing",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_identityCertificate",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_alwaysOnConfiguration",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_enableAlwaysOnConfiguration",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_tlsMaximumVersion",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_tlsMinimumVersion",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_optInToDeviceIdSharingInternal",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_assignmentProgress",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--iOSIKEv2VpnConfiguration_targetedMobileAppIds"
    ],
    "constraints": [],
    "dependencies": []
}