{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSIKEv2VpnConfiguration_childSecurityAssociationParameters",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSIKEv2VpnConfiguration_childSecurityAssociationParameters_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_securityDiffieHellmanGroup",
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_lifetimeInMinutes",
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_securityIntegrityAlgorithm",
        "deviceConfiguration--iOSVpnSecurityAssociationParameters_securityEncryptionAlgorithm"
    ],
    "constraints": [],
    "dependencies": []
}