{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsUpdateScheduledInstall",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsUpdateScheduledInstall_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsUpdateScheduledInstall_restartMode",
        "deviceConfiguration--windowsUpdateScheduledInstall_scheduledInstallTime",
        "deviceConfiguration--windowsUpdateScheduledInstall_scheduledInstallDay"
    ],
    "constraints": [],
    "dependencies": []
}