{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_allowHardwareDeviceInstallationByDeviceInstanceIdentifiers",
    "valueType": "abstractComplex",
    "displayName": "Allow hardware device installation by device instance identifiers",
    "isTopLevel": true,
    "description": "If you enable this policy setting, Windows is allowed to install or update any device whose Plug and Play device instance ID appears in the list you create, unless another policy setting specifically prevents that installation. If you enable this policy setting on a remote desktop server, the policy setting affects redirection of the specified devices from a remote desktop client to the remote desktop server.",
    "placeholderText": null,
    "documentationUrl": "",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--hardwareDeviceInstallationAllowed",
        "deviceConfiguration--allowDeviceInstallation"
    ],
    "constraints": [],
    "dependencies": []
}