{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iPv4Range",
    "valueType": "complex",
    "displayName": "IPv4 range",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iPv4Range_lowerAddress",
        "deviceConfiguration--iPv4Range_upperAddress"
    ],
    "constraints": [],
    "dependencies": []
}