{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--omaSettingFloatingPoint",
    "valueType": "complex",
    "displayName": "Floating Point",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--omaSettingFloatingPoint_displayName",
        "deviceConfiguration--omaSettingFloatingPoint_description",
        "deviceConfiguration--omaSettingFloatingPoint_omaUri",
        "deviceConfiguration--omaSettingFloatingPoint_value"
    ],
    "constraints": [],
    "dependencies": []
}