{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows81SCEPCertificateProfile",
    "valueType": "complex",
    "displayName": "windows81SCEPCertificateProfile",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81SCEPCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--windows81SCEPCertificateProfile_rootCertificate",
        "deviceConfiguration--windows81SCEPCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--windows81SCEPCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--windows81SCEPCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows81SCEPCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows81SCEPCertificateProfile_subjectNameFormat",
        "deviceConfiguration--windows81SCEPCertificateProfile_hashAlgorithm",
        "deviceConfiguration--windows81SCEPCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--windows81SCEPCertificateProfile_scepServerUrls",
        "deviceConfiguration--windows81SCEPCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--windows81SCEPCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--windows81SCEPCertificateProfile_keyStorageProvider",
        "deviceConfiguration--windows81SCEPCertificateProfile_keySize",
        "deviceConfiguration--windows81SCEPCertificateProfile_certificateStore",
        "deviceConfiguration--windows81SCEPCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--windows81SCEPCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--windows81SCEPCertificateProfile_keyUsage",
        "deviceConfiguration--windows81SCEPCertificateProfile_assignmentProgress",
        "deviceConfiguration--windows81SCEPCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}