{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSKerberosSingleSignOnExtension",
    "valueType": "complex",
    "displayName": "Kerberos",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_realm",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_domains",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_blockAutomaticLogin",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_requireUserPresence",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_isDefaultRealm",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_blockActiveDirectorySiteAutoDiscovery",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordBlockModification",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordEnableLocalSync",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordRequireActiveDirectoryComplexity",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordMinimumLength",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordMinimumAgeDays",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordExpirationNotificationDays",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordExpirationDays",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordChangeUrl",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_userPrincipalName",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_activeDirectorySiteCode",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_cacheName",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_passwordRequirementsDescription",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_credentialBundleIdAccessControlList",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension_domainRealms"
    ],
    "constraints": [],
    "dependencies": []
}