{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSWebContentFilterAutoFilter",
    "valueType": "complex",
    "displayName": "Configure URLs",
    "isTopLevel": false,
    "description": "Use Apple’s built in AutoFilter algorithm that looks for adult language, i.e. swearing and sexually explicit language. This function evaluates each web page as it is loaded and attempts to identify and block content not suitable for children. If you have specific URLs that need to bypass Apple’s filtering algorithm, add them to Permitted URLs list. If you have specific URLs that need to be blocked regardless of Apple’s AutoFilter, add them to the Blocked URLs list.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSWebContentFilterAutoFilter_allowedUrls",
        "deviceConfiguration--iOSWebContentFilterAutoFilter_blockedUrls"
    ],
    "constraints": [],
    "dependencies": []
}