{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidGeneralDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidGeneralDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidGeneralDeviceConfiguration_deviceSharingBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidGeneralDeviceConfiguration_kioskModeManagedAppId",
        "deviceConfiguration--androidGeneralDeviceConfiguration_storageRequireRemovableStorageEncryption",
        "deviceConfiguration--androidGeneralDeviceConfiguration_compliantAppsList",
        "deviceConfiguration--androidGeneralDeviceConfiguration_webBrowserAllowPopups",
        "deviceConfiguration--androidGeneralDeviceConfiguration_storageBlockRemovableStorage",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordRequiredType",
        "deviceConfiguration--androidGeneralDeviceConfiguration_screenCaptureBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_voiceAssistantBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsComplianceListType",
        "deviceConfiguration--androidGeneralDeviceConfiguration_cellularBlockMessaging",
        "deviceConfiguration--androidGeneralDeviceConfiguration_diagnosticDataBlockSubmission",
        "deviceConfiguration--androidGeneralDeviceConfiguration_dateAndTimeBlockChanges",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsComplianceList",
        "deviceConfiguration--androidGeneralDeviceConfiguration_deviceSharingAllowed",
        "deviceConfiguration--androidGeneralDeviceConfiguration_compliantAppListType",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsBlockCopyPaste",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsBlockYouTube",
        "deviceConfiguration--androidGeneralDeviceConfiguration_storageBlockGoogleBackup",
        "deviceConfiguration--androidGeneralDeviceConfiguration_wiFiBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_securityRequireVerifyApps",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordBlockTrustAgents",
        "deviceConfiguration--androidGeneralDeviceConfiguration_googleAccountBlockAutoSync",
        "deviceConfiguration--androidGeneralDeviceConfiguration_powerOffBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_cellularBlockVoiceRoaming",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsInstallAllowList",
        "deviceConfiguration--androidGeneralDeviceConfiguration_webBrowserBlockAutofill",
        "deviceConfiguration--androidGeneralDeviceConfiguration_requireAppVerify",
        "deviceConfiguration--androidGeneralDeviceConfiguration_googlePlayStoreBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_kioskModeApps",
        "deviceConfiguration--androidGeneralDeviceConfiguration_kioskModeManagedApps",
        "deviceConfiguration--androidGeneralDeviceConfiguration_cellularBlockWiFiTethering",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--androidGeneralDeviceConfiguration_webBrowserBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_storageRequireDeviceEncryption",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordRequired",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordMinimumLength",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordBlockFingerprintUnlock",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsBlockClipboardSharing",
        "deviceConfiguration--androidGeneralDeviceConfiguration_webBrowserBlockJavaScript",
        "deviceConfiguration--androidGeneralDeviceConfiguration_passwordExpirationDays",
        "deviceConfiguration--androidGeneralDeviceConfiguration_cellularBlockDataRoaming",
        "deviceConfiguration--androidGeneralDeviceConfiguration_cameraBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_voiceDialingBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_bluetoothBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_factoryResetBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_kioskModeBlockVolumeButtons",
        "deviceConfiguration--androidGeneralDeviceConfiguration_kioskModeBlockSleepButton",
        "deviceConfiguration--androidGeneralDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidGeneralDeviceConfiguration_nfcBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_webBrowserCookieSettings",
        "deviceConfiguration--androidGeneralDeviceConfiguration_locationServicesBlocked",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsLaunchBlockList",
        "deviceConfiguration--androidGeneralDeviceConfiguration_webBrowserBlockPopups",
        "deviceConfiguration--androidGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidGeneralDeviceConfiguration_appsHideList",
        "deviceConfiguration--androidGeneralDeviceConfiguration_scenarioType",
        "deviceConfiguration--androidGeneralDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--androidGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}