{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--omaSetting",
    "valueType": "abstractComplex",
    "displayName": "OMA-URI Setting",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--omaSettingBase64",
        "deviceConfiguration--omaSettingBoolean",
        "deviceConfiguration--omaSettingStringXml",
        "deviceConfiguration--omaSettingDateTime",
        "deviceConfiguration--omaSettingString",
        "deviceConfiguration--omaSettingFloatingPoint",
        "deviceConfiguration--omaSettingInteger"
    ],
    "constraints": [],
    "dependencies": []
}