{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEasEmailProfileConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSEasEmailProfileConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSEasEmailProfileConfiguration_identityCertificate",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_sMIMEEnablePerMessageSwitch",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_useOAuth",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptByDefaultEnabled",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_authenticationMethod",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_emailAddressSource",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_hostName",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_accountName",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_blockSendingEmailFromThirdPartyApps",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_encryptionCertificateType",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_signingCertificateType",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_blockSyncingRecentlyUsedEmailAddresses",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptionCertificate",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeSigningEnabled",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_derivedCredentialSettings",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_blockMovingMessagesToOtherEmailAccounts",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeSigningCertificate",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptByDefaultUserOverrideEnabled",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_customDomainName",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_userDomainNameSource",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_durationOfEmailToSync",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_usernameAADSource",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeSigningUserOverrideEnabled",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptionCertificateUserOverrideEnabled",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_requireSsl",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_usernameSource",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeSigningCertificateUserOverrideEnabled",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_requireSmime",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_easServices",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_easServicesUserOverrideEnabled",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptByDefaultEnabledPCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeSigningEnabledPCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeSigningUserOverrideEnabledPCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptByDefaultUserOverrideEnabledPCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeSigningCertificateUserOverrideEnabledPCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptionCertificateUserOverrideEnabledPCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimePerMessageSwitchPCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_smimePerMessageSwitchiOS12PCL",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_assignmentProgress",
        "deviceConfiguration--iOSEasEmailProfileConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}