{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--sharedPCConfiguration_allowedAccounts",
    "valueType": "collection",
    "displayName": "Guest account",
    "isTopLevel": true,
    "description": "Create a Guest option on the sign-in screen. Requires no user credentials or authentication, and creates a new local account each time it is used.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--sharedPCConfiguration_allowedAccounts_element",
    "constraints": [],
    "dependencies": []
}