{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--deviceManagementUserRightsSetting_localUsersOrGroups",
    "valueType": "collection",
    "displayName": "Local users or groups",
    "isTopLevel": false,
    "description": "Local users or groups",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--deviceManagementUserRightsLocalUserOrGroup",
    "constraints": [],
    "dependencies": []
}