{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--redirectSingleSignOnExtension_configurations",
    "valueType": "collection",
    "displayName": "Additional configuration",
    "isTopLevel": false,
    "description": "Additional extension-specific data to pass to the app extension.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--keyTypedValuePair",
    "constraints": [],
    "dependencies": []
}