{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingNewZealand",
    "valueType": "complex",
    "displayName": "Ratings region - New Zealand",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--mediaContentRatingNewZealand_tVRating",
        "deviceConfiguration--mediaContentRatingNewZealand_movieRating"
    ],
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--iOSGeneralDeviceConfiguration_mediaContentRatingCountryOrRegion",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
                    "values": [
                        {
                            "value": "nz",
                            "displayName": null
                        }
                    ]
                }
            ]
        }
    ]
}