{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--deliveryOptimizationBandwidth",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__deliveryOptimizationBandwidth_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--deliveryOptimizationBandwidthAbsolute",
        "deviceConfiguration--deliveryOptimizationBandwidthPercentage",
        "deviceConfiguration--deliveryOptimizationBandwidthHoursWithPercentage"
    ],
    "constraints": [],
    "dependencies": []
}