{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSRedirectSingleSignOnExtension_urlPrefixes",
    "valueType": "collection",
    "displayName": "URLs",
    "isTopLevel": false,
    "description": "The URLs where your identity provider can be reached. When a user is redirected to these URLs, the SSO app extension will intervene and prompt SSO. Each URL must be unique and can’t already exist in another profile. Must use HTTP or HTTPS protocols.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSRedirectSingleSignOnExtension_urlPrefixes_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": 1,
            "maximumLength": 500
        }
    ],
    "dependencies": []
}