{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--deviceConfiguration",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__deviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration",
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile",
        "deviceConfiguration--androidDeviceOwnerTrustedRootCertificate",
        "deviceConfiguration--androidDeviceOwnerVpnConfiguration",
        "deviceConfiguration--androidDeviceOwnerWiFiConfiguration",
        "deviceConfiguration--androidDeviceOwnerDerivedCredentialAuthenticationConfiguration",
        "deviceConfiguration--androidCustomConfiguration",
        "deviceConfiguration--androidEasEmailProfileConfiguration",
        "deviceConfiguration--androidEnterpriseWiFiConfiguration",
        "deviceConfiguration--androidForWorkCustomConfiguration",
        "deviceConfiguration--androidForWorkImportedPFXCertificateProfile",
        "deviceConfiguration--androidForWorkWiFiConfiguration",
        "deviceConfiguration--androidForWorkEnterpriseWiFiConfiguration",
        "deviceConfiguration--androidForWorkGeneralDeviceConfiguration",
        "deviceConfiguration--androidForWorkVpnConfiguration",
        "deviceConfiguration--androidForWorkGmailEasConfiguration",
        "deviceConfiguration--androidForWorkNineWorkEasConfiguration",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile",
        "deviceConfiguration--androidForWorkScepCertificateProfile",
        "deviceConfiguration--androidForWorkTrustedRootCertificate",
        "deviceConfiguration--androidGeneralDeviceConfiguration",
        "deviceConfiguration--androidImportedPFXCertificateProfile",
        "deviceConfiguration--androidOmaCpConfiguration",
        "deviceConfiguration--androidPkcsCertificateProfile",
        "deviceConfiguration--androidScepCertificateProfile",
        "deviceConfiguration--androidTrustedRootCertificate",
        "deviceConfiguration--androidVpnConfiguration",
        "deviceConfiguration--androidWiFiConfiguration",
        "deviceConfiguration--androidWorkProfileCustomConfiguration",
        "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration",
        "deviceConfiguration--androidWorkProfileGmailEasConfiguration",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate",
        "deviceConfiguration--androidWorkProfileVpnConfiguration",
        "deviceConfiguration--androidWorkProfileWiFiConfiguration",
        "deviceConfiguration--iOSExpeditedCheckinConfiguration",
        "deviceConfiguration--macOSCustomAppConfiguration",
        "deviceConfiguration--macOSDeviceFeaturesConfiguration",
        "deviceConfiguration--macOSWiredNetworkConfiguration",
        "deviceConfiguration--iOSDerivedCredentialAuthenticationConfiguration",
        "deviceConfiguration--iOSCustomConfiguration",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration",
        "deviceConfiguration--iOSEasEmailProfileConfiguration",
        "deviceConfiguration--iOSEduDeviceConfiguration",
        "deviceConfiguration--iOSEducationDeviceConfiguration",
        "deviceConfiguration--iOSIKEv2VpnConfiguration",
        "deviceConfiguration--iOSImportedPFXCertificateProfile",
        "deviceConfiguration--iOSPkcsCertificateProfile",
        "deviceConfiguration--iOSScepCertificateProfile",
        "deviceConfiguration--iOSTrustedRootCertificate",
        "deviceConfiguration--iOSEnterpriseWiFiConfiguration",
        "deviceConfiguration--iOSGeneralDeviceConfiguration",
        "deviceConfiguration--iOSUpdateConfiguration",
        "deviceConfiguration--iOSVpnConfiguration",
        "deviceConfiguration--iOSWiFiConfiguration",
        "deviceConfiguration--macOSCustomConfiguration",
        "deviceConfiguration--macOSEndpointProtectionConfiguration",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration",
        "deviceConfiguration--macOSExtensionsConfiguration",
        "deviceConfiguration--macOSGeneralDeviceConfiguration",
        "deviceConfiguration--macOSImportedPFXCertificateProfile",
        "deviceConfiguration--macOSPkcsCertificateProfile",
        "deviceConfiguration--macOSScepCertificateProfile",
        "deviceConfiguration--macOSSoftwareUpdateConfiguration",
        "deviceConfiguration--macOSTrustedRootCertificate",
        "deviceConfiguration--macOSVpnConfiguration",
        "deviceConfiguration--macOSWiFiConfiguration",
        "deviceConfiguration--unsupportedDeviceConfiguration",
        "deviceConfiguration--silverlightMobileDeviceSecurity",
        "deviceConfiguration--windows10EndpointProtectionConfiguration",
        "deviceConfiguration--windows10GeneralConfiguration",
        "deviceConfiguration--windows10DeviceFirmwareConfigurationInterface",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration",
        "deviceConfiguration--editionUpgradeConfiguration",
        "deviceConfiguration--windows10NetworkBoundaryConfiguration",
        "deviceConfiguration--windows10CustomConfiguration",
        "deviceConfiguration--windowsDeliveryOptimizationConfiguration",
        "deviceConfiguration--windowsHealthMonitoringConfiguration",
        "deviceConfiguration--windowsIdentityProtectionConfiguration",
        "deviceConfiguration--windowsKioskConfiguration",
        "deviceConfiguration--windows10EasEmailProfileConfiguration",
        "deviceConfiguration--windows10PkcsCertificateProfile",
        "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration",
        "deviceConfiguration--sharedPCConfiguration",
        "deviceConfiguration--windows10ImportedPFXCertificateProfile",
        "deviceConfiguration--windows10PFXImportCertificateProfile",
        "deviceConfiguration--windows10PolicyOverrideConfiguration",
        "deviceConfiguration--windows10SecureAssessmentConfiguration",
        "deviceConfiguration--windows10VpnConfiguration",
        "deviceConfiguration--windowsWifiConfiguration",
        "deviceConfiguration--windowsWifiEnterpriseEAPConfiguration",
        "deviceConfiguration--windows81SCEPCertificateProfile",
        "deviceConfiguration--windows81VpnConfiguration",
        "deviceConfiguration--windows81WifiImportConfiguration",
        "deviceConfiguration--windowsDomainJoinConfiguration",
        "deviceConfiguration--windows81TrustedRootCertificate",
        "deviceConfiguration--windowsPhone81CustomConfiguration",
        "deviceConfiguration--windowsPhone81ImportedPFXCertificateProfile",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile",
        "deviceConfiguration--windowsPhone81TrustedRootCertificate",
        "deviceConfiguration--windowsPhone81VpnConfiguration",
        "deviceConfiguration--windowsPhoneEASEmailProfileConfiguration",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration",
        "deviceConfiguration--windows81GeneralConfiguration",
        "deviceConfiguration--windowsPhone81GeneralConfiguration",
        "deviceConfiguration--windows10TeamGeneralConfiguration"
    ],
    "constraints": [],
    "dependencies": []
}