{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSEnterpriseWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSEnterpriseWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_authenticationMethod",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_ssid",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_networkName",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_preSharedKeySet",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_proxySettings",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_proxyManualPort",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_innerAuthenticationProtocolForEapTtls",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_proxyManualAddress",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_proxyAutomaticConfigurationUrl",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_preSharedKey",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_nonEapAuthenticationMethodForEapTtls",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_enableOuterIdentityPrivacy",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_outerIdentityPrivacyTemporaryValue",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_trustedServerCertificateNames",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_eapFastConfiguration",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_eapType",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_rootCertificateForServerValidation",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--macOSEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}