{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEducationDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSEducationDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSEducationDeviceConfiguration_teacherIdentityCertificate",
        "deviceConfiguration--iOSEducationDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSEducationDeviceConfiguration_studentIdentityCertificate",
        "deviceConfiguration--iOSEducationDeviceConfiguration_studentRootCertificates",
        "deviceConfiguration--iOSEducationDeviceConfiguration_teacherRootCertificates",
        "deviceConfiguration--iOSEducationDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSEducationDeviceConfiguration_scenarioType",
        "deviceConfiguration--iOSEducationDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--iOSEducationDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}