{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidScepCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidScepCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidScepCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidScepCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidScepCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidScepCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidScepCertificateProfile_scepServerUrls",
        "deviceConfiguration--androidScepCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidScepCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--androidScepCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidScepCertificateProfile_hashAlgorithm",
        "deviceConfiguration--androidScepCertificateProfile_rootCertificate",
        "deviceConfiguration--androidScepCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidScepCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidScepCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidScepCertificateProfile_keySize",
        "deviceConfiguration--androidScepCertificateProfile_keyUsage",
        "deviceConfiguration--androidScepCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidScepCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}