{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSDeviceFeaturesConfiguration_wallpaperImage",
    "valueType": "complex",
    "displayName": "Wallpaper image",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--mimeContent_type",
        "deviceConfiguration--mimeContent_value"
    ],
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}