{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskAzureADGroup",
    "valueType": "complex",
    "displayName": "AAD Group",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskAzureADGroup_displayName",
        "deviceConfiguration--windowsKioskAzureADGroup_groupId"
    ],
    "constraints": [],
    "dependencies": []
}