{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSHomeScreenFolder",
    "valueType": "complex",
    "displayName": "Folder",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSHomeScreenFolder_pages",
        "deviceConfiguration--iOSHomeScreenFolder_displayName"
    ],
    "constraints": [],
    "dependencies": []
}