{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidPkcsCertificateProfile_rootCertificate",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidPkcsCertificateProfile_rootCertificate_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidTrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--androidTrustedRootCertificate_certFileName",
        "deviceConfiguration--androidTrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidTrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidTrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--androidTrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}