{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSWebContentFilterSpecificWebsitesAccess_websiteList",
    "valueType": "collection",
    "displayName": "Website list",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSBookmark",
    "constraints": [],
    "dependencies": []
}