{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileNineWorkEasConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_emailAddressSource",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_syncContacts",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_hostName",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_syncTasks",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_syncCalendar",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_requireSsl",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_usernameSource",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_durationOfEmailToSync",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_authenticationMethod",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_identityCertificate",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_assignmentProgress",
        "deviceConfiguration--androidWorkProfileNineWorkEasConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}