{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSCustomAppConfiguration",
    "valueType": "complex",
    "displayName": "Preference file",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSCustomAppConfiguration_bundleId",
        "deviceConfiguration--macOSCustomAppConfiguration_fileName",
        "deviceConfiguration--macOSCustomAppConfiguration_configurationXml",
        "deviceConfiguration--macOSCustomAppConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSCustomAppConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSCustomAppConfiguration_scenarioType",
        "deviceConfiguration--macOSCustomAppConfiguration_configurationXmlPcl",
        "deviceConfiguration--macOSCustomAppConfiguration_assignmentProgress",
        "deviceConfiguration--macOSCustomAppConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}