{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--appleVpnAlwaysOnConfiguration_allowedCaptiveNetworkPlugins",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__appleVpnAlwaysOnConfiguration_allowedCaptiveNetworkPlugins_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--allCaptiveNetworkPlugins",
        "deviceConfiguration--specifiedCaptiveNetworkPlugins"
    ],
    "constraints": [],
    "dependencies": []
}