{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_defenderDetectedMalwareActions",
    "valueType": "complex",
    "displayName": "Actions for detected threats",
    "isTopLevel": true,
    "description": "Allow to specify any valid threat severity levels and the corresponding default action to take. Only enforced on desktop devices running Windows 10 and later.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2113938&clcid=0x409",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--defenderDetectedMalwareActions_lowSeverity",
        "deviceConfiguration--defenderDetectedMalwareActions_moderateSeverity",
        "deviceConfiguration--defenderDetectedMalwareActions_highSeverity",
        "deviceConfiguration--defenderDetectedMalwareActions_severeSeverity"
    ],
    "constraints": [],
    "dependencies": []
}