{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows81VpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows81VpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81VpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows81VpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--windows81VpnConfiguration_connectionType",
        "deviceConfiguration--windows81VpnConfiguration_applyOnlyToWindows81",
        "deviceConfiguration--windows81VpnConfiguration_servers",
        "deviceConfiguration--windows81VpnConfiguration_loginGroupOrDomain",
        "deviceConfiguration--windows81VpnConfiguration_connectionName",
        "deviceConfiguration--windows81VpnConfiguration_routes",
        "deviceConfiguration--windows81VpnConfiguration_proxyServer",
        "deviceConfiguration--windows81VpnConfiguration_customXml",
        "deviceConfiguration--windows81VpnConfiguration_applyAllConfigurationsToWindows10",
        "deviceConfiguration--windows81VpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows81VpnConfiguration_assignmentProgress",
        "deviceConfiguration--windows81VpnConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}