{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidOmaCpConfiguration_deviceManagementApplicabilityRuleOsVersion",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidOmaCpConfiguration_deviceManagementApplicabilityRuleOsVersion_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementApplicabilityRuleOsVersion_minOSVersion",
        "deviceConfiguration--deviceManagementApplicabilityRuleOsVersion_maxOSVersion",
        "deviceConfiguration--deviceManagementApplicabilityRuleOsVersion_name",
        "deviceConfiguration--deviceManagementApplicabilityRuleOsVersion_ruleType"
    ],
    "constraints": [],
    "dependencies": []
}