{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProcessesToExclude",
    "valueType": "collection",
    "displayName": "Defender Processes to exclude",
    "isTopLevel": true,
    "description": "Specify a list of files opened by processes to ignore during a scan. The process itself is not excluded from the scan, but can be by using the Defender/ExcludedPaths policy to exclude its path.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProcessesToExclude_element",
    "constraints": [],
    "dependencies": []
}