{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidGeneralDeviceConfiguration_kioskModeManagedApps",
    "valueType": "collection",
    "displayName": "Kiosk mode managed apps",
    "isTopLevel": true,
    "description": "Kiosk mode managed apps",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [],
    "dependencies": []
}