{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration_singleSignOnEku",
    "valueType": "complex",
    "displayName": "Extended key usage",
    "isTopLevel": true,
    "description": "Single sign on eku",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--extendedKeyUsage_name",
        "deviceConfiguration--extendedKeyUsage_objectIdentifier"
    ],
    "constraints": [],
    "dependencies": []
}