{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--customUpdateTimeWindow",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__customUpdateTimeWindow_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--customUpdateTimeWindow_startDay",
        "deviceConfiguration--customUpdateTimeWindow_startTime",
        "deviceConfiguration--customUpdateTimeWindow_endDay",
        "deviceConfiguration--customUpdateTimeWindow_endTime"
    ],
    "constraints": [],
    "dependencies": []
}