{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81VpnConfiguration_dnsSuffixSearchList",
    "valueType": "collection",
    "displayName": "DNS suffix search list",
    "isTopLevel": true,
    "description": "DNS suffix search list",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsPhone81VpnConfiguration_dnsSuffixSearchList_element",
    "constraints": [],
    "dependencies": []
}