{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_displayAppListWithGdiDPIScalingTurnedOff",
    "valueType": "collection",
    "displayName": "Turn off GDI scaling for apps.",
    "isTopLevel": true,
    "description": "GDI DPI Scaling lets apps that are not DPI aware to become per-monitor DPI aware. Specify the legacy apps that will have GDI DPI Scaling turned off. With GDI DPI Scaling configured to both turn on and turn off on an app, scaling is turned off for the app.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_displayAppListWithGdiDPIScalingTurnedOff_element",
    "constraints": [],
    "dependencies": []
}