{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidVpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidVpnConfiguration_deviceManagementApplicabilityRuleOsEdition_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementApplicabilityRuleOsEdition_ruleType",
        "deviceConfiguration--deviceManagementApplicabilityRuleOsEdition_osEditionTypes",
        "deviceConfiguration--deviceManagementApplicabilityRuleOsEdition_name"
    ],
    "constraints": [],
    "dependencies": []
}