{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsKioskConfiguration_kioskBrowserBlockedUrlExceptions",
    "valueType": "collection",
    "displayName": "Website exceptions",
    "isTopLevel": true,
    "description": "Specify URLs that kiosk browsers are allowed to navigate to. If a URL is in both the Blocked website list as well as the Blocked website exception list, the exception will take effect.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsKioskConfiguration_kioskBrowserBlockedUrlExceptions_element",
    "constraints": [],
    "dependencies": []
}