{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidGeneralDeviceConfiguration_appsInstallAllowList",
    "valueType": "collection",
    "displayName": "Apps allowed to be installed (Samsung KNOX Standard only)",
    "isTopLevel": true,
    "description": "Specify the apps that users can install. Users will not be able to install apps that are not on the list.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingAppConstraint",
            "supportedTypes": [
                "androidLobApp",
                "androidStoreApp",
                "managedAndroidStoreApp",
                "managedAndroidLobApp"
            ]
        }
    ],
    "dependencies": []
}