{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileGeneralDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockNotificationsWhileDeviceLocked",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinimumLength",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileDataSharingType",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordBlockFingerprintUnlock",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinNonLetterCharacters",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileDefaultAppPermissionPolicy",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_requireAppVerify",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBluetoothEnableContactSharing",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockCrossProfileCopyPaste",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordMinimumLength",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockCamera",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordRequiredType",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordBlockTrustAgents",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileRequirePassword",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockAddingAccounts",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinLetterCharacters",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockCrossProfileCallerId",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinLowerCaseCharacters",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_vpnAlwaysOnPackageIdentifier",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_securityRequireVerifyApps",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordBlockFingerprintUnlock",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinSymbolCharacters",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_blockCrossProfileCopyPaste",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockScreenCapture",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileAllowWidgets",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordBlockTrustAgents",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordPreviousPasswordBlockCount",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordRequiredType",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_passwordExpirationDays",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordExpirationDays",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinNumericCharacters",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_vpnEnableAlwaysOnLockdownMode",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfilePasswordMinUpperCaseCharacters",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockCrossProfileContactsSearch",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_workProfileBlockPersonalAppInstallsFromUnknownSources",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_scenarioType",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_vpnAlwaysOnPackageType",
        "deviceConfiguration--androidWorkProfileGeneralDeviceConfiguration_vpnAlwaysOnPackageIdentifierForCustom"
    ],
    "constraints": [],
    "dependencies": []
}