{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--unsupportedDeviceConfiguration_details",
    "valueType": "collection",
    "displayName": "Details",
    "isTopLevel": true,
    "description": "Details",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--unsupportedDeviceConfigurationDetail",
    "constraints": [],
    "dependencies": []
}