{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--airPrintDestination",
    "valueType": "complex",
    "displayName": "AirPrint Destination",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--airPrintDestination_port",
        "deviceConfiguration--airPrintDestination_iPAddress",
        "deviceConfiguration--airPrintDestination_resourcePath",
        "deviceConfiguration--airPrintDestination_forceTls"
    ],
    "constraints": [],
    "dependencies": []
}