{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionExcludedExtensions",
    "valueType": "collection",
    "displayName": "File types excluded from scan",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionExcludedExtensions_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": null,
            "maximumLength": 500
        }
    ],
    "dependencies": []
}