{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--credentialSingleSignOnExtension",
    "valueType": "complex",
    "displayName": "Credential",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--credentialSingleSignOnExtension_teamIdentifier",
        "deviceConfiguration--credentialSingleSignOnExtension_realm",
        "deviceConfiguration--credentialSingleSignOnExtension_domains",
        "deviceConfiguration--credentialSingleSignOnExtension_configurations",
        "deviceConfiguration--credentialSingleSignOnExtension_extensionIdentifier"
    ],
    "constraints": [],
    "dependencies": []
}