{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerGeneralDeviceConfiguration_DisplayName",
    "isTopLevel": true,
    "description": "Global proxy type",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_usersBlockAdd",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordSignInFailureCountBeforeFactoryReset",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_systemUpdateWindowEndMinutesAfterMidnight",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_storageAllowUsb",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_appsAllowInstallFromUnknownSources",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordRequiredType",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeVirtualHomeButtonType",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_cellularBlockWiFiTethering",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordExpirationDays",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_storageBlockExternalMedia",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_factoryResetDeviceAdministratorEmails",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_vpnAlwaysOnLockdownMode",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_stayOnModes",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_safeBootBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_volumeBlockAdjustment",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinimumLetterCharacters",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeScreenSaverDetectMediaDisabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_securityAllowDebuggingFeatures",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_vpnAlwaysOnPackageIdentifier",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_systemWindowsBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_appsAutoUpdatePolicy",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_bluetoothBlockContactSharing",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_dateTimeConfigurationBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_dataRoamingBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinimumLength",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeVirtualHomeButtonEnabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_usersBlockRemove",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordBlockKeyguard",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_securityRequireVerifyApps",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinimumUpperCaseCharacters",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_cameraBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_wifiBlockEditConfigurations",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeScreenSaverDisplayTimeInSeconds",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_wifiBlockEditPolicyDefinedConfigurations",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinimumNumericCharacters",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeWiFiConfigurationEnabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_storageBlockUsbFileTransfer",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeScreenSaverStartDelayInSeconds",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinimumNonLetterCharacters",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_screenCaptureBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_microphoneForceMute",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_accountsBlockModification",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_factoryResetBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_nfcBlockOutgoingBeam",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_bluetoothBlockConfiguration",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeMediaVolumeConfigurationEnabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_networkEscapeHatchAllowed",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeScreenSaverImageUrl",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_appsDefaultPermissionPolicy",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_appsRecommendSkippingFirstUseHints",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeWallpaperUrl",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_statusBarBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordPreviousPasswordCountToBlock",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeApps",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinimumSymbolCharacters",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_playStoreMode",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_systemUpdateWindowStartMinutesAfterMidnight",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_systemUpdateInstallType",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinimumLowerCaseCharacters",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeBluetoothConfigurationEnabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeExitCode",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeScreenSaverConfigurationEnabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeFlashlightConfigurationEnabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordBlockKeyguardFeatures",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_passwordMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_certificateCredentialConfigurationDisabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_globalProxy",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_googleAccountsBlocked",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_customPassword",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_customPasswordIsSet",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_scenarioType",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeUseMangedHomeScreenApp",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_vpnAlwaysOnPackageType",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskModeSingleApp",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_kioskMultiAppsModeApps",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_vpnAlwaysOnPackageIdentifierForCustom",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_microsoftLauncherConfigurationEnabled",
        "deviceConfiguration--androidDeviceOwnerGeneralDeviceConfiguration_enrollmentProfile"
    ],
    "constraints": [],
    "dependencies": []
}