{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSHomeScreenFolder_pages",
    "valueType": "collection",
    "displayName": "List of pages",
    "isTopLevel": false,
    "description": "Add the apps you want to appear on this folder page. Apps selected will be laid out on the folder page on end user’s iOS device, from left to right, in the order they are given below. Any number of apps greater than the page can display on a single page will be moved to a subsequent pages. Click and drag items to reorder them.\r\n\r\n60 items maximum allowed.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSHomeScreenFolderPage",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": 1,
            "maximumLength": 20
        }
    ],
    "dependencies": []
}