{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81SCEPCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsPhone81SCEPCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_subjectNameFormat",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_hashAlgorithm",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_keyUsage",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_keyStorageProvider",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_scepServerUrls",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_keySize",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_rootCertificate",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_assignmentProgress",
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}