{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfilePkcsCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfilePkcsCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_certificateTemplateName",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_certificationAuthority",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_certificateStore",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_certificationAuthorityName",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_rootCertificate",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}