{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10CustomConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10CustomConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10CustomConfiguration_omaSettings",
        "deviceConfiguration--windows10CustomConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10CustomConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10CustomConfiguration_scenarioType",
        "deviceConfiguration--windows10CustomConfiguration_assignmentProgress",
        "deviceConfiguration--windows10CustomConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}