{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileScepCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileScepCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_scepServerUrls",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_certificateStore",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_rootCertificate",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_hashAlgorithm",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_keySize",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_keyUsage",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidWorkProfileScepCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}