{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--extendedKeyUsage",
    "valueType": "complex",
    "displayName": "Extended Key Usage",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--extendedKeyUsage_name",
        "deviceConfiguration--extendedKeyUsage_objectIdentifier"
    ],
    "constraints": [],
    "dependencies": []
}