{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerCertificateProfileBase",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerCertificateProfileBase_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--androidDeviceOwnerImportedPFXCertificateProfile",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}