{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSGeneralDeviceConfiguration_compliantAppsList",
    "valueType": "collection",
    "displayName": "Apps list",
    "isTopLevel": true,
    "description": "Enter the iTunes App Store URL of the app you want. For example, to specify the Microsoft Work Folders app for iOS, enter https://itunes.apple.com/us/app/work-folders/id950878067?mt=8. To find the URL of an app, use a search engine to locate the store page. For example, to find the Work Folders app, you could search Microsoft Work Folders ITunes.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--appListItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSDeviceEnrollment",
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--iOSGeneralDeviceConfiguration_compliantAppListType",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
                    "values": [
                        {
                            "value": "appsInListCompliant",
                            "displayName": "appsInListApproved"
                        },
                        {
                            "value": "appsNotInListCompliant",
                            "displayName": "appsInListProhibited"
                        }
                    ]
                }
            ]
        }
    ]
}