{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSDeviceFeaturesConfiguration_homeScreenPages",
    "valueType": "collection",
    "displayName": "Home screen pages",
    "isTopLevel": true,
    "description": "Apps and folders you select will be placed on the main screen of end user's iOS devices that you assign this policy to. Items are added from the upper-left corner of the screen to the lower-right. If the screen becomes full, items will automatically be placed on the next screen.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=845300",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSHomeScreenPage",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}