{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSExtensionsConfiguration_kernelExtensionAllowedTeamIdentifiers",
    "valueType": "collection",
    "displayName": "Allowed team identifiers",
    "isTopLevel": true,
    "description": "Identifiers that define which validly signed kernel extensions will be allowed to load.",
    "placeholderText": "e.g. ABCDE12345",
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSExtensionsConfiguration_kernelExtensionAllowedTeamIdentifiers_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "MacOSAutoDeviceEnrollment",
                "MacOSUserApprovedEnrollment"
            ]
        }
    ],
    "dependencies": []
}