{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--bitLockerRemovableDrivePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__bitLockerRemovableDrivePolicy_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--bitLockerRemovableDrivePolicy_requireEncryptionForWriteAccess",
        "deviceConfiguration--bitLockerRemovableDrivePolicy_encryptionMethod",
        "deviceConfiguration--bitLockerRemovableDrivePolicy_blockCrossOrganizationWriteAccess"
    ],
    "constraints": [],
    "dependencies": []
}