{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSKernelExtension",
    "valueType": "complex",
    "displayName": "Kernel extension",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSKernelExtension_bundleId",
        "deviceConfiguration--macOSKernelExtension_teamIdentifier"
    ],
    "constraints": [],
    "dependencies": []
}