{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--appListItem",
    "valueType": "complex",
    "displayName": "App",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--appListItem_appId",
        "deviceConfiguration--appListItem_appStoreUrl",
        "deviceConfiguration--appListItem_name",
        "deviceConfiguration--appListItem_publisher"
    ],
    "constraints": [],
    "dependencies": []
}