{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--omaSettingStringXml",
    "valueType": "complex",
    "displayName": "String (XML file)",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--omaSettingStringXml_displayName",
        "deviceConfiguration--omaSettingStringXml_description",
        "deviceConfiguration--omaSettingStringXml_omaUri",
        "deviceConfiguration--omaSettingStringXml_value",
        "deviceConfiguration--omaSettingStringXml_fileName"
    ],
    "constraints": [],
    "dependencies": []
}