{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsDefenderAdvancedThreatProtectionConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionOffboardingFilename",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionOffboardingBlob",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionAutoPopulateOnboardingBlob",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionOnboardingFilename",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_enableExpeditedTelemetryReporting",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionOnboardingBlob",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_allowSampleSharing",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_scenarioType",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_enableExpeditedTelemetryReportingCustom",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionOnboardingBlobBinary",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionOffboardingBlobBinary",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_assignmentProgress",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--windowsDefenderAdvancedThreatProtectionConfiguration_advancedThreatProtectionBlobType"
    ],
    "constraints": [],
    "dependencies": []
}