{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10AppsForceUpdateSchedule",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10AppsForceUpdateSchedule_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10AppsForceUpdateSchedule_runImmediatelyIfAfterStartDateTime",
        "deviceConfiguration--windows10AppsForceUpdateSchedule_recurrence"
    ],
    "constraints": [],
    "dependencies": []
}