{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSDeviceFeaturesConfiguration_homeScreenDockIcons",
    "valueType": "collection",
    "displayName": "Dock",
    "isTopLevel": true,
    "description": "Apps and folders you select will be placed on the dock of end user's iOS devices that you assign this policy to. Items are added from left to right in the order you give them. You can select up to 6 items.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=845300",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSHomeScreenItem",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": null,
            "maximumLength": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}