{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfilePkcsCertificateProfile_rootCertificate",
    "valueType": "complex",
    "displayName": "Root certificate",
    "isTopLevel": true,
    "description": "Root certificate",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_certFileName",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}