{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--omaSettingBoolean",
    "valueType": "complex",
    "displayName": "Boolean",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--omaSettingBoolean_displayName",
        "deviceConfiguration--omaSettingBoolean_description",
        "deviceConfiguration--omaSettingBoolean_omaUri",
        "deviceConfiguration--omaSettingBoolean_value"
    ],
    "constraints": [],
    "dependencies": []
}