{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerPkcsCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_certificationAuthorityName",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_rootCertificate",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_certificationAuthority",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_certificateTemplateName",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_certificateStore",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidDeviceOwnerPkcsCertificateProfile_certificationAuthorityType"
    ],
    "constraints": [],
    "dependencies": []
}