{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_assignedAccessMultiModeProfiles",
    "valueType": "collection",
    "displayName": "Assigned access multi mode profiles",
    "isTopLevel": true,
    "description": "Assigned access multi mode profiles",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsAssignedAccessProfile",
    "constraints": [],
    "dependencies": []
}