{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iPRange",
    "valueType": "abstractComplex",
    "displayName": "IP range",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iPv4Range",
        "deviceConfiguration--iPv6Range"
    ],
    "constraints": [],
    "dependencies": []
}