{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSGeneralDeviceConfiguration_safariPasswordAutoFillDomains",
    "valueType": "collection",
    "displayName": "Safari password domains",
    "isTopLevel": true,
    "description": "Users can save passwords in Safari only from URLs matching the patterns you specify here. To use this setting, the device must be in supervised mode and not configured for multiple users. (iOS 9.3+)",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSGeneralDeviceConfiguration_safariPasswordAutoFillDomains_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}