{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSGeneralDeviceConfiguration_safariManagedDomains",
    "valueType": "collection",
    "displayName": "Managed Safari web domains",
    "isTopLevel": true,
    "description": "Documents downloaded from the URLs you specify here will be considered managed (Safari only).",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSGeneralDeviceConfiguration_safariManagedDomains_element",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "IOSDeviceEnrollment",
                "IOSAutoDeviceEnrollment"
            ]
        }
    ],
    "dependencies": []
}