{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSCredentialSingleSignOnExtension",
    "valueType": "complex",
    "displayName": "Credential",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSCredentialSingleSignOnExtension_extensionIdentifier",
        "deviceConfiguration--macOSCredentialSingleSignOnExtension_teamIdentifier",
        "deviceConfiguration--macOSCredentialSingleSignOnExtension_realm",
        "deviceConfiguration--macOSCredentialSingleSignOnExtension_domains",
        "deviceConfiguration--macOSCredentialSingleSignOnExtension_configurations"
    ],
    "constraints": [],
    "dependencies": []
}