{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--mimeContent",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__mimeContent_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--mimeContent_type",
        "deviceConfiguration--mimeContent_value"
    ],
    "constraints": [],
    "dependencies": []
}