{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--keyRealValuePair_value",
    "valueType": "complex",
    "displayName": "Value",
    "isTopLevel": false,
    "description": "Value to be passed to the app extension.",
    "placeholderText": "3.14",
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [],
    "constraints": [],
    "dependencies": []
}