{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iOSHomeScreenItem",
    "valueType": "abstractComplex",
    "displayName": "Display Name",
    "isTopLevel": false,
    "description": "For your own reference. Does not need to be exact.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSHomeScreenApp",
        "deviceConfiguration--iOSHomeScreenFolder"
    ],
    "constraints": [],
    "dependencies": []
}