{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsAssignedAccessProfile",
    "valueType": "complex",
    "displayName": "Assigned access profile",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsAssignedAccessProfile_userAccounts",
        "deviceConfiguration--windowsAssignedAccessProfile_desktopAppPaths",
        "deviceConfiguration--windowsAssignedAccessProfile_appUserModelIds",
        "deviceConfiguration--windowsAssignedAccessProfile_id",
        "deviceConfiguration--windowsAssignedAccessProfile_startMenuLayoutXml",
        "deviceConfiguration--windowsAssignedAccessProfile_showTaskBar",
        "deviceConfiguration--windowsAssignedAccessProfile_profileName"
    ],
    "constraints": [],
    "dependencies": []
}