{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsDeliveryOptimizationConfiguration_cacheServerHostNames",
    "valueType": "collection",
    "displayName": "Cache server host names",
    "isTopLevel": true,
    "description": "This policy allows you to set one or more Delivery Optimization in Network Cache servers that will be used by your client(s). One or more values can be added as either fully qualified domain names (FQDN) or IP addresses.​",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsDeliveryOptimizationConfiguration_cacheServerHostNames_element",
    "constraints": [],
    "dependencies": []
}