{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--vpnRoute",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__vpnRoute_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnRoute_prefixSize",
        "deviceConfiguration--vpnRoute_destinationPrefix"
    ],
    "constraints": [],
    "dependencies": []
}