{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerScepCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerScepCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_certificateStore",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_scepServerUrls",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_hashAlgorithm",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_rootCertificate",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_keyUsage",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_keySize",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerScepCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}