{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkGmailEasConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkGmailEasConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkGmailEasConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_requireSsl",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_emailAddressSource",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_authenticationMethod",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_identityCertificate",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_hostName",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_usernameSource",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_durationOfEmailToSync",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_assignmentProgress",
        "deviceConfiguration--androidForWorkGmailEasConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}