{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSVpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSVpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSVpnConfiguration_optInToDeviceIdSharing",
        "deviceConfiguration--macOSVpnConfiguration_role",
        "deviceConfiguration--macOSVpnConfiguration_customKeyValueData",
        "deviceConfiguration--macOSVpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--macOSVpnConfiguration_onDemandRules",
        "deviceConfiguration--macOSVpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSVpnConfiguration_server",
        "deviceConfiguration--macOSVpnConfiguration_enablePerApp",
        "deviceConfiguration--macOSVpnConfiguration_customData",
        "deviceConfiguration--macOSVpnConfiguration_connectionType",
        "deviceConfiguration--macOSVpnConfiguration_authenticationMethod",
        "deviceConfiguration--macOSVpnConfiguration_connectionName",
        "deviceConfiguration--macOSVpnConfiguration_proxyServer",
        "deviceConfiguration--macOSVpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSVpnConfiguration_safariDomains",
        "deviceConfiguration--macOSVpnConfiguration_loginGroupOrDomain",
        "deviceConfiguration--macOSVpnConfiguration_identifier",
        "deviceConfiguration--macOSVpnConfiguration_identityCertificate",
        "deviceConfiguration--macOSVpnConfiguration_realm",
        "deviceConfiguration--macOSVpnConfiguration_optInToDeviceIdSharingInternal",
        "deviceConfiguration--macOSVpnConfiguration_assignmentProgress",
        "deviceConfiguration--macOSVpnConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}