{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSWiredNetworkConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSWiredNetworkConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSWiredNetworkConfiguration_networkName",
        "deviceConfiguration--macOSWiredNetworkConfiguration_networkInterface",
        "deviceConfiguration--macOSWiredNetworkConfiguration_eapType",
        "deviceConfiguration--macOSWiredNetworkConfiguration_eapFastConfiguration",
        "deviceConfiguration--macOSWiredNetworkConfiguration_trustedServerCertificateNames",
        "deviceConfiguration--macOSWiredNetworkConfiguration_authenticationMethod",
        "deviceConfiguration--macOSWiredNetworkConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--macOSWiredNetworkConfiguration_nonEapAuthenticationMethodForEapTtls",
        "deviceConfiguration--macOSWiredNetworkConfiguration_enableOuterIdentityPrivacy",
        "deviceConfiguration--macOSWiredNetworkConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSWiredNetworkConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSWiredNetworkConfiguration_scenarioType",
        "deviceConfiguration--macOSWiredNetworkConfiguration_rootCertificateForServerValidation",
        "deviceConfiguration--macOSWiredNetworkConfiguration_assignmentProgress",
        "deviceConfiguration--macOSWiredNetworkConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}