{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10EnterpriseModernAppManagementConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration_uninstallBuiltInApps",
        "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration_scenarioType",
        "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration_assignmentProgress",
        "deviceConfiguration--windows10EnterpriseModernAppManagementConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}