{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--macOSWiredNetworkConfiguration_identityCertificateForClientAuthentication",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSWiredNetworkConfiguration_identityCertificateForClientAuthentication_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--macOSImportedPFXCertificateProfile",
        "deviceConfiguration--macOSPkcsCertificateProfile",
        "deviceConfiguration--macOSScepCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}