{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10NetworkBoundaryConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10NetworkBoundaryConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10NetworkBoundaryConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10NetworkBoundaryConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10NetworkBoundaryConfiguration_windowsNetworkIsolationPolicy",
        "deviceConfiguration--windows10NetworkBoundaryConfiguration_scenarioType",
        "deviceConfiguration--windows10NetworkBoundaryConfiguration_assignmentProgress",
        "deviceConfiguration--windows10NetworkBoundaryConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}