{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10CompliancePolicy_validOperatingSystemBuildRanges",
    "valueType": "collection",
    "displayName": "Valid operating system builds",
    "isTopLevel": true,
    "description": "Valid operating system builds",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--operatingSystemVersionRange",
    "constraints": [],
    "dependencies": []
}