{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_networkProxyServer",
    "valueType": "complex",
    "displayName": "Allow to Use manual proxy server",
    "isTopLevel": true,
    "description": "Use manual proxy server",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10NetworkProxyServer_address",
        "deviceConfiguration--windows10NetworkProxyServer_exceptions",
        "deviceConfiguration--windows10NetworkProxyServer_useForLocalAddresses"
    ],
    "constraints": [],
    "dependencies": []
}