{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsFirewallRule_actualLocalAddressRanges",
    "valueType": "collection",
    "displayName": "Local address ranges",
    "isTopLevel": false,
    "description": "\r\n    List of local addresses covered by the rule. Valid tokens include:​<br>\r\n<ul><li>\"*\" indicates any local address. If present, this must be the only token included.</li>\r\n<li>A subnet can be specified using either the subnet mask or network prefix notation. If neither a subnet mask nor a network prefix is specified, the subnet mask defaults to 255.255.255.255.​​</li>\r\n<li>A valid IPv6 address.​​</li>\r\n<li>An IPv4 address range in the format of \"start address - end address\" with no spaces included, where the start address is less than the end address.​​</li>\r\n<li>An IPv6 address range in the format of \"start address - end address\" with no spaces included, where the start address is less than the end address.</li></ul>\r\nIf not specified, the default is \"Any address.\"",
    "placeholderText": null,
    "documentationUrl": "https://aka.ms/intunefirewalllocaladdressrule",
    "headerTitle": "IP address settings",
    "headerSubtitle": "Specifies the local and remote addresses to which this rule applies",
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsFirewallRule_actualLocalAddressRanges_element",
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--windowsFirewallRule_useAnyLocalAddressRange",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementSettingBooleanConstraint",
                    "value": false
                }
            ]
        }
    ]
}