{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsProfileSingleProcess",
    "valueType": "complex",
    "displayName": "User rights profile single process",
    "isTopLevel": true,
    "description": "This user right determines which users can use performance monitoring tools to monitor the performance of system processes.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067305",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceManagementUserRightsSetting_state",
        "deviceConfiguration--deviceManagementUserRightsSetting_localUsersOrGroups"
    ],
    "constraints": [],
    "dependencies": []
}