{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--macOSSingleSignOnExtension",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSSingleSignOnExtension_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--macOSCredentialSingleSignOnExtension",
        "deviceConfiguration--macOSRedirectSingleSignOnExtension",
        "deviceConfiguration--macOSKerberosSingleSignOnExtension"
    ],
    "constraints": [],
    "dependencies": []
}