{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGlobalProxyDirect",
    "valueType": "complex",
    "displayName": "Direct",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerGlobalProxyDirect_host",
        "deviceConfiguration--androidDeviceOwnerGlobalProxyDirect_port",
        "deviceConfiguration--androidDeviceOwnerGlobalProxyDirect_excludedHosts"
    ],
    "constraints": [],
    "dependencies": []
}