{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_edgeRequiredExtensionPackageFamilyNames",
    "valueType": "collection",
    "displayName": "Required extensions",
    "isTopLevel": true,
    "description": "This setting allows you to specify a list of extensions that cannot be turned off by the user in Microsoft Edge. To learn how to find the package family name of an extension, refer here: https://docs.microsoft.com/en-us/sccm/protect/deploy-use/find-a-pfn-for-per-app-vpn.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeRequiredExtensionPackageFamilyNames_element",
    "constraints": [],
    "dependencies": []
}