{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsKioskProfile_userAccountsConfiguration",
    "valueType": "collection",
    "displayName": "User accounts configuration",
    "isTopLevel": false,
    "description": "User accounts configuration",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsKioskUser",
    "constraints": [],
    "dependencies": []
}