{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderGuardedFoldersAllowedAppPaths",
    "valueType": "collection",
    "displayName": "List of apps that have access to protected folders",
    "isTopLevel": true,
    "description": "Define a list of apps that have access to read/write to controlled locations. ",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=872616",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderGuardedFoldersAllowedAppPaths_element",
    "constraints": [],
    "dependencies": []
}