{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSRedirectSingleSignOnExtension",
    "valueType": "complex",
    "displayName": "Redirect",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSRedirectSingleSignOnExtension_extensionIdentifier",
        "deviceConfiguration--iOSRedirectSingleSignOnExtension_teamIdentifier",
        "deviceConfiguration--iOSRedirectSingleSignOnExtension_urlPrefixes",
        "deviceConfiguration--iOSRedirectSingleSignOnExtension_configurations"
    ],
    "constraints": [],
    "dependencies": []
}