{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--edgeHomeButtonConfiguration",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__edgeHomeButtonConfiguration_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--edgeHomeButtonLoadsStartPage",
        "deviceConfiguration--edgeHomeButtonOpensNewTab",
        "deviceConfiguration--edgeHomeButtonOpensCustomURL",
        "deviceConfiguration--edgeHomeButtonHidden"
    ],
    "constraints": [],
    "dependencies": []
}