{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidDeviceOwnerEnterpriseWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_innerAuthenticationProtocolForEapTtls",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_preSharedKey",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_networkName",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_enableOuterIdentityPrivacy",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_ssid",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_innerAuthenticationProtocolForPeap",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_preSharedKeyIsSet",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_authenticationMethod",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_eapType",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_outerIdentityPrivacyTemporaryValue",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_derivedCredentialSettings",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_rootCertificateForServerValidation",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidDeviceOwnerEnterpriseWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}