{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSBookmark",
    "valueType": "complex",
    "displayName": "iOS Bookmark",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSBookmark_url",
        "deviceConfiguration--iOSBookmark_bookmarkFolder",
        "deviceConfiguration--iOSBookmark_displayName"
    ],
    "constraints": [],
    "dependencies": []
}