{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_privacyAccessControls",
    "valueType": "collection",
    "displayName": "Per-app privacy access controls",
    "isTopLevel": true,
    "description": "Define information that all apps on the device can access. You can define exceptions on a per-app basis using “Per-app privacy exceptions”.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsPrivacyDataAccessControlItem",
    "constraints": [],
    "dependencies": []
}