{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWiFiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWiFiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWiFiConfiguration_ssid",
        "deviceConfiguration--androidWiFiConfiguration_wiFiSecurityType",
        "deviceConfiguration--androidWiFiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidWiFiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--androidWiFiConfiguration_networkName",
        "deviceConfiguration--androidWiFiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWiFiConfiguration_connectAutomatically",
        "deviceConfiguration--androidWiFiConfiguration_assignmentProgress",
        "deviceConfiguration--androidWiFiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}