{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81VpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsPhone81VpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsPhone81VpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsPhone81VpnConfiguration_bypassVpnOnCompanyWifi",
        "deviceConfiguration--windowsPhone81VpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--windowsPhone81VpnConfiguration_dnsSuffixSearchList",
        "deviceConfiguration--windowsPhone81VpnConfiguration_applyAllConfigurationsToWindows10",
        "deviceConfiguration--windowsPhone81VpnConfiguration_applyOnlyToWindows81",
        "deviceConfiguration--windowsPhone81VpnConfiguration_connectionType",
        "deviceConfiguration--windowsPhone81VpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsPhone81VpnConfiguration_proxyServer",
        "deviceConfiguration--windowsPhone81VpnConfiguration_loginGroupOrDomain",
        "deviceConfiguration--windowsPhone81VpnConfiguration_routes",
        "deviceConfiguration--windowsPhone81VpnConfiguration_rememberUserCredentials",
        "deviceConfiguration--windowsPhone81VpnConfiguration_authenticationMethod",
        "deviceConfiguration--windowsPhone81VpnConfiguration_customXml",
        "deviceConfiguration--windowsPhone81VpnConfiguration_identityCertificate",
        "deviceConfiguration--windowsPhone81VpnConfiguration_servers",
        "deviceConfiguration--windowsPhone81VpnConfiguration_bypassVpnOnHomeWifi",
        "deviceConfiguration--windowsPhone81VpnConfiguration_connectionName",
        "deviceConfiguration--windowsPhone81VpnConfiguration_assignmentProgress",
        "deviceConfiguration--windowsPhone81VpnConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}