{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--appsComplianceListItem",
    "valueType": "complex",
    "displayName": "Apps compliance",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--appsComplianceListItem_publisher",
        "deviceConfiguration--appsComplianceListItem_appStoreUrl",
        "deviceConfiguration--appsComplianceListItem_appId",
        "deviceConfiguration--appsComplianceListItem_name"
    ],
    "constraints": [],
    "dependencies": []
}