{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--edgeHomeButtonOpensCustomURL",
    "valueType": "complex",
    "displayName": "Home button opens a custom URL",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--edgeHomeButtonOpensCustomURL_homeButtonCustomURL"
    ],
    "constraints": [],
    "dependencies": []
}