{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSCompliancePolicy_scheduledActionsForRule",
    "valueType": "collection",
    "displayName": "Actions for noncompliance",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--deviceComplianceScheduledActionForRule",
    "constraints": [],
    "dependencies": []
}