{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsUpdateForBusinessConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsUpdateForBusinessConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_qualityUpdatesPauseStartDateTime",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_userWindowsUpdateScanAccess",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_qualityUpdatesPaused",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deadlineForFeatureUpdatesInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_automaticUpdateMode",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_scheduleRestartWarningInHours",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesPauseExpiryDateTime",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_autoRestartNotificationDismissal",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesDeferralPeriodInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_engagedRestartTransitionScheduleInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_qualityUpdatesWillBeRolledBack",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_engagedRestartDeadlineInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_engagedRestartSnoozeScheduleForFeatureUpdatesInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_scheduleImminentRestartWarningInMinutes",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_engagedRestartDeadlineForFeatureUpdatesInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_driversExcluded",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesPauseStartDateTime",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesRollbackWindowInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_qualityUpdatesPauseExpiryDateTime",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_qualityUpdatesRollbackStartDateTime",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_prereleaseFeatures",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deviceUpdateStates",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_updateNotificationLevel",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_installationSchedule",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesWillBeRolledBack",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deadlineForQualityUpdatesInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_updateWeeks",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_engagedRestartSnoozeScheduleInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_previewBuildSetting",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_microsoftUpdateServiceAllowed",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_qualityUpdatesDeferralPeriodInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesRollbackStartDateTime",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_qualityUpdatesPauseStartDate",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_skipChecksBeforeRestart",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deliveryOptimizationMode",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesPauseStartDate",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_postponeRebootUntilAfterDeadline",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_engagedRestartTransitionScheduleForFeatureUpdatesInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_businessReadyUpdatesOnly",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deadlineGracePeriodInDays",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_featureUpdatesPaused",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_userPauseAccess",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_scenarioType",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_assignmentProgress",
        "deviceConfiguration--windowsUpdateForBusinessConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}