{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10PFXImportCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10PFXImportCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10PFXImportCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10PFXImportCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10PFXImportCertificateProfile_scenarioType",
        "deviceConfiguration--windows10PFXImportCertificateProfile_assignmentProgress",
        "deviceConfiguration--windows10PFXImportCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}