{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSRedirectSingleSignOnExtension_configurations",
    "valueType": "collection",
    "displayName": "Additional configuration",
    "isTopLevel": false,
    "description": "Additional extension-specific data to pass to the app extension.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--keyTypedValuePair",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingCollectionConstraint",
            "minimumLength": null,
            "maximumLength": 500
        }
    ],
    "dependencies": []
}