{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidOmaCpConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidOmaCpConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidOmaCpConfiguration_configurationXml",
        "deviceConfiguration--androidOmaCpConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidOmaCpConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidOmaCpConfiguration_scenarioType",
        "deviceConfiguration--androidOmaCpConfiguration_assignmentProgress",
        "deviceConfiguration--androidOmaCpConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}