{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSCustomConfiguration",
    "valueType": "complex",
    "displayName": "MacOS Custom Configuration",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSCustomConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSCustomConfiguration_payload",
        "deviceConfiguration--macOSCustomConfiguration_payloadFileName",
        "deviceConfiguration--macOSCustomConfiguration_payloadName",
        "deviceConfiguration--macOSCustomConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSCustomConfiguration_scenarioType",
        "deviceConfiguration--macOSCustomConfiguration_assignmentProgress",
        "deviceConfiguration--macOSCustomConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}