{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskMultipleApps",
    "valueType": "complex",
    "displayName": "Multiple Apps",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskMultipleApps_startMenuLayoutXml",
        "deviceConfiguration--windowsKioskMultipleApps_apps",
        "deviceConfiguration--windowsKioskMultipleApps_disallowDesktopApps",
        "deviceConfiguration--windowsKioskMultipleApps_showTaskBar",
        "deviceConfiguration--windowsKioskMultipleApps_allowAccessToDownloadsFolder"
    ],
    "constraints": [],
    "dependencies": []
}