{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkVpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkVpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkVpnConfiguration_realm",
        "deviceConfiguration--androidForWorkVpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkVpnConfiguration_role",
        "deviceConfiguration--androidForWorkVpnConfiguration_authenticationMethod",
        "deviceConfiguration--androidForWorkVpnConfiguration_connectionType",
        "deviceConfiguration--androidForWorkVpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--androidForWorkVpnConfiguration_identityCertificate",
        "deviceConfiguration--androidForWorkVpnConfiguration_servers",
        "deviceConfiguration--androidForWorkVpnConfiguration_fingerprint",
        "deviceConfiguration--androidForWorkVpnConfiguration_customData",
        "deviceConfiguration--androidForWorkVpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkVpnConfiguration_connectionName",
        "deviceConfiguration--androidForWorkVpnConfiguration_customKeyValueData",
        "deviceConfiguration--androidForWorkVpnConfiguration_assignmentProgress",
        "deviceConfiguration--androidForWorkVpnConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}