{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration_trafficRules",
    "valueType": "collection",
    "displayName": "Network traffic rules for this VPN connection",
    "isTopLevel": true,
    "description": "Careful: By adding network rules, the VPN connection will be limited to only the rules specified. When adding traffic rules, make sure to add a catch-all rule that is least restrictive, to avoid VPN issues.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--vpnTrafficRule",
    "constraints": [],
    "dependencies": []
}