{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows81WifiImportConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows81WifiImportConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81WifiImportConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows81WifiImportConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows81WifiImportConfiguration_profileName",
        "deviceConfiguration--windows81WifiImportConfiguration_payloadFileName",
        "deviceConfiguration--windows81WifiImportConfiguration_payload",
        "deviceConfiguration--windows81WifiImportConfiguration_assignmentProgress",
        "deviceConfiguration--windows81WifiImportConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}