{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderFilesAndFoldersToExclude",
    "valueType": "collection",
    "displayName": "Defender Files And Folders To Exclude",
    "isTopLevel": true,
    "description": "Specify a list of files and directory paths to ignore during a scan.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderFilesAndFoldersToExclude_element",
    "constraints": [],
    "dependencies": []
}