{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsFirewallRule_profileTypes",
    "valueType": "collection",
    "displayName": "Network types",
    "isTopLevel": false,
    "description": "Specifies the network type to which the rule belongs: \"Domain,\" \"Private,\" or \"Public.\" If none selected, the rule applies to all network types.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsFirewallRule_profileTypes_element",
    "constraints": [],
    "dependencies": []
}