{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSCompliancePolicy_passcodeBlockSimple",
        "deviceConfiguration--iOSCompliancePolicy_managedEmailProfileRequired",
        "deviceConfiguration--iOSCompliancePolicy_passcodeMinimumLength",
        "deviceConfiguration--iOSCompliancePolicy_passcodeExpirationDays",
        "deviceConfiguration--iOSCompliancePolicy_passcodeRequiredType",
        "deviceConfiguration--iOSCompliancePolicy_deviceThreatProtectionEnabled",
        "deviceConfiguration--iOSCompliancePolicy_deviceThreatProtectionRequiredSecurityLevel",
        "deviceConfiguration--iOSCompliancePolicy_passcodeRequired",
        "deviceConfiguration--iOSCompliancePolicy_passcodeMinutesOfInactivityBeforeScreenTimeout",
        "deviceConfiguration--iOSCompliancePolicy_id",
        "deviceConfiguration--iOSCompliancePolicy_securityBlockJailbrokenDevices",
        "deviceConfiguration--iOSCompliancePolicy_restrictedApps",
        "deviceConfiguration--iOSCompliancePolicy_passcodeMinutesOfInactivityBeforeLock",
        "deviceConfiguration--iOSCompliancePolicy_passcodePreviousPasscodeBlockCount",
        "deviceConfiguration--iOSCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--iOSCompliancePolicy_passcodeMinimumCharacterSetCount",
        "deviceConfiguration--iOSCompliancePolicy_osMinimumVersion",
        "deviceConfiguration--iOSCompliancePolicy_osMaximumVersion",
        "deviceConfiguration--iOSCompliancePolicy_osMinimumBuildVersion",
        "deviceConfiguration--iOSCompliancePolicy_osMaximumBuildVersion",
        "deviceConfiguration--iOSCompliancePolicy_requireRecentSSPHeartbeat",
        "deviceConfiguration--iOSCompliancePolicy_requireSSPLocationServices",
        "deviceConfiguration--iOSCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--iOSCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSCompliancePolicy_numberOfPasscodesToRemember"
    ],
    "constraints": [],
    "dependencies": []
}