{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSDeviceFeaturesConfiguration_associatedDomains",
    "valueType": "collection",
    "displayName": "Associated domains",
    "isTopLevel": true,
    "description": "Can be used with SSO extension, universal links, and password autofill on macOS 10.15+. Enter the app ID as the name and the domain as the value. App ID takes the format <i>&lt;team ID&gt;.&lt;bundle ID&gt;</i> and domain takes the format <i>&lt;service type&gt;:&lt;domain&gt;</i> where <i>domain</i> is a fully qualified hostname, like <i>www.example.com</i>.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--keyValuePair",
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementSettingEnrollmentTypeConstraint",
            "enrollmentTypes": [
                "MacOSAutoDeviceEnrollment",
                "MacOSUserApprovedEnrollment"
            ]
        }
    ],
    "dependencies": []
}