{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic",
    "valueType": "complex",
    "displayName": "Firewall profile public",
    "isTopLevel": true,
    "description": "Specifies the profiles to which the rule belongs: Domain, Private, Public. This value represents the profile for public networks. These networks are classified as public by the administrators in the server host. The classification happens the first time the host connects to the network. Usually these networks are those at airports, coffee shops, and other public places where the peers in the network or the network administrator are not trusted.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067143",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_unicastResponsesToMulticastBroadcastsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_unicastResponsesToMulticastBroadcastsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_stealthModeRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_securedPacketExemptionAllowed",
        "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundConnectionsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_authorizedApplicationRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_globalPortRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_outboundConnectionsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_inboundNotificationsBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_globalPortRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_stealthModeBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_firewallEnabled",
        "deviceConfiguration--windowsFirewallNetworkProfile_authorizedApplicationRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_securedPacketExemptionBlocked",
        "deviceConfiguration--windowsFirewallNetworkProfile_connectionSecurityRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_incomingTrafficRequired",
        "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyNotMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_policyRulesFromGroupPolicyMerged",
        "deviceConfiguration--windowsFirewallNetworkProfile_incomingTrafficBlocked"
    ],
    "constraints": [],
    "dependencies": []
}