{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGlobalProxyDirect_excludedHosts",
    "valueType": "collection",
    "displayName": "Excluded hosts",
    "isTopLevel": false,
    "description": "Semicolon separated list of host names for which the proxy is bypassed. The host names may contain wildcards such as *.example.com.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--androidDeviceOwnerGlobalProxyDirect_excludedHosts_element",
    "constraints": [],
    "dependencies": []
}