{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSPrivacyAccessControlItem",
    "valueType": "complex",
    "displayName": "App or process",
    "isTopLevel": false,
    "description": "Specify the privacy preferences for the app or process.​",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSPrivacyAccessControlItem_displayName",
        "deviceConfiguration--macOSPrivacyAccessControlItem_identifier",
        "deviceConfiguration--macOSPrivacyAccessControlItem_identifierType",
        "deviceConfiguration--macOSPrivacyAccessControlItem_codeRequirement",
        "deviceConfiguration--macOSPrivacyAccessControlItem_staticCodeValidation",
        "deviceConfiguration--macOSPrivacyAccessControlItem_blockCamera",
        "deviceConfiguration--macOSPrivacyAccessControlItem_blockMicrophone",
        "deviceConfiguration--macOSPrivacyAccessControlItem_blockScreenCapture",
        "deviceConfiguration--macOSPrivacyAccessControlItem_blockListenEvent",
        "deviceConfiguration--macOSPrivacyAccessControlItem_speechRecognition",
        "deviceConfiguration--macOSPrivacyAccessControlItem_accessibility",
        "deviceConfiguration--macOSPrivacyAccessControlItem_addressBook",
        "deviceConfiguration--macOSPrivacyAccessControlItem_calendar",
        "deviceConfiguration--macOSPrivacyAccessControlItem_reminders",
        "deviceConfiguration--macOSPrivacyAccessControlItem_photos",
        "deviceConfiguration--macOSPrivacyAccessControlItem_mediaLibrary",
        "deviceConfiguration--macOSPrivacyAccessControlItem_fileProviderPresence",
        "deviceConfiguration--macOSPrivacyAccessControlItem_systemPolicyAllFiles",
        "deviceConfiguration--macOSPrivacyAccessControlItem_systemPolicySystemAdminFiles",
        "deviceConfiguration--macOSPrivacyAccessControlItem_systemPolicyDesktopFolder",
        "deviceConfiguration--macOSPrivacyAccessControlItem_systemPolicyDocumentsFolder",
        "deviceConfiguration--macOSPrivacyAccessControlItem_systemPolicyDownloadsFolder",
        "deviceConfiguration--macOSPrivacyAccessControlItem_systemPolicyNetworkVolumes",
        "deviceConfiguration--macOSPrivacyAccessControlItem_systemPolicyRemovableVolumes",
        "deviceConfiguration--macOSPrivacyAccessControlItem_postEvent",
        "deviceConfiguration--macOSPrivacyAccessControlItem_appleEventsAllowedReceivers"
    ],
    "constraints": [],
    "dependencies": []
}