{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windowsAssignedAccessProfile_appUserModelIds",
    "valueType": "collection",
    "displayName": "App user model ids",
    "isTopLevel": false,
    "description": "App user model ids",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windowsAssignedAccessProfile_appUserModelIds_element",
    "constraints": [],
    "dependencies": []
}