{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windowsPhone81CertificateProfileBase",
    "valueType": "abstractComplex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsPhone81CertificateProfileBase_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--windowsPhone81SCEPCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}