{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsDomainJoinConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsDomainJoinConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsDomainJoinConfiguration_networkAccessConfigurations",
        "deviceConfiguration--windowsDomainJoinConfiguration_organizationalUnit",
        "deviceConfiguration--windowsDomainJoinConfiguration_computerNameStaticPrefix",
        "deviceConfiguration--windowsDomainJoinConfiguration_computerNameSuffixRandomCharCount",
        "deviceConfiguration--windowsDomainJoinConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsDomainJoinConfiguration_activeDirectoryDomainName",
        "deviceConfiguration--windowsDomainJoinConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsDomainJoinConfiguration_scenarioType",
        "deviceConfiguration--windowsDomainJoinConfiguration_blob",
        "deviceConfiguration--windowsDomainJoinConfiguration_assignmentProgress",
        "deviceConfiguration--windowsDomainJoinConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}