{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--hardenedUncPathEnabled",
    "valueType": "complex",
    "displayName": "Configure Windows to only allow access to the specified UNC paths after fulfilling additional security requirements",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--hardenedUncPathEnabled_hardenedUncPaths"
    ],
    "constraints": [],
    "dependencies": []
}