{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--deviceComplianceActionItem",
    "valueType": "complex",
    "displayName": "Item",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--deviceComplianceActionItem_id",
        "deviceConfiguration--deviceComplianceActionItem_actionType",
        "deviceConfiguration--deviceComplianceActionItem_notificationTemplateId",
        "deviceConfiguration--deviceComplianceActionItem_gracePeriodHours",
        "deviceConfiguration--deviceComplianceActionItem_notificationMessageCCList"
    ],
    "constraints": [],
    "dependencies": []
}