{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSEnterpriseWiFiConfiguration_rootCertificateForServerValidation",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSEnterpriseWiFiConfiguration_rootCertificateForServerValidation_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSTrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--macOSTrustedRootCertificate_certFileName",
        "deviceConfiguration--macOSTrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--macOSTrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSTrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--macOSTrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}