{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSVpnConfiguration_proxyServer",
    "valueType": "complex",
    "displayName": "Use proxy server",
    "isTopLevel": true,
    "description": "Proxy used when profile is active.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnProxyServer_address",
        "deviceConfiguration--vpnProxyServer_automaticConfigurationScriptUrl",
        "deviceConfiguration--vpnProxyServer_port"
    ],
    "constraints": [],
    "dependencies": []
}