{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10EndpointProtectionConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10EndpointProtectionConfiguration_rpcUnauthenticatedClientOptions",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsAccessCredentialManagerAsTrustedCaller",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsIncreaseSchedulingPriority",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIPSecExemptionsAllowDHCP",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIPSecExemptionsAllowRouterDiscovery",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsHideLastSignedInUser",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIdleTimeoutForSecurityAssociationInSeconds",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallBlockStatefulFTP",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_windowsDefenderTamperProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowFileSaveOnHost",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsManageVolumes",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMachineInactivityLimitInMinutes",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockMicrosoftAccounts",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceStoringRunAsCredentials",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderExploitProtectionXmlFileName",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideApplyUacRestrictionsToLocalAccountsOnNetworkLogon",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowVirtualGPU",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsCreateSymbolicLinks",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableHardwareUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsRemoteDesktopServicesLogOn",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardForceAuditing",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMachineInactivityLimit",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProcessCreation",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsGenerateSecurityAudits",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardBlockNonEnterpriseContent",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIPSecExemptionsAllowNeighborDiscovery",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpSourceRoutingProtectionLevel",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableAccountUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientDigitallySignCommunicationsAlways",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsProfileSingleProcess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableVulnerableTpmFirmwareUpdateUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderExploitProtectionXml",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPasswordSaving",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsRestoreData",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsDebugPrograms",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallPacketQueueingMethod",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowUndockWithoutHavingToLogon",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesSecureRpcCommunication",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenBlockOverrideForFiles",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsLogOnMessageText",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_windowsConnectionManagerConnectionToNonDomainNetworks",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsCreateGlobalObjects",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderNetworkProtectionType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsAllowAccessFromNetwork",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockRemoteOpticalDriveAccess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableServerDigitallySignCommunicationsAlways",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAdministratorElevationPromptBehavior",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1ClientDriverStartConfiguration",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsDenyLocalLogOn",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsLogOnMessageTitle",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityPrintingOverHttp",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardEnabledOptions",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesDriveRedirection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsTakeOwnership",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerAllowStandardUserEncryption",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableNetworkUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityInternetDownloadForWebPublishingAndOnlineOrderingWizards",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallRules",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1Server",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_attackSurfaceReductionRules",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallMergeKeyingModuleSettings",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerDisableWarningForOtherDiskEncryption",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsLockMemory",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSecurityLogMaximumFileSizeInKb",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerDataExecutionPrevention",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_dmaGuardDeviceEnumerationPolicy",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsImpersonateClient",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsCreatePageFile",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotRequireCtrlAltDel",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardSecureBootWithDMA",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsCreateToken",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsSmartCardRemovalBehavior",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsLocalLogOn",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsChangeSystemTime",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdvancedRansomewareProtectionType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomain",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivate",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableTroubleshootingUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardEnabled",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_passwordPinLogOn",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSystemLogMaximumFileSizeInKb",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecution",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsInformationShownOnLockScreen",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowPrintToNetworkPrinters",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowPrintToXPS",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAttackSurfaceReductionExcludedPaths",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPromptForPasswordUponConnection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockRemoteLogonWithBlankPassword",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideWDigestAuthentication",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsOnlyElevateSignedExecutables",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterBlockExploitProtectionOverride",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowPrintToPDF",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_appLockerApplicationControl",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsStandardUserElevationPromptBehavior",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowPKU2UAuthenticationRequests",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCode",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableRansomwareUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAdministratorAccountName",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalModeForAdministrators",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesClientConnectionEncryptionLevel",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsActAsPartOfTheOperatingSystem",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterITContactDisplay",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsGuestAccountName",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsDelegation",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceApplicationLogMaximumFileSizeInKb",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_xboxServicesLiveAuthManagerServiceStartupMode",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterHelpURL",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteHostDelegationOfNonExportableCredentials",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterHelpEmail",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableVirusUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableNotificationAreaUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableAdministratorAccount",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerWorkstationEnableInsecureGuestLogons",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsBackupData",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallPreSharedKeyEncodingMethod",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowUIAccessApplicationElevation",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecution",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_xboxServicesEnableXboxGameSaveTask",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceBasicAuthentication",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32Imports",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsBlockAccessFromNetwork",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideStructuredExceptionHandlingOverwriteProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_powerShellShellScriptBlockLogging",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsModifyFirmwareEnvironment",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsLoadUnloadDrivers",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsInformationDisplayedOnLockScreen",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIgnoreNetBiosNameReleaseRequestsExceptFromWinsServers",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteAssistanceSolicitedSetting",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEnableStorageCardEncryptionOnMobile",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalMode",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterNotificationsFromApp",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProcessCreationType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableAppBrowserUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableSecureBootUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowUIAccessApplicationsForSecureLocations",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableGuestAccount",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerWorkstationDisableInsecureGuestLogons",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsHideUsernameAtSignIn",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunch",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsCreatePermanentSharedObjects",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedExecutable",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdditionalGuardedFolders",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRecoveryPasswordRotation",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsManageAuditingAndSecurityLogs",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowPersistence",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsEnableGuestAccount",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallCertificateRevocationListCheckMethod",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardBlockClipboardSharing",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProtectAgainstPotentiallyUnwantedApplications",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityDownloadingOfPrintDriversOverHttp",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardBlockFileTransfer",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_xboxServicesLiveGameSaveServiceStartupMode",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsEnableAdministratorAccount",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardEnableVirtualizationBasedSecurity",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_credentialsUIEnumerateAdministrators",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClearVirtualMemoryPageFile",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_xboxServicesAccessoryManagementServiceStartupMode",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderGuardedFoldersAllowedAppPaths",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardEnableSecureBootWithDMA",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsRemoteShutdown",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderGuardMyFoldersType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsModifyObjectLabels",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientDigestAuthentication",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpV6SourceRoutingProtectionLevel",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIPSecExemptionsAllowICMP",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterHelpPhone",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedExecutableType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_userRightsRegisterProcessAsService",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableFamilyUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceUnencryptedTraffic",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowPrintToLocalPrinters",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockUsersInstallingPrinterDrivers",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableClearTpmUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_windowsLogOnSignInLastInteractiveUserAfterSystemInitiatedRestart",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableHealthUI",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenEnableInShell",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIcmpRedirectsOverrideOspfGeneratedRoutes",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientUnencryptedTraffic",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_xboxServicesLiveNetworkingServiceStartupMode",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientBasicAuthentication",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerHeapTerminationOnCorruption",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLaunchSystemGuard",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderBlockEndUserAccess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDaysBeforeDeletingQuarantinedMalware",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDetectedMalwareActions",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSystemScanSchedule",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderFilesAndFoldersToExclude",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderFileExtensionsToExclude",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanMaxCpu",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderMonitorFileActivity",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPotentiallyUnwantedAppAction",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPotentiallyUnwantedAppActionSetting",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderProcessesToExclude",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPromptForSampleSubmission",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderRequireBehaviorMonitoring",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderRequireCloudProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderRequireNetworkInspectionSystem",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderRequireRealTimeMonitoring",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanArchiveFiles",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanDownloads",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScheduleScanEnableLowCpuPriority",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableCatchupQuickScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableCatchupFullScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanNetworkFiles",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanIncomingMail",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanMappedNetworkDrivesDuringFullScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanRemovableDrivesDuringFullScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanScriptsLoadedInInternetExplorer",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSignatureUpdateIntervalInHours",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScheduledScanTime",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScheduledQuickScanTime",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderCloudBlockLevel",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderCloudExtendedTimeout",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderCloudExtendedTimeoutInSeconds",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderBlockOnAccessProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSubmitSamplesConsentType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_scenarioType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterOrganizationDisplayName",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableEnhancedNotifications",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterDisableNotifications",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterEnableCustomizedToasts",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSecurityCenterEnableInAppCustomization",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIPsecExempt",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainFirewallEnabled",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainStealthModeBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainIncomingTrafficBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainUnicastResponsesToMulticastBroadcastsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainInboundNotificationsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainAuthorizedApplicationRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainGlobalPortRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainConnectionSecurityRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainOutboundConnectionsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainInboundConnectionsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainSecuredPacketExemptionAllowed",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomainPolicyRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicFirewallEnabled",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicStealthModeBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicIncomingTrafficBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicUnicastResponsesToMulticastBroadcastsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicInboundNotificationsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicAuthorizedApplicationRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicGlobalPortRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicConnectionSecurityRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicOutboundConnectionsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicInboundConnectionsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicSecuredPacketExemptionAllowed",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublicPolicyRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateFirewallEnabled",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateStealthModeBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateIncomingTrafficBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateUnicastResponsesToMulticastBroadcastsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateInboundNotificationsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateAuthorizedApplicationRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateGlobalPortRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateConnectionSecurityRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateOutboundConnectionsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateInboundConnectionsBlocked",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivateSecuredPacketExemptionAllowed",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivatePolicyRulesFromGroupPolicyMerged",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardPrintingSettings",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptionMethodByDriveType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivesRecoveryOptions",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivesRequireEncryption",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivesRequireEncryption",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivesMinimumPINLength",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivesRecoveryMessage",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivesRecoveryOptions",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivesRequireStartupAuthentication",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableScanArchiveFiles",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableBehaviorMonitoring",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableCloudProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEnableScanIncomingMail",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEnableScanMappedNetworkDrivesDuringFullScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableScanRemovableDrivesDuringFullScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableScanDownloads",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableIntrusionPreventionSystem",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableOnAccessProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableRealTimeMonitoring",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableScanNetworkFiles",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderDisableScanScriptsLoadedInInternetExplorer",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanMaxCpuPercentage",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderCheckForSignaturesBeforeRunningScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEnableLowCpuPriority",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanDirection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScheduledScanDay",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_assignmentProgress",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanArchiveFiles",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowBehaviorMonitoring",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowCloudProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanRemovableDrivesDuringFullScan",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanDownloads",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowIntrusionPreventionSystem",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowOnAccessProtection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowRealTimeMonitoring",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanNetworkFiles",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanScriptsLoadedInInternetExplorer",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowEndUserAccess",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSignatureUpdateFileSharesSources",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderSignatureUpdateFallbackOrder",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderBlockPersistenceThroughWmiType",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIPSecExemptionsNone",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_storageBlockRemovableStorageWrite",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardAllowCameraMicrophoneRedirection",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardCertificateThumbprints",
        "deviceConfiguration--windows10EndpointProtectionConfiguration_configurationDisableLocalAdminMerge"
    ],
    "constraints": [],
    "dependencies": []
}