{
    "id": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneNavigateWindowsAndFramesAcrossDifferentDomains",
    "valueType": "string",
    "displayName": "Internet Explorer restricted zone navigate windows and frames across different domains",
    "isTopLevel": true,
    "description": "This policy setting allows you to set options for dragging content from one domain to a different domain when the source and destination are in different windows.\r\n\r\nIf you enable this policy setting, users can drag content from one domain to a different domain when the source and destination are in different windows. Users cannot change this setting.\r\n\r\nIf you disable this policy setting, users cannot drag content from one domain to a different domain when both the source and destination are in different windows. Users cannot change this setting.\r\n\r\nIn Internet Explorer 10, if you do not configure this policy setting, users cannot drag content from one domain to a different domain when the source and destination are in different windows. Users can change this setting in the Internet Options dialog.\r\n\r\nIn Internet Explorer 9 and earlier versions, if you do not configure this policy setting, users can drag content from one domain to a different domain when the source and destination are in different windows. Users cannot change this setting.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067050",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
            "values": [
                {
                    "value": "notConfigured",
                    "displayName": "Not configured"
                },
                {
                    "value": "enable",
                    "displayName": "Enable"
                },
                {
                    "value": "prompt",
                    "displayName": "Prompt"
                },
                {
                    "value": "disable",
                    "displayName": "Disable"
                }
            ]
        }
    ],
    "dependencies": []
}