{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkPkcsCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkPkcsCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_certificationAuthorityName",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_rootCertificate",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_certificateTemplateName",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_certificationAuthority",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_certificateStore",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidForWorkPkcsCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}