{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--omaSettingBase64",
    "valueType": "complex",
    "displayName": "Base64",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--omaSettingBase64_displayName",
        "deviceConfiguration--omaSettingBase64_description",
        "deviceConfiguration--omaSettingBase64_omaUri",
        "deviceConfiguration--omaSettingBase64_value",
        "deviceConfiguration--omaSettingBase64_fileName"
    ],
    "constraints": [],
    "dependencies": []
}