{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidCustomConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidCustomConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidCustomConfiguration_omaSettings",
        "deviceConfiguration--androidCustomConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidCustomConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidCustomConfiguration_scenarioType",
        "deviceConfiguration--androidCustomConfiguration_assignmentProgress",
        "deviceConfiguration--androidCustomConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}