{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--appleEventReceiver",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__appleEventReceiver_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--appleEventReceiver_codeRequirement",
        "deviceConfiguration--appleEventReceiver_identifier",
        "deviceConfiguration--appleEventReceiver_identifierType"
    ],
    "constraints": [],
    "dependencies": []
}