{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--macOSPrivacyAccessControlItem_appleEventsAllowedReceivers",
    "valueType": "collection",
    "displayName": "Apple events",
    "isTopLevel": false,
    "description": "Allow the app or process to send a restricted Apple event to another app or process. You will need to know the identifier, identifier type, and code requirement of the receiving app or process.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--macOSAppleEventReceiver",
    "constraints": [],
    "dependencies": []
}