{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsWifiConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsWifiConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsWifiConfiguration_wifiSecurityType",
        "deviceConfiguration--windowsWifiConfiguration_proxyManualPort",
        "deviceConfiguration--windowsWifiConfiguration_connectWhenNetworkNameIsHidden",
        "deviceConfiguration--windowsWifiConfiguration_networkName",
        "deviceConfiguration--windowsWifiConfiguration_meteredConnectionLimit",
        "deviceConfiguration--windowsWifiConfiguration_proxySetting",
        "deviceConfiguration--windowsWifiConfiguration_proxyAutomaticConfigurationUrl",
        "deviceConfiguration--windowsWifiConfiguration_sSID",
        "deviceConfiguration--windowsWifiConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsWifiConfiguration_preSharedKey",
        "deviceConfiguration--windowsWifiConfiguration_connectToPreferredNetwork",
        "deviceConfiguration--windowsWifiConfiguration_connectAutomatically",
        "deviceConfiguration--windowsWifiConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsWifiConfiguration_forceFIPSCompliance",
        "deviceConfiguration--windowsWifiConfiguration_proxyManualAddress",
        "deviceConfiguration--windowsWifiConfiguration_meteredConnectionLimitPcl",
        "deviceConfiguration--windowsWifiConfiguration_assignmentProgress",
        "deviceConfiguration--windowsWifiConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}