{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--partnerAndroidCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__partnerAndroidCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--partnerAndroidCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--partnerAndroidCompliancePolicy_id",
        "deviceConfiguration--partnerAndroidCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--partnerAndroidCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--partnerAndroidCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}