{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--vpnOnDemandRule",
    "valueType": "complex",
    "displayName": "Vpn On Demand Rule",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnOnDemandRule_domains",
        "deviceConfiguration--vpnOnDemandRule_dnsSearchDomains",
        "deviceConfiguration--vpnOnDemandRule_probeRequiredUrl",
        "deviceConfiguration--vpnOnDemandRule_ssids",
        "deviceConfiguration--vpnOnDemandRule_action",
        "deviceConfiguration--vpnOnDemandRule_probeUrl",
        "deviceConfiguration--vpnOnDemandRule_domainAction"
    ],
    "constraints": [],
    "dependencies": []
}