{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--mediaContentRatingNewZealand",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__mediaContentRatingNewZealand_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--mediaContentRatingNewZealand_tVRating",
        "deviceConfiguration--mediaContentRatingNewZealand_movieRating"
    ],
    "constraints": [],
    "dependencies": []
}