{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_preventHardwareDeviceInstallationByDeviceInstanceIdentifiers",
    "valueType": "abstractComplex",
    "displayName": "Block hardware device installation by device instance identifiers",
    "isTopLevel": true,
    "description": "If you enable this policy setting, Windows is prevented from installing a device whose device instance ID appears in the list you create. If you enable this policy setting on a remote desktop server, the policy setting affects redirection of the specified devices from a remote desktop client to the remote desktop server.",
    "placeholderText": null,
    "documentationUrl": "",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--hardwareDeviceInstallationAllowed",
        "deviceConfiguration--hardwareDeviceInstallationBlocked"
    ],
    "constraints": [],
    "dependencies": []
}