{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10VpnProxyServer",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10VpnProxyServer_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10VpnProxyServer_address",
        "deviceConfiguration--windows10VpnProxyServer_port",
        "deviceConfiguration--windows10VpnProxyServer_automaticConfigurationScriptUrl",
        "deviceConfiguration--windows10VpnProxyServer_bypassProxyServerForLocalAddress"
    ],
    "constraints": [],
    "dependencies": []
}