{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--editionUpgradeConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__editionUpgradeConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--editionUpgradeConfiguration_targetEdition",
        "deviceConfiguration--editionUpgradeConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--editionUpgradeConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--editionUpgradeConfiguration_licenseType",
        "deviceConfiguration--editionUpgradeConfiguration_license",
        "deviceConfiguration--editionUpgradeConfiguration_windowsSMode",
        "deviceConfiguration--editionUpgradeConfiguration_productKey",
        "deviceConfiguration--editionUpgradeConfiguration_scenarioType",
        "deviceConfiguration--editionUpgradeConfiguration_switchingPolicy",
        "deviceConfiguration--editionUpgradeConfiguration_assignmentProgress",
        "deviceConfiguration--editionUpgradeConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--editionUpgradeConfiguration_sModeSwitchSetting"
    ],
    "constraints": [],
    "dependencies": []
}