{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10EasEmailProfileConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10EasEmailProfileConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10EasEmailProfileConfiguration_syncContacts",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_customDomainName",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_userDomainNameSource",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_emailSyncSchedule",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_syncTasks",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_usernameSource",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_accountName",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_hostName",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_emailAddressSource",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_requireSsl",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_durationOfEmailToSync",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_syncCalendar",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_usernameAADSource",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_assignmentProgress",
        "deviceConfiguration--windows10EasEmailProfileConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}