{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windowsDeliveryOptimizationConfiguration_maximumCacheSize",
    "valueType": "abstractComplex",
    "displayName": "Maximum cache size type",
    "isTopLevel": true,
    "description": "The maximum cache size that Delivery Optimization can utilize as a either a percentage of disk size, or absolute value (in GB).",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--deliveryOptimizationMaxCacheSizeAbsolute",
        "deviceConfiguration--deliveryOptimizationMaxCacheSizePercentage"
    ],
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--windowsDeliveryOptimizationConfiguration_deliveryOptimizationMode",
            "constraints": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
                    "values": [
                        {
                            "value": "userDefined",
                            "displayName": null
                        },
                        {
                            "value": "httpOnly",
                            "displayName": null
                        },
                        {
                            "value": "httpWithPeeringNat",
                            "displayName": null
                        },
                        {
                            "value": "httpWithPeeringPrivateGroup",
                            "displayName": null
                        },
                        {
                            "value": "httpWithInternetPeering",
                            "displayName": null
                        },
                        {
                            "value": "simpleDownload",
                            "displayName": null
                        }
                    ]
                }
            ]
        }
    ]
}