{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSEndpointProtectionConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__macOSEndpointProtectionConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultEnabled",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultPersonalRecoveryKeyRotationInMonths",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_firewallEnabled",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_gatekeeperAllowedAppSource",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_gatekeeperBlockOverride",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_firewallBlockAllIncoming",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultInstitutionalRecoveryKeyCertificate",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_firewallApplications",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_firewallEnableStealthMode",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultDisablePromptAtSignOut",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultSelectedRecoveryKeyTypes",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultInstitutionalRecoveryKeyCertificateFileName",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultAllowDeferralUntilSignOut",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultNumberOfTimesUserCanIgnore",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultPersonalRecoveryKeyHelpMessage",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_scenarioType",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_assignmentProgress",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultHidePersonalRecoveryKey",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_fileVaultForceReEncryption",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionRealTime",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionCloudDelivered",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionAutomaticSampleSubmission",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionDiagnosticDataCollection",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionExcludedFolders",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionExcludedFiles",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionExcludedExtensions",
        "deviceConfiguration--macOSEndpointProtectionConfiguration_advancedThreatProtectionExcludedProcesses"
    ],
    "constraints": [],
    "dependencies": []
}