{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSScepCertificateProfile_rootCertificate",
    "valueType": "complex",
    "displayName": "Root certificate",
    "isTopLevel": true,
    "description": "Root certificate",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSTrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--macOSTrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--macOSTrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--macOSTrustedRootCertificate_certFileName",
        "deviceConfiguration--macOSTrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--macOSTrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}