{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskAzureADUser",
    "valueType": "complex",
    "displayName": "AAD User",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskAzureADUser_userPrincipalName",
        "deviceConfiguration--windowsKioskAzureADUser_userId"
    ],
    "constraints": [],
    "dependencies": []
}