{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows81TrustedRootCertificate",
    "valueType": "complex",
    "displayName": "Windows81 Trusted Root Certificate",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81TrustedRootCertificate_certFileName",
        "deviceConfiguration--windows81TrustedRootCertificate_destinationStore",
        "deviceConfiguration--windows81TrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows81TrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows81TrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--windows81TrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--windows81TrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}