{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--iOSEasEmailProfileConfiguration_smimeEncryptionCertificate",
    "valueType": "abstractComplex",
    "displayName": "SMIME encryption certificate",
    "isTopLevel": true,
    "description": "SMIME encryption certificate",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--iOSImportedPFXCertificateProfile",
        "deviceConfiguration--iOSPkcsCertificateProfile",
        "deviceConfiguration--iOSScepCertificateProfile"
    ],
    "constraints": [],
    "dependencies": []
}