{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--credentialSingleSignOnExtension_domains",
    "valueType": "collection",
    "displayName": "Domains",
    "isTopLevel": false,
    "description": "The domain or host names that can authenticate through SSO. Matched case-insensitively and all domain/host names of all installed SSO app extension profiles must be unique.",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--credentialSingleSignOnExtension_domains_element",
    "constraints": [],
    "dependencies": []
}