{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskAppBase",
    "valueType": "abstractComplex",
    "displayName": "App Base",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--windowsKioskUWPApp",
        "deviceConfiguration--windowsKioskDesktopApp"
    ],
    "constraints": [],
    "dependencies": []
}