{
    "id": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLogonOptions",
    "valueType": "string",
    "displayName": "Internet Explorer restricted zone logon options",
    "isTopLevel": true,
    "description": "This policy setting allows you to manage settings for logon options.\r\n\r\nAnonymous logon to disable HTTP authentication and use the guest account only for the Common Internet File System (CIFS) protocol.\r\n\r\nPrompt for user name and password to query users for user IDs and passwords. After a user is queried, these values can be used silently for the remainder of the session.\r\n\r\nAutomatic logon only in Intranet zone to query users for user IDs and passwords in other zones. After a user is queried, these values can be used silently for the remainder of the session.\r\n\r\nAutomatic logon with current user name and password to attempt logon using Windows NT Challenge Response (also known as NTLM authentication). If Windows NT Challenge Response is supported by the server, the logon uses the user's network user name and password for logon. If Windows NT Challenge Response is not supported by the server, the user is queried to provide the user name and password.\r\n\r\nIf you do not configure this policy setting, logon is set to Prompt for username and password.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2067110",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "constraints": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementEnumConstraint",
            "values": [
                {
                    "value": "notConfigured",
                    "displayName": "Not configured"
                },
                {
                    "value": "automaticWithCurrentUsernameAndPassword",
                    "displayName": "Automatic with current user name and password"
                },
                {
                    "value": "automaticOnlyInIntranetZone",
                    "displayName": "Automatic only in Intranet zone"
                },
                {
                    "value": "prompt",
                    "displayName": "Prompt"
                },
                {
                    "value": "anonymous",
                    "displayName": "Anonymous"
                }
            ]
        }
    ],
    "dependencies": []
}