{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--appleAppListItem",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__appleAppListItem_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--appleAppListItem_appId",
        "deviceConfiguration--appleAppListItem_name",
        "deviceConfiguration--appleAppListItem_publisher",
        "deviceConfiguration--appleAppListItem_appStoreUrl"
    ],
    "constraints": [],
    "dependencies": []
}