{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--vpnDnsRule",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__vpnDnsRule_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnDnsRule_proxyServerUri",
        "deviceConfiguration--vpnDnsRule_persistent",
        "deviceConfiguration--vpnDnsRule_autoTrigger",
        "deviceConfiguration--vpnDnsRule_servers",
        "deviceConfiguration--vpnDnsRule_name"
    ],
    "constraints": [],
    "dependencies": []
}