{
    "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_edgeHomeButtonConfiguration",
    "valueType": "abstractComplex",
    "displayName": "Select home button configuration",
    "isTopLevel": true,
    "description": "Select a home button configuration",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "implementations": [
        "deviceConfiguration--edgeHomeButtonHidden",
        "deviceConfiguration--edgeHomeButtonLoadsStartPage",
        "deviceConfiguration--edgeHomeButtonOpensCustomURL",
        "deviceConfiguration--edgeHomeButtonOpensNewTab"
    ],
    "constraints": [],
    "dependencies": [
        {
            "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeHomeButtonConfigurationEnabled",
            "constraints": []
        }
    ]
}