{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--macOSLaunchItem",
    "valueType": "complex",
    "displayName": "macOS launch item",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--macOSLaunchItem_path",
        "deviceConfiguration--macOSLaunchItem_hide"
    ],
    "constraints": [],
    "dependencies": []
}