{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--partnerIOSCompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__partnerIOSCompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--partnerIOSCompliancePolicy_id",
        "deviceConfiguration--partnerIOSCompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--partnerIOSCompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--partnerIOSCompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--partnerIOSCompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}