{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows10VpnConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows10VpnConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows10VpnConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows10VpnConfiguration_authenticationMethod",
        "deviceConfiguration--windows10VpnConfiguration_onlyAssociatedAppsCanUseConnection",
        "deviceConfiguration--windows10VpnConfiguration_rememberUserCredentials",
        "deviceConfiguration--windows10VpnConfiguration_dnsSuffixes",
        "deviceConfiguration--windows10VpnConfiguration_singleSignOnIssuerHash",
        "deviceConfiguration--windows10VpnConfiguration_trafficRules",
        "deviceConfiguration--windows10VpnConfiguration_profileTarget",
        "deviceConfiguration--windows10VpnConfiguration_customXml",
        "deviceConfiguration--windows10VpnConfiguration_enableDnsRegistration",
        "deviceConfiguration--windows10VpnConfiguration_enableDeviceTunnel",
        "deviceConfiguration--windows10VpnConfiguration_enableSingleSignOnWithAlternateCertificate",
        "deviceConfiguration--windows10VpnConfiguration_windowsInformationProtectionDomain",
        "deviceConfiguration--windows10VpnConfiguration_associatedApps",
        "deviceConfiguration--windows10VpnConfiguration_identityCertificate",
        "deviceConfiguration--windows10VpnConfiguration_enableSplitTunneling",
        "deviceConfiguration--windows10VpnConfiguration_servers",
        "deviceConfiguration--windows10VpnConfiguration_proxyServer",
        "deviceConfiguration--windows10VpnConfiguration_dnsRules",
        "deviceConfiguration--windows10VpnConfiguration_connectionName",
        "deviceConfiguration--windows10VpnConfiguration_eapXml",
        "deviceConfiguration--windows10VpnConfiguration_enableAlwaysOn",
        "deviceConfiguration--windows10VpnConfiguration_connectionType",
        "deviceConfiguration--windows10VpnConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windows10VpnConfiguration_routes",
        "deviceConfiguration--windows10VpnConfiguration_enableConditionalAccess",
        "deviceConfiguration--windows10VpnConfiguration_singleSignOnEku",
        "deviceConfiguration--windows10VpnConfiguration_trustedNetworkDomains",
        "deviceConfiguration--windows10VpnConfiguration_assignmentProgress",
        "deviceConfiguration--windows10VpnConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}