{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--vpnProxyServer",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__vpnProxyServer_DisplayName",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--vpnProxyServer_address",
        "deviceConfiguration--vpnProxyServer_automaticConfigurationScriptUrl",
        "deviceConfiguration--vpnProxyServer_port"
    ],
    "constraints": [],
    "dependencies": []
}