{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidForWorkScepCertificateProfile",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidForWorkScepCertificateProfile_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidForWorkScepCertificateProfile_certificateValidityPeriodScale",
        "deviceConfiguration--androidForWorkScepCertificateProfile_certificateValidityPeriodValue",
        "deviceConfiguration--androidForWorkScepCertificateProfile_extendedKeyUsages",
        "deviceConfiguration--androidForWorkScepCertificateProfile_customSubjectAlternativeNames",
        "deviceConfiguration--androidForWorkScepCertificateProfile_keyUsage",
        "deviceConfiguration--androidForWorkScepCertificateProfile_keySize",
        "deviceConfiguration--androidForWorkScepCertificateProfile_certificateStore",
        "deviceConfiguration--androidForWorkScepCertificateProfile_hashAlgorithm",
        "deviceConfiguration--androidForWorkScepCertificateProfile_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--androidForWorkScepCertificateProfile_renewalThresholdPercentage",
        "deviceConfiguration--androidForWorkScepCertificateProfile_rootCertificate",
        "deviceConfiguration--androidForWorkScepCertificateProfile_subjectNameFormatString",
        "deviceConfiguration--androidForWorkScepCertificateProfile_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidForWorkScepCertificateProfile_subjectAlternativeNameType",
        "deviceConfiguration--androidForWorkScepCertificateProfile_scepServerUrls",
        "deviceConfiguration--androidForWorkScepCertificateProfile_subjectNameFormat",
        "deviceConfiguration--androidForWorkScepCertificateProfile_subjectAlternativeNameFormatString",
        "deviceConfiguration--androidForWorkScepCertificateProfile_assignmentProgress",
        "deviceConfiguration--androidForWorkScepCertificateProfile_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}