{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidWorkProfileEnterpriseWiFiConfiguration_rootCertificateForServerValidation",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__androidWorkProfileEnterpriseWiFiConfiguration_rootCertificateForServerValidation_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_trustedRootCertificate",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_certFileName",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_assignmentProgress",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--androidWorkProfileTrustedRootCertificate_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}