{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_defenderFileExtensionsToExclude",
    "valueType": "collection",
    "displayName": "Defender file extensions to exclude",
    "isTopLevel": true,
    "description": "Defender file extensions to exclude",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderFileExtensionsToExclude_element",
    "constraints": [],
    "dependencies": []
}