{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardCertificateThumbprints",
    "valueType": "collection",
    "displayName": "Application Guard allow use of Root Certificate Authorities from the user's device",
    "isTopLevel": true,
    "description": "If configured, certificates with a thumbprint matching the ones specified will be transferred into the Microsoft Defender Application Guard container. Multiple certificates can be specified by using a comma to separate the thumbprints for each certificate you want to transfer. Example:  b4e72779a8a362c860c36a6461f31e3aa7e58c14,1b1d49f06d2a697a544a1059bd59a7b058cda924\r\n\r\nIf not configured, certificates are not shared with the Microsoft Defender Application Guard container.",
    "placeholderText": null,
    "documentationUrl": "https://go.microsoft.com/fwlink/?linkid=2148614",
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_applicationGuardCertificateThumbprints_element",
    "constraints": [],
    "dependencies": []
}