{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windows81CompliancePolicy",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windows81CompliancePolicy_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windows81CompliancePolicy_passwordRequired",
        "deviceConfiguration--windows81CompliancePolicy_id",
        "deviceConfiguration--windows81CompliancePolicy_configurationManagerComplianceRequired",
        "deviceConfiguration--windows81CompliancePolicy_passwordExpirationDays",
        "deviceConfiguration--windows81CompliancePolicy_passwordPreviousPasswordBlockCount",
        "deviceConfiguration--windows81CompliancePolicy_passwordBlockSimple",
        "deviceConfiguration--windows81CompliancePolicy_storageRequireEncryption",
        "deviceConfiguration--windows81CompliancePolicy_passwordMinimumLength",
        "deviceConfiguration--windows81CompliancePolicy_scheduledActionsForRule",
        "deviceConfiguration--windows81CompliancePolicy_passwordMinimumCharacterSetCount",
        "deviceConfiguration--windows81CompliancePolicy_passwordRequiredType",
        "deviceConfiguration--windows81CompliancePolicy_passwordMinutesOfInactivityBeforeLock",
        "deviceConfiguration--windows81CompliancePolicy_osMinimumVersion",
        "deviceConfiguration--windows81CompliancePolicy_osMaximumVersion",
        "deviceConfiguration--windows81CompliancePolicy_minimumUpdateAutoInstallClassification",
        "deviceConfiguration--windows81CompliancePolicy_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windows81CompliancePolicy_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--windows81CompliancePolicy_deviceManagementApplicabilityRuleDeviceMode"
    ],
    "constraints": [],
    "dependencies": []
}