{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSDeviceFeaturesConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__iOSDeviceFeaturesConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_wallpaperDisplayLocation",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_contentFilterSettings",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_airPrintDestinations",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_wallpaperImage",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_notificationSettings",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_singleSignOnExtension",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_singleSignOnSettings",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_lockScreenFootnote",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_identityCertificateForClientAuthentication",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_homeScreenDockIcons",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_assetTagTemplate",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_homeScreenPages",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_singleSignOnExtensionPkinitCertificate",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_scenarioType",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_assignmentProgress",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_deviceManagementApplicabilityRuleOsVersion",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_iOSSingleSignOnExtension",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_identityCertificateForClientAuthenticationId",
        "deviceConfiguration--iOSDeviceFeaturesConfiguration_singleSignOnExtensionPkinitCertificateId"
    ],
    "constraints": [],
    "dependencies": []
}