{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsKioskSingleUWPApp_uWPApp",
    "valueType": "complex",
    "displayName": "UWP App",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsKioskUWPApp_name",
        "deviceConfiguration--windowsKioskUWPApp_appType",
        "deviceConfiguration--windowsKioskUWPApp_appUserModelId",
        "deviceConfiguration--windowsKioskUWPApp_autoLaunch",
        "deviceConfiguration--windowsKioskUWPApp_appId",
        "deviceConfiguration--windowsKioskUWPApp_startLayoutTileSize",
        "deviceConfiguration--windowsKioskUWPApp_containedAppId"
    ],
    "constraints": [],
    "dependencies": []
}