{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--iOSHomeScreenPage",
    "valueType": "complex",
    "displayName": "List of pages",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--iOSHomeScreenPage_icons",
        "deviceConfiguration--iOSHomeScreenPage_displayName"
    ],
    "constraints": [],
    "dependencies": []
}