{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--iOSEducationDeviceConfiguration_studentRootCertificates",
    "valueType": "collection",
    "displayName": "Student root certificates",
    "isTopLevel": true,
    "description": "Student root certificates",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--iOSTrustedRootCertificate",
    "constraints": [],
    "dependencies": []
}