{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_edgeHomepageUrls",
    "valueType": "collection",
    "displayName": "Start pages",
    "isTopLevel": true,
    "description": "List of URLs that specify home pages for MDM-enrolled devices (Desktop only).",
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeHomepageUrls_element",
    "constraints": [],
    "dependencies": []
}