{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--windowsHealthMonitoringConfiguration",
    "valueType": "complex",
    "displayName": "LOC NEEDED: deviceConfiguration__windowsHealthMonitoringConfiguration_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--windowsHealthMonitoringConfiguration_allowDeviceHealthMonitoring",
        "deviceConfiguration--windowsHealthMonitoringConfiguration_deviceManagementApplicabilityRuleOsEdition",
        "deviceConfiguration--windowsHealthMonitoringConfiguration_deviceManagementApplicabilityRuleDeviceMode",
        "deviceConfiguration--windowsHealthMonitoringConfiguration_configDeviceHealthMonitoringScope",
        "deviceConfiguration--windowsHealthMonitoringConfiguration_configDeviceHealthMonitoringCustomScope",
        "deviceConfiguration--windowsHealthMonitoringConfiguration_scenarioType",
        "deviceConfiguration--windowsHealthMonitoringConfiguration_assignmentProgress",
        "deviceConfiguration--windowsHealthMonitoringConfiguration_deviceManagementApplicabilityRuleOsVersion"
    ],
    "constraints": [],
    "dependencies": []
}