{
    "@odata.type": "#microsoft.graph.deviceManagementComplexSettingDefinition",
    "id": "deviceConfiguration--androidDeviceOwnerGlobalProxyAutoConfig",
    "valueType": "complex",
    "displayName": "Proxy Auto-Config",
    "isTopLevel": false,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "propertyDefinitionIds": [
        "deviceConfiguration--androidDeviceOwnerGlobalProxyAutoConfig_proxyAutoConfigURL"
    ],
    "constraints": [],
    "dependencies": []
}