{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "deviceConfiguration--windows10GeneralConfiguration_defenderProcessesToExclude",
    "valueType": "collection",
    "displayName": "Processes to exclude from scans and real-time protection",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderProcessesToExclude_element",
    "constraints": [],
    "dependencies": []
}