{
    "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingDefinition",
    "id": "managedApplication--intuneApplication_applicationIds",
    "valueType": "collection",
    "displayName": "LOC NEEDED: managedApplication__intuneApplication_applicationIds_DisplayName",
    "isTopLevel": true,
    "description": null,
    "placeholderText": null,
    "documentationUrl": null,
    "headerTitle": null,
    "headerSubtitle": null,
    "keywords": [
        ""
    ],
    "elementDefinitionId": "managedApplication--intuneApplication_applicationId",
    "constraints": [],
    "dependencies": []
}