{
    "id": "8c8b803f-96e1-4129-9349-20738d9f9652",
    "assignmentMode": "allowed",
    "categories": "collaboration",
    "description": "Perform all migration functionality to migrate content to Microsoft 365 using Migration Manager.",
    "displayName": "Microsoft 365 Migration Administrator",
    "isBuiltIn": true,
    "isEnabled": true,
    "isPrivileged": false,
    "resourceScopes": [
        "/"
    ],
    "richDescription": "Assign the Microsoft 365 Migration Administrator role to users who need to do the following tasks:\n* Use Migration Manager in the Microsoft 365 admin center to manage content migration to Microsoft 365, including Teams, OneDrive for Business, and SharePoint sites, from Google Drive, Dropbox, Box, and Egnyte\n* Select migration sources, create migration inventories (such as Google Drive user lists), schedule and execute migrations, and download reports\n* Create new SharePoint sites if the destination sites don't already exist, create SharePoint lists under the SharePoint admin sites, and create and update items in SharePoint lists\n* Manage migration project settings and migration lifecycle for tasks\n* Manage permission mappings from source to destination\n**Note**: This role doesn't allow you to access Migration Manager from the SharePoint admin center. You can use the SharePoint Administrator role to migrate from network file shares.",
    "templateId": "8c8b803f-96e1-4129-9349-20738d9f9652",
    "version": "1",
    "rolePermissions": [
        {
            "allowedResourceActions": [
                "microsoft.office365.migrations/allEntities/allProperties/allTasks",
                "microsoft.office365.supportTickets/allEntities/allTasks",
                "microsoft.office365.webPortal/allEntities/standard/read"
            ],
            "condition": null
        }
    ],
    "inheritsPermissionsFrom@odata.context": "https://graph.microsoft.com/beta/$metadata#roleManagement/directory/roleDefinitions('8c8b803f-96e1-4129-9349-20738d9f9652')/inheritsPermissionsFrom",
    "inheritsPermissionsFrom": []
}