{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Global Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": ".GlobalPreferences",
    "rootDefinitionId": ".globalpreferences_.globalpreferences",
    "categoryId": "1829cdc1-1bed-4058-9aba-9b778cd3d955",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": ".globalpreferences_.globalpreferences",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": ".GlobalPreferences",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        ".globalpreferences_multiplesessionenabled",
        ".globalpreferences_com.apple.autologout.autologoutdelay"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": ".globalpreferences_multiplesessionenabled",
            "required": false
        },
        {
            "dependedOnBy": ".globalpreferences_com.apple.autologout.autologoutdelay",
            "required": false
        }
    ]
}