{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Global Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.autologout.AutoLogOutDelay",
    "rootDefinitionId": ".globalpreferences_.globalpreferences",
    "categoryId": "1829cdc1-1bed-4058-9aba-9b778cd3d955",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": ".globalpreferences_com.apple.autologout.autologoutdelay",
    "description": "The autologout delay, in seconds. A value of 0 means autologout is off. In some cases, this delay may be restricted to values between 5 minutes and 24 hours.",
    "helpText": null,
    "name": "com.apple.autologout.AutoLogOutDelay",
    "displayName": "Auto Log Out Delay",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": ".globalpreferences_.globalpreferences",
            "parentSettingId": ".globalpreferences_.globalpreferences"
        }
    ],
    "dependedOnBy": []
}