{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/deviceNameTemplate",
    "rootDefinitionId": "ade_devicenametemplatechoices",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "ade_appledevicenametemplate",
    "description": "Create a unique name for your devices. Names must be 63 characters or less, and can contain letters (a-z, A-Z), numbers (0-9), and hyphens.Variables supported: {{SERIAL}}, {{DEVICETYPE}}",
    "helpText": "{{DEVICETYPE}}-{{SERIAL}}",
    "name": "DeivceNameTemplate",
    "displayName": "Device name template",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "regEx",
        "inputValidationSchema": "^[a-zA-Z0-9-._{}]*$",
        "maximumLength": 63,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": "{{DEVICETYPE}}-{{SERIAL}}"
    },
    "dependentOn": [
        {
            "dependentOn": "ade_devicenametemplatechoices_1",
            "parentSettingId": "ade_devicenametemplatechoices"
        }
    ],
    "dependedOnBy": []
}