{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ADE profile",
        "enrollment",
        "Management settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/ade",
    "offsetUri": "/maximumSecondsInactivityUntilUserLogsOut",
    "rootDefinitionId": "ade_useraffinity",
    "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "ade_maximumsecondsinactivityuntiluserlogsout",
    "description": "Available for devices running iPadOS versions 14.5 and later. Enter a value in seconds (minimum value to add is 30 seconds). If there isn't any activity after the value you enter, the user session automatically signs out. If you set the value to anything between 0-29, then the user session stays signed in.",
    "helpText": "Enter value",
    "name": "MaximumSecondsInactivityUntilUserLogsOut",
    "displayName": "Maximum seconds of inactivity until user session logs out",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "enrollment"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 14400,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "ade_requiresharedipadtemporarysessiononly_0",
            "parentSettingId": "ade_requiresharedipadtemporarysessiononly"
        }
    ],
    "dependedOnBy": []
}