{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Custom Profile"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AppleCustomProfile/Profile",
    "rootDefinitionId": "apple_customprofile_profile",
    "categoryId": "ddb64e9d-34b9-44f4-9980-a6623f14e445",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "apple_customprofile_profile",
    "description": "A admin uploaded profile to install.",
    "helpText": null,
    "name": "Apple_CustomProfile_Profile",
    "displayName": "Profile",
    "applicability": {
        "description": null,
        "platform": "visionOS,tvOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [
        {
            "settingDefinitionId": "apple_customprofile_profile_referred_setting"
        }
    ],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "base64",
        "inputValidationSchema": null,
        "maximumLength": 2147483647,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": [
            "mobileconfig",
            "plist",
            "xml",
            "txt"
        ]
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}