{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Audio Accessory"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "TemporaryPairing/Configuration",
    "rootDefinitionId": "audioaccessory_audioaccessory",
    "categoryId": "a42e2248-d2dc-4476-a92d-d152fd67e04b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "audioaccessory_temporarypairing_configuration",
    "description": "A dictionary providing configuration for temporary pairing. Required if `Disabled` isn't present or is `false`.",
    "helpText": null,
    "name": "TemporaryPairing_Configuration",
    "displayName": "Configuration",
    "childIds": [
        "audioaccessory_temporarypairing_configuration_unpairingtime"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "audioaccessory_temporarypairing",
            "parentSettingId": "audioaccessory_temporarypairing"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "audioaccessory_temporarypairing_configuration_unpairingtime",
            "required": true
        }
    ]
}