{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Audio Accessory"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "TemporaryPairing/Configuration/UnpairingTime",
    "rootDefinitionId": "audioaccessory_audioaccessory",
    "categoryId": "a42e2248-d2dc-4476-a92d-d152fd67e04b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "audioaccessory_temporarypairing_configuration_unpairingtime",
    "description": "A dictionary that describes when the device automatically unpairs temporarily paired audio accessories.",
    "helpText": null,
    "name": "TemporaryPairing_Configuration_UnpairingTime",
    "displayName": "Unpairing Time",
    "childIds": [
        "audioaccessory_temporarypairing_configuration_unpairingtime_policy",
        "audioaccessory_temporarypairing_configuration_unpairingtime_hour"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "audioaccessory_temporarypairing_configuration",
            "parentSettingId": "audioaccessory_temporarypairing_configuration"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "audioaccessory_temporarypairing_configuration_unpairingtime_policy",
            "required": true
        },
        {
            "dependedOnBy": "audioaccessory_temporarypairing_configuration_unpairingtime_hour",
            "required": false
        }
    ]
}