{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Audio Accessory"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.configuration.audio-accessory.settings",
    "rootDefinitionId": "audioaccessory_audioaccessory",
    "categoryId": "a42e2248-d2dc-4476-a92d-d152fd67e04b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "audioaccessory_audioaccessory",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.configuration.audio-accessory.settings",
    "displayName": "com.apple.configuration.audio-accessory.settings",
    "childIds": [
        "audioaccessory_temporarypairing"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "audioaccessory_temporarypairing",
            "required": false
        }
    ]
}