{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Audio Accessory"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "TemporaryPairing",
    "rootDefinitionId": "audioaccessory_audioaccessory",
    "categoryId": "a42e2248-d2dc-4476-a92d-d152fd67e04b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "audioaccessory_temporarypairing",
    "description": "A dictionary that describes audio accessory temporary pairing behavior. The device enables temporary pairing when this key is present and the `Disabled` key isn't `false`. The device doesn't synchronize pairing information with iCloud when temporary pairing is active.",
    "helpText": null,
    "name": "TemporaryPairing",
    "displayName": "Temporary Pairing",
    "childIds": [
        "audioaccessory_temporarypairing_disabled",
        "audioaccessory_temporarypairing_configuration"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "audioaccessory_audioaccessory",
            "parentSettingId": "audioaccessory_audioaccessory"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "audioaccessory_temporarypairing_disabled",
            "required": false
        },
        {
            "dependedOnBy": "audioaccessory_temporarypairing_configuration",
            "required": false
        }
    ]
}