{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Notifications"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "NotificationSettings/[{0}]/GroupingType",
    "rootDefinitionId": "com.apple.notificationsettings_com.apple.notificationsettings",
    "categoryId": "ff90bf4b-0583-4761-a1c4-5aa4b50c5872",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.notificationsettings_notificationsettings_item_groupingtype",
    "description": "The type of grouping for notifications for this app. Available in iOS 12 and later.",
    "helpText": null,
    "name": "NotificationSettings_item_GroupingType",
    "displayName": "Grouping Type",
    "defaultOptionId": "com.apple.notificationsettings_notificationsettings_item_groupingtype_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.notificationsettings_notificationsettings_item_groupingtype_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "Automatic: Group notifications into app-specified groups",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.notificationsettings_notificationsettings",
                    "parentSettingId": "com.apple.notificationsettings_notificationsettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.notificationsettings_notificationsettings_item_groupingtype_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "By app: Group notifications into one group",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.notificationsettings_notificationsettings",
                    "parentSettingId": "com.apple.notificationsettings_notificationsettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.notificationsettings_notificationsettings_item_groupingtype_2",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "Off: Don't group notifications",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.notificationsettings_notificationsettings",
                    "parentSettingId": "com.apple.notificationsettings_notificationsettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}