{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SmartScreen settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.ExemptSmartScreenDownloadWarnings",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.exemptsmartscreendownloadwarnings",
    "categoryId": "08c5f391-e156-4a72-bbb9-3670f2f63a56",
    "settingUsage": "configuration",
    "uxBehavior": "largeTextBox",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.exemptsmartscreendownloadwarnings",
    "description": "You can enable this policy to create a dictionary of file type extensions with a corresponding list of domains that are exempted from SmartScreen AppRep warnings. For example, if the `vbe` extension is associated with \"contoso.com,\" users wouldn't see a SmartScreen AppRep warning when downloading `vbe` files from \"contoso.com.\" They might, however, see a download warning when downloading `vbe` files from \"fabrikam.com.\"\n\nFiles with file type extensions specified for domains identified by this policy are still subject to file type extension-based security warnings and mixed-content download warnings.\n\nIf you disable this policy or don't configure it, files that trigger SmartScreen AppRep download warnings show warnings to the user.\n\nIf you enable this policy:\n\n* The URL pattern should be formatted according to <a href=\"https://go.microsoft.com/fwlink/?linkid=2095322\">https://go.microsoft.com/fwlink/?linkid=2095322</a>.\n* The file type extension entered must be in lower-cased ASCII. The leading separator shouldn't be included when listing the file type extension, so `vbe` should be used instead of `.vbe`.\n\nExample:\n\nThe following example would prevent SmartScreen AppRep warnings on msi, exe, and vbe extensions for *.contoso.com domains. It might show the user a SmartScreen AppRep warning on any other domain for exe and msi files, but not for vbe files.\n\n[\n  { \"file_extension\": \"msi\", \"domains\": [\"contoso.com\"] },\n  { \"file_extension\": \"exe\", \"domains\": [\"contoso.com\"] },\n  { \"file_extension\": \"vbe\", \"domains\": [\"*\"] }\n]\n\nNote: While the preceding example shows the suppression of SmartScreen AppRep download warnings for `vbe` files for all domains, applying suppression of such warnings for all domains isn't recommended due to security concerns. The ability to suppress warnings for all domains is shown in the example merely to demonstrate the ability to do so.",
    "helpText": null,
    "name": "ExemptSmartScreenDownloadWarnings",
    "displayName": "Disable SmartScreen AppRep based warnings for specified file types on specified domains",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}