{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Time Limits"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "time-limits/weekend-curfew/enabled",
    "rootDefinitionId": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
    "categoryId": "f71e7e3a-482a-4760-b7f9-0403b2b6f7d8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_enabled",
    "description": "If true, enable these settings. ",
    "helpText": null,
    "name": "time-limits_weekend-curfew_enabled",
    "displayName": "Enabled",
    "defaultOptionId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_enabled_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_enabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew",
                    "parentSettingId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_enabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew",
                    "parentSettingId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew"
                }
            ],
            "dependedOnBy": []
        }
    ]
}