{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Sleeping Tabs settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.SleepingTabsTimeout_recommended",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended",
    "categoryId": "ae78ab75-2d0d-418c-be6f-9e64642de4e2",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended",
    "description": "This policy setting lets you configure the timeout, in seconds, after which inactive background tabs will be automatically put to sleep if sleeping tabs is enabled. By default, this timeout is 7,200 seconds (2 hours).\n\nTabs are only put to sleep automatically when the policy \"SleepingTabsEnabled\" is enabled or is not configured and the user has enabled the sleeping tabs setting.\n\nIf you don't configure this policy, users can choose the timeout value.\n\nPolicy options mapping:\n\n* 30Seconds (30) = 30 seconds of inactivity\n\n* 5Minutes (300) = 5 minutes of inactivity\n\n* 15Minutes (900) = 15 minutes of inactivity\n\n* 30Minutes (1800) = 30 minutes of inactivity\n\n* 1Hour (3600) = 1 hour of inactivity\n\n* 2Hours (7200) = 2 hours of inactivity\n\n* 3Hours (10800) = 3 hours of inactivity\n\n* 6Hours (21600) = 6 hours of inactivity\n\n* 12Hours (43200) = 12 hours of inactivity\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "SleepingTabsTimeout_recommended",
    "displayName": "Set the background tab inactivity timeout for sleeping tabs (users can override)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_30seconds",
            "description": null,
            "helpText": null,
            "name": "30 seconds of inactivity",
            "displayName": "30 seconds of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 30
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_5minutes",
            "description": null,
            "helpText": null,
            "name": "5 minutes of inactivity",
            "displayName": "5 minutes of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 300
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_15minutes",
            "description": null,
            "helpText": null,
            "name": "15 minutes of inactivity",
            "displayName": "15 minutes of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 900
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_30minutes",
            "description": null,
            "helpText": null,
            "name": "30 minutes of inactivity",
            "displayName": "30 minutes of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1800
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_1hour",
            "description": null,
            "helpText": null,
            "name": "1 hour of inactivity",
            "displayName": "1 hour of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3600
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_2hours",
            "description": null,
            "helpText": null,
            "name": "2 hours of inactivity",
            "displayName": "2 hours of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 7200
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_3hours",
            "description": null,
            "helpText": null,
            "name": "3 hours of inactivity",
            "displayName": "3 hours of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 10800
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_6hours",
            "description": null,
            "helpText": null,
            "name": "6 hours of inactivity",
            "displayName": "6 hours of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 21600
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.sleepingtabstimeout_recommended_12hours",
            "description": null,
            "helpText": null,
            "name": "12 hours of inactivity",
            "displayName": "12 hours of inactivity",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 43200
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}