{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password",
        "Passcode",
        "Password type",
        "Password required type",
        "Android Enterprise",
        "Device password"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/mem/intune/configuration/device-restrictions-android-for-work?WT.mc_id=Portal-fx#device-password"
    ],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/passwordRequiredType/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.passwordrequiredtype",
    "categoryId": "f350f9a2-3a91-4d6d-90ed-7e3849b0d5f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.passwordrequiredtype",
    "description": "Set the password’s complexity requirements. Additional password requirements will become available based on your selection. Available for fully managed, dedicated and corporate-owned work profile devices (at work profile level). For more details, see the information provided in the ‘Learn More’ section below.",
    "helpText": "",
    "name": "PasswordRequiredType",
    "displayName": "Required password type",
    "defaultOptionId": "com.android.devicerestrictionpolicy.passwordrequiredtype_devicedefault",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_devicedefault",
            "description": "Device default value, no intent.",
            "helpText": null,
            "name": "PASSWORD_QUALITY_UNSPECIFIED",
            "displayName": "Device default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "PASSWORD_QUALITY_UNSPECIFIED"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_required",
            "description": "There must be a password set, but there are no restrictions on type.",
            "helpText": null,
            "name": "SOMETHING",
            "displayName": "Password required, no restrictions",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "SOMETHING"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_lowsecuritybiometric",
            "description": "Low security biometrics based password required.",
            "helpText": null,
            "name": "BIOMETRIC_WEAK",
            "displayName": "Weak Biometric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "BIOMETRIC_WEAK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_numeric",
            "description": "At least numeric.",
            "helpText": null,
            "name": "NUMERIC",
            "displayName": "Numeric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NUMERIC"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_numericcomplex",
            "description": "At least numeric with no repeating or ordered sequences.",
            "helpText": null,
            "name": "NUMERIC_COMPLEX",
            "displayName": "Numeric Complex",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NUMERIC_COMPLEX"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_alphabetic",
            "description": "At least alphabetic password.",
            "helpText": null,
            "name": "ALPHABETIC",
            "displayName": "Alphabetic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ALPHABETIC"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_alphanumeric",
            "description": "At least alphanumeric password",
            "helpText": null,
            "name": "ALPHANUMERIC",
            "displayName": "Alphanumeric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ALPHANUMERIC"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtype_alphanumericwithsymbols",
            "description": "At least alphanumeric with symbols.",
            "helpText": null,
            "name": "COMPLEX",
            "displayName": "Alphanumeric with symbols",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "COMPLEX"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlength",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlettercharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlowercasecharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumnonlettercharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumnumericcharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumsymbolcharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumuppercasecharacters",
                    "required": false
                }
            ]
        }
    ]
}