{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sslversionmin"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "SSLVersionMin",
    "rootDefinitionId": "com.apple.managedclient.preferences_sslversionmin",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_sslversionmin",
    "description": "Sets the minimum supported version of SSL. If you don't configure this policy, Microsoft Edge uses a default minimum version, TLS 1.0.\n\nIf you enable this policy, you can set the minimum version to one of the following values: \"tls1\", \"tls1.1\" or \"tls1.2\". When set, Microsoft Edge won't use any version of SSL/TLS lower than the specified version. Any unrecognized value is ignored.\n\n* \"tls1\" = TLS 1.0\n\n* \"tls1.1\" = TLS 1.1\n\n* \"tls1.2\" = TLS 1.2",
    "helpText": null,
    "name": "SSLVersionMin",
    "displayName": "Minimum TLS version enabled",
    "defaultOptionId": "com.apple.managedclient.preferences_sslversionmin_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_sslversionmin_0",
            "description": null,
            "helpText": null,
            "name": "TLS 1.0",
            "displayName": "TLS 1.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tls1"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_sslversionmin_1",
            "description": null,
            "helpText": null,
            "name": "TLS 1.1",
            "displayName": "TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tls1.1"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_sslversionmin_2",
            "description": null,
            "helpText": null,
            "name": "TLS 1.2",
            "displayName": "TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tls1.2"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}