{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular Private Network"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.cellularprivatenetwork.managed",
    "rootDefinitionId": "com.apple.cellularprivatenetwork.managed_com.apple.cellularprivatenetwork.managed",
    "categoryId": "b6650a16-32bc-4344-ac98-8f20486c6b0b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.cellularprivatenetwork.managed_com.apple.cellularprivatenetwork.managed",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.cellularprivatenetwork.managed",
    "displayName": "com.apple.cellularprivatenetwork.managed",
    "childIds": [
        "com.apple.cellularprivatenetwork.managed_geofences",
        "com.apple.cellularprivatenetwork.managed_datasetname",
        "com.apple.cellularprivatenetwork.managed_versionnumber",
        "com.apple.cellularprivatenetwork.managed_cellulardatapreferred",
        "com.apple.cellularprivatenetwork.managed_enablenrstandalone",
        "com.apple.cellularprivatenetwork.managed_networkidentifier",
        "com.apple.cellularprivatenetwork.managed_csgnetworkidentifier"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.cellularprivatenetwork.managed_geofences",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellularprivatenetwork.managed_datasetname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.cellularprivatenetwork.managed_versionnumber",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.cellularprivatenetwork.managed_cellulardatapreferred",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellularprivatenetwork.managed_enablenrstandalone",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellularprivatenetwork.managed_networkidentifier",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellularprivatenetwork.managed_csgnetworkidentifier",
            "required": false
        }
    ]
}