{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Vault",
        "FileVault"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Enable",
    "rootDefinitionId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
    "categoryId": "3f56adc1-2207-4033-a6e2-07f64c08e3ff",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx.filevault2_enable",
    "description": "If true, enables FileVault.",
    "helpText": null,
    "name": "Enable",
    "displayName": "Enable",
    "defaultOptionId": "com.apple.mcx.filevault2_enable_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mcx.filevault2_enable_0",
            "description": null,
            "helpText": null,
            "name": "On",
            "displayName": "On",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "On"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_enable_1",
            "description": null,
            "helpText": null,
            "name": "Off",
            "displayName": "Off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Off"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        }
    ]
}