{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Vault Recovery Key Escrow",
        "FileVault Recovery Key Escrow"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.security.FDERecoveryKeyEscrow",
    "rootDefinitionId": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
    "categoryId": "bd5533e1-f1ee-4994-8a79-cffe02b12d5c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.security.FDERecoveryKeyEscrow",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.security.fderecoverykeyescrow_location",
        "com.apple.security.fderecoverykeyescrow_devicekey"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.security.fderecoverykeyescrow_location",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.security.fderecoverykeyescrow_devicekey",
            "required": false
        }
    ]
}