{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "User Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DisableUsingiCloudPassword",
    "rootDefinitionId": "com.apple.preference.users_com.apple.preference.users",
    "categoryId": "0a9f982a-3515-4728-a231-fa000eb9e550",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.preference.users_disableusingicloudpassword",
    "description": "If true, disables the iCloud password for local accounts.",
    "helpText": null,
    "name": "DisableUsingiCloudPassword",
    "displayName": "Disable Using iCloud Password",
    "defaultOptionId": "com.apple.preference.users_disableusingicloudpassword_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.preference.users_disableusingicloudpassword_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.preference.users_com.apple.preference.users",
                    "parentSettingId": "com.apple.preference.users_com.apple.preference.users"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.preference.users_disableusingicloudpassword_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.preference.users_com.apple.preference.users",
                    "parentSettingId": "com.apple.preference.users_com.apple.preference.users"
                }
            ],
            "dependedOnBy": []
        }
    ]
}