{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutoLaunchedApplicationDictionary-managed/[{0}]/Path",
    "rootDefinitionId": "com.apple.loginitems.managed_com.apple.loginitems.managed",
    "categoryId": "6efb8802-223a-46a7-b13f-a68f28f8b2c2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_path",
    "description": "The URL or path string to the item's location.",
    "helpText": null,
    "name": "AutoLaunchedApplicationDictionary-managed_item_Path",
    "displayName": "Path",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed",
            "parentSettingId": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed"
        }
    ],
    "dependedOnBy": []
}