{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Proxy Configuration"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.SystemConfiguration",
    "rootDefinitionId": "com.apple.systemconfiguration_com.apple.systemconfiguration",
    "categoryId": "b8ed9eb3-17de-4091-b08b-7adb2fe13271",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systemconfiguration_com.apple.systemconfiguration",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.SystemConfiguration",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.systemconfiguration_proxies"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies",
            "required": true
        }
    ]
}