{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft OneDrive",
        "Microsoft One Drive"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/sharepoint/deploy-and-configure-on-macos#uploadbandwidthlimited"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.OneDrive/Forced/[0]/mcx_preference_settings",
    "offsetUri": "UploadBandwidthLimited",
    "rootDefinitionId": "com.apple.managedclient.preferences_uploadbandwidthlimited",
    "categoryId": "19ba782c-3594-45da-b829-72b54f6d45c7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_uploadbandwidthlimited",
    "description": "Sets the maximum upload throughput rate in kilobytes (KB)/sec for computers running the OneDrive sync app. The minimum rate is 50 KB/sec and the maximum rate is 100,000 KB/sec.",
    "helpText": null,
    "name": "UploadBandwidthLimited",
    "displayName": "Set maximum upload throughput",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 100000
    },
    "dependentOn": [],
    "dependedOnBy": []
}