{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized",
        "Web Rtc settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.WebRtcLocalhostIpHandling",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.webrtclocalhostiphandling",
    "categoryId": "08677354-6f67-455e-a430-4d8d2fbabe84",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.webrtclocalhostiphandling",
    "description": "Allows you to set whether or not WebRTC exposes the user's local IP address.\n\nIf you set this policy to \"AllowAllInterfaces\" or \"AllowPublicAndPrivateInterfaces\", WebRTC exposes the local IP address.\n\nIf you set this policy to \"AllowPublicInterfaceOnly\" or \"DisableNonProxiedUdp\", WebRTC doesn't expose the local IP address.\n\nIf you don't set this policy, or if you disable it, WebRTC exposes the local IP address.\n\nNote: This policy does not provide an option to exclude specific domains.\n\nPolicy options mapping:\n\n* AllowAllInterfaces (default) = Allow all interfaces. This exposes the local IP address\n\n* AllowPublicAndPrivateInterfaces (default_public_and_private_interfaces) = Allow public and private interfaces over http default route. This exposes the local IP address\n\n* AllowPublicInterfaceOnly (default_public_interface_only) = Allow public interface over http default route. This doesn't expose the local IP address\n\n* DisableNonProxiedUdp (disable_non_proxied_udp) = Use TCP unless proxy server supports UDP. This doesn't expose the local IP address\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "WebRtcLocalhostIpHandling",
    "displayName": "Restrict exposure of local IP address by WebRTC",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.webrtclocalhostiphandling_allowallinterfaces",
            "description": null,
            "helpText": null,
            "name": "Allow all interfaces. This exposes the local IP address",
            "displayName": "Allow all interfaces. This exposes the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "default"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.webrtclocalhostiphandling_allowpublicandprivateinterfaces",
            "description": null,
            "helpText": null,
            "name": "Allow public and private interfaces over http default route. This exposes the local IP address",
            "displayName": "Allow public and private interfaces over http default route. This exposes the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "default_public_and_private_interfaces"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.webrtclocalhostiphandling_allowpublicinterfaceonly",
            "description": null,
            "helpText": null,
            "name": "Allow public interface over http default route. This doesn't expose the local IP address",
            "displayName": "Allow public interface over http default route. This doesn't expose the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "default_public_interface_only"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.webrtclocalhostiphandling_disablenonproxiedudp",
            "description": null,
            "helpText": null,
            "name": "Use TCP unless proxy server supports UDP. This doesn't expose the local IP address",
            "displayName": "Use TCP unless proxy server supports UDP. This doesn't expose the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disable_non_proxied_udp"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}