{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Extensions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RemovableSystemExtensions/{0}",
    "rootDefinitionId": "com.apple.system-extension-policy_com.apple.system-extension-policy",
    "categoryId": "cb33668b-933f-4424-8d2d-8bdf0e61bddd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.system-extension-policy_removablesystemextensions_generickey",
    "description": "The dictionary maps team identifiers (keys) to arrays of bundle identifiers, where the bundle identifier defines the system extension.",
    "helpText": null,
    "name": "RemovableSystemExtensions_genericKey",
    "displayName": "Removable System Extensions",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.system-extension-policy_removablesystemextensions",
            "parentSettingId": "com.apple.system-extension-policy_removablesystemextensions"
        }
    ],
    "dependedOnBy": []
}