{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Air Print",
        "AirPrint"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AirPrint",
    "rootDefinitionId": "com.apple.airprint_com.apple.airprint",
    "categoryId": "429c4b85-a2b4-46ed-afa0-6c89c08a5544",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.airprint_airprint",
    "description": "A list of AirPrint printers that are presented to the user.",
    "helpText": null,
    "name": "AirPrint",
    "displayName": "Printers",
    "childIds": [
        "com.apple.airprint_airprint_item_ipaddress",
        "com.apple.airprint_airprint_item_resourcepath",
        "com.apple.airprint_airprint_item_port",
        "com.apple.airprint_airprint_item_forcetls"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.airprint_com.apple.airprint",
            "parentSettingId": "com.apple.airprint_com.apple.airprint"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.airprint_airprint_item_ipaddress",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.airprint_airprint_item_resourcepath",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.airprint_airprint_item_port",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.airprint_airprint_item_forcetls",
            "required": false
        }
    ]
}