{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.CollectionsServicesAndExportsBlockList",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist",
    "description": "List specific services and export targets that users can't access in the Collections feature in Microsoft Edge. This includes displaying additional data from Bing and exporting collections to Microsoft products or external partners.\n\nIf you enable this policy, services and export targets that match the given list are blocked.\n\nIf you don't configure this policy, no restrictions on the acceptable services and export targets are enforced.\n\nPolicy options mapping:\n\n* pinterest_suggestions (pinterest_suggestions) = Pinterest suggestions\n\n* collections_share (collections_share) = Sharing of Collections\n\n* local_pdf (local_pdf) = Save local PDFs in Collections to OneDrive\n\n* send_word (send_word) = Send collection to Microsoft Word\n\n* send_excel (send_excel) = Send collection to Microsoft Excel\n\n* send_onenote (send_onenote) = Send collection to Microsoft OneNote\n\n* send_pinterest (send_pinterest) = Send collection to Pinterest\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "CollectionsServicesAndExportsBlockList",
    "displayName": "Block access to a specified list of services and export targets in Collections",
    "defaultOptionId": null,
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist_pinterest_suggestions",
            "description": null,
            "helpText": null,
            "name": "Pinterest suggestions",
            "displayName": "Pinterest suggestions",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pinterest_suggestions"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist_collections_share",
            "description": null,
            "helpText": null,
            "name": "Sharing of Collections",
            "displayName": "Sharing of Collections",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "collections_share"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist_local_pdf",
            "description": null,
            "helpText": null,
            "name": "Save local PDFs in Collections to OneDrive",
            "displayName": "Save local PDFs in Collections to OneDrive",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "local_pdf"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist_send_word",
            "description": null,
            "helpText": null,
            "name": "Send collection to Microsoft Word",
            "displayName": "Send collection to Microsoft Word",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "send_word"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist_send_excel",
            "description": null,
            "helpText": null,
            "name": "Send collection to Microsoft Excel",
            "displayName": "Send collection to Microsoft Excel",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "send_excel"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist_send_onenote",
            "description": null,
            "helpText": null,
            "name": "Send collection to Microsoft OneNote",
            "displayName": "Send collection to Microsoft OneNote",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "send_onenote"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.collectionsservicesandexportsblocklist_send_pinterest",
            "description": null,
            "helpText": null,
            "name": "Send collection to Pinterest",
            "displayName": "Send collection to Pinterest",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "send_pinterest"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}