{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#adssettingforintrusiveadssites"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "AdsSettingForIntrusiveAdsSites",
    "rootDefinitionId": "com.apple.managedclient.preferences_adssettingforintrusiveadssites",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_adssettingforintrusiveadssites",
    "description": "Controls whether ads are blocked on sites with intrusive ads. You can set this policy to one of the following options:\n\n* 1 = Allow ads on all sites.\n\n* 2 = Block ads on sites with intrusive ads (Default value).",
    "helpText": null,
    "name": "AdsSettingForIntrusiveAdsSites",
    "displayName": "Ads setting for sites with intrusive ads",
    "defaultOptionId": "com.apple.managedclient.preferences_adssettingforintrusiveadssites_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_adssettingforintrusiveadssites_0",
            "description": null,
            "helpText": null,
            "name": "Allow ads on all sites",
            "displayName": "Allow ads on all sites",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_adssettingforintrusiveadssites_1",
            "description": null,
            "helpText": null,
            "name": "Block ads on sites with intrusive ads. (Default value)",
            "displayName": "Block ads on sites with intrusive ads. (Default value)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}