{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Printing"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "UserPrinterList/Printer",
    "rootDefinitionId": "com.apple.mcxprinting_com.apple.mcxprinting",
    "categoryId": "174ffe92-3770-4688-aa21-85b7535cf374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxprinting_userprinterlist_printer",
    "description": "A dictionary of printer details.",
    "helpText": null,
    "name": "UserPrinterList_Printer",
    "displayName": "Printer",
    "childIds": [
        "com.apple.mcxprinting_userprinterlist_printer_deviceuri",
        "com.apple.mcxprinting_userprinterlist_printer_displayname",
        "com.apple.mcxprinting_userprinterlist_printer_location",
        "com.apple.mcxprinting_userprinterlist_printer_model",
        "com.apple.mcxprinting_userprinterlist_printer_printerlocked",
        "com.apple.mcxprinting_userprinterlist_printer_ppdurl"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcxprinting_userprinterlist",
            "parentSettingId": "com.apple.mcxprinting_userprinterlist"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist_printer_deviceuri",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist_printer_displayname",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist_printer_location",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist_printer_model",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist_printer_printerlocked",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist_printer_ppdurl",
            "required": false
        }
    ]
}