{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Caldav"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CalDAVPort",
    "rootDefinitionId": "com.apple.caldav.account_com.apple.caldav.account",
    "categoryId": "831dcaee-a6fa-4893-a32d-e13fdf7d3777",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.caldav.account_caldavport",
    "description": "The server’s port.",
    "helpText": null,
    "name": "CalDAVPort",
    "displayName": "Cal DAV Port",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.caldav.account_com.apple.caldav.account",
            "parentSettingId": "com.apple.caldav.account_com.apple.caldav.account"
        }
    ],
    "dependedOnBy": []
}