{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password",
        "Passcode",
        "SignIn Failure",
        "SignIn Failure Count Before Factory Reset",
        "Device password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/passwordSignInFailureCountBeforeFactoryResetAosp/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.passwordsigninfailurecountbeforefactoryresetaosp",
    "categoryId": "f350f9a2-3a91-4d6d-90ed-7e3849b0d5f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.passwordsigninfailurecountbeforefactoryresetaosp",
    "description": "Enter the number of sign-in attempts allowed, from 4 to 11, before the device is wiped. 0 (zero) might disable the device wipe functionality. When the value is blank, Intune doesn't change or update this setting.",
    "helpText": "Enter a number (4-11)",
    "name": "PasswordSignInFailureCountBeforeFactoryReset",
    "displayName": "Number of sign-in failures before wiping device",
    "applicability": {
        "description": null,
        "platform": "aosp",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 11,
        "minimumValue": 4
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 11
    },
    "dependentOn": [],
    "dependedOnBy": []
}