{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Tamper protection"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/tamperProtection",
    "offsetUri": "exclusions/[{0}]/path",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions_tamperprotection",
    "categoryId": "5c4df3be-80b0-40cc-a8c8-0258120b0de5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_exclusions_item_path_tamperprotection",
    "description": "Full and exact path to the process binary",
    "helpText": null,
    "name": "exclusions_item_path_tamperProtection",
    "displayName": "Process path",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.managedclient.preferences_exclusions_tamperprotection",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions_tamperprotection"
        }
    ],
    "dependedOnBy": []
}