{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On Kerberos"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ExtensionIdentifier",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
    "categoryId": "f35cc803-3a06-4262-b38b-a5295321f756",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_extensionidentifier_kerberos",
    "description": "This value must be com.apple.AppSSOKerberos.KerberosExtension for this extension.",
    "helpText": null,
    "name": "ExtensionIdentifier",
    "displayName": "Extension Identifier",
    "defaultOptionId": "com.apple.extensiblesso_extensionidentifier_kerberos_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_extensionidentifier_kerberos_0",
            "description": null,
            "helpText": null,
            "name": "com.apple.AppSSOKerberos.KerberosExtension",
            "displayName": "com.apple.AppSSOKerberos.KerberosExtension",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "com.apple.AppSSOKerberos.KerberosExtension"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
                    "parentSettingId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos"
                }
            ],
            "dependedOnBy": []
        }
    ]
}