{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "APNs",
    "rootDefinitionId": "com.apple.cellular_com.apple.cellular",
    "categoryId": "5c722b3f-9d77-428a-b859-3fb556162cd6",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.cellular_apns",
    "description": "An array of access point dictionaries.",
    "helpText": null,
    "name": "APNs",
    "displayName": "APNs",
    "childIds": [
        "com.apple.cellular_apns_item_name",
        "com.apple.cellular_apns_item_authenticationtype",
        "com.apple.cellular_apns_item_username",
        "com.apple.cellular_apns_item_password",
        "com.apple.cellular_apns_item_proxyserver",
        "com.apple.cellular_apns_item_proxyport",
        "com.apple.cellular_apns_item_allowedprotocolmask",
        "com.apple.cellular_apns_item_allowedprotocolmaskinroaming",
        "com.apple.cellular_apns_item_allowedprotocolmaskindomesticroaming",
        "com.apple.cellular_apns_item_enablexlat464"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.cellular_com.apple.cellular",
            "parentSettingId": "com.apple.cellular_com.apple.cellular"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.cellular_apns_item_name",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_authenticationtype",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_username",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_password",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_proxyserver",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_proxyport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_allowedprotocolmask",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_allowedprotocolmaskinroaming",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_allowedprotocolmaskindomesticroaming",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_apns_item_enablexlat464",
            "required": false
        }
    ]
}