{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On Kerberos"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ExtensionData/credentialUseMode",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
    "categoryId": "f35cc803-3a06-4262-b38b-a5295321f756",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_extensiondata_credentialusemode_kerberos",
    "description": "This setting affects how the Kerberos Extension credential is used by other processes.",
    "helpText": null,
    "name": "ExtensionData_credentialUseMode",
    "displayName": "Credential Use Mode",
    "defaultOptionId": "com.apple.extensiblesso_extensiondata_credentialusemode_kerberos_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_extensiondata_credentialusemode_kerberos_0",
            "description": null,
            "helpText": null,
            "name": "always",
            "displayName": "Always",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "always"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_extensiondata_kerberos",
                    "parentSettingId": "com.apple.extensiblesso_extensiondata_kerberos"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_extensiondata_credentialusemode_kerberos_1",
            "description": null,
            "helpText": null,
            "name": "whenNotSpecified",
            "displayName": "When Not Specified",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "whenNotSpecified"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_extensiondata_kerberos",
                    "parentSettingId": "com.apple.extensiblesso_extensiondata_kerberos"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_extensiondata_credentialusemode_kerberos_2",
            "description": null,
            "helpText": null,
            "name": "kerberosDefault",
            "displayName": "Kerberos Default ",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kerberosDefault"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_extensiondata_kerberos",
                    "parentSettingId": "com.apple.extensiblesso_extensiondata_kerberos"
                }
            ],
            "dependedOnBy": []
        }
    ]
}