{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Profile Removal Password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.profileRemovalPassword",
    "rootDefinitionId": "com.apple.profileremovalpassword_com.apple.profileremovalpassword",
    "categoryId": "e905d6cf-7820-48d4-86e0-b55fa991a5ad",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.profileremovalpassword_com.apple.profileremovalpassword",
    "description": "com.apple.profileRemovalPassword",
    "helpText": null,
    "name": "com.apple.profileRemovalPassword",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.profileremovalpassword_removalpassword"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.profileremovalpassword_removalpassword",
            "required": false
        }
    ]
}