{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Immersive Reader settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.ImmersiveReaderGrammarToolsEnabled",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.immersivereadergrammartoolsenabled",
    "categoryId": "8bcf8b08-35a3-49b7-8760-5fe3b767d6a6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.immersivereadergrammartoolsenabled",
    "description": "This policy is obsoleted because Grammar Tools is deprecated from Edge. This policy won't work in Microsoft Edge version 126. Enables the Grammar Tools feature within Immersive Reader in Microsoft Edge.\nThis helps improve reading comprehension by splitting words into syllables and highlighting nouns, verbs, adverbs, and adjectives.\n\nIf you enable this policy or don't configure it, the Grammar Tools option shows up within Immersive Reader.\nIf you disable this policy, users can't access the Grammar Tools feature within Immersive Reader.",
    "helpText": null,
    "name": "ImmersiveReaderGrammarToolsEnabled",
    "displayName": "Enable Grammar Tools feature within Immersive Reader in Microsoft Edge (Obsolete)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.immersivereadergrammartoolsenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.immersivereadergrammartoolsenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}