{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Apps",
        "Allow",
        "Install",
        "From",
        "Unknown",
        "Sources",
        "Applications"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/appsAllowInstallFromUnknownSources/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.appsallowinstallfromunknownsources",
    "categoryId": "2257f7e1-3e88-4d4d-a666-437bbe42baca",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.appsallowinstallfromunknownsources",
    "description": "If 'True', allows users to enable unknown sources. This setting permits app installation from sources other than the Google Play Store, enabling users to side-load apps through alternative methods. If 'False', Intune doesn't change or update this setting. By default, the OS may prevent users from enabling unknown sources. Available for fully managed, dedicated, and corporate-owned work profile devices.",
    "helpText": null,
    "name": "AppsAllowInstallFromUnknownSources",
    "displayName": "Allow installation from unknown sources",
    "defaultOptionId": "com.android.devicerestrictionpolicy.appsallowinstallfromunknownsources_false",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.appsallowinstallfromunknownsources_true",
            "description": "true",
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.appsallowinstallfromunknownsources_false",
            "description": "false",
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}