{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password",
        "Passcode",
        "Password type",
        "Password required type",
        "Device password"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/mem/intune/configuration/device-restrictions-android-aosp#:~:text=Required%20password%20type"
    ],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/passwordRequiredTypeAosp/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp",
    "categoryId": "f350f9a2-3a91-4d6d-90ed-7e3849b0d5f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp",
    "description": "Set the password’s complexity requirements. Additional password requirements will become available based on your selection. For more details, see the information provided in the ‘Learn More’ section below.",
    "helpText": "",
    "name": "PasswordRequiredType",
    "displayName": "Required password type",
    "defaultOptionId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_devicedefault",
    "applicability": {
        "description": null,
        "platform": "aosp",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_devicedefault",
            "description": "Device default value, no intent.",
            "helpText": null,
            "name": "DeviceDefault",
            "displayName": "Device default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "DeviceDefault"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_required",
            "description": "There must be a password set, but there are no restrictions on type.",
            "helpText": null,
            "name": "Required",
            "displayName": "Password required, no restrictions",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Required"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_lowsecuritybiometric",
            "description": "Low security biometrics based password required.",
            "helpText": null,
            "name": "LowSecurityBiometric",
            "displayName": "Weak Biometric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "LowSecurityBiometric"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_numeric",
            "description": "At least numeric.",
            "helpText": null,
            "name": "Numeric",
            "displayName": "Numeric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Numeric"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlengthaosp",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_numericcomplex",
            "description": "At least numeric with no repeating or ordered sequences.",
            "helpText": null,
            "name": "NumericComplex",
            "displayName": "Numeric Complex",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NumericComplex"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlengthaosp",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_alphabetic",
            "description": "At least alphabetic password.",
            "helpText": null,
            "name": "Alphabetic",
            "displayName": "Alphabetic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Alphabetic"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlengthaosp",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_alphanumeric",
            "description": "At least alphanumeric password",
            "helpText": null,
            "name": "Alphanumeric",
            "displayName": "Alphanumeric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Alphanumeric"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlengthaosp",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequiredtypeaosp_alphanumericwithsymbols",
            "description": "At least alphanumeric with symbols.",
            "helpText": null,
            "name": "AlphanumericWithSymbols",
            "displayName": "Alphanumeric with symbols",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AlphanumericWithSymbols"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.passwordminimumlengthaosp",
                    "required": false
                }
            ]
        }
    ]
}