{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content Caching"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ListenRanges",
    "rootDefinitionId": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "categoryId": "e95335ec-2704-47ab-8b40-f602b31eeb9d",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.assetcache.managed_listenranges",
    "description": "The range of client IP addresses to serve.",
    "helpText": null,
    "name": "ListenRanges",
    "displayName": "Listen Ranges",
    "childIds": [
        "com.apple.assetcache.managed_listenranges_item_type",
        "com.apple.assetcache.managed_listenranges_item_first",
        "com.apple.assetcache.managed_listenranges_item_last"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.assetcache.managed_com.apple.assetcache.managed",
            "parentSettingId": "com.apple.assetcache.managed_com.apple.assetcache.managed"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.assetcache.managed_listenranges_item_type",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_listenranges_item_first",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_listenranges_item_last",
            "required": true
        }
    ]
}