{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Office"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.office/Forced/[0]/mcx_preference_settings",
    "offsetUri": "OfficeActivationEmailAddress",
    "rootDefinitionId": "com.apple.managedclient.preferences_officeactivationemailaddress",
    "categoryId": "b5169b74-41be-460a-9402-b13b6c22582b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_officeactivationemailaddress",
    "description": "The sign in sheet for Word, Excel, PowerPoint, Outlook, and OneNote will be automatically populated with the specified value.",
    "helpText": null,
    "name": "OfficeActivationEmailAddress",
    "displayName": "Office Activation Email Address",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "variableReplacement",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}