{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular Private Network"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Geofences/[{0}]/Longitude",
    "rootDefinitionId": "com.apple.cellularprivatenetwork.managed_com.apple.cellularprivatenetwork.managed",
    "categoryId": "b6650a16-32bc-4344-ac98-8f20486c6b0b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.cellularprivatenetwork.managed_geofences_item_longitude",
    "description": "The longitude of the geofence.",
    "helpText": null,
    "name": "Geofences_item_Longitude",
    "displayName": "Longitude",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {},
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingValue",
        "settingValueTemplateReference": null
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.cellularprivatenetwork.managed_geofences",
            "parentSettingId": "com.apple.cellularprivatenetwork.managed_geofences"
        }
    ],
    "dependedOnBy": []
}