{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "siteWhitelist/[{0}]/pageTitle",
    "rootDefinitionId": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter",
    "categoryId": "dc270c70-1cf4-4d98-ad26-8c2d441173f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.familycontrols.contentfilter_sitewhitelist_item_pagetitle",
    "description": "The site page title.",
    "helpText": null,
    "name": "siteWhitelist_item_pageTitle",
    "displayName": "Page Title",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.familycontrols.contentfilter_sitewhitelist",
            "parentSettingId": "com.apple.familycontrols.contentfilter_sitewhitelist"
        }
    ],
    "dependedOnBy": []
}