{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On",
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ScreenLockedBehavior",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_screenlockedbehavior",
    "description": "When set to Do Not Handle, the request continues without SSO. Available in iOS 15 and later and macOS 12 and later.",
    "helpText": null,
    "name": "ScreenLockedBehavior",
    "displayName": "Screen Locked Behavior",
    "defaultOptionId": "com.apple.extensiblesso_screenlockedbehavior_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_screenlockedbehavior_0",
            "description": null,
            "helpText": null,
            "name": "DoNotHandle",
            "displayName": "Do Not Handle",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "DoNotHandle"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_com.apple.extensiblesso",
                    "parentSettingId": "com.apple.extensiblesso_com.apple.extensiblesso"
                }
            ],
            "dependedOnBy": []
        }
    ]
}