{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ratingTVShows",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_ratingtvshowsie",
    "description": "The maximum level of TV content allowed on the device. Available in iOS 4 and later.",
    "helpText": null,
    "name": "ratingTVShows",
    "displayName": "Rating TV Shows - Ireland",
    "defaultOptionId": "com.apple.applicationaccess_ratingtvshowsie_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsie_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_5",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsie_1",
            "description": null,
            "helpText": null,
            "name": "GA",
            "displayName": "GA",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 100
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_5",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsie_2",
            "description": null,
            "helpText": null,
            "name": "CH",
            "displayName": "CH",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 200
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_5",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsie_3",
            "description": null,
            "helpText": null,
            "name": "YA",
            "displayName": "YA",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 400
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_5",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsie_4",
            "description": null,
            "helpText": null,
            "name": "PS",
            "displayName": "PS",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 500
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_5",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsie_5",
            "description": null,
            "helpText": null,
            "name": "MA",
            "displayName": "MA",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 600
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_5",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsie_6",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1000
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_5",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        }
    ]
}