{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Printing"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.PrintingBackgroundGraphicsDefault",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.printingbackgroundgraphicsdefault",
    "categoryId": "c6099521-a05f-480a-8562-7e71318e2cda",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.printingbackgroundgraphicsdefault",
    "description": "Overrides the last used setting for printing background graphics.\nIf you enable this setting, background graphics printing is enabled.\nIf you disable this setting, background graphics printing is disabled.\n\nPolicy options mapping:\n\n* enabled (enabled) = Enable background graphics printing mode by default\n\n* disabled (disabled) = Disable background graphics printing mode by default\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "PrintingBackgroundGraphicsDefault",
    "displayName": "Default background graphics printing mode",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.printingbackgroundgraphicsdefault_enabled",
            "description": null,
            "helpText": null,
            "name": "Enable background graphics printing mode by default",
            "displayName": "Enable background graphics printing mode by default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "enabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.printingbackgroundgraphicsdefault_disabled",
            "description": null,
            "helpText": null,
            "name": "Disable background graphics printing mode by default",
            "displayName": "Disable background graphics printing mode by default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}