{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Policy Control"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "EnableXProtectMalwareUpload",
    "rootDefinitionId": "com.apple.systempolicy.control_com.apple.systempolicy.control",
    "categoryId": "763525a0-8456-4336-a8d1-392253e8fdd8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.systempolicy.control_enablexprotectmalwareupload",
    "description": "If false, will prevent Gatekeeper from prompting the user to upload blocked malware to Apple for purposes of improving malware detection.",
    "helpText": null,
    "name": "EnableXProtectMalwareUpload",
    "displayName": "Enable XProtect Malware Upload",
    "defaultOptionId": "com.apple.systempolicy.control_enablexprotectmalwareupload_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.systempolicy.control_enablexprotectmalwareupload_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.systempolicy.control_com.apple.systempolicy.control",
                    "parentSettingId": "com.apple.systempolicy.control_com.apple.systempolicy.control"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.systempolicy.control_enablexprotectmalwareupload_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.systempolicy.control_com.apple.systempolicy.control",
                    "parentSettingId": "com.apple.systempolicy.control_com.apple.systempolicy.control"
                }
            ],
            "dependedOnBy": []
        }
    ]
}