{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ApplicationsSystem//Applications/Microsoft OneNote.app/ManifestServer",
    "rootDefinitionId": "com.apple.managedclient.preferences_applicationssystem",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app_manifestserver",
    "description": null,
    "helpText": null,
    "name": "ApplicationsSystem_Applications_Microsoft OneNote.app_ManifestServer",
    "displayName": "Update channel override",
    "defaultOptionId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app_manifestserver_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app_manifestserver_0",
            "description": null,
            "helpText": null,
            "name": "Current Channel",
            "displayName": "Current Channel",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/C1297A47-86C4-4C1F-97FA-950631F94777/MacAutoupdate/"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app",
                    "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app_manifestserver_1",
            "description": null,
            "helpText": null,
            "name": "Current Channel (Preview)",
            "displayName": "Current Channel (Preview)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/1ac37578-5a24-40fb-892e-b89d85b6dfaa/MacAutoupdate/"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app",
                    "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app_manifestserver_2",
            "description": null,
            "helpText": null,
            "name": "Beta Channel",
            "displayName": "Beta Channel",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/4B2D7701-0A4F-49C8-B4CB-0C2D4043F51F/MacAutoupdate/"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app",
                    "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app_manifestserver_3",
            "description": null,
            "helpText": null,
            "name": "Change Freeze",
            "displayName": "Change Freeze",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Freeze/"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app",
                    "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app"
                }
            ],
            "dependedOnBy": []
        }
    ]
}