{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "loginWindowModulePath",
    "rootDefinitionId": "com.apple.screensaver_com.apple.screensaver",
    "categoryId": "8cefd936-362e-4a24-bc76-e078b6fd13fa",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.screensaver_loginwindowmodulepath",
    "description": "The full path to the screen-saver module to use. ",
    "helpText": null,
    "name": "loginWindowModulePath",
    "displayName": "Login Window Module Path",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.screensaver_com.apple.screensaver",
            "parentSettingId": "com.apple.screensaver_com.apple.screensaver"
        }
    ],
    "dependedOnBy": []
}