{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DNSSettings/SupplementalMatchDomains",
    "rootDefinitionId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "categoryId": "bbe51018-a17d-46c4-9517-ff45c54d8d18",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dnssettings.managed_dnssettings_supplementalmatchdomains",
    "description": "A list of domain strings used to determine which DNS queries will use the DNS server. If this array is not provided, all domains will use the DNS server.",
    "helpText": null,
    "name": "DNSSettings_SupplementalMatchDomains",
    "displayName": "Supplemental Match Domains",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.dnssettings.managed_dnssettings",
            "parentSettingId": "com.apple.dnssettings.managed_dnssettings"
        }
    ],
    "dependedOnBy": []
}