{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Time Machine"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "BackupDestURL",
    "rootDefinitionId": "com.apple.mcx.timemachine_com.apple.mcx.timemachine",
    "categoryId": "361859d9-1382-47c3-b9ec-9251a62fbb25",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx.timemachine_backupdesturl",
    "description": "The URL of the backup destination.",
    "helpText": null,
    "name": "BackupDestURL",
    "displayName": "Backup Destination URL",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcx.timemachine_com.apple.mcx.timemachine",
            "parentSettingId": "com.apple.mcx.timemachine_com.apple.mcx.timemachine"
        }
    ],
    "dependedOnBy": []
}