{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Font"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Font",
    "rootDefinitionId": "com.apple.font_com.apple.font",
    "categoryId": "5401711f-292a-487a-be18-f99593a0477c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.font_font",
    "description": "The contents of the font file.",
    "helpText": null,
    "name": "Font",
    "displayName": "Font",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [
        {
            "settingDefinitionId": "com.apple.font_font_referred_setting"
        }
    ],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "base64",
        "inputValidationSchema": null,
        "maximumLength": 2796203,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": [
            "ttf",
            "otf"
        ]
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.font_com.apple.font",
            "parentSettingId": "com.apple.font_com.apple.font"
        }
    ],
    "dependedOnBy": []
}