{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.SoftwareUpdate",
    "rootDefinitionId": "com.apple.softwareupdate_com.apple.softwareupdate",
    "categoryId": "f8f4d337-4c55-4518-91c4-f7f77703d843",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.softwareupdate_com.apple.softwareupdate",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.SoftwareUpdate",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.softwareupdate_allowprereleaseinstallation",
        "com.apple.softwareupdate_restrict-software-update-require-admin-to-install",
        "com.apple.softwareupdate_automaticallyinstallmacosupdates",
        "com.apple.softwareupdate_automaticallyinstallappupdates",
        "com.apple.softwareupdate_automaticcheckenabled",
        "com.apple.softwareupdate_automaticdownload",
        "com.apple.softwareupdate_criticalupdateinstall",
        "com.apple.softwareupdate_configdatainstall"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.softwareupdate_allowprereleaseinstallation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.softwareupdate_restrict-software-update-require-admin-to-install",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.softwareupdate_automaticallyinstallmacosupdates",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.softwareupdate_automaticallyinstallappupdates",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.softwareupdate_automaticcheckenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.softwareupdate_automaticdownload",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.softwareupdate_criticalupdateinstall",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.softwareupdate_configdatainstall",
            "required": false
        }
    ]
}