{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "NS Extension Management"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.NSExtension",
    "rootDefinitionId": "com.apple.nsextension_com.apple.nsextension",
    "categoryId": "d875dca1-dc97-4cc5-9df3-c50b813622a3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.nsextension_com.apple.nsextension",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.NSExtension",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.nsextension_allowedextensions",
        "com.apple.nsextension_deniedextensions",
        "com.apple.nsextension_deniedextensionpoints"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.nsextension_allowedextensions",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.nsextension_deniedextensions",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.nsextension_deniedextensionpoints",
            "required": false
        }
    ]
}