{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.ComposeInlineEnabled",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.composeinlineenabled",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.composeinlineenabled",
    "description": "This policy controls whether users can use writing support features in Microsoft Edge for Business, such as Rewrite, which utilizes Microsoft 365 Copilot Chat. With Rewrite, users can receive help with drafting content, rewriting text, and adjusting style directly in their browser tab. In Edge, users can trigger it when highlighting editable content in their main browser through the right-click context menu.\n\nThis policy applies only to Microsoft Entra accounts and does not apply to Microsoft accounts.\n\nIf you enable this policy, users can use Rewrite in Microsoft Edge when logged in with an Entra account.\n\nIf you disable this policy, users within your tenant will not be able to use Rewrite.\n\nIf you don't configure this policy, the default behavior is as follows:\n\n- Rewrite is available to users\n\n- Users can enable or disable Microsoft 365 Copilot access to Microsoft Edge page content using the toggle in Microsoft Edge settings.\n\nNote: Rewrite is not available on pages protected by data loss prevention (DLP) policies to help maintain compliance.\n\nLearn more about Microsoft 365 Copilot Chat data, privacy, and security here: <a href=\"https://go.microsoft.com/fwlink/?linkid=2321816\">https://go.microsoft.com/fwlink/?linkid=2321816</a>",
    "helpText": null,
    "name": "ComposeInlineEnabled",
    "displayName": "Control access to Microsoft 365 Copilot writing assistance in Microsoft Edge for Business",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.composeinlineenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.composeinlineenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}