{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "OnDemandRules/[{0}]/Action",
    "rootDefinitionId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "categoryId": "bbe51018-a17d-46c4-9517-ff45c54d8d18",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dnssettings.managed_ondemandrules_item_action",
    "description": "The action to take if this dictionary matches the current network.",
    "helpText": null,
    "name": "OnDemandRules_item_Action",
    "displayName": "Action",
    "defaultOptionId": "com.apple.dnssettings.managed_ondemandrules_item_action_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_action_0",
            "description": null,
            "helpText": null,
            "name": "Connect",
            "displayName": "Connect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Connect"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_action_1",
            "description": null,
            "helpText": null,
            "name": "Disconnect",
            "displayName": "Disconnect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Disconnect"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_action_2",
            "description": null,
            "helpText": null,
            "name": "EvaluateConnection",
            "displayName": "Evaluate Connection",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "EvaluateConnection"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules"
                }
            ],
            "dependedOnBy": []
        }
    ]
}