{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Service Management - Managed Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Rules/[{0}]/TeamIdentifier",
    "rootDefinitionId": "com.apple.servicemanagement_com.apple.servicemanagement",
    "categoryId": "9859957e-34f1-4669-9f95-2b7c79fff052",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.servicemanagement_rules_item_teamidentifier",
    "description": "An additional constraint to limit the scope of the rule that is tested after matching the Rule Type and Rule Value.",
    "helpText": null,
    "name": "Rules_item_TeamIdentifier",
    "displayName": "Team Identifier",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.servicemanagement_rules",
            "parentSettingId": "com.apple.servicemanagement_rules"
        }
    ],
    "dependedOnBy": []
}