{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "tilesize",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_tilesize",
    "description": "The tile size. Values must be in the range of 16 to 128.",
    "helpText": null,
    "name": "tilesize",
    "displayName": "Tile Size",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 128,
        "minimumValue": 16
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.dock_com.apple.dock",
            "parentSettingId": "com.apple.dock_com.apple.dock"
        }
    ],
    "dependedOnBy": []
}