{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "siteWhitelist",
    "rootDefinitionId": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter",
    "categoryId": "dc270c70-1cf4-4d98-ad26-8c2d441173f1",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.familycontrols.contentfilter_sitewhitelist",
    "description": "An array of sites that defines an allow list. If specified, this defines additional allowed sites besides those in the automated allow list and deny list, including disallowed adult sites. This key is required if Allow List Enabled is true.",
    "helpText": null,
    "name": "siteWhitelist",
    "displayName": "Site Allowlist",
    "childIds": [
        "com.apple.familycontrols.contentfilter_sitewhitelist_item_address",
        "com.apple.familycontrols.contentfilter_sitewhitelist_item_pagetitle"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter",
            "parentSettingId": "com.apple.familycontrols.contentfilter_com.apple.familycontrols.contentfilter"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_sitewhitelist_item_address",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.familycontrols.contentfilter_sitewhitelist_item_pagetitle",
            "required": false
        }
    ]
}