{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Performance"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.PinBrowserEssentialsToolbarButton",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.pinbrowseressentialstoolbarbutton",
    "categoryId": "3edb2860-b77b-4240-af16-fb34d45d6ba1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.pinbrowseressentialstoolbarbutton",
    "description": "This policy lets you configure whether to pin the Browser essentials button on the toolbar.\n\nWhen the button is pinned, it will always appear on the toolbar.\n\nWhen the button isn't pinned, it will only appear when there's an alert. An example of this kind of alert is the performance detector alert that indicates the browser is using high CPU or memory.\n\nIf you enable or don't configure this policy, the Browser essentials button will be pinned on the toolbar.\n\nIf you disable this policy, the Browser essentials button won't be pinned on the toolbar.\n\nLearn more about browser essentials: <a href=\"https://go.microsoft.com/fwlink/?linkid=2240439\">https://go.microsoft.com/fwlink/?linkid=2240439</a>",
    "helpText": null,
    "name": "PinBrowserEssentialsToolbarButton",
    "displayName": "Pin browser essentials toolbar button",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.pinbrowseressentialstoolbarbutton_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.pinbrowseressentialstoolbarbutton_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}