{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Outlook"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployoffice/mac/preferences-outlook#disable-skype-for-business-online-meetings"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Outlook/Forced/[0]/mcx_preference_settings",
    "offsetUri": "DisableSkypeMeeting",
    "rootDefinitionId": "com.apple.managedclient.preferences_disableskypemeeting",
    "categoryId": "191a84f2-13b5-4609-808f-8b743b7f0247",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_disableskypemeeting",
    "description": "Prevent users from adding Skype for Business to meeting invites.",
    "helpText": null,
    "name": "DisableSkypeMeeting",
    "displayName": "Disable Skype for Business meeting support",
    "defaultOptionId": "com.apple.managedclient.preferences_disableskypemeeting_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_disableskypemeeting_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_disableskypemeeting_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}