{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.PrefetchWithServiceWorkerEnabled",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.prefetchwithserviceworkerenabled",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.prefetchwithserviceworkerenabled",
    "description": "Controls whether SpeculationRules prefetch requests are allowed for\nServiceWorker-controlled URLs.\n\nStarting with Microsoft Edge version 138,\nprefetch requests to ServiceWorker-controlled URLs are allowed by default when\nthe PrefetchServiceWorker feature is enabled.\n\nIf this policy is enabled or not configured, that default behavior is used.\n\nTo restore the legacy behavior from versions prior to 138, where prefetch requests\nto ServiceWorker-controlled URLs were blocked, set this policy to disabled.\n\nThis policy is intended to be temporary and will be removed in the future.",
    "helpText": null,
    "name": "PrefetchWithServiceWorkerEnabled",
    "displayName": "Allow SpeculationRules prefetch for ServiceWorker-controlled URLs",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.prefetchwithserviceworkerenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.prefetchwithserviceworkerenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}