{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Dictionary"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.Dictionary",
    "rootDefinitionId": "com.apple.dictionary_com.apple.dictionary",
    "categoryId": "65087b94-7e45-4d74-a50d-df4377b67499",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dictionary_com.apple.dictionary",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.Dictionary",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.dictionary_parentalcontrol"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.dictionary_parentalcontrol",
            "required": true
        }
    ]
}