{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "APNs/[{0}]/ProxyPort",
    "rootDefinitionId": "com.apple.cellular_com.apple.cellular",
    "categoryId": "5c722b3f-9d77-428a-b859-3fb556162cd6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.cellular_apns_item_proxyport",
    "description": "The proxy server's port number.",
    "helpText": null,
    "name": "APNs_item_ProxyPort",
    "displayName": "Proxy Port",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.cellular_apns",
            "parentSettingId": "com.apple.cellular_apns"
        }
    ],
    "dependedOnBy": []
}