{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Associated Domains"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.associated-domains",
    "rootDefinitionId": "com.apple.associated-domains_com.apple.associated-domains",
    "categoryId": "8efd284f-5a56-4da8-8821-f51984ff954d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.associated-domains_com.apple.associated-domains",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.associated-domains",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.associated-domains_configuration"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.associated-domains_configuration",
            "required": true
        }
    ]
}