{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft OneDrive",
        "Microsoft One Drive"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/sharepoint/deploy-and-configure-on-macos#automaticuploadbandwidthpercentage"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.OneDrive/Forced/[0]/mcx_preference_settings",
    "offsetUri": "AutomaticUploadBandwidthPercentage",
    "rootDefinitionId": "com.apple.managedclient.preferences_automaticuploadbandwidthpercentage",
    "categoryId": "19ba782c-3594-45da-b829-72b54f6d45c7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_automaticuploadbandwidthpercentage",
    "description": "Enables the sync app to automatically set the amount of bandwidth used based on available bandwidth for uploading files. Accepted values are from 1 through 99.",
    "helpText": null,
    "name": "AutomaticUploadBandwidthPercentage",
    "displayName": "Automatic upload bandwidth percentage",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 99
    },
    "dependentOn": [],
    "dependedOnBy": []
}