{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On Kerberos"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ExtensionData",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
    "categoryId": "f35cc803-3a06-4262-b38b-a5295321f756",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_extensiondata_kerberos",
    "description": "This is the dictionary used by the Apple built-in Kerberos extension.",
    "helpText": null,
    "name": "ExtensionData",
    "displayName": "Extension Data",
    "childIds": [
        "com.apple.extensiblesso_extensiondata_principalname_kerberos",
        "com.apple.extensiblesso_extensiondata_sitecode_kerberos",
        "com.apple.extensiblesso_extensiondata_certificateuuid_kerberos",
        "com.apple.extensiblesso_extensiondata_usesiteautodiscovery_kerberos",
        "com.apple.extensiblesso_extensiondata_credentialbundleidacl_kerberos",
        "com.apple.extensiblesso_extensiondata_includemanagedappsinbundleidacl_kerberos",
        "com.apple.extensiblesso_extensiondata_includekerberosappsinbundleidacl_kerberos",
        "com.apple.extensiblesso_extensiondata_domainrealmmapping_kerberos",
        "com.apple.extensiblesso_extensiondata_isdefaultrealm_kerberos",
        "com.apple.extensiblesso_extensiondata_customusernamelabel_kerberos",
        "com.apple.extensiblesso_extensiondata_helptext_kerberos",
        "com.apple.extensiblesso_extensiondata_allowpasswordchange_kerberos",
        "com.apple.extensiblesso_extensiondata_allowautomaticlogin_kerberos",
        "com.apple.extensiblesso_extensiondata_requireuserpresence_kerberos",
        "com.apple.extensiblesso_extensiondata_pwnotificationdays_kerberos",
        "com.apple.extensiblesso_extensiondata_pwreqlength_kerberos",
        "com.apple.extensiblesso_extensiondata_pwreqcomplexity_kerberos",
        "com.apple.extensiblesso_extensiondata_pwreqminage_kerberos",
        "com.apple.extensiblesso_extensiondata_pwreqhistory_kerberos",
        "com.apple.extensiblesso_extensiondata_pwreqtext_kerberos",
        "com.apple.extensiblesso_extensiondata_pwreqrtfdata_kerberos",
        "com.apple.extensiblesso_extensiondata_pwchangeurl_kerberos",
        "com.apple.extensiblesso_extensiondata_synclocalpassword_kerberos",
        "com.apple.extensiblesso_extensiondata_delayusersetup_kerberos",
        "com.apple.extensiblesso_extensiondata_monitorcredentialscache_kerberos",
        "com.apple.extensiblesso_extensiondata_requiretlsforldap_kerberos",
        "com.apple.extensiblesso_extensiondata_credentialusemode_kerberos",
        "com.apple.extensiblesso_extensiondata_preferredkdcs_kerberos",
        "com.apple.extensiblesso_extensiondata_useplatformssotgt_kerberos",
        "com.apple.extensiblesso_extensiondata_allowplatformssoauthfallback_kerberos",
        "com.apple.extensiblesso_extensiondata_performkerberosonly_kerberos",
        "com.apple.extensiblesso_extensiondata_identityissuerautoselectfilter_kerberos",
        "com.apple.extensiblesso_extensiondata_allowsmartcard_kerberos",
        "com.apple.extensiblesso_extensiondata_allowpassword_kerberos",
        "com.apple.extensiblesso_extensiondata_startinsmartcardmode_kerberos"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
            "parentSettingId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_principalname_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_sitecode_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_certificateuuid_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_usesiteautodiscovery_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_credentialbundleidacl_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_includemanagedappsinbundleidacl_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_includekerberosappsinbundleidacl_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_domainrealmmapping_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_isdefaultrealm_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_customusernamelabel_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_helptext_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_allowpasswordchange_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_allowautomaticlogin_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_requireuserpresence_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwnotificationdays_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwreqlength_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwreqcomplexity_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwreqminage_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwreqhistory_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwreqtext_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwreqrtfdata_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_pwchangeurl_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_synclocalpassword_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_delayusersetup_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_monitorcredentialscache_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_requiretlsforldap_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_credentialusemode_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_preferredkdcs_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_useplatformssotgt_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_allowplatformssoauthfallback_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_performkerberosonly_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_identityissuerautoselectfilter_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_allowsmartcard_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_allowpassword_kerberos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_startinsmartcardmode_kerberos",
            "required": false
        }
    ]
}