{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On",
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ExtensionData",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_extensiondata",
    "description": "A dictionary of arbitrary data passed through to the app extension.",
    "helpText": null,
    "name": "ExtensionData",
    "displayName": "Extension Data",
    "childIds": [
        "com.apple.extensiblesso_ignored_$typepicker",
        "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.extensiblesso_com.apple.extensiblesso",
            "parentSettingId": "com.apple.extensiblesso_com.apple.extensiblesso"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.extensiblesso_ignored_$typepicker",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
            "required": true
        }
    ]
}