{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "OnDemandRules/[{0}]/ActionParameters/DomainAction",
    "rootDefinitionId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "categoryId": "bbe51018-a17d-46c4-9517-ff45c54d8d18",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domainaction",
    "description": " The DNS settings behavior for the specified domains.",
    "helpText": null,
    "name": "OnDemandRules_item_ActionParameters_DomainAction",
    "displayName": "Domain Action (Deprecated)",
    "defaultOptionId": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domainaction_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domainaction_0",
            "description": null,
            "helpText": null,
            "name": "NeverConnect",
            "displayName": "Never Connect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NeverConnect"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domainaction_1",
            "description": null,
            "helpText": null,
            "name": "ConnectIfNeeded",
            "displayName": "Connect If Needed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ConnectIfNeeded"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters"
                }
            ],
            "dependedOnBy": []
        }
    ]
}