{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Printing"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "UserPrinterList",
    "rootDefinitionId": "com.apple.mcxprinting_com.apple.mcxprinting",
    "categoryId": "174ffe92-3770-4688-aa21-85b7535cf374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxprinting_userprinterlist",
    "description": "The printers available to a user.",
    "helpText": null,
    "name": "UserPrinterList",
    "displayName": "User Printer List",
    "childIds": [
        "com.apple.mcxprinting_userprinterlist_printer"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcxprinting_com.apple.mcxprinting",
            "parentSettingId": "com.apple.mcxprinting_com.apple.mcxprinting"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist_printer",
            "required": false
        }
    ]
}