{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "forcePreserveESIMOnErase",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_forcepreserveesimonerase",
    "description": "If set to true, eSIM will be preserved when a device is erased due to too many failed password attempt or the \"Erase All Content and Settings\" option in Settings > General > Reset. eSIM will not be preserved if the device is erased by FindMy.",
    "helpText": null,
    "name": "forcePreserveESIMOnErase",
    "displayName": "Force Preserve ESIM On Erase",
    "defaultOptionId": "com.apple.applicationaccess_forcepreserveesimonerase_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_forcepreserveesimonerase_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_forcepreserveesimonerase_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        }
    ]
}