{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password",
        "Require",
        "Unlock",
        "Device password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/passwordRequireUnlock/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.passwordrequireunlock",
    "categoryId": "f350f9a2-3a91-4d6d-90ed-7e3849b0d5f1",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.passwordrequireunlock",
    "description": "Select how long users have before they're required to unlock the device using a strong authentication method (password, PIN, or pattern). Available for fully managed, dedicated and corporate-owned work profile devices (at work profile level).",
    "helpText": "",
    "name": "PasswordRequireUnlock",
    "displayName": "Required unlock frequency",
    "defaultOptionId": null,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequireunlock_devicedefault",
            "description": null,
            "helpText": null,
            "name": "USE_DEFAULT_DEVICE_TIMEOUT",
            "displayName": "Device default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "USE_DEFAULT_DEVICE_TIMEOUT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordrequireunlock_requiredpasswordunlockdailyoption",
            "description": null,
            "helpText": null,
            "name": "REQUIRE_EVERY_DAY",
            "displayName": "24 hours since last PIN, password, or pattern unlock",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "REQUIRE_EVERY_DAY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}