{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Time Machine"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "BackupSizeMB",
    "rootDefinitionId": "com.apple.mcx.timemachine_com.apple.mcx.timemachine",
    "categoryId": "361859d9-1382-47c3-b9ec-9251a62fbb25",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx.timemachine_backupsizemb",
    "description": "The backup size limit, in megabytes. Set to 0 for unlimited.",
    "helpText": null,
    "name": "BackupSizeMB",
    "displayName": "Backup Size MB",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcx.timemachine_com.apple.mcx.timemachine",
            "parentSettingId": "com.apple.mcx.timemachine_com.apple.mcx.timemachine"
        }
    ],
    "dependedOnBy": []
}