{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content Caching"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CacheLimit",
    "rootDefinitionId": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "categoryId": "e95335ec-2704-47ab-8b40-f602b31eeb9d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.assetcache.managed_cachelimit",
    "description": "The maximum number of bytes of disk space that will be used for the content cache. A value of 0 means unlimited disk space.",
    "helpText": null,
    "name": "CacheLimit",
    "displayName": "Cache Limit",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.assetcache.managed_com.apple.assetcache.managed",
            "parentSettingId": "com.apple.assetcache.managed_com.apple.assetcache.managed"
        }
    ],
    "dependedOnBy": []
}