{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Policy Managed"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.systempolicy.managed",
    "rootDefinitionId": "com.apple.systempolicy.managed_com.apple.systempolicy.managed",
    "categoryId": "64538726-8745-4e7a-b370-332f725b58bf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systempolicy.managed_com.apple.systempolicy.managed",
    "description": "com.apple.systempolicy.managed",
    "helpText": null,
    "name": "com.apple.systempolicy.managed",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.systempolicy.managed_disableoverride"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.systempolicy.managed_disableoverride",
            "required": false
        }
    ]
}