{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Office"
    ],
    "infoUrls": [
        "https://aka.ms/macvbpref"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.office/Forced/[0]/mcx_preference_settings",
    "offsetUri": "VisualBasicMacroExecutionState",
    "rootDefinitionId": "com.apple.managedclient.preferences_visualbasicmacroexecutionstate",
    "categoryId": "b5169b74-41be-460a-9402-b13b6c22582b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_visualbasicmacroexecutionstate",
    "description": "Controls whether Visual Basic macros are allowed to execute in Word, Excel, and PowerPoint.",
    "helpText": null,
    "name": "VisualBasicMacroExecutionState",
    "displayName": "Visual Basic macro policy",
    "defaultOptionId": "com.apple.managedclient.preferences_visualbasicmacroexecutionstate_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_visualbasicmacroexecutionstate_0",
            "description": null,
            "helpText": null,
            "name": "Macros disabled by default, with warning to enable",
            "displayName": "Macros disabled by default, with warning to enable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "DisabledWithWarnings"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_visualbasicmacroexecutionstate_1",
            "description": null,
            "helpText": null,
            "name": "Disable all macros",
            "displayName": "Disable all macros",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "DisabledWithoutWarnings"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_visualbasicmacroexecutionstate_2",
            "description": null,
            "helpText": null,
            "name": "Always allow macros to run (potentially dangerous)",
            "displayName": "Always allow macros to run (potentially dangerous)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "EnabledWithoutWarnings"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}