{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Scareware Blocker settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.ScarewareBlockerAllowListDomains",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.scarewareblockerallowlistdomains",
    "categoryId": "16ea64a1-563e-43cc-b34a-728c8e7cd13c",
    "settingUsage": "configuration",
    "uxBehavior": "smallTextBox",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.scarewareblockerallowlistdomains",
    "description": "This policy configures the list of trusted domains for Microsoft Edge Scareware blocker. When a website's source URL matches any domain in this list, Microsoft Edge Scareware blocker doesn't analyze that site.\n\nThis policy takes effect only if the ScarewareBlockerProtectionEnabled policy is enabled.\n\nIf you enable this policy, Microsoft Edge Scareware blocker trusts the specified domains.\n\nIf you disable or don't configure this policy, Microsoft Edge Scareware blocker analyzes all sites.",
    "helpText": null,
    "name": "ScarewareBlockerAllowListDomains",
    "displayName": "Configure the list of domains where Microsoft Edge Scareware blockers don't run",
    "maximumCount": 600,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}