{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Outlook"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployoffice/mac/preferences-outlook#specify-when-pictures-are-downloaded-for-email"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Outlook/Forced/[0]/mcx_preference_settings",
    "offsetUri": "AutomaticallyDownloadExternalContent",
    "rootDefinitionId": "com.apple.managedclient.preferences_automaticallydownloadexternalcontent",
    "categoryId": "191a84f2-13b5-4609-808f-8b743b7f0247",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_automaticallydownloadexternalcontent",
    "description": "Automatically downloading images will provide users with a better messaging experience. However, be aware of the privacy considerations if you are enabling this setting.",
    "helpText": null,
    "name": "AutomaticallyDownloadExternalContent",
    "displayName": "Download embedded images",
    "defaultOptionId": "com.apple.managedclient.preferences_automaticallydownloadexternalcontent_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_automaticallydownloadexternalcontent_0",
            "description": null,
            "helpText": null,
            "name": "Never download images",
            "displayName": "Never download images",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_automaticallydownloadexternalcontent_1",
            "description": null,
            "helpText": null,
            "name": "Automatically download images from users in the address book",
            "displayName": "Automatically download images from users in the address book",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_automaticallydownloadexternalcontent_2",
            "description": null,
            "helpText": null,
            "name": "Always download images regardless of sender",
            "displayName": "Always download images regardless of sender",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}