{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Web Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "FilterDataProviderDesignatedRequirement",
    "rootDefinitionId": "com.apple.webcontent-filter_com.apple.webcontent-filter",
    "categoryId": "a6fe8038-136b-4d50-bf04-8e232409c0d2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.webcontent-filter_filterdataproviderdesignatedrequirement",
    "description": "The designated requirement string that the system embeds in the code signature of the filter data provider system extension. This string identifies the filter data provider when the filter starts running. This field is a requirement if Filter Sockets is true.",
    "helpText": null,
    "name": "FilterDataProviderDesignatedRequirement",
    "displayName": "Filter Data Provider Designated Requirement",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.webcontent-filter_com.apple.webcontent-filter",
            "parentSettingId": "com.apple.webcontent-filter_com.apple.webcontent-filter"
        }
    ],
    "dependedOnBy": []
}