{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "minutesUntilFailedLoginReset",
    "rootDefinitionId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "categoryId": "d68abc4d-559a-4339-be48-c41a77a87034",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mobiledevice.passwordpolicy_minutesuntilfailedloginreset",
    "description": "The number of minutes before the login is reset after the maximum number of unsuccessful login attempts is reached. This key requires setting Max Failed Attempts. Available in macOS 10.10 and later.",
    "helpText": null,
    "name": "minutesUntilFailedLoginReset",
    "displayName": "Minutes Until Failed Login Reset",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mobiledevice.passwordpolicy_maxfailedattempts",
            "parentSettingId": "com.apple.mobiledevice.passwordpolicy_maxfailedattempts"
        },
        {
            "dependentOn": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
            "parentSettingId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy"
        }
    ],
    "dependedOnBy": []
}