{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LDAP"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "LDAPAccountUserName",
    "rootDefinitionId": "com.apple.ldap.account_com.apple.ldap.account",
    "categoryId": "9ba1b877-865a-4104-8376-b43a0c75b04b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.ldap.account_ldapaccountusername",
    "description": "The user name.",
    "helpText": null,
    "name": "LDAPAccountUserName",
    "displayName": "LDAP Account User Name",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "variableReplacement",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": "{{USERNAME}}"
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.ldap.account_com.apple.ldap.account",
            "parentSettingId": "com.apple.ldap.account_com.apple.ldap.account"
        }
    ],
    "dependedOnBy": []
}