{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Directory Service"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.DirectoryService.managed",
    "rootDefinitionId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
    "categoryId": "5995d2ad-5ec7-49d2-ada2-d9c2b57746ba",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.DirectoryService.managed",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.directoryservice.managed_hostname",
        "com.apple.directoryservice.managed_username",
        "com.apple.directoryservice.managed_password",
        "com.apple.directoryservice.managed_clientid",
        "com.apple.directoryservice.managed_description",
        "com.apple.directoryservice.managed_adorganizationalunit",
        "com.apple.directoryservice.managed_admountstyle",
        "com.apple.directoryservice.managed_adcreatemobileaccountatloginflag",
        "com.apple.directoryservice.managed_adcreatemobileaccountatlogin",
        "com.apple.directoryservice.managed_adwarnuserbeforecreatingmaflag",
        "com.apple.directoryservice.managed_adwarnuserbeforecreatingma",
        "com.apple.directoryservice.managed_adforcehomelocalflag",
        "com.apple.directoryservice.managed_adforcehomelocal",
        "com.apple.directoryservice.managed_adusewindowsuncpathflag",
        "com.apple.directoryservice.managed_adusewindowsuncpath",
        "com.apple.directoryservice.managed_adallowmultidomainauthflag",
        "com.apple.directoryservice.managed_adallowmultidomainauth",
        "com.apple.directoryservice.managed_addefaultusershellflag",
        "com.apple.directoryservice.managed_addefaultusershell",
        "com.apple.directoryservice.managed_admapuidattributeflag",
        "com.apple.directoryservice.managed_admapuidattribute",
        "com.apple.directoryservice.managed_admapgidattributeflag",
        "com.apple.directoryservice.managed_admapgidattribute",
        "com.apple.directoryservice.managed_admapggidattributeflag",
        "com.apple.directoryservice.managed_admapggidattribute",
        "com.apple.directoryservice.managed_adpreferreddcserverflag",
        "com.apple.directoryservice.managed_adpreferreddcserver",
        "com.apple.directoryservice.managed_addomainadmingrouplistflag",
        "com.apple.directoryservice.managed_addomainadmingrouplist",
        "com.apple.directoryservice.managed_adnamespaceflag",
        "com.apple.directoryservice.managed_adnamespace",
        "com.apple.directoryservice.managed_adpacketsignflag",
        "com.apple.directoryservice.managed_adpacketsign",
        "com.apple.directoryservice.managed_adpacketencryptflag",
        "com.apple.directoryservice.managed_adpacketencrypt",
        "com.apple.directoryservice.managed_adrestrictddnsflag",
        "com.apple.directoryservice.managed_adrestrictddns",
        "com.apple.directoryservice.managed_adtrustchangepassintervaldaysflag",
        "com.apple.directoryservice.managed_adtrustchangepassintervaldays"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.directoryservice.managed_hostname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_username",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_password",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_clientid",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_description",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adorganizationalunit",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_admountstyle",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adcreatemobileaccountatloginflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adcreatemobileaccountatlogin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adwarnuserbeforecreatingmaflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adwarnuserbeforecreatingma",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adforcehomelocalflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adforcehomelocal",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adusewindowsuncpathflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adusewindowsuncpath",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adallowmultidomainauthflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adallowmultidomainauth",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_addefaultusershellflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_addefaultusershell",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_admapuidattributeflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_admapuidattribute",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_admapgidattributeflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_admapgidattribute",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_admapggidattributeflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_admapggidattribute",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adpreferreddcserverflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adpreferreddcserver",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_addomainadmingrouplistflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_addomainadmingrouplist",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adnamespaceflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adnamespace",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adpacketsignflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adpacketsign",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adpacketencryptflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adpacketencrypt",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adrestrictddnsflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adrestrictddns",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adtrustchangepassintervaldaysflag",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.directoryservice.managed_adtrustchangepassintervaldays",
            "required": false
        }
    ]
}