{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content Caching"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ListenRanges/[{0}]/type",
    "rootDefinitionId": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "categoryId": "e95335ec-2704-47ab-8b40-f602b31eeb9d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.assetcache.managed_listenranges_item_type",
    "description": "The IP address type.",
    "helpText": null,
    "name": "ListenRanges_item_type",
    "displayName": "IP Address Type",
    "defaultOptionId": "com.apple.assetcache.managed_listenranges_item_type_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.assetcache.managed_listenranges_item_type_0",
            "description": null,
            "helpText": null,
            "name": "IPv4",
            "displayName": "IPv4",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "IPv4"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.assetcache.managed_listenranges",
                    "parentSettingId": "com.apple.assetcache.managed_listenranges"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.assetcache.managed_listenranges_item_type_1",
            "description": null,
            "helpText": null,
            "name": "IPv6",
            "displayName": "IPv6",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "IPv6"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.assetcache.managed_listenranges",
                    "parentSettingId": "com.apple.assetcache.managed_listenranges"
                }
            ],
            "dependedOnBy": []
        }
    ]
}