{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Tamper protection"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/tamperProtection",
    "offsetUri": "exclusions",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions_tamperprotection",
    "categoryId": "5c4df3be-80b0-40cc-a8c8-0258120b0de5",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_exclusions_tamperprotection",
    "description": "Defines process that can interfere with Defender without considering it tampering",
    "helpText": null,
    "name": "exclusions_tamperProtection",
    "displayName": "Process exclusions",
    "childIds": [
        "com.apple.managedclient.preferences_exclusions_item_path_tamperprotection",
        "com.apple.managedclient.preferences_exclusions_item_teamid_tamperprotection",
        "com.apple.managedclient.preferences_exclusions_item_signingid_tamperprotection",
        "com.apple.managedclient.preferences_exclusions_item_args_tamperprotection"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_path_tamperprotection",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_teamid_tamperprotection",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_signingid_tamperprotection",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_exclusions_item_args_tamperprotection",
            "required": false
        }
    ]
}