{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Energy Saver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.EnergySaver.desktop.Schedule/RepeatingPowerOff/weekdays",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-energysaver",
    "categoryId": "8c75a12d-664d-43ba-a3aa-5259425f9b37",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays",
    "description": "One or more days of the week that the device will automatically shutdown. ",
    "helpText": null,
    "name": "com.apple.EnergySaver.desktop.Schedule_RepeatingPowerOff_weekdays",
    "displayName": "Weekdays",
    "defaultOptionId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_0",
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_0",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "Mon",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_1",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "Tue",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_2",
            "description": null,
            "helpText": null,
            "name": "4",
            "displayName": "Wed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_3",
            "description": null,
            "helpText": null,
            "name": "8",
            "displayName": "Thu",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 8
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_4",
            "description": null,
            "helpText": null,
            "name": "16",
            "displayName": "Fri",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 16
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_5",
            "description": null,
            "helpText": null,
            "name": "32",
            "displayName": "Sat",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 32
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_weekdays_6",
            "description": null,
            "helpText": null,
            "name": "64",
            "displayName": "Sun",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 64
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        }
    ]
}