{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Accessibility"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "closeViewScrollWheelToggle",
    "rootDefinitionId": "com.apple.universalaccess_com.apple.universalaccess",
    "categoryId": "c00d6468-cac3-429c-ada5-ba3adf4982a8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.universalaccess_closeviewscrollwheeltoggle",
    "description": "If true, enables \"Use scroll gesture\" in the Zoom options.",
    "helpText": null,
    "name": "closeViewScrollWheelToggle",
    "displayName": "Close View Scroll Wheel Toggle",
    "defaultOptionId": "com.apple.universalaccess_closeviewscrollwheeltoggle_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.universalaccess_closeviewscrollwheeltoggle_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.universalaccess_com.apple.universalaccess",
                    "parentSettingId": "com.apple.universalaccess_com.apple.universalaccess"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.universalaccess_closeviewscrollwheeltoggle_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.universalaccess_com.apple.universalaccess",
                    "parentSettingId": "com.apple.universalaccess_com.apple.universalaccess"
                }
            ],
            "dependedOnBy": []
        }
    ]
}