{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On Kerberos"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ExtensionData/domainRealmMapping/{0}",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
    "categoryId": "f35cc803-3a06-4262-b38b-a5295321f756",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_extensiondata_domainrealmmapping_realm_kerberos",
    "description": "The key should be the name of the realm, and the value is an array of DNS suffixes that map to the realm.",
    "helpText": null,
    "name": "ExtensionData_domainRealmMapping_genericKey",
    "displayName": "Realm (Deprecated)",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.extensiblesso_extensiondata_domainrealmmapping_kerberos",
            "parentSettingId": "com.apple.extensiblesso_extensiondata_domainrealmmapping_kerberos"
        }
    ],
    "dependedOnBy": []
}