{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Edge Workspaces settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.EdgeWorkspacesEnabled",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.edgeworkspacesenabled",
    "categoryId": "ef6a4e8c-07b2-4f55-9e94-5701cb2268b1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.edgeworkspacesenabled",
    "description": "Microsoft Edge Workspaces helps improve productivity for users in your organization.\n\nIf you enable or don't configure this policy, users will be able to access the Microsoft Edge Workspaces feature.\nIf you disable this policy, users will not be able to access the Microsoft Edge Workspaces feature.\n\nTo learn more about the feature, see <a href=\"https://go.microsoft.com/fwlink/?linkid=2209950\">https://go.microsoft.com/fwlink/?linkid=2209950</a>",
    "helpText": null,
    "name": "EdgeWorkspacesEnabled",
    "displayName": "Enable Workspaces",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.edgeworkspacesenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.edgeworkspacesenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}