{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Managed Menu Extras"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "delaySeconds",
    "rootDefinitionId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
    "categoryId": "b6ad9576-be4c-46b9-a3a6-13a03ff1fed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxmenuextras_delayseconds",
    "description": "The number of seconds to delay after login before adding or removing menu extras. If the delay is too short, the menu extras don't appear, or disappear from the menu bar.",
    "helpText": null,
    "name": "delaySeconds",
    "displayName": "Delay Seconds",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 2
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
            "parentSettingId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras"
        }
    ],
    "dependedOnBy": []
}