{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Application Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "familyControlsEnabled",
    "rootDefinitionId": "com.apple.applicationaccess.new_com.apple.applicationaccess.new",
    "categoryId": "f019963f-f4ed-4429-b6e3-babfb24c36a8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess.new_familycontrolsenabled",
    "description": "If true, enables app access restrictions.",
    "helpText": null,
    "name": "familyControlsEnabled",
    "displayName": "Family Controls Enabled",
    "defaultOptionId": "com.apple.applicationaccess.new_familycontrolsenabled_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess.new_familycontrolsenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess.new_com.apple.applicationaccess.new",
                    "parentSettingId": "com.apple.applicationaccess.new_com.apple.applicationaccess.new"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess.new_familycontrolsenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess.new_com.apple.applicationaccess.new",
                    "parentSettingId": "com.apple.applicationaccess.new_com.apple.applicationaccess.new"
                }
            ],
            "dependedOnBy": []
        }
    ]
}