{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Subscribed Calendars"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "SubCalAccountUseSSL",
    "rootDefinitionId": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account",
    "categoryId": "fa20bbc3-d25d-4a7f-a349-9b211d186e21",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.subscribedcalendar.account_subcalaccountusessl",
    "description": "If true, enables SSL.",
    "helpText": null,
    "name": "SubCalAccountUseSSL",
    "displayName": "Account Use SSL",
    "defaultOptionId": "com.apple.subscribedcalendar.account_subcalaccountusessl_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.subscribedcalendar.account_subcalaccountusessl_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account",
                    "parentSettingId": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.subscribedcalendar.account_subcalaccountusessl_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account",
                    "parentSettingId": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account"
                }
            ],
            "dependedOnBy": []
        }
    ]
}