{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#passwordprotectionwarningtrigger"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "PasswordProtectionWarningTrigger",
    "rootDefinitionId": "com.apple.managedclient.preferences_passwordprotectionwarningtrigger",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_passwordprotectionwarningtrigger",
    "description": "Allows you to control when to trigger password protection warning. Password protection alerts users when they reuse their protected password on potentially suspicious sites.\n\nYou can use the \"PasswordProtectionLoginURLs\" and \"PasswordProtectionChangePasswordURL\" policies to configure which passwords to protect.\n\nExemptions: Passwords for the sites listed in \"PasswordProtectionLoginURLs\" and \"PasswordProtectionChangePasswordURL\", as well as for the sites listed in \"SmartScreenAllowListDomains\", will not trigger a password-protection warning.\n\nSet to 'PasswordProtectionWarningOff' (0) to not show password protection warningss.\n\nSet to 'PasswordProtectionWarningOnPasswordReuse' (1) to show password protection warnings when the user reuses their protected password on a non-whitelisted site.\n\nIf you disable or don't configure this policy, then the warning trigger is not shown.\n\n* 0 = Password protection warning is off.\n\n* 1 = Password protection warning is triggered by password reuse.",
    "helpText": null,
    "name": "PasswordProtectionWarningTrigger",
    "displayName": "Configure password protection warning trigger",
    "defaultOptionId": "com.apple.managedclient.preferences_passwordprotectionwarningtrigger_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_passwordprotectionwarningtrigger_0",
            "description": null,
            "helpText": null,
            "name": "Password protection warning is off",
            "displayName": "Password protection warning is off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_passwordprotectionwarningtrigger_1",
            "description": null,
            "helpText": null,
            "name": "Password protection warning is triggered by password reuse",
            "displayName": "Password protection warning is triggered by password reuse",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}