{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Lock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.app.lock",
    "rootDefinitionId": "com.apple.app.lock_com.apple.app.lock",
    "categoryId": "7b4e3f58-fb7a-4e6b-8f39-35d1cd90f508",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.app.lock_com.apple.app.lock",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.app.lock",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.app.lock_app"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.app.lock_app",
            "required": true
        }
    ]
}