{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Work Profile Password",
        "Passcode",
        "Password type",
        "Password required type"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/mem/intune/configuration/device-restrictions-android-for-work?WT.mc_id=Portal-fx#device-password:~:text=owned%20work%20profiles.-,Required%20password%20type%3A,-Enter%20the%20required"
    ],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/workProfilePasswordRequiredType/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype",
    "categoryId": "70c4566f-a079-4a8e-ac97-0736b405df1d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype",
    "description": "Set the work profile password’s complexity requirements. Additional password requirements will become available based on your selection. Available for corporate-owned work profile devices (at work profile level). For more details, see the information provided in the ‘Learn More’ section below.",
    "helpText": "",
    "name": "WorkProfilePasswordRequiredType",
    "displayName": "Required password type",
    "defaultOptionId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_devicedefault",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_devicedefault",
            "description": "Device default value, no intent.",
            "helpText": null,
            "name": null,
            "displayName": "Device default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "PASSWORD_QUALITY_UNSPECIFIED"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_required",
            "description": "There must be a password set, but there are no restrictions on type.",
            "helpText": null,
            "name": "SOMETHING",
            "displayName": "Password required, no restrictions",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "SOMETHING"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_lowsecuritybiometric",
            "description": "Low security biometrics based password required.",
            "helpText": null,
            "name": "BIOMETRIC_WEAK",
            "displayName": "Weak Biometric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "BIOMETRIC_WEAK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_numeric",
            "description": "At least numeric.",
            "helpText": null,
            "name": "NUMERIC",
            "displayName": "Numeric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NUMERIC"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_numericcomplex",
            "description": "At least numeric with no repeating or ordered sequences.",
            "helpText": null,
            "name": "NUMERIC_COMPLEX",
            "displayName": "Numeric Complex",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NUMERIC_COMPLEX"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_alphabetic",
            "description": "At least alphabetic password.",
            "helpText": null,
            "name": "ALPHABETIC",
            "displayName": "Alphabetic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ALPHABETIC"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_alphanumeric",
            "description": "At least alphanumeric password",
            "helpText": null,
            "name": "ALPHANUMERIC",
            "displayName": "Alphanumeric",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ALPHANUMERIC"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlength",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_alphanumericwithsymbols",
            "description": "At least alphanumeric with symbols.",
            "helpText": null,
            "name": "COMPLEX",
            "displayName": "Alphanumeric with symbols",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "COMPLEX"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlength",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlettercharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlowercasecharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumnonlettercharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumnumericcharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumsymbolcharacters",
                    "required": false
                },
                {
                    "dependedOnBy": "com.android.devicerestrictionpolicy.workprofilepasswordminimumuppercasecharacters",
                    "required": false
                }
            ]
        }
    ]
}