{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "persistent-apps/[{0}]/tile-data/file-type",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_persistent-apps_item_tile-data_file-type",
    "description": "The type of file",
    "helpText": null,
    "name": "persistent-apps_item_tile-data_file-type",
    "displayName": "File Type",
    "defaultOptionId": "com.apple.dock_persistent-apps_item_tile-data_file-type_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dock_persistent-apps_item_tile-data_file-type_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "URL",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_persistent-apps_item_tile-data",
                    "parentSettingId": "com.apple.dock_persistent-apps_item_tile-data"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_persistent-apps_item_tile-data_file-type_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "File",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_persistent-apps_item_tile-data",
                    "parentSettingId": "com.apple.dock_persistent-apps_item_tile-data"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_persistent-apps_item_tile-data_file-type_2",
            "description": null,
            "helpText": null,
            "name": "3",
            "displayName": "Directory",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_persistent-apps_item_tile-data",
                    "parentSettingId": "com.apple.dock_persistent-apps_item_tile-data"
                }
            ],
            "dependedOnBy": []
        }
    ]
}