{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Outlook"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployoffice/mac/preferences-outlook#set-the-order-in-which-smime-certificates-are-considered"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Outlook/Forced/[0]/mcx_preference_settings",
    "offsetUri": "SMIMECertificatesLookupOrder",
    "rootDefinitionId": "com.apple.managedclient.preferences_smimecertificateslookuporder",
    "categoryId": "191a84f2-13b5-4609-808f-8b743b7f0247",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_smimecertificateslookuporder",
    "description": "Set the order in which certificates will be used to decrypt and encrypt S/MIME messages.",
    "helpText": null,
    "name": "SMIMECertificatesLookupOrder",
    "displayName": "Set the order in which S/MIME certificates are considered",
    "defaultOptionId": "com.apple.managedclient.preferences_smimecertificateslookuporder_0",
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_smimecertificateslookuporder_0",
            "description": null,
            "helpText": null,
            "name": "Contacts",
            "displayName": "Contacts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_smimecertificateslookuporder_1",
            "description": null,
            "helpText": null,
            "name": "Global Address List",
            "displayName": "Global Address List",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_smimecertificateslookuporder_2",
            "description": null,
            "helpText": null,
            "name": "Device",
            "displayName": "Device",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_smimecertificateslookuporder_3",
            "description": null,
            "helpText": null,
            "name": "LDAP",
            "displayName": "LDAP",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}