{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PlatformSSO/AuthenticationMethod",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_platformsso_authenticationmethod",
    "description": "The Platform SSO authentication method to be used with the extension. Requires that the SSO Extension also support the method.",
    "helpText": null,
    "name": "PlatformSSO_AuthenticationMethod",
    "displayName": "Authentication Method",
    "defaultOptionId": "com.apple.extensiblesso_platformsso_authenticationmethod_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_platformsso_authenticationmethod_0",
            "description": null,
            "helpText": null,
            "name": "Password",
            "displayName": "Password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Password"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_platformsso",
                    "parentSettingId": "com.apple.extensiblesso_platformsso"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_platformsso_authenticationmethod_1",
            "description": null,
            "helpText": null,
            "name": "UserSecureEnclaveKey",
            "displayName": "UserSecureEnclaveKey",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "UserSecureEnclaveKey"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_platformsso",
                    "parentSettingId": "com.apple.extensiblesso_platformsso"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_platformsso_authenticationmethod_2",
            "description": null,
            "helpText": null,
            "name": "SmartCard",
            "displayName": "SmartCard",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "SmartCard"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_platformsso",
                    "parentSettingId": "com.apple.extensiblesso_platformsso"
                }
            ],
            "dependedOnBy": []
        }
    ]
}