{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [
        "https://support.microsoft.com/office/update-office-for-mac-automatically-bfd1e497-c24d-4754-92ab-910a4074d7c1"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "HowToCheck",
    "rootDefinitionId": "com.apple.managedclient.preferences_howtocheck",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_howtocheck",
    "description": "Specifies whether AutoUpdate should download and install updates. This value should be true unless you need to temporarily halt all updates.",
    "helpText": null,
    "name": "HowToCheck",
    "displayName": "Enable AutoUpdate",
    "defaultOptionId": "com.apple.managedclient.preferences_howtocheck_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_howtocheck_0",
            "description": null,
            "helpText": null,
            "name": "Automatically Download and Install",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AutomaticDownload"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_howtocheck_1",
            "description": null,
            "helpText": null,
            "name": "Automatically Check for Updates",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AutomaticCheck"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_howtocheck_2",
            "description": null,
            "helpText": null,
            "name": "Manual Check",
            "displayName": "Manual Check",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Manual"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}