{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content Caching"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PeerFilterRanges",
    "rootDefinitionId": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "categoryId": "e95335ec-2704-47ab-8b40-f602b31eeb9d",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.assetcache.managed_peerfilterranges",
    "description": "The ranges of peer IP addresses that the content cache uses to filter its list of peers to query for content. The content cache only queries peers in Peer Filter Ranges. When Peer Filter Ranges is an empty array, the content cache doesn't query any peers.",
    "helpText": null,
    "name": "PeerFilterRanges",
    "displayName": "Peer Filter Ranges",
    "childIds": [
        "com.apple.assetcache.managed_peerfilterranges_item_type",
        "com.apple.assetcache.managed_peerfilterranges_item_first",
        "com.apple.assetcache.managed_peerfilterranges_item_last"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.assetcache.managed_com.apple.assetcache.managed",
            "parentSettingId": "com.apple.assetcache.managed_com.apple.assetcache.managed"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.assetcache.managed_peerfilterranges_item_type",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_peerfilterranges_item_first",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_peerfilterranges_item_last",
            "required": true
        }
    ]
}