{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Firewall"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Applications/[{0}]/BundleID",
    "rootDefinitionId": "com.apple.security.firewall_com.apple.security.firewall",
    "categoryId": "70b5da13-9c31-4857-890d-b7eb223729c3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.security.firewall_applications_item_bundleid",
    "description": "The bundle identifier for an app.",
    "helpText": null,
    "name": "Applications_item_BundleID",
    "displayName": "Bundle ID",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.security.firewall_applications",
            "parentSettingId": "com.apple.security.firewall_applications"
        }
    ],
    "dependedOnBy": []
}