{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Proxy server"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.ProxySettings",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.proxysettings",
    "categoryId": "fe845e81-5993-4a65-b22a-decfc5928c65",
    "settingUsage": "configuration",
    "uxBehavior": "largeTextBox",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.proxysettings",
    "description": "Configures the proxy settings for Microsoft Edge.\n\nIf you enable this policy, Microsoft Edge ignores all proxy-related options specified from the command line.\n\nIf you don't configure this policy, users can choose their own proxy settings.\n\nThis policy overrides the following individual policies:\n\n\"ProxyMode\"\n\n\"ProxyPacUrl\"\n\n\"ProxyServer\"\n\n\"ProxyBypassList\"\n\nSetting the \"ProxySettings\" policy accepts the following fields:\n\n* ProxyMode, which lets you specify the proxy server used by Microsoft Edge and prevents users from changing proxy settings\n\n* ProxyPacUrl, a URL to a proxy .pac file, or a PAC script encoded as a data URL with MIME type application/x-ns-proxy-autoconfig\n\n* ProxyPacMandatory, a boolean flag which prevents the network stack from falling back to direct connections with invalid or unavailable PAC script\n\n* ProxyServer, a URL for the proxy server\n\n* ProxyBypassList, a list of proxy hosts that Microsoft Edge bypasses\n\nFor ProxyMode, if you choose the value:\n\n* direct, a proxy is never used and all other fields are ignored.\n\n* system, the systems's proxy is used and all other fields are ignored.\n\n* auto_detect, all other fields are ignored.\n\n* fixed_servers, the ProxyServer and ProxyBypassList fields are used.\n\n* pac_script, the ProxyPacUrl, ProxyPacMandatory and ProxyBypassList fields are used.\n\nFor more detailed examples go to <a href=\"https://go.microsoft.com/fwlink/?linkid=2094936\">https://go.microsoft.com/fwlink/?linkid=2094936</a>.",
    "helpText": null,
    "name": "ProxySettings",
    "displayName": "Proxy settings",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}