{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Service Management",
        "Service Management - Managed Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Rules/[{0}]/RuleType",
    "rootDefinitionId": "com.apple.servicemanagement_com.apple.servicemanagement",
    "categoryId": "9859957e-34f1-4669-9f95-2b7c79fff052",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.servicemanagement_rules_item_ruletype",
    "description": "The type of comparision to make.",
    "helpText": null,
    "name": "Rules_item_RuleType",
    "displayName": "Rule Type",
    "defaultOptionId": "com.apple.servicemanagement_rules_item_ruletype_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.servicemanagement_rules_item_ruletype_0",
            "description": null,
            "helpText": null,
            "name": "BundleIdentifier",
            "displayName": "Bundle Identifier",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "BundleIdentifier"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.servicemanagement_rules",
                    "parentSettingId": "com.apple.servicemanagement_rules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.servicemanagement_rules_item_ruletype_1",
            "description": null,
            "helpText": null,
            "name": "BundleIdentifierPrefix",
            "displayName": "Bundle Identifier Prefix",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "BundleIdentifierPrefix"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.servicemanagement_rules",
                    "parentSettingId": "com.apple.servicemanagement_rules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.servicemanagement_rules_item_ruletype_2",
            "description": null,
            "helpText": null,
            "name": "Label",
            "displayName": "Label",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Label"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.servicemanagement_rules",
                    "parentSettingId": "com.apple.servicemanagement_rules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.servicemanagement_rules_item_ruletype_3",
            "description": null,
            "helpText": null,
            "name": "LabelPrefix",
            "displayName": "Label Prefix",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "LabelPrefix"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.servicemanagement_rules",
                    "parentSettingId": "com.apple.servicemanagement_rules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.servicemanagement_rules_item_ruletype_4",
            "description": null,
            "helpText": null,
            "name": "TeamIdentifier",
            "displayName": "Team Identifier",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "TeamIdentifier"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.servicemanagement_rules",
                    "parentSettingId": "com.apple.servicemanagement_rules"
                }
            ],
            "dependedOnBy": []
        }
    ]
}