{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "allowUnmanagedToReadManagedContacts",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_allowunmanagedtoreadmanagedcontacts",
    "description": "If true, unmanaged apps can read from managed contacts accounts. If Allow Open From Managed To Unmanaged is true, this restriction has no effect. If this restriction is set to true, you must install the payload through MDM. Available in iOS 12 and later. Also available for user enrollment.",
    "helpText": null,
    "name": "allowUnmanagedToReadManagedContacts",
    "displayName": "Allow Unmanaged To Read Managed Contacts",
    "defaultOptionId": "com.apple.applicationaccess_allowunmanagedtoreadmanagedcontacts_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_allowunmanagedtoreadmanagedcontacts_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_allowunmanagedtoreadmanagedcontacts_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        }
    ]
}