{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Identification",
        "Identification (Deprecated)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PayloadIdentification/EmailAddress",
    "rootDefinitionId": "com.apple.configurationprofile.identification_com.apple.configurationprofile.identification",
    "categoryId": "c3fdc01d-0648-4dcb-855d-7afe78bf1d89",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.configurationprofile.identification_payloadidentification_emailaddress",
    "description": "The address for the account.",
    "helpText": null,
    "name": "PayloadIdentification_EmailAddress",
    "displayName": "Email Address",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.configurationprofile.identification_payloadidentification",
            "parentSettingId": "com.apple.configurationprofile.identification_payloadidentification"
        }
    ],
    "dependedOnBy": []
}