{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "enforcedFingerprintTimeout",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_enforcedfingerprinttimeout",
    "description": "The value, in seconds, after which the fingerprint unlock will require a password to authenticate. The default value is 48 hours.",
    "helpText": null,
    "name": "enforcedFingerprintTimeout",
    "displayName": "Enforced Fingerprint Timeout",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 172800
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
            "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
        }
    ],
    "dependedOnBy": []
}