{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#externalprotocoldialogshowalwaysopencheckbox"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ExternalProtocolDialogShowAlwaysOpenCheckbox",
    "rootDefinitionId": "com.apple.managedclient.preferences_externalprotocoldialogshowalwaysopencheckbox",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_externalprotocoldialogshowalwaysopencheckbox",
    "description": "This policy controls whether the \"Always open\" checkbox is shown on external protocol launch confirmation prompts.\n\nIf you set this policy to True, when an external protocol confirmation prompt is shown, the user can select \"Always open\". The user won’t get any future confirmation prompts for this protocol.\n\nIf you set this policy to False, or the policy is unset, the \"Always open\" checkbox isn’t displayed. The user will be prompted for confirmation every time an external protocol is invoked.",
    "helpText": null,
    "name": "ExternalProtocolDialogShowAlwaysOpenCheckbox",
    "displayName": "Show an \"Always open\" checkbox in external protocol dialog",
    "defaultOptionId": "com.apple.managedclient.preferences_externalprotocoldialogshowalwaysopencheckbox_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_externalprotocoldialogshowalwaysopencheckbox_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_externalprotocoldialogshowalwaysopencheckbox_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}