{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webrtclocalhostiphandling"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "WebRtcLocalhostIpHandling",
    "rootDefinitionId": "com.apple.managedclient.preferences_webrtclocalhostiphandling",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_webrtclocalhostiphandling",
    "description": "Allows you to set whether or not WebRTC exposes the user's local IP address.\n\nIf you set this policy to \"AllowAllInterfaces\" ('default') or \"AllowPublicAndPrivateInterfaces\" ('default_public_and_private_interfaces'), WebRTC exposes the local IP address.\n\nIf you set this policy to \"AllowPublicInterfaceOnly\" ('default_public_interface_only') or \"DisableNonProxiedUdp\" ('disable_non_proxied_udp'), WebRTC doesn't expose the local IP address.\n\nIf you don't set this policy, or if you disable it, WebRTC exposes the local IP address.\n\n  * 'default' = Allow all interfaces. This exposes the local IP address.\n  * 'default_public_and_private_interfaces' = Allow public and private interfaces over http default route. This exposes the local IP address.\n  * 'default_public_interface_only' = Allow public interface over http default route. This doesn't expose the local IP address.\n  * 'disable_non_proxied_udp' = Use TCP unless proxy server supports UDP. This doesn't expose the local IP address.",
    "helpText": null,
    "name": "WebRtcLocalhostIpHandling",
    "displayName": "Restrict exposure of local IP address by WebRTC",
    "defaultOptionId": "com.apple.managedclient.preferences_webrtclocalhostiphandling_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_webrtclocalhostiphandling_0",
            "description": null,
            "helpText": null,
            "name": "Allow all interfaces. This exposes the local IP address",
            "displayName": "Allow all interfaces. This exposes the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "default"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_webrtclocalhostiphandling_1",
            "description": null,
            "helpText": null,
            "name": "Allow public and private interfaces over http default route. This exposes the local IP address",
            "displayName": "Allow public and private interfaces over http default route. This exposes the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "default_public_and_private_interfaces"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_webrtclocalhostiphandling_2",
            "description": null,
            "helpText": null,
            "name": "Allow public interface over http default route. This doesn't expose the local IP address",
            "displayName": "Allow public interface over http default route. This doesn't expose the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "default_public_interface_only"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_webrtclocalhostiphandling_3",
            "description": null,
            "helpText": null,
            "name": "Use TCP unless proxy server supports UDP. This doesn't expose the local IP address",
            "displayName": "Use TCP unless proxy server supports UDP. This doesn't expose the local IP address",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disable_non_proxied_udp"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}