{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Proxy Configuration"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Proxies",
    "rootDefinitionId": "com.apple.systemconfiguration_com.apple.systemconfiguration",
    "categoryId": "b8ed9eb3-17de-4091-b08b-7adb2fe13271",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systemconfiguration_proxies",
    "description": "The dictionary containing all the proxies for this device.",
    "helpText": null,
    "name": "Proxies",
    "displayName": "Proxies",
    "childIds": [
        "com.apple.systemconfiguration_proxies_ftpenable",
        "com.apple.systemconfiguration_proxies_ftppassive",
        "com.apple.systemconfiguration_proxies_ftpport",
        "com.apple.systemconfiguration_proxies_ftpproxy",
        "com.apple.systemconfiguration_proxies_gopherenable",
        "com.apple.systemconfiguration_proxies_gopherport",
        "com.apple.systemconfiguration_proxies_gopherproxy",
        "com.apple.systemconfiguration_proxies_httpenable",
        "com.apple.systemconfiguration_proxies_httpport",
        "com.apple.systemconfiguration_proxies_httpproxy",
        "com.apple.systemconfiguration_proxies_httpsenable",
        "com.apple.systemconfiguration_proxies_httpsport",
        "com.apple.systemconfiguration_proxies_httpsproxy",
        "com.apple.systemconfiguration_proxies_proxyautoconfigenable",
        "com.apple.systemconfiguration_proxies_proxyautoconfigurlstring",
        "com.apple.systemconfiguration_proxies_proxycaptiveloginallowed",
        "com.apple.systemconfiguration_proxies_rtspenable",
        "com.apple.systemconfiguration_proxies_rtspport",
        "com.apple.systemconfiguration_proxies_rtspproxy",
        "com.apple.systemconfiguration_proxies_socksenable",
        "com.apple.systemconfiguration_proxies_socksportinteger",
        "com.apple.systemconfiguration_proxies_socksproxy",
        "com.apple.systemconfiguration_proxies_fallbackallowed",
        "com.apple.systemconfiguration_proxies_exceptionslist"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.systemconfiguration_com.apple.systemconfiguration",
            "parentSettingId": "com.apple.systemconfiguration_com.apple.systemconfiguration"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_ftpenable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_ftppassive",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_ftpport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_ftpproxy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_gopherenable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_gopherport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_gopherproxy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_httpenable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_httpport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_httpproxy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_httpsenable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_httpsport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_httpsproxy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_proxyautoconfigenable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_proxyautoconfigurlstring",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_proxycaptiveloginallowed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_rtspenable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_rtspport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_rtspproxy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_socksenable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_socksportinteger",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_socksproxy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_fallbackallowed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.systemconfiguration_proxies_exceptionslist",
            "required": false
        }
    ]
}