{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ratingTVShows",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_ratingtvshowsau",
    "description": "The maximum level of TV content allowed on the device. Available in iOS 4 and later.",
    "helpText": null,
    "name": "ratingTVShows",
    "displayName": "Rating TV Shows - Australia",
    "defaultOptionId": "com.apple.applicationaccess_ratingtvshowsau_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_1",
            "description": null,
            "helpText": null,
            "name": "P",
            "displayName": "P",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 100
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_2",
            "description": null,
            "helpText": null,
            "name": "C",
            "displayName": "C",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 200
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_3",
            "description": null,
            "helpText": null,
            "name": "G",
            "displayName": "G",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 300
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_4",
            "description": null,
            "helpText": null,
            "name": "PG",
            "displayName": "PG",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 400
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_5",
            "description": null,
            "helpText": null,
            "name": "M",
            "displayName": "M",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 500
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_6",
            "description": null,
            "helpText": null,
            "name": "MA15+",
            "displayName": "MA15+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 550
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_7",
            "description": null,
            "helpText": null,
            "name": "AV15+",
            "displayName": "AV15+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 575
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_8",
            "description": null,
            "helpText": null,
            "name": "R",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 600
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingtvshowsau_9",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1000
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_1",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        }
    ]
}