{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "forceClassroomRequestPermissionToLeaveClasses",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_forceclassroomrequestpermissiontoleaveclasses",
    "description": "If true, a student enrolled in an unmanaged course through Classroom requests permission from the teacher when attempting to leave the course. Requires a supervised device. Available in iOS 11.3 and later, and macOS 10.14.4 and later.",
    "helpText": null,
    "name": "forceClassroomRequestPermissionToLeaveClasses",
    "displayName": "Force Classroom Request Permission To Leave Classes",
    "defaultOptionId": "com.apple.applicationaccess_forceclassroomrequestpermissiontoleaveclasses_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_forceclassroomrequestpermissiontoleaveclasses_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_forceclassroomrequestpermissiontoleaveclasses_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        }
    ]
}