{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Outlook"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployoffice/mac/preferences-outlook#enable-new-outlook"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Outlook/Forced/[0]/mcx_preference_settings",
    "offsetUri": "EnableNewOutlook",
    "rootDefinitionId": "com.apple.managedclient.preferences_enablenewoutlook",
    "categoryId": "191a84f2-13b5-4609-808f-8b743b7f0247",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_enablenewoutlook",
    "description": "Specify whether users should be allowed to switch between Classic and New Outlook.",
    "helpText": null,
    "name": "EnableNewOutlook",
    "displayName": "Enable New Outlook",
    "defaultOptionId": "com.apple.managedclient.preferences_enablenewoutlook_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_enablenewoutlook_0",
            "description": null,
            "helpText": null,
            "name": "Classic Outlook only",
            "displayName": "Classic Outlook only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enablenewoutlook_1",
            "description": null,
            "helpText": null,
            "name": "Default to Classic Outlook. Users may switch to New Outlook",
            "displayName": "Default to Classic Outlook. Users may switch to New Outlook",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enablenewoutlook_2",
            "description": null,
            "helpText": null,
            "name": "Default to New Outlook. Users may revert to Classic Outlook",
            "displayName": "Default to New Outlook. Users may revert to Classic Outlook",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enablenewoutlook_3",
            "description": null,
            "helpText": null,
            "name": "New Outlook only",
            "displayName": "New Outlook only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}