{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "NewTabPageManagedQuickLinks/[{0}]/pinned",
    "rootDefinitionId": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks_item_pinned",
    "description": "0 - Not Pinned; 1 - Pinned.",
    "helpText": null,
    "name": "NewTabPageManagedQuickLinks_item_pinned",
    "displayName": "Pinned",
    "defaultOptionId": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks_item_pinned_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks_item_pinned_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks",
                    "parentSettingId": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks_item_pinned_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks",
                    "parentSettingId": "com.apple.managedclient.preferences_newtabpagemanagedquicklinks"
                }
            ],
            "dependedOnBy": []
        }
    ]
}