{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Game Center"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.gamed",
    "rootDefinitionId": "com.apple.gamed_com.apple.gamed",
    "categoryId": "7ecdd7c9-6ab2-4dac-88ef-9bdad46e1f66",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.gamed_com.apple.gamed",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.gamed",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.gamed_gkfeatureaccountmodificationallowed"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.gamed_gkfeatureaccountmodificationallowed",
            "required": false
        }
    ]
}