{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ApplicationsSystem//Applications/Microsoft Defender ATP.app",
    "rootDefinitionId": "com.apple.managedclient.preferences_applicationssystem",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app",
    "description": null,
    "helpText": null,
    "name": "ApplicationsSystem_Applications_Microsoft Defender ATP.app",
    "displayName": "Microsoft Defender ATP (Deprecated)",
    "childIds": [
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_application id",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_lcid",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_channelname",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_manifestserver"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.managedclient.preferences_applicationssystem",
            "parentSettingId": "com.apple.managedclient.preferences_applicationssystem"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_application id",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_lcid",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_channelname",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app_manifestserver",
            "required": false
        }
    ]
}