{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Printing"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PrintMACAddress",
    "rootDefinitionId": "com.apple.mcxprinting_com.apple.mcxprinting",
    "categoryId": "174ffe92-3770-4688-aa21-85b7535cf374",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxprinting_printmacaddress",
    "description": "If true, includes the MAC address.",
    "helpText": null,
    "name": "PrintMACAddress",
    "displayName": "Print MAC Address",
    "defaultOptionId": "com.apple.mcxprinting_printmacaddress_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mcxprinting_printmacaddress_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcxprinting_com.apple.mcxprinting",
                    "parentSettingId": "com.apple.mcxprinting_com.apple.mcxprinting"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcxprinting_printmacaddress_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcxprinting_com.apple.mcxprinting",
                    "parentSettingId": "com.apple.mcxprinting_com.apple.mcxprinting"
                }
            ],
            "dependedOnBy": []
        }
    ]
}