{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Identification",
        "Identification (Deprecated)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PayloadIdentification",
    "rootDefinitionId": "com.apple.configurationprofile.identification_com.apple.configurationprofile.identification",
    "categoryId": "c3fdc01d-0648-4dcb-855d-7afe78bf1d89",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.configurationprofile.identification_payloadidentification",
    "description": "The dictionary containing details about the user.",
    "helpText": null,
    "name": "PayloadIdentification",
    "displayName": "Payload Identification (Deprecated)",
    "childIds": [
        "com.apple.configurationprofile.identification_payloadidentification_username",
        "com.apple.configurationprofile.identification_payloadidentification_fullname",
        "com.apple.configurationprofile.identification_payloadidentification_emailaddress",
        "com.apple.configurationprofile.identification_payloadidentification_authmethod",
        "com.apple.configurationprofile.identification_payloadidentification_password",
        "com.apple.configurationprofile.identification_payloadidentification_prompt",
        "com.apple.configurationprofile.identification_payloadidentification_promptmessage"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.configurationprofile.identification_com.apple.configurationprofile.identification",
            "parentSettingId": "com.apple.configurationprofile.identification_com.apple.configurationprofile.identification"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification_username",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification_fullname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification_emailaddress",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification_authmethod",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification_password",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification_prompt",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.configurationprofile.identification_payloadidentification_promptmessage",
            "required": false
        }
    ]
}