{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AttachAPN/AllowedProtocolMask",
    "rootDefinitionId": "com.apple.cellular_com.apple.cellular",
    "categoryId": "5c722b3f-9d77-428a-b859-3fb556162cd6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.cellular_attachapn_allowedprotocolmask",
    "description": "The supported Internet Protocol versions.",
    "helpText": null,
    "name": "AttachAPN_AllowedProtocolMask",
    "displayName": "Allowed Protocol Mask",
    "defaultOptionId": "com.apple.cellular_attachapn_allowedprotocolmask_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.cellular_attachapn_allowedprotocolmask_0",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "IPv4",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.cellular_attachapn",
                    "parentSettingId": "com.apple.cellular_attachapn"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.cellular_attachapn_allowedprotocolmask_1",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "IPv6",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.cellular_attachapn",
                    "parentSettingId": "com.apple.cellular_attachapn"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.cellular_attachapn_allowedprotocolmask_2",
            "description": null,
            "helpText": null,
            "name": "3",
            "displayName": "Both",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.cellular_attachapn",
                    "parentSettingId": "com.apple.cellular_attachapn"
                }
            ],
            "dependedOnBy": []
        }
    ]
}