{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ratingRegion",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_ratingregion",
    "description": "The country key that profile tools use to display the proper ratings for the given region. This data isn’t recognized or reported by the client.",
    "helpText": null,
    "name": "ratingRegion",
    "displayName": "Rating Region",
    "defaultOptionId": "com.apple.applicationaccess_ratingregion_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_ratingregion_0",
            "description": null,
            "helpText": null,
            "name": "us",
            "displayName": "United States",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "us"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsus",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesus",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsus",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_1",
            "description": null,
            "helpText": null,
            "name": "au",
            "displayName": "Australia",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "au"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsau",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesau",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsau",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_2",
            "description": null,
            "helpText": null,
            "name": "ca",
            "displayName": "Canada",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ca"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsca",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesca",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsca",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_3",
            "description": null,
            "helpText": null,
            "name": "de",
            "displayName": "Germany",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsde",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesde",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsde",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_4",
            "description": null,
            "helpText": null,
            "name": "fr",
            "displayName": "France",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsfr",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesfr",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsfr",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_5",
            "description": null,
            "helpText": null,
            "name": "ie",
            "displayName": "Ireland",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ie"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsie",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesie",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsie",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_6",
            "description": null,
            "helpText": null,
            "name": "jp",
            "displayName": "Japan",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "jp"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsjp",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesjp",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsjp",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_7",
            "description": null,
            "helpText": null,
            "name": "nz",
            "displayName": "New Zealand",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nz"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsnz",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesnz",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsnz",
                    "required": false
                }
            ]
        },
        {
            "itemId": "com.apple.applicationaccess_ratingregion_8",
            "description": null,
            "helpText": null,
            "name": "gb",
            "displayName": "Great Britain",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gb"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingappsgb",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingmoviesgb",
                    "required": false
                },
                {
                    "dependedOnBy": "com.apple.applicationaccess_ratingtvshowsgb",
                    "required": false
                }
            ]
        }
    ]
}