{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Antivirus engine",
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#threat-type-settings"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "threatTypeSettings",
    "rootDefinitionId": "com.apple.managedclient.preferences_threattypesettings",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_threattypesettings",
    "description": "The threatTypeSettings preference in the antivirus engine is used to control how certain threat types are handled by the product.",
    "helpText": null,
    "name": "threatTypeSettings",
    "displayName": "Threat type settings",
    "childIds": [
        "com.apple.managedclient.preferences_threattypesettings_item_key",
        "com.apple.managedclient.preferences_threattypesettings_item_value"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.managedclient.preferences_threattypesettings_item_key",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_threattypesettings_item_value",
            "required": true
        }
    ]
}