{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cloud delivered protection preferences"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/defender-endpoint/mac-preferences#duration-for-security-intelligence-updates-due-in-days"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "definitionUpdateDue",
    "rootDefinitionId": "com.apple.managedclient.preferences_definitionupdatedue",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_definitionupdatedue",
    "description": "Determines the number of days after which the last installed security intelligence updates are considered outdated.",
    "helpText": null,
    "name": "definitionUpdateDue",
    "displayName": "Security intelligence update due (in days)",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 30,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 7
    },
    "dependentOn": [],
    "dependedOnBy": []
}