{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DisabledPreferencePanes",
    "rootDefinitionId": "com.apple.systempreferences_com.apple.systempreferences",
    "categoryId": "c7c1ed5a-a2ec-4237-bbf1-d5723f94d033",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systempreferences_disabledpreferencepanes",
    "description": "The list of disabled System Preferences panes.",
    "helpText": null,
    "name": "DisabledPreferencePanes",
    "displayName": "Disabled Preference Panes",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.systempreferences_com.apple.systempreferences",
            "parentSettingId": "com.apple.systempreferences_com.apple.systempreferences"
        }
    ],
    "dependedOnBy": []
}