{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Subscribed Calendars"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "SubCalAccountDescription",
    "rootDefinitionId": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account",
    "categoryId": "fa20bbc3-d25d-4a7f-a349-9b211d186e21",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.subscribedcalendar.account_subcalaccountdescription",
    "description": "The description of the account.",
    "helpText": null,
    "name": "SubCalAccountDescription",
    "displayName": "Account Description",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account",
            "parentSettingId": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account"
        }
    ],
    "dependedOnBy": []
}