{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Firewall"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "LoggingOption",
    "rootDefinitionId": "com.apple.security.firewall_com.apple.security.firewall",
    "categoryId": "70b5da13-9c31-4857-890d-b7eb223729c3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.security.firewall_loggingoption",
    "description": "This string specifies the type of logging. Available in macOS 12 and later.",
    "helpText": null,
    "name": "LoggingOption",
    "displayName": "Logging Option (Deprecated)",
    "defaultOptionId": "com.apple.security.firewall_loggingoption_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.security.firewall_loggingoption_0",
            "description": null,
            "helpText": null,
            "name": "throttled",
            "displayName": "throttled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "throttled"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.security.firewall_com.apple.security.firewall",
                    "parentSettingId": "com.apple.security.firewall_com.apple.security.firewall"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.security.firewall_loggingoption_1",
            "description": null,
            "helpText": null,
            "name": "brief",
            "displayName": "brief",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "brief"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.security.firewall_com.apple.security.firewall",
                    "parentSettingId": "com.apple.security.firewall_com.apple.security.firewall"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.security.firewall_loggingoption_2",
            "description": null,
            "helpText": null,
            "name": "detail",
            "displayName": "detail",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "detail"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.security.firewall_com.apple.security.firewall",
                    "parentSettingId": "com.apple.security.firewall_com.apple.security.firewall"
                }
            ],
            "dependedOnBy": []
        }
    ]
}