{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ratingMovies",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_ratingmoviesnz",
    "description": "The maximum level of movie content allowed on the device. Available in iOS 4 and later.",
    "helpText": null,
    "name": "ratingMovies",
    "displayName": "Rating Movies - New Zealand",
    "defaultOptionId": "com.apple.applicationaccess_ratingmoviesnz_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_1",
            "description": null,
            "helpText": null,
            "name": "G",
            "displayName": "G",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 100
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_2",
            "description": null,
            "helpText": null,
            "name": "PG",
            "displayName": "PG",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 200
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_3",
            "description": null,
            "helpText": null,
            "name": "M",
            "displayName": "M",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 300
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_4",
            "description": null,
            "helpText": null,
            "name": "R13",
            "displayName": "R13",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 325
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_5",
            "description": null,
            "helpText": null,
            "name": "R15",
            "displayName": "R15",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 350
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_6",
            "description": null,
            "helpText": null,
            "name": "R16",
            "displayName": "R16",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 375
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_7",
            "description": null,
            "helpText": null,
            "name": "R18",
            "displayName": "R18",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 400
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_8",
            "description": null,
            "helpText": null,
            "name": "R",
            "displayName": "R",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 500
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_9",
            "description": null,
            "helpText": null,
            "name": "RP16",
            "displayName": "RP16",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 600
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesnz_10",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1000
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_7",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        }
    ]
}