{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Office"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/deployoffice/mac/preferences-office"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.office/Forced/[0]/mcx_preference_settings",
    "offsetUri": "DefaultsToLocalOpenSave",
    "rootDefinitionId": "com.apple.managedclient.preferences_defaultstolocalopensave",
    "categoryId": "b5169b74-41be-460a-9402-b13b6c22582b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_defaultstolocalopensave",
    "description": "Prefer the local file system when accessing the Open and Save dialogs.",
    "helpText": null,
    "name": "DefaultsToLocalOpenSave",
    "displayName": "Default to local files for open/save",
    "defaultOptionId": "com.apple.managedclient.preferences_defaultstolocalopensave_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_defaultstolocalopensave_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_defaultstolocalopensave_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}