{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Outlook"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployoffice/mac/preferences-outlook#specify-microsoft-365-mailbox-to-be-added-on-first-launch"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Outlook/Forced/[0]/mcx_preference_settings",
    "offsetUri": "DefaultEmailAddressOrDomain",
    "rootDefinitionId": "com.apple.managedclient.preferences_defaultemailaddressordomain",
    "categoryId": "191a84f2-13b5-4609-808f-8b743b7f0247",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_defaultemailaddressordomain",
    "description": "Specify the domain or full email address of the Microsoft 365 mailbox to be added on first launch (e.g. contoso.com or fred@contoso.com).",
    "helpText": null,
    "name": "DefaultEmailAddressOrDomain",
    "displayName": "Default domain name",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}