{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Notifications"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "NotificationSettings/[{0}]/BundleIdentifier",
    "rootDefinitionId": "com.apple.notificationsettings_com.apple.notificationsettings",
    "categoryId": "ff90bf4b-0583-4761-a1c4-5aa4b50c5872",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.notificationsettings_notificationsettings_item_bundleidentifier",
    "description": "The bundle identifier of the app to which to apply these notification settings. Available in iOS 9.3 and later and macOS 10.15 and later.",
    "helpText": null,
    "name": "NotificationSettings_item_BundleIdentifier",
    "displayName": "Bundle Identifier",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.notificationsettings_notificationsettings",
            "parentSettingId": "com.apple.notificationsettings_notificationsettings"
        }
    ],
    "dependedOnBy": []
}