{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "dblclickbehavior",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_dblclickbehavior",
    "description": "The behavior when the window's title bar is double-clicked.",
    "helpText": null,
    "name": "dblclickbehavior",
    "displayName": "Double Click Behavior",
    "defaultOptionId": "com.apple.dock_dblclickbehavior_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dock_dblclickbehavior_0",
            "description": null,
            "helpText": null,
            "name": "minimize",
            "displayName": "Minimize",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "minimize"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_dblclickbehavior_1",
            "description": null,
            "helpText": null,
            "name": "maximize",
            "displayName": "Maximize",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "maximize"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_dblclickbehavior_2",
            "description": null,
            "helpText": null,
            "name": "none",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "none"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        }
    ]
}