{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#dnsoverhttpsmode"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "DnsOverHttpsMode",
    "rootDefinitionId": "com.apple.managedclient.preferences_dnsoverhttpsmode",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_dnsoverhttpsmode",
    "description": "Control the mode of the DNS-over-HTTPS resolver. Note that this policy will only set the default mode for each query. The mode can be overridden for special types of queries such as requests to resolve a DNS-over-HTTPS server hostname.\n\nThe \"off\" mode will disable DNS-over-HTTPS.\n\nThe \"automatic\" mode will send DNS-over-HTTPS queries first if a DNS-over-HTTPS server is available and may fallback to sending insecure queries on error.\n\nThe \"secure\" mode will only send DNS-over-HTTPS queries and will fail to resolve on error.\n\nIf you don't configure this policy, the browser might send DNS-over-HTTPS requests to a resolver associated with the user's configured system resolver.",
    "helpText": null,
    "name": "DnsOverHttpsMode",
    "displayName": "Control the mode of DNS-over-HTTPS",
    "defaultOptionId": "com.apple.managedclient.preferences_dnsoverhttpsmode_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_dnsoverhttpsmode_0",
            "description": null,
            "helpText": null,
            "name": "Enable DNS-over-HTTPS with insecure fallback",
            "displayName": "Enable DNS-over-HTTPS with insecure fallback",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "automatic"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_dnsoverhttpsmode_1",
            "description": null,
            "helpText": null,
            "name": "Disable DNS-over-HTTPS",
            "displayName": "Disable DNS-over-HTTPS",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "off"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_dnsoverhttpsmode_2",
            "description": null,
            "helpText": null,
            "name": "Enable DNS-over-HTTPS without insecure fallback",
            "displayName": "Enable DNS-over-HTTPS without insecure fallback",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "secure"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}