{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Printing"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DefaultPrinter",
    "rootDefinitionId": "com.apple.mcxprinting_com.apple.mcxprinting",
    "categoryId": "174ffe92-3770-4688-aa21-85b7535cf374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxprinting_defaultprinter",
    "description": "The default printer for the user.",
    "helpText": null,
    "name": "DefaultPrinter",
    "displayName": "Default Printer",
    "childIds": [
        "com.apple.mcxprinting_defaultprinter_deviceuri",
        "com.apple.mcxprinting_defaultprinter_displayname"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcxprinting_com.apple.mcxprinting",
            "parentSettingId": "com.apple.mcxprinting_com.apple.mcxprinting"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcxprinting_defaultprinter_deviceuri",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_defaultprinter_displayname",
            "required": false
        }
    ]
}