{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "persistent-apps/[{0}]/tile-data",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_persistent-apps_item_tile-data",
    "description": "The information about the Dock item.",
    "helpText": null,
    "name": "persistent-apps_item_tile-data",
    "displayName": "Tile Data",
    "childIds": [
        "com.apple.dock_persistent-apps_item_tile-data_label",
        "com.apple.dock_persistent-apps_item_tile-data_url",
        "com.apple.dock_persistent-apps_item_tile-data_file-type",
        "com.apple.dock_persistent-apps_item_tile-data_file-data"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.dock_persistent-apps",
            "parentSettingId": "com.apple.dock_persistent-apps"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.dock_persistent-apps_item_tile-data_label",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.dock_persistent-apps_item_tile-data_url",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_persistent-apps_item_tile-data_file-type",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.dock_persistent-apps_item_tile-data_file-data",
            "required": false
        }
    ]
}