{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ProxySettings/ProxyMode",
    "rootDefinitionId": "com.apple.managedclient.preferences_proxysettings",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_proxysettings_proxymode",
    "description": null,
    "helpText": null,
    "name": "ProxySettings_ProxyMode",
    "displayName": "Proxy Mode",
    "defaultOptionId": "com.apple.managedclient.preferences_proxysettings_proxymode_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_proxysettings_proxymode_0",
            "description": null,
            "helpText": null,
            "name": "direct",
            "displayName": "direct",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "direct"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_proxysettings",
                    "parentSettingId": "com.apple.managedclient.preferences_proxysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_proxysettings_proxymode_1",
            "description": null,
            "helpText": null,
            "name": "auto_detect",
            "displayName": "auto_detect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "auto_detect"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_proxysettings",
                    "parentSettingId": "com.apple.managedclient.preferences_proxysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_proxysettings_proxymode_2",
            "description": null,
            "helpText": null,
            "name": "pac_script",
            "displayName": "pac_script",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pac_script"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_proxysettings",
                    "parentSettingId": "com.apple.managedclient.preferences_proxysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_proxysettings_proxymode_3",
            "description": null,
            "helpText": null,
            "name": "fixed_servers",
            "displayName": "fixed_servers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fixed_servers"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_proxysettings",
                    "parentSettingId": "com.apple.managedclient.preferences_proxysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_proxysettings_proxymode_4",
            "description": null,
            "helpText": null,
            "name": "system",
            "displayName": "system",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "system"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_proxysettings",
                    "parentSettingId": "com.apple.managedclient.preferences_proxysettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}