{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Energy Saver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.EnergySaver.portable.ACPower/Wake on LAN",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-energysaver",
    "categoryId": "8c75a12d-664d-43ba-a3aa-5259425f9b37",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan",
    "description": "If true, enables \"Wake for network access.\"",
    "helpText": null,
    "name": "com.apple.EnergySaver.portable.ACPower_Wake on LAN",
    "displayName": "Wake on LAN",
    "defaultOptionId": "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.portable.acpower",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.portable.acpower"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.portable.acpower",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.portable.acpower"
                }
            ],
            "dependedOnBy": []
        }
    ]
}