{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Notifications"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "NotificationSettings",
    "rootDefinitionId": "com.apple.notificationsettings_com.apple.notificationsettings",
    "categoryId": "ff90bf4b-0583-4761-a1c4-5aa4b50c5872",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.notificationsettings_notificationsettings",
    "description": "An array of notification settings dictionaries.",
    "helpText": null,
    "name": "NotificationSettings",
    "displayName": "Notification Settings",
    "childIds": [
        "com.apple.notificationsettings_notificationsettings_item_bundleidentifier",
        "com.apple.notificationsettings_notificationsettings_item_notificationsenabled",
        "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter",
        "com.apple.notificationsettings_notificationsettings_item_showinlockscreen",
        "com.apple.notificationsettings_notificationsettings_item_alerttype",
        "com.apple.notificationsettings_notificationsettings_item_badgesenabled",
        "com.apple.notificationsettings_notificationsettings_item_soundsenabled",
        "com.apple.notificationsettings_notificationsettings_item_showincarplay",
        "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled",
        "com.apple.notificationsettings_notificationsettings_item_groupingtype",
        "com.apple.notificationsettings_notificationsettings_item_previewtype"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.notificationsettings_com.apple.notificationsettings",
            "parentSettingId": "com.apple.notificationsettings_com.apple.notificationsettings"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_bundleidentifier",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_notificationsenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_showinlockscreen",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_alerttype",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_badgesenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_soundsenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_showincarplay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_groupingtype",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.notificationsettings_notificationsettings_item_previewtype",
            "required": false
        }
    ]
}