{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Energy Saver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.EnergySaver.desktop.Schedule/RepeatingPowerOff/eventtype",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-energysaver",
    "categoryId": "8c75a12d-664d-43ba-a3aa-5259425f9b37",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype",
    "description": "The type of action defined by this schedule.",
    "helpText": null,
    "name": "com.apple.EnergySaver.desktop.Schedule_RepeatingPowerOff_eventtype",
    "displayName": "Event Type",
    "defaultOptionId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype_0",
            "description": null,
            "helpText": null,
            "name": "wake",
            "displayName": "Wake",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wake"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype_1",
            "description": null,
            "helpText": null,
            "name": "poweron",
            "displayName": "Power On",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "poweron"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype_2",
            "description": null,
            "helpText": null,
            "name": "wakepoweron",
            "displayName": "Wake Power On",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wakepoweron"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype_3",
            "description": null,
            "helpText": null,
            "name": "sleep",
            "displayName": "Sleep",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sleep"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype_4",
            "description": null,
            "helpText": null,
            "name": "shutdown",
            "displayName": "Shutdown",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "shutdown"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff_eventtype_5",
            "description": null,
            "helpText": null,
            "name": "restart",
            "displayName": "Restart",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "restart"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff",
                    "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweroff"
                }
            ],
            "dependedOnBy": []
        }
    ]
}