{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ManifestServer",
    "rootDefinitionId": "com.apple.managedclient.preferences_manifestserver",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_manifestserver",
    "description": "You can tell AutoUpdate to either a) wait for a number of days to pass before downloading updates from the Current Channel, or b) stop Office from advancing beyond a given version. Deferred updates only affects Word, Excel, PowerPoint, Outlook, and OneNote. Other applications such as Edge, Defender, and Company Portal will receive updates based on the regular Current Channel schedule.",
    "helpText": null,
    "name": "ManifestServer",
    "displayName": "Deferred updates (Deprecated)",
    "defaultOptionId": "com.apple.managedclient.preferences_manifestserver_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_0",
            "description": null,
            "helpText": null,
            "name": "Defer 3 days",
            "displayName": "Defer 3 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Defer.3/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_1",
            "description": null,
            "helpText": null,
            "name": "Defer 7 days",
            "displayName": "Defer 7 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Defer.7/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_2",
            "description": null,
            "helpText": null,
            "name": "Defer 14 days",
            "displayName": "Defer 14 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Defer.14/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_3",
            "description": null,
            "helpText": null,
            "name": "Defer 21 days",
            "displayName": "Defer 21 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Defer.21/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_4",
            "description": null,
            "helpText": null,
            "name": "Defer 28 days",
            "displayName": "Defer 28 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Defer.28/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_5",
            "description": null,
            "helpText": null,
            "name": "Defer 45 days",
            "displayName": "Defer 45 days",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Defer.45/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_6",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.64 (August 2022 Release)",
            "displayName": "Pause at 16.64 (August 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.64.2208/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_7",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.63 (July 2022 Release)",
            "displayName": "Pause at 16.63 (July 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.63.2207/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_8",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.62 (June 2022 Release)",
            "displayName": "Pause at 16.62 (June 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.62.2206/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_9",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.61 (May 2022 Release)",
            "displayName": "Pause at 16.61 (May 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.61.2205/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_10",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.60 (April 2022 Release)",
            "displayName": "Pause at 16.60 (April 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.60.2204/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_11",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.59 (March 2022 Release)",
            "displayName": "Pause at 16.59 (March 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.59.2203/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_12",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.58 (February 2022 Release)",
            "displayName": "Pause at 16.58 (February 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.58.2202/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_13",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.57 (January 2022 Release)",
            "displayName": "Pause at 16.57 (January 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.57.2201/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_14",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.56 (December 2021 Release)",
            "displayName": "Pause at 16.56 (December 2021 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.56.2112/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_15",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.55 (November 2021 Release)",
            "displayName": "Pause at 16.55 (November 2021 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.55.2111/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_16",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.54 (October 2021 Release)",
            "displayName": "Pause at 16.54 (October 2021 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.54.2110/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_17",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.53 (September 2021 Release)",
            "displayName": "Pause at 16.53 (September 2021 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.53.2109/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_18",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.52 (August 2021 Release)",
            "displayName": "Pause at 16.52 (August 2021 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.52.2108/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_19",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.51 (July 2021 Release)",
            "displayName": "Pause at 16.51 (July 2021 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.51.2107/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_20",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.80 (December 2023 Release)",
            "displayName": "Pause at 16.80 (December 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.80.2312/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_21",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.79 (November 2023 Release)",
            "displayName": "Pause at 16.79 (November 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.79.2311/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_22",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.78 (October 2023 Release)",
            "displayName": "Pause at 16.78 (October 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.78.2310/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_23",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.77 (September 2023 Release)",
            "displayName": "Pause at 16.77 (September 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.77.2309/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_24",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.76 (August 2023 Release)",
            "displayName": "Pause at 16.76 (August 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.76.2308/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_25",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.75 (July 2023 Release)",
            "displayName": "Pause at 16.75 (July 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.75.2307/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_26",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.74 (June 2023 Release)",
            "displayName": "Pause at 16.74 (June 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.74.2306/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_27",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.73 (May 2023 Release)",
            "displayName": "Pause at 16.73 (May 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.73.2305/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_28",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.72 (April 2023 Release)",
            "displayName": "Pause at 16.72 (April 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.72.2304/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_29",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.71 (March 2023 Release)",
            "displayName": "Pause at 16.71 (March 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.71.2303/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_30",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.70 (February 2023 Release)",
            "displayName": "Pause at 16.70 (February 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.70.2302/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_31",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.69 (January 2023 Release)",
            "displayName": "Pause at 16.69 (January 2023 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.69.2301/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_32",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.68 (December 2022 Release)",
            "displayName": "Pause at 16.68 (December 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.68.2212/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_33",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.67 (November 2022 Release)",
            "displayName": "Pause at 16.67 (November 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.67.2211/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_34",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.66 (October 2022 Release)",
            "displayName": "Pause at 16.66 (October 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.66.2210/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_35",
            "description": null,
            "helpText": null,
            "name": "Pause at 16.65 (September 2022 Release)",
            "displayName": "Pause at 16.65 (September 2022 Release)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/16.65.2209/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_manifestserver_36",
            "description": null,
            "helpText": null,
            "name": "Change Freeze",
            "displayName": "Change Freeze",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "https://officecdnmac.microsoft.com/pr/Freeze/"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}