{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Vault",
        "FileVault"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.MCX.FileVault2",
    "rootDefinitionId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
    "categoryId": "3f56adc1-2207-4033-a6e2-07f64c08e3ff",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
    "description": "com.apple.MCX.FileVault2",
    "helpText": null,
    "name": "com.apple.MCX.FileVault2",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcx.filevault2_enable",
        "com.apple.mcx.filevault2_defer",
        "com.apple.mcx.filevault2_userentersmissinginfo",
        "com.apple.mcx.filevault2_userecoverykey",
        "com.apple.mcx.filevault2_showrecoverykey",
        "com.apple.mcx.filevault2_outputpath",
        "com.apple.mcx.filevault2_certificate",
        "com.apple.mcx.filevault2_payloadcertificateuuid",
        "com.apple.mcx.filevault2_username",
        "com.apple.mcx.filevault2_password",
        "com.apple.mcx.filevault2_usekeychain",
        "com.apple.mcx.filevault2_deferforceatuserloginmaxbypassattempts",
        "com.apple.mcx.filevault2_deferdontaskatuserlogout",
        "com.apple.mcx.filevault2_forceenableinsetupassistant",
        "com.apple.mcx.filevault2_recoverykeyrotationinmonths"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx.filevault2_enable",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_defer",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_userentersmissinginfo",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_userecoverykey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_showrecoverykey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_outputpath",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_certificate",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_payloadcertificateuuid",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_username",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_password",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_usekeychain",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_deferforceatuserloginmaxbypassattempts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_deferdontaskatuserlogout",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_forceenableinsetupassistant",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx.filevault2_recoverykeyrotationinmonths",
            "required": false
        }
    ]
}