{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Lock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "App/Options/DisableVolumeButtons",
    "rootDefinitionId": "com.apple.app.lock_com.apple.app.lock",
    "categoryId": "7b4e3f58-fb7a-4e6b-8f39-35d1cd90f508",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.app.lock_app_options_disablevolumebuttons",
    "description": "If true, disables the volume buttons.",
    "helpText": null,
    "name": "App_Options_DisableVolumeButtons",
    "displayName": "Disable Volume Buttons",
    "defaultOptionId": "com.apple.app.lock_app_options_disablevolumebuttons_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.app.lock_app_options_disablevolumebuttons_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.app.lock_app_options",
                    "parentSettingId": "com.apple.app.lock_app_options"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.app.lock_app_options_disablevolumebuttons_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.app.lock_app_options",
                    "parentSettingId": "com.apple.app.lock_app_options"
                }
            ],
            "dependedOnBy": []
        }
    ]
}