{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutoLaunchedApplicationDictionary-managed",
    "rootDefinitionId": "com.apple.loginitems.managed_com.apple.loginitems.managed",
    "categoryId": "6efb8802-223a-46a7-b13f-a68f28f8b2c2",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed",
    "description": "Auto Launch Login Items",
    "helpText": null,
    "name": "AutoLaunchedApplicationDictionary-managed",
    "displayName": "Auto Launch Items",
    "childIds": [
        "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_path",
        "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_hide"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.loginitems.managed_com.apple.loginitems.managed",
            "parentSettingId": "com.apple.loginitems.managed_com.apple.loginitems.managed"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_path",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_hide",
            "required": false
        }
    ]
}