{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content Caching"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutoEnableTetheredCaching",
    "rootDefinitionId": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "categoryId": "e95335ec-2704-47ab-8b40-f602b31eeb9d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.assetcache.managed_autoenabletetheredcaching",
    "description": "Automatically enable Internet connection sharing when possible and prevent disabling Internet connection sharing. Deny Tethered Caching overrides Auto Enable Tethered Caching. Tethered caching requires Content Caching. Available in macOS 10.15.4 and later.",
    "helpText": null,
    "name": "AutoEnableTetheredCaching",
    "displayName": "Auto Enable Tethered Caching",
    "defaultOptionId": "com.apple.assetcache.managed_autoenabletetheredcaching_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.assetcache.managed_autoenabletetheredcaching_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.assetcache.managed_com.apple.assetcache.managed",
                    "parentSettingId": "com.apple.assetcache.managed_com.apple.assetcache.managed"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.assetcache.managed_autoenabletetheredcaching_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.assetcache.managed_com.apple.assetcache.managed",
                    "parentSettingId": "com.apple.assetcache.managed_com.apple.assetcache.managed"
                }
            ],
            "dependedOnBy": []
        }
    ]
}