{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver User"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.screensaver.user",
    "rootDefinitionId": "com.apple.screensaver.user_com.apple.screensaver.user",
    "categoryId": "11c4cf0f-a03d-4309-93b2-011be4c410d5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.screensaver.user_com.apple.screensaver.user",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.screensaver.user",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.screensaver.user_modulename",
        "com.apple.screensaver.user_modulepath",
        "com.apple.screensaver.user_idletime"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.screensaver.user_modulename",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.screensaver.user_modulepath",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.screensaver.user_idletime",
            "required": false
        }
    ]
}