{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Login Window Behavior"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutologinUsername",
    "rootDefinitionId": "com.apple.loginwindow_com.apple.loginwindow",
    "categoryId": "8f831e0a-feb7-4cbb-acc1-2e583f3f4de3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.loginwindow_autologinusername",
    "description": "Sets up auto login with the specified short user name.",
    "helpText": null,
    "name": "AutologinUsername",
    "displayName": "Autologin Username",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.loginwindow_com.apple.loginwindow",
            "parentSettingId": "com.apple.loginwindow_com.apple.loginwindow"
        }
    ],
    "dependedOnBy": []
}