{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "OnDemandRules/[{0}]/ActionParameters",
    "rootDefinitionId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "categoryId": "bbe51018-a17d-46c4-9517-ff45c54d8d18",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters",
    "description": "A dictionary that provides per-connection rules.",
    "helpText": null,
    "name": "OnDemandRules_item_ActionParameters",
    "displayName": "Action Parameters",
    "childIds": [
        "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_item_domains",
        "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_item_domainaction",
        "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domains",
        "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domainaction"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.dnssettings.managed_ondemandrules",
            "parentSettingId": "com.apple.dnssettings.managed_ondemandrules"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_item_domains",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_item_domainaction",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domains",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters_domainaction",
            "required": false
        }
    ]
}