{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PlatformSSO/NewUserAuthorizationMode",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_platformsso_newuserauthorizationmode",
    "description": "This setting affects the permissions for accounts created at login by Platform SSO. It is only used when the account is created. Use of the following:\n* Standard\n    The account will be a standard user.\n* Admin\n    The account will be added to the local administrators group.\n* Groups\n    The account will be assigned groups using the 'AdministratorGroups', 'AdditionalGroups', or 'AuthorizationGroups'.",
    "helpText": null,
    "name": "PlatformSSO_NewUserAuthorizationMode",
    "displayName": "New User Authorization Mode",
    "defaultOptionId": "com.apple.extensiblesso_platformsso_newuserauthorizationmode_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_platformsso_newuserauthorizationmode_0",
            "description": null,
            "helpText": null,
            "name": "Standard",
            "displayName": "Standard",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Standard"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_platformsso",
                    "parentSettingId": "com.apple.extensiblesso_platformsso"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_platformsso_newuserauthorizationmode_1",
            "description": null,
            "helpText": null,
            "name": "Admin",
            "displayName": "Admin",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Admin"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_platformsso",
                    "parentSettingId": "com.apple.extensiblesso_platformsso"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_platformsso_newuserauthorizationmode_2",
            "description": null,
            "helpText": null,
            "name": "Groups",
            "displayName": "Groups",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Groups"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_platformsso",
                    "parentSettingId": "com.apple.extensiblesso_platformsso"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_platformsso_newuserauthorizationmode_3",
            "description": null,
            "helpText": null,
            "name": "Temporary",
            "displayName": "Temporary",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Temporary"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_platformsso",
                    "parentSettingId": "com.apple.extensiblesso_platformsso"
                }
            ],
            "dependedOnBy": []
        }
    ]
}