{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "askForPasswordDelay",
    "rootDefinitionId": "com.apple.screensaver_com.apple.screensaver",
    "categoryId": "8cefd936-362e-4a24-bc76-e078b6fd13fa",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.screensaver_askforpassworddelay",
    "description": "The number of seconds to delay before the password will be required to unlock or stop the screen saver (the grace period). A value of 2147483647 (for example, 0x7FFFFFFF) disables this requirement. To use this option, you must set Ask For Password to true. Available in macOS 10.13 and later.",
    "helpText": null,
    "name": "askForPasswordDelay",
    "displayName": "Ask For Password Delay",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.screensaver_com.apple.screensaver",
            "parentSettingId": "com.apple.screensaver_com.apple.screensaver"
        }
    ],
    "dependedOnBy": []
}