{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Energy Saver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.EnergySaver.portable.ACPower",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-energysaver",
    "categoryId": "8c75a12d-664d-43ba-a3aa-5259425f9b37",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.energysaver.portable.acpower",
    "description": "The settings for a laptop computer using AC power. ",
    "helpText": null,
    "name": "com.apple.EnergySaver.portable.ACPower",
    "displayName": "Laptop Power",
    "childIds": [
        "com.apple.mcx_com.apple.energysaver.portable.acpower_display sleep timer",
        "com.apple.mcx_com.apple.energysaver.portable.acpower_disk sleep timer",
        "com.apple.mcx_com.apple.energysaver.portable.acpower_system sleep timer",
        "com.apple.mcx_com.apple.energysaver.portable.acpower_reduce processor speed",
        "com.apple.mcx_com.apple.energysaver.portable.acpower_dynamic power step",
        "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan",
        "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on modem ring",
        "com.apple.mcx_com.apple.energysaver.portable.acpower_automatic restart on power loss"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcx_com.apple.mcx-energysaver",
            "parentSettingId": "com.apple.mcx_com.apple.mcx-energysaver"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_display sleep timer",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_disk sleep timer",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_system sleep timer",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_reduce processor speed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_dynamic power step",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on modem ring",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower_automatic restart on power loss",
            "required": false
        }
    ]
}