{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - User interface preferences",
        "User interface preferences"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#diagnostic-collection-level"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/userInterface",
    "offsetUri": "userInitiatedFeedback",
    "rootDefinitionId": "com.apple.managedclient.preferences_userinitiatedfeedback",
    "categoryId": "67cd904c-78e0-4e77-9dd4-c713b21763f3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_userinitiatedfeedback",
    "description": "Specify whether users can submit feedback to Microsoft by going to Help > Send Feedback.",
    "helpText": null,
    "name": "userInitiatedFeedback",
    "displayName": "User initiated feedback",
    "defaultOptionId": "com.apple.managedclient.preferences_userinitiatedfeedback_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_userinitiatedfeedback_0",
            "description": null,
            "helpText": null,
            "name": "enabled",
            "displayName": "enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "enabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_userinitiatedfeedback_1",
            "description": null,
            "helpText": null,
            "name": "disabled",
            "displayName": "disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}