{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Work",
        "Profile",
        "Password",
        "Minimum",
        "Letter",
        "Characters",
        "Work profile password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/workProfilePasswordMinimumLetterCharacters/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype",
    "categoryId": "70c4566f-a079-4a8e-ac97-0736b405df1d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.workprofilepasswordminimumlettercharacters",
    "description": "Enter the number of characters the work profile password must have, between 1 and 16 characters. Available for fully managed, dedicated and corporate-owned work profile devices (at work profile level).",
    "helpText": "Enter a number (1-16)",
    "name": "WorkProfilePasswordMinimumLetterCharacters",
    "displayName": "Number of characters required",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 16,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype_alphanumericwithsymbols",
            "parentSettingId": "com.android.devicerestrictionpolicy.workprofilepasswordrequiredtype"
        }
    ],
    "dependedOnBy": []
}