{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Managed Menu Extras"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.mcxMenuExtras",
    "rootDefinitionId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
    "categoryId": "b6ad9576-be4c-46b9-a3a6-13a03ff1fed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.mcxMenuExtras",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcxmenuextras_delayseconds",
        "com.apple.mcxmenuextras_maxwaitseconds",
        "com.apple.mcxmenuextras_airport.menu",
        "com.apple.mcxmenuextras_battery.menu",
        "com.apple.mcxmenuextras_bluetooth.menu",
        "com.apple.mcxmenuextras_cpu.menu",
        "com.apple.mcxmenuextras_clock.menu",
        "com.apple.mcxmenuextras_displays.menu",
        "com.apple.mcxmenuextras_eject.menu",
        "com.apple.mcxmenuextras_fax.menu",
        "com.apple.mcxmenuextras_homesync.menu",
        "com.apple.mcxmenuextras_ichat.menu",
        "com.apple.mcxmenuextras_ink.menu",
        "com.apple.mcxmenuextras_irda.menu",
        "com.apple.mcxmenuextras_pccard.menu",
        "com.apple.mcxmenuextras_ppp.menu",
        "com.apple.mcxmenuextras_pppoe.menu",
        "com.apple.mcxmenuextras_remotedesktop.menu",
        "com.apple.mcxmenuextras_script menu.menu",
        "com.apple.mcxmenuextras_spaces.menu",
        "com.apple.mcxmenuextras_sync.menu",
        "com.apple.mcxmenuextras_textinput.menu",
        "com.apple.mcxmenuextras_timemachine.menu",
        "com.apple.mcxmenuextras_universalaccess.menu",
        "com.apple.mcxmenuextras_user.menu",
        "com.apple.mcxmenuextras_vpn.menu",
        "com.apple.mcxmenuextras_volume.menu",
        "com.apple.mcxmenuextras_wwan.menu"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcxmenuextras_delayseconds",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_maxwaitseconds",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_airport.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_battery.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_bluetooth.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_cpu.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_clock.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_displays.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_eject.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_fax.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_homesync.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_ichat.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_ink.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_irda.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_pccard.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_ppp.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_pppoe.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_remotedesktop.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_script menu.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_spaces.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_sync.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_textinput.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_timemachine.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_universalaccess.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_user.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_vpn.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_volume.menu",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxmenuextras_wwan.menu",
            "required": false
        }
    ]
}