{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Profile Removal Password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RemovalPassword",
    "rootDefinitionId": "com.apple.profileremovalpassword_com.apple.profileremovalpassword",
    "categoryId": "e905d6cf-7820-48d4-86e0-b55fa991a5ad",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.profileremovalpassword_removalpassword",
    "description": "The password for allowing the profile to be removed.",
    "helpText": null,
    "name": "RemovalPassword",
    "displayName": "Removal Password",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 1,
        "isSecret": true,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
        "settingValueTemplateReference": null,
        "value": "",
        "valueState": "invalid"
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.profileremovalpassword_com.apple.profileremovalpassword",
            "parentSettingId": "com.apple.profileremovalpassword_com.apple.profileremovalpassword"
        }
    ],
    "dependedOnBy": []
}