{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Extensions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AllowedSystemExtensionTypes",
    "rootDefinitionId": "com.apple.system-extension-policy_com.apple.system-extension-policy",
    "categoryId": "cb33668b-933f-4424-8d2d-8bdf0e61bddd",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.system-extension-policy_allowedsystemextensiontypes",
    "description": "A dictionary that maps a team identifier to an array of strings, where each string is a type of system extension that you can install for that team identifier. The allowed extension types are DriverExtension, NetworkExtension, and EndpointSecurityExtension. If there’s no entry for a specified team identifier in the dictionary, the system allows all extension types.",
    "helpText": null,
    "name": "AllowedSystemExtensionTypes",
    "displayName": "Allowed System Extension Types",
    "childIds": [
        "com.apple.system-extension-policy_allowedsystemextensiontypes_generickey",
        "com.apple.system-extension-policy_allowedsystemextensiontypes_generickey_keytobereplaced"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.system-extension-policy_com.apple.system-extension-policy",
            "parentSettingId": "com.apple.system-extension-policy_com.apple.system-extension-policy"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.system-extension-policy_allowedsystemextensiontypes_generickey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.system-extension-policy_allowedsystemextensiontypes_generickey_keytobereplaced",
            "required": true
        }
    ]
}