{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content Caching"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.AssetCache.managed",
    "rootDefinitionId": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "categoryId": "e95335ec-2704-47ab-8b40-f602b31eeb9d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "description": "com.apple.AssetCache.managed",
    "helpText": null,
    "name": "com.apple.AssetCache.managed",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.assetcache.managed_allowcachedelete",
        "com.apple.assetcache.managed_allowpersonalcaching",
        "com.apple.assetcache.managed_allowsharedcaching",
        "com.apple.assetcache.managed_autoactivation",
        "com.apple.assetcache.managed_autoenabletetheredcaching",
        "com.apple.assetcache.managed_cachelimit",
        "com.apple.assetcache.managed_datapath",
        "com.apple.assetcache.managed_denytetheredcaching",
        "com.apple.assetcache.managed_displayalerts",
        "com.apple.assetcache.managed_keepawake",
        "com.apple.assetcache.managed_listenranges",
        "com.apple.assetcache.managed_listenrangesonly",
        "com.apple.assetcache.managed_listenwithpeersandparents",
        "com.apple.assetcache.managed_localsubnetsonly",
        "com.apple.assetcache.managed_logclientidentity",
        "com.apple.assetcache.managed_parents",
        "com.apple.assetcache.managed_parentselectionpolicy",
        "com.apple.assetcache.managed_peerfilterranges",
        "com.apple.assetcache.managed_peerlistenranges",
        "com.apple.assetcache.managed_peerlocalsubnetsonly",
        "com.apple.assetcache.managed_port",
        "com.apple.assetcache.managed_publicranges"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.assetcache.managed_allowcachedelete",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_allowpersonalcaching",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_allowsharedcaching",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_autoactivation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_autoenabletetheredcaching",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_cachelimit",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_datapath",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_denytetheredcaching",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_displayalerts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_keepawake",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_listenranges",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_listenrangesonly",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_listenwithpeersandparents",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_localsubnetsonly",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_logclientidentity",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_parents",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_parentselectionpolicy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_peerfilterranges",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_peerlistenranges",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_peerlocalsubnetsonly",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_port",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.assetcache.managed_publicranges",
            "required": false
        }
    ]
}