{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.EnhanceSecurityModeBypassIntranet",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.enhancesecuritymodebypassintranet",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.enhancesecuritymodebypassintranet",
    "description": "Microsoft Edge will apply Enhanced Security Mode on Intranet zone sites by default. This may lead to Intranet zone sites acting in an unexpected manner.\n\nIf you enable this policy, Microsoft Edge won't apply Enhanced Security Mode on Intranet zone sites.\n\nIf you disable or don't configure this policy, Microsoft Edge will apply Enhanced Security Mode on Intranet zone sites.\n\nFor detailed information about Enhanced Security Mode, see <a href=\"https://go.microsoft.com/fwlink/?linkid=2185895\">https://go.microsoft.com/fwlink/?linkid=2185895</a>",
    "helpText": null,
    "name": "EnhanceSecurityModeBypassIntranet",
    "displayName": "Enhanced Security Mode configuration for Intranet zone sites",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.enhancesecuritymodebypassintranet_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.enhancesecuritymodebypassintranet_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}