{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "mineffect",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_mineffect",
    "description": "The minimize effect.",
    "helpText": null,
    "name": "mineffect",
    "displayName": "Minimize Effect",
    "defaultOptionId": "com.apple.dock_mineffect_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dock_mineffect_0",
            "description": null,
            "helpText": null,
            "name": "genie",
            "displayName": "Genie",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "genie"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_mineffect_1",
            "description": null,
            "helpText": null,
            "name": "scale",
            "displayName": "Scale",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "scale"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        }
    ]
}