{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "safariAcceptCookies",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_safariacceptcookies",
    "description": "This value defines the conditions under which the device accepts cookies. The user-facing settings changed in iOS 11, although the possible values remain the same. Available in iOS 4 and later.",
    "helpText": null,
    "name": "safariAcceptCookies",
    "displayName": "Safari Accept Cookies",
    "defaultOptionId": "com.apple.applicationaccess_safariacceptcookies_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_safariacceptcookies_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "Prevent Cross-Site Tracking and Block All Cookies are enabled and the user canʼt disable either setting.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_safariacceptcookies_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "Prevent Cross-Site Tracking is enabled and the user canʼt disable it. Block All Cookies is not enabled, although the user can enable it.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_safariacceptcookies_2",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "Prevent Cross-Site Tracking is enabled and Block All Cookies is not enabled. The user can toggle either setting.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        }
    ]
}