{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.DefaultThirdPartyStoragePartitioningSetting",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.defaultthirdpartystoragepartitioningsetting",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.defaultthirdpartystoragepartitioningsetting",
    "description": "This policy controls whether third-party storage partitioning is allowed by default.\n\nIf this policy is set to 1 - AllowPartitioning, or unset, third-party storage partitioning will be allowed by default. This default may be overridden for specific top-level origins by other means.\n\nIf this policy is set to 2 - BlockPartitioning, third-party storage partitioning will be disabled for all contexts.\n\nUse ThirdPartyStoragePartitioningBlockedForOrigins to disable third-party storage partitioning for specific top-level origins.\n\nThis feature will be removed starting in Microsoft Edge version 145. To ensure compatibility, use the requestStorageAccess method instead. For more information, see https://developer.mozilla.org/en-US/docs/Web/API/Document/requestStorageAccess.\n\nPolicy options mapping:\n\n* AllowPartitioning (1) = Allow third-party storage partitioning by default.\n\n* BlockPartitioning (2) = Disable third-party storage partitioning.\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "DefaultThirdPartyStoragePartitioningSetting",
    "displayName": "Default setting for third-party storage partitioning (Deprecated)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultthirdpartystoragepartitioningsetting_allowpartitioning",
            "description": null,
            "helpText": null,
            "name": "Allow third-party storage partitioning by default.",
            "displayName": "Allow third-party storage partitioning by default.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultthirdpartystoragepartitioningsetting_blockpartitioning",
            "description": null,
            "helpText": null,
            "name": "Disable third-party storage partitioning.",
            "displayName": "Disable third-party storage partitioning.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}