{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Time Limits"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "time-limits",
    "rootDefinitionId": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
    "categoryId": "f71e7e3a-482a-4760-b7f9-0403b2b6f7d8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.familycontrols.timelimits.v2_time-limits",
    "description": "The time limits to enforce if Family Controls Enabled is enabled. ",
    "helpText": null,
    "name": "time-limits",
    "displayName": "Time Limits",
    "childIds": [
        "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance",
        "com.apple.familycontrols.timelimits.v2_time-limits_weekday-curfew",
        "com.apple.familycontrols.timelimits.v2_time-limits_weekend-allowance",
        "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
            "parentSettingId": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-curfew",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-allowance",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew",
            "required": false
        }
    ]
}