{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Domains"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.domains",
    "rootDefinitionId": "com.apple.domains_com.apple.domains",
    "categoryId": "224dc683-c0e0-4783-8ba8-8f02c76d161d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.domains_com.apple.domains",
    "description": "com.apple.domains",
    "helpText": null,
    "name": "com.apple.domains",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.domains_emaildomains",
        "com.apple.domains_webdomains",
        "com.apple.domains_safaripasswordautofilldomains",
        "com.apple.domains_crosssitetrackingpreventionrelaxeddomains",
        "com.apple.domains_crosssitetrackingpreventionrelaxedapps"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.domains_emaildomains",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.domains_webdomains",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.domains_safaripasswordautofilldomains",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.domains_crosssitetrackingpreventionrelaxeddomains",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.domains_crosssitetrackingpreventionrelaxedapps",
            "required": false
        }
    ]
}