{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#relaunchnotification"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "RelaunchNotification",
    "rootDefinitionId": "com.apple.managedclient.preferences_relaunchnotification",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_relaunchnotification",
    "description": "Notify users that they need to restart Microsoft Edge to apply a pending update.\n\nIf you don't configure this policy, Microsoft Edge adds a recycle icon at the far right of the top menu bar to prompt users to restart the browser to apply the update.\n\nIf you enable this policy and set it to 'Recommended' (1), a recurring warning prompts users that a restart is recommended. Users can dismiss this warning and defer the restart.\n\nIf you set the policy to 'Required' (2), a recurring warning prompts users that the browser will be restarted automatically as soon as a notification period passes. The default period is seven days. You can configure this period with the \"RelaunchNotificationPeriod\" policy.\n\nThe user's session is restored when the browser restarts.\n\n* Recommended (1) = Show a recurring prompt to the user indicating that a restart is recommended\n\n* Required (2) = Show a recurring prompt to the user indicating that a restart is required",
    "helpText": null,
    "name": "RelaunchNotification",
    "displayName": "Notify a user that a browser restart is recommended or required for pending updates",
    "defaultOptionId": "com.apple.managedclient.preferences_relaunchnotification_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_relaunchnotification_0",
            "description": null,
            "helpText": null,
            "name": "Recommended - Show a recurring prompt to the user indicating that a restart is recommended",
            "displayName": "Recommended - Show a recurring prompt to the user indicating that a restart is recommended",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_relaunchnotification_1",
            "description": null,
            "helpText": null,
            "name": "Required - Show a recurring prompt to the user indicating that a restart is required",
            "displayName": "Required - Show a recurring prompt to the user indicating that a restart is required",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}