{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Antivirus engine",
        "Antivirus engine"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "exclusions/[{0}]/name",
    "rootDefinitionId": "com.apple.managedclient.preferences_exclusions",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_exclusions_item_name",
    "description": "Process name, either or full path or file name, wildcards supported",
    "helpText": null,
    "name": "exclusions_item_name",
    "displayName": "Name",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 1,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.managedclient.preferences_exclusions_item_$type_2",
            "parentSettingId": "com.apple.managedclient.preferences_exclusions_item_$type"
        }
    ],
    "dependedOnBy": []
}