{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular Private Network"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "NetworkIdentifier",
    "rootDefinitionId": "com.apple.cellularprivatenetwork.managed_com.apple.cellularprivatenetwork.managed",
    "categoryId": "b6650a16-32bc-4344-ac98-8f20486c6b0b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.cellularprivatenetwork.managed_networkidentifier",
    "description": "A string using the 3GPP \"Coordinated NID\" (option 1 or option 2) format (defined in 3GPP 31.102, Section 12.7.1). The device uses this value to match a SIM present on the device.\n\nAll combinations of `NetworkIdentifier` and `CsgNetworkIdentifier` must be unique across all profiles installed on the device.",
    "helpText": null,
    "name": "NetworkIdentifier",
    "displayName": "Network Identifier",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.cellularprivatenetwork.managed_com.apple.cellularprivatenetwork.managed",
            "parentSettingId": "com.apple.cellularprivatenetwork.managed_com.apple.cellularprivatenetwork.managed"
        }
    ],
    "dependedOnBy": []
}