{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Web Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutoFilterEnabled",
    "rootDefinitionId": "com.apple.webcontent-filter_com.apple.webcontent-filter",
    "categoryId": "a6fe8038-136b-4d50-bf04-8e232409c0d2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.webcontent-filter_autofilterenabled",
    "description": "If true, automatic filtering is in an enabled state. This function evaluates each web page as it loads and attempts to identify and block content not suitable for children. The search algorithm is complex and may vary from release to release, but it’s basically looking for adult language.",
    "helpText": null,
    "name": "AutoFilterEnabled",
    "displayName": "Auto Filter Enabled",
    "defaultOptionId": "com.apple.webcontent-filter_autofilterenabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.webcontent-filter_autofilterenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.webcontent-filter_com.apple.webcontent-filter",
                    "parentSettingId": "com.apple.webcontent-filter_com.apple.webcontent-filter"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.webcontent-filter_autofilterenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.webcontent-filter_com.apple.webcontent-filter",
                    "parentSettingId": "com.apple.webcontent-filter_com.apple.webcontent-filter"
                }
            ],
            "dependedOnBy": []
        }
    ]
}