{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.SpellcheckLanguage",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.spellchecklanguage",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "smallTextBox",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.spellchecklanguage",
    "description": "Enables different languages for spellcheck. Any language that you specify that isn't recognized is ignored.\n\nIf you enable this policy, spellcheck is enabled for the languages specified, as well as any languages the user has enabled.\n\nIf you don't configure or disable this policy, there's no change to the user's spellcheck preferences.\n\nIf the \"SpellcheckEnabled\" policy is disabled, this policy will have no effect.\n\nIf a language is included in both the 'SpellcheckLanguage' and the \"SpellcheckLanguageBlocklist\" policy, the spellcheck language is enabled.",
    "helpText": null,
    "name": "SpellcheckLanguage",
    "displayName": "Enable specific spellcheck languages",
    "maximumCount": 600,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}