{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#newtabpagesetfeedtype"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "NewTabPageSetFeedType",
    "rootDefinitionId": "com.apple.managedclient.preferences_newtabpagesetfeedtype",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_newtabpagesetfeedtype",
    "description": "Lets you choose either the Microsoft News or Office 365 feed experience for the new tab page.\n\nWhen you set this policy to Microsoft News feed experience (0), users will see the Microsoft News feed experience on the new tab page.\n\nWhen you set this policy to Office 365 feed experience (1), users with an Azure Active Directory browser sign-in will see the Office 365 feed experience on the new tab page.\n\nIf you disable or don't configure this policy:\n\n- Users with an Azure Active Directory browser sign-in are offered the Office 365 new tab page feed experience, as well as the standard new tab page feed experience.\n\n- Users without an Azure Active Directory browser sign-in will see the standard new tab page experience.\n\nIf you configure this policy *and* the \"NewTabPageLocation\" policy, \"NewTabPageLocation\" has precedence.\n\nDefault setting:  Disabled or not configured.\n\n* 0 = Microsoft News feed experience\n\n* 1 = Office 365 feed experience",
    "helpText": null,
    "name": "NewTabPageSetFeedType",
    "displayName": "Configure the Microsoft Edge new tab page experience",
    "defaultOptionId": "com.apple.managedclient.preferences_newtabpagesetfeedtype_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_newtabpagesetfeedtype_0",
            "description": null,
            "helpText": null,
            "name": "Microsoft News feed experience",
            "displayName": "Microsoft News feed experience",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_newtabpagesetfeedtype_1",
            "description": null,
            "helpText": null,
            "name": "Office 365 feed experience",
            "displayName": "Office 365 feed experience",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}