{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Accessibility"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.universalaccess",
    "rootDefinitionId": "com.apple.universalaccess_com.apple.universalaccess",
    "categoryId": "c00d6468-cac3-429c-ada5-ba3adf4982a8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.universalaccess_com.apple.universalaccess",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.universalaccess",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.universalaccess_closeviewfarpoint",
        "com.apple.universalaccess_closeviewhotkeysenabled",
        "com.apple.universalaccess_closeviewnearpoint",
        "com.apple.universalaccess_closeviewscrollwheeltoggle",
        "com.apple.universalaccess_closeviewsmoothimages",
        "com.apple.universalaccess_contrast",
        "com.apple.universalaccess_flashscreen",
        "com.apple.universalaccess_mousedriver",
        "com.apple.universalaccess_mousedrivercursorsize",
        "com.apple.universalaccess_mousedriverignoretrackpad",
        "com.apple.universalaccess_mousedriverinitialdelay",
        "com.apple.universalaccess_mousedrivermaxspeed",
        "com.apple.universalaccess_slowkey",
        "com.apple.universalaccess_slowkeybeepon",
        "com.apple.universalaccess_slowkeydelay",
        "com.apple.universalaccess_stereoasmono",
        "com.apple.universalaccess_stickykey",
        "com.apple.universalaccess_stickykeybeeponmodifier",
        "com.apple.universalaccess_stickykeyshowwindow",
        "com.apple.universalaccess_voiceoveronoffkey",
        "com.apple.universalaccess_whiteonblack"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.universalaccess_closeviewfarpoint",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_closeviewhotkeysenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_closeviewnearpoint",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_closeviewscrollwheeltoggle",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_closeviewsmoothimages",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_contrast",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_flashscreen",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_mousedriver",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_mousedrivercursorsize",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_mousedriverignoretrackpad",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_mousedriverinitialdelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_mousedrivermaxspeed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_slowkey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_slowkeybeepon",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_slowkeydelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_stereoasmono",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_stickykey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_stickykeybeeponmodifier",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_stickykeyshowwindow",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_voiceoveronoffkey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.universalaccess_whiteonblack",
            "required": false
        }
    ]
}