{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password",
        "Passcode",
        "Screen Timeout",
        "Device password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/passwordMinutesOfInactivityBeforeScreenTimeoutAosp/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp",
    "categoryId": "f350f9a2-3a91-4d6d-90ed-7e3849b0d5f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp",
    "description": "Enter the maximum length of time, from 1 minute to 1 hour, that devices can be idle before the screen is automatically locked. Users must enter their credentials to regain access. For example, enter 5 to lock the device after 5 minutes of inactivity. Ignored by device if new time is longer than what's currently set on device. If set to Immediately, devices will use the minimum possible value per device.",
    "helpText": "",
    "name": "passwordMinutesOfInactivityBeforeScreenTimeout",
    "displayName": "Maximum minutes of inactivity until screen locks",
    "defaultOptionId": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp_1minute",
    "applicability": {
        "description": null,
        "platform": "aosp",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp_1minute",
            "description": "Screen Timeout after 1 Minute of Inactivity",
            "helpText": null,
            "name": "1Minute",
            "displayName": "1 Minute",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp_5minutes",
            "description": "Screen Timeout after 5 Minutes of Inactivity",
            "helpText": null,
            "name": "5Minutes",
            "displayName": "5 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp_15minutes",
            "description": "Screen Timeout after 15 Minutes of Inactivity",
            "helpText": null,
            "name": "15Minutes",
            "displayName": "15 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 15
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp_30minutes",
            "description": "Screen Timeout after 30 Minutes of Inactivity",
            "helpText": null,
            "name": "30Minutes",
            "displayName": "30 Minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 30
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.passwordminutesofinactivitybeforescreentimeoutaosp_1hour",
            "description": "Screen Timeout after 1 Hour of Inactivity",
            "helpText": null,
            "name": "1Hour",
            "displayName": "1 Hour",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 60
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}