{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Managed Menu Extras"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "maxWaitSeconds",
    "rootDefinitionId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
    "categoryId": "b6ad9576-be4c-46b9-a3a6-13a03ff1fed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxmenuextras_maxwaitseconds",
    "description": "The maximum wait, in seconds, for all menu extras to be added or removed.",
    "helpText": null,
    "name": "maxWaitSeconds",
    "displayName": "Max Wait Seconds",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 20
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
            "parentSettingId": "com.apple.mcxmenuextras_com.apple.mcxmenuextras"
        }
    ],
    "dependedOnBy": []
}