{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Lock Screen Message"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "LockScreenFootnote",
    "rootDefinitionId": "com.apple.shareddeviceconfiguration_com.apple.shareddeviceconfiguration",
    "categoryId": "dec8381a-0a61-406b-842b-fc6ae9930795",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.shareddeviceconfiguration_lockscreenfootnote",
    "description": "The footnote displayed in the login window and Lock screen. ",
    "helpText": null,
    "name": "LockScreenFootnote",
    "displayName": "Lock Screen Footnote",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "variableReplacement",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.shareddeviceconfiguration_com.apple.shareddeviceconfiguration",
            "parentSettingId": "com.apple.shareddeviceconfiguration_com.apple.shareddeviceconfiguration"
        }
    ],
    "dependedOnBy": []
}