{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Security Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.preference.security",
    "rootDefinitionId": "com.apple.preference.security_com.apple.preference.security",
    "categoryId": "8abddb23-7036-4ba8-8912-529279a849ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.preference.security_com.apple.preference.security",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.preference.security",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.preference.security_dontallowpasswordresetui",
        "com.apple.preference.security_dontallowlockmessageui",
        "com.apple.preference.security_dontallowfirewallui"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.preference.security_dontallowpasswordresetui",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.preference.security_dontallowlockmessageui",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.preference.security_dontallowfirewallui",
            "required": false
        }
    ]
}