{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Personal",
        "Profile",
        "Screen",
        "Capture",
        "Blocked",
        "Personal Profile"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/personalProfileScreenCaptureBlocked/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.personalprofilescreencaptureblocked",
    "categoryId": "990880db-3f64-4436-ab4a-d7d5181dfa5d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.personalprofilescreencaptureblocked",
    "description": "If 'True', prevents screen captures during personal and work use. If 'False', Intune doesn't change or update this setting. By default, the OS might allow users to get screen captures or screenshots in the personal and work profile. Available for corporate-owned work profile devices (applies at both work and personal profile level).",
    "helpText": null,
    "name": "PersonalProfileScreenCaptureBlocked",
    "displayName": "Block screen capture",
    "defaultOptionId": "com.android.devicerestrictionpolicy.personalprofilescreencaptureblocked_false",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.personalprofilescreencaptureblocked_true",
            "description": "true",
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.personalprofilescreencaptureblocked_false",
            "description": "false",
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}