{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Time Limits"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.familycontrols.timelimits.v2",
    "rootDefinitionId": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
    "categoryId": "f71e7e3a-482a-4760-b7f9-0403b2b6f7d8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.familycontrols.timelimits.v2",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.familycontrols.timelimits.v2_familycontrolsenabled",
        "com.apple.familycontrols.timelimits.v2_time-limits"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_familycontrolsenabled",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits",
            "required": false
        }
    ]
}