{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Domains"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CrossSiteTrackingPreventionRelaxedDomains",
    "rootDefinitionId": "com.apple.domains_com.apple.domains",
    "categoryId": "224dc683-c0e0-4783-8ba8-8f02c76d161d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.domains_crosssitetrackingpreventionrelaxeddomains",
    "description": "Specify an array of up to ten domains \r\nwhen cross-site tracking is required for functionality.",
    "helpText": null,
    "name": "CrossSiteTrackingPreventionRelaxedDomains",
    "displayName": "Cross Site Tracking Prevention Relaxed Domains",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.domains_com.apple.domains",
            "parentSettingId": "com.apple.domains_com.apple.domains"
        }
    ],
    "dependedOnBy": []
}