{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.EdgeDiscoverEnabled",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.edgediscoverenabled",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.edgediscoverenabled",
    "description": "This policy doesn't work because Discover is now contained within the Edge Sidebar and can be managed using the \"HubsSidebarEnabled\" policy.\n\nThis policy lets you configure the Discover feature in Microsoft Edge.\n\nWorking in the background when enabled, this feature sends URLs to Microsoft Bing to search for related recommendations.\n\nIf you enable or don't configure this policy, you can use the Discover button on Microsoft Edge to start using this feature.\n\nIf you disable this policy, you can't use the Discover feature in Microsoft Edge.",
    "helpText": null,
    "name": "EdgeDiscoverEnabled",
    "displayName": "Discover feature In Microsoft Edge (Obsolete)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.edgediscoverenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.edgediscoverenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}