{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ratingApps",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_ratingappsgb",
    "description": "The maximum level of app content allowed on the device. Available in iOS 4 and later.",
    "helpText": null,
    "name": "ratingApps",
    "displayName": "Rating Apps - Great Britain",
    "defaultOptionId": "com.apple.applicationaccess_ratingappsgb_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_1",
            "description": null,
            "helpText": null,
            "name": "1+",
            "displayName": "1+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_2",
            "description": null,
            "helpText": null,
            "name": "2+",
            "displayName": "2+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_3",
            "description": null,
            "helpText": null,
            "name": "3+",
            "displayName": "3+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_4",
            "description": null,
            "helpText": null,
            "name": "4+",
            "displayName": "4+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 100
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_5",
            "description": null,
            "helpText": null,
            "name": "5+",
            "displayName": "5+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 105
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_6",
            "description": null,
            "helpText": null,
            "name": "6+",
            "displayName": "6+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 106
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_7",
            "description": null,
            "helpText": null,
            "name": "7+",
            "displayName": "7+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 107
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_8",
            "description": null,
            "helpText": null,
            "name": "8+",
            "displayName": "8+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 108
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_9",
            "description": null,
            "helpText": null,
            "name": "9+",
            "displayName": "9+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 200
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_10",
            "description": null,
            "helpText": null,
            "name": "10+",
            "displayName": "10+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 210
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_11",
            "description": null,
            "helpText": null,
            "name": "11+",
            "displayName": "11+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 211
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_12",
            "description": null,
            "helpText": null,
            "name": "12+",
            "displayName": "12+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 300
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_13",
            "description": null,
            "helpText": null,
            "name": "13+",
            "displayName": "13+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 313
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_14",
            "description": null,
            "helpText": null,
            "name": "14+",
            "displayName": "14+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 314
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_15",
            "description": null,
            "helpText": null,
            "name": "15+",
            "displayName": "15+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 415
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_16",
            "description": null,
            "helpText": null,
            "name": "16+",
            "displayName": "16+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 416
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_17",
            "description": null,
            "helpText": null,
            "name": "17+",
            "displayName": "17+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 600
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_18",
            "description": null,
            "helpText": null,
            "name": "18+",
            "displayName": "18+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 618
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_19",
            "description": null,
            "helpText": null,
            "name": "19+",
            "displayName": "19+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 619
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_20",
            "description": null,
            "helpText": null,
            "name": "20+",
            "displayName": "20+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 620
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_21",
            "description": null,
            "helpText": null,
            "name": "21+",
            "displayName": "21+",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 621
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingappsgb_22",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1000
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_8",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        }
    ]
}