{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Service Management",
        "Service Management - Managed Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Rules",
    "rootDefinitionId": "com.apple.servicemanagement_com.apple.servicemanagement",
    "categoryId": "9859957e-34f1-4669-9f95-2b7c79fff052",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.servicemanagement_rules",
    "description": "An array of rule dictionaries.",
    "helpText": null,
    "name": "Rules",
    "displayName": "Rules",
    "childIds": [
        "com.apple.servicemanagement_rules_item_ruletype",
        "com.apple.servicemanagement_rules_item_rulevalue",
        "com.apple.servicemanagement_rules_item_comment",
        "com.apple.servicemanagement_rules_item_teamidentifier"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.servicemanagement_com.apple.servicemanagement",
            "parentSettingId": "com.apple.servicemanagement_com.apple.servicemanagement"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.servicemanagement_rules_item_ruletype",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.servicemanagement_rules_item_rulevalue",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.servicemanagement_rules_item_comment",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.servicemanagement_rules_item_teamidentifier",
            "required": false
        }
    ]
}