{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password",
        "Minimum",
        "Numeric",
        "Characters",
        "Device password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/passwordMinimumNumericCharacters/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.passwordrequiredtype",
    "categoryId": "f350f9a2-3a91-4d6d-90ed-7e3849b0d5f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.passwordminimumnumericcharacters",
    "description": "Enter the number of numeric characters (1, 2, 3, and so on) the password must have, between 1 and 16 characters. Available for fully managed, dedicated and corporate-owned work profile devices (at work profile level).",
    "helpText": "Enter a number (1-16)",
    "name": "PasswordMinimumNumericCharacters",
    "displayName": "Number of numeric characters required",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 16,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "com.android.devicerestrictionpolicy.passwordrequiredtype_alphanumericwithsymbols",
            "parentSettingId": "com.android.devicerestrictionpolicy.passwordrequiredtype"
        }
    ],
    "dependedOnBy": []
}