{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Xsan"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "sharedSecret",
    "rootDefinitionId": "com.apple.xsan_com.apple.xsan",
    "categoryId": "46af3391-ed6d-4ada-aef7-02dac2a1b136",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.xsan_sharedsecret",
    "description": "The shared secret used for Xsan network authentication. This key is required when the San Auth Method key is present. The value should equal the content of the MDC's /Library/Preferences/Xsan/.auth_secret file.",
    "helpText": null,
    "name": "sharedSecret",
    "displayName": "Shared Secret",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 1,
        "isSecret": true,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
        "settingValueTemplateReference": null,
        "value": "",
        "valueState": "invalid"
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.xsan_com.apple.xsan",
            "parentSettingId": "com.apple.xsan_com.apple.xsan"
        }
    ],
    "dependedOnBy": []
}