{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - EDR preferences",
        "Endpoint Detection and Response (EDR) preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/edr",
    "offsetUri": "tags/[{0}]/value",
    "rootDefinitionId": "com.apple.managedclient.preferences_tags",
    "categoryId": "b77a3a7b-6fab-4240-b5c3-852aa78781d5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_tags_item_value",
    "description": "Only one value per tag type can be set. Type of tags are unique, and should not be repeated in the same configuration profile.",
    "helpText": null,
    "name": "tags_item_value",
    "displayName": "Value of tag",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement,microsoftSense"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.managedclient.preferences_tags",
            "parentSettingId": "com.apple.managedclient.preferences_tags"
        }
    ],
    "dependedOnBy": []
}