{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Lock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "App/Identifier",
    "rootDefinitionId": "com.apple.app.lock_com.apple.app.lock",
    "categoryId": "7b4e3f58-fb7a-4e6b-8f39-35d1cd90f508",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.app.lock_app_identifier",
    "description": "The bundle identifier of the app.",
    "helpText": null,
    "name": "App_Identifier",
    "displayName": "App Identifier",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.app.lock_app",
            "parentSettingId": "com.apple.app.lock_app"
        }
    ],
    "dependedOnBy": []
}