{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "persistent-apps",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_persistent-apps",
    "description": "Dock items located on the Applications side of the Dock that can be removed.",
    "helpText": null,
    "name": "persistent-apps",
    "displayName": "Persistent Apps",
    "childIds": [
        "com.apple.dock_persistent-apps_item_tile-data",
        "com.apple.dock_persistent-apps_item_tile-type"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.dock_com.apple.dock",
            "parentSettingId": "com.apple.dock_com.apple.dock"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.dock_persistent-apps_item_tile-data",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.dock_persistent-apps_item_tile-type",
            "required": true
        }
    ]
}