{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ApplicationsSystem//Applications/Microsoft Outlook.app/LCID",
    "rootDefinitionId": "com.apple.managedclient.preferences_applicationssystem",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft outlook.app_lcid",
    "description": null,
    "helpText": null,
    "name": "ApplicationsSystem_Applications_Microsoft Outlook.app_LCID",
    "displayName": "Microsoft Outlook LCID",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1033
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft outlook.app",
            "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft outlook.app"
        }
    ],
    "dependedOnBy": []
}