{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "OnDemandRules/[{0}]/InterfaceTypeMatch",
    "rootDefinitionId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "categoryId": "bbe51018-a17d-46c4-9517-ff45c54d8d18",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dnssettings.managed_ondemandrules_item_interfacetypematch",
    "description": "An interface type. If specified, this rule matches only if the primary network interface hardware matches the specified type.",
    "helpText": null,
    "name": "OnDemandRules_item_InterfaceTypeMatch",
    "displayName": "Interface Type Match",
    "defaultOptionId": "com.apple.dnssettings.managed_ondemandrules_item_interfacetypematch_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_interfacetypematch_0",
            "description": null,
            "helpText": null,
            "name": "Ethernet",
            "displayName": "Ethernet",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Ethernet"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_interfacetypematch_1",
            "description": null,
            "helpText": null,
            "name": "WiFi",
            "displayName": "WiFi",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "WiFi"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dnssettings.managed_ondemandrules_item_interfacetypematch_2",
            "description": null,
            "helpText": null,
            "name": "Cellular",
            "displayName": "Cellular",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Cellular"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dnssettings.managed_ondemandrules",
                    "parentSettingId": "com.apple.dnssettings.managed_ondemandrules"
                }
            ],
            "dependedOnBy": []
        }
    ]
}