{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Web Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AllowListBookmarks",
    "rootDefinitionId": "com.apple.webcontent-filter_com.apple.webcontent-filter",
    "categoryId": "a6fe8038-136b-4d50-bf04-8e232409c0d2",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.webcontent-filter_allowlistbookmarks",
    "description": "An array of dictionaries defining the pages that the user can visit.",
    "helpText": null,
    "name": "AllowListBookmarks",
    "displayName": "Allow List Bookmarks",
    "childIds": [
        "com.apple.webcontent-filter_allowlistbookmarks_item_url",
        "com.apple.webcontent-filter_allowlistbookmarks_item_title"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.webcontent-filter_com.apple.webcontent-filter",
            "parentSettingId": "com.apple.webcontent-filter_com.apple.webcontent-filter"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.webcontent-filter_allowlistbookmarks_item_url",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_allowlistbookmarks_item_title",
            "required": true
        }
    ]
}