{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "LDAP"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "LDAPSearchSettings",
    "rootDefinitionId": "com.apple.ldap.account_com.apple.ldap.account",
    "categoryId": "9ba1b877-865a-4104-8376-b43a0c75b04b",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.ldap.account_ldapsearchsettings",
    "description": "An array of search settings dictionaries.",
    "helpText": null,
    "name": "LDAPSearchSettings",
    "displayName": "LDAP Search Settings",
    "childIds": [
        "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingdescription",
        "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingsearchbase",
        "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingscope"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.ldap.account_com.apple.ldap.account",
            "parentSettingId": "com.apple.ldap.account_com.apple.ldap.account"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingdescription",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingsearchbase",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingscope",
            "required": false
        }
    ]
}