{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webdriveroverridesincompatiblepolicies"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "WebDriverOverridesIncompatiblePolicies",
    "rootDefinitionId": "com.apple.managedclient.preferences_webdriveroverridesincompatiblepolicies",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_webdriveroverridesincompatiblepolicies",
    "description": "This policy was removed in M83, because it is not necessary anymore as\nWebDriver is now compatible with all existing policies.\n\nThis policy allows users of the WebDriver feature to override\npolicies which can interfere with its operation.\n\nCurrently this policy disables \"SitePerProcess\" and \"IsolateOrigins\" policies.\n\nIf the policy is enabled, WebDriver will be able to override incomaptible\npolicies.\nIf the policy is disabled or not configured, WebDriver will not be allowed\nto override incompatible policies.",
    "helpText": null,
    "name": "WebDriverOverridesIncompatiblePolicies",
    "displayName": "Allow WebDriver to Override Incompatible Policies",
    "defaultOptionId": "com.apple.managedclient.preferences_webdriveroverridesincompatiblepolicies_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_webdriveroverridesincompatiblepolicies_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_webdriveroverridesincompatiblepolicies_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}