{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#nativemessagingallowlist"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "NativeMessagingAllowlist",
    "rootDefinitionId": "com.apple.managedclient.preferences_nativemessagingallowlist",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_nativemessagingallowlist",
    "description": "List specific native messaging hosts that users can use in Microsoft Edge.\n\nBy default, all native messaging hosts are allowed. If you set the \"NativeMessagingBlocklist\" policy to *, all native messaging hosts are blocked, and only native messaging hosts listed in here are loaded.",
    "helpText": null,
    "name": "NativeMessagingAllowlist",
    "displayName": "Control which native messaging hosts users can use",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}