{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "WorkProfile",
        "Password",
        "Require",
        "Unlock",
        "Work profile password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/workProfilePasswordRequireUnlock/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.workprofilepasswordrequireunlock",
    "categoryId": "70c4566f-a079-4a8e-ac97-0736b405df1d",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.workprofilepasswordrequireunlock",
    "description": "Select how long users have before they're required to unlock the work profile using a strong authentication method (password, PIN, or pattern). Available for corporate-owned work profile devices (at work profile level).",
    "helpText": "",
    "name": "WorkProfilePasswordRequireUnlock",
    "displayName": "Required unlock frequency",
    "defaultOptionId": null,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequireunlock_devicedefault",
            "description": null,
            "helpText": null,
            "name": "USE_DEFAULT_DEVICE_TIMEOUT",
            "displayName": "Device default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "USE_DEFAULT_DEVICE_TIMEOUT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.workprofilepasswordrequireunlock_requiredpasswordunlockdailyoption",
            "description": null,
            "helpText": null,
            "name": "REQUIRE_EVERY_DAY",
            "displayName": "24 hours since last PIN, password, or pattern unlock",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "REQUIRE_EVERY_DAY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}