{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Air Play",
        "AirPlay"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.airplay",
    "rootDefinitionId": "com.apple.airplay_com.apple.airplay",
    "categoryId": "132003c7-1130-4f59-96a7-dfb6adb8bd5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.airplay_com.apple.airplay",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.airplay",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.airplay_allowlist",
        "com.apple.airplay_passwords"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.airplay_allowlist",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.airplay_passwords",
            "required": false
        }
    ]
}