{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Web Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.webcontent-filter",
    "rootDefinitionId": "com.apple.webcontent-filter_com.apple.webcontent-filter",
    "categoryId": "a6fe8038-136b-4d50-bf04-8e232409c0d2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.webcontent-filter_com.apple.webcontent-filter",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.webcontent-filter",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.webcontent-filter_filtertype",
        "com.apple.webcontent-filter_autofilterenabled",
        "com.apple.webcontent-filter_permittedurls",
        "com.apple.webcontent-filter_denylisturls",
        "com.apple.webcontent-filter_hidedenylisturls",
        "com.apple.webcontent-filter_allowlistbookmarks",
        "com.apple.webcontent-filter_userdefinedname",
        "com.apple.webcontent-filter_pluginbundleid",
        "com.apple.webcontent-filter_serveraddress",
        "com.apple.webcontent-filter_username",
        "com.apple.webcontent-filter_password",
        "com.apple.webcontent-filter_payloadcertificateuuid",
        "com.apple.webcontent-filter_organization",
        "com.apple.webcontent-filter_vendorconfig",
        "com.apple.webcontent-filter_filterbrowsers",
        "com.apple.webcontent-filter_filtersockets",
        "com.apple.webcontent-filter_filterdataproviderdesignatedrequirement",
        "com.apple.webcontent-filter_filterdataproviderbundleidentifier",
        "com.apple.webcontent-filter_filterpackets",
        "com.apple.webcontent-filter_filterpacketproviderdesignatedrequirement",
        "com.apple.webcontent-filter_filterpacketproviderbundleidentifier",
        "com.apple.webcontent-filter_filtergrade",
        "com.apple.webcontent-filter_contentfilteruuid",
        "com.apple.webcontent-filter_filterurls",
        "com.apple.webcontent-filter_urlfilterparameters"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.webcontent-filter_filtertype",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_autofilterenabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_permittedurls",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_denylisturls",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_hidedenylisturls",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_allowlistbookmarks",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_userdefinedname",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_pluginbundleid",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_serveraddress",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_username",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_password",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_payloadcertificateuuid",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_organization",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_vendorconfig",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filterbrowsers",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filtersockets",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filterdataproviderdesignatedrequirement",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filterdataproviderbundleidentifier",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filterpackets",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filterpacketproviderdesignatedrequirement",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filterpacketproviderbundleidentifier",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filtergrade",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_contentfilteruuid",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_filterurls",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.webcontent-filter_urlfilterparameters",
            "required": false
        }
    ]
}