{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [
        "https://github.com/pbowden-msft/Payloads"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ApplicationsSystem",
    "rootDefinitionId": "com.apple.managedclient.preferences_applicationssystem",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_applicationssystem",
    "description": null,
    "helpText": null,
    "name": "ApplicationsSystem",
    "displayName": "Applications",
    "childIds": [
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft word.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft excel.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft powerpoint.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft outlook.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app",
        "com.apple.managedclient.preferences_applicationssystem_library_application support_microsoft_mau2.0_microsoft autoupdate.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_onedrive.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_company portal.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams classic.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams (work or school).app",
        "com.apple.managedclient.preferences_applicationssystem_applications_skype for business.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft remote desktop.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_windows app.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender atp.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft edge.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft edge beta.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft edge canary.app",
        "com.apple.managedclient.preferences_applicationssystem_applications_microsoft edge dev.app"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft word.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft excel.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft powerpoint.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft outlook.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft onenote.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_library_application support_microsoft_mau2.0_microsoft autoupdate.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_onedrive.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_company portal.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams classic.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams (work or school).app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_skype for business.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft remote desktop.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_windows app.app",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender.app",
            "required": false
        }
    ]
}