{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.AllowedDomainsForApps",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.alloweddomainsforapps",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "smallTextBox",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.alloweddomainsforapps",
    "description": "Setting the policy on Microsoft Edge turns on the restricted sign-in feature in Google Workspace and prevents users from changing this setting. Users can only access Google tools using accounts from the specified domains. To allow gmail or googlemail accounts, add consumer_accounts to the list of domains. This policy is based on the Chrome policy of the same name.\n\nIf you don't provide a domain name or leave this policy unset, users can access Google Workspace with any account.\n\nUsers cannot change or override this setting.\n\nNote: This policy causes the X-GoogApps-Allowed-Domains header to be appended to all HTTP and HTTPS requests to all google.com domains, as described in <a href=\"https://go.microsoft.com/fwlink/?linkid=2197973\">https://go.microsoft.com/fwlink/?linkid=2197973</a>.",
    "helpText": null,
    "name": "AllowedDomainsForApps",
    "displayName": "Define domains allowed to access Google Workspace",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}