{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Features"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/defender-endpoint/behavior-monitor-macos"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/features",
    "offsetUri": "behaviorMonitoring",
    "rootDefinitionId": "com.apple.managedclient.preferences_behaviormonitoring",
    "categoryId": "a3ea4da3-445e-41c0-ac4d-c9ad2467ec26",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_behaviormonitoring",
    "description": "Behavior Monitoring detections with Microsoft Defender for Endpoint.",
    "helpText": null,
    "name": "behaviorMonitoring",
    "displayName": "Behavior Monitoring",
    "defaultOptionId": "com.apple.managedclient.preferences_behaviormonitoring_1",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_behaviormonitoring_0",
            "description": null,
            "helpText": null,
            "name": "enabled",
            "displayName": "enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "enabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_behaviormonitoring_1",
            "description": null,
            "helpText": null,
            "name": "disabled",
            "displayName": "disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}