{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.LocalNetworkAccessRestrictionsEnabled",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.localnetworkaccessrestrictionsenabled",
    "categoryId": "3fbd3b29-bafd-4adf-89e4-3be612dee275",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.localnetworkaccessrestrictionsenabled",
    "description": "Local Network Access restrictions prevent public websites from making\nrequests to devices on a user's local network without explicit user permission.\n\nIf you enable this policy, Microsoft Edge blocks\nany request that would otherwise trigger a DevTools warning\ndue to Local Network Access checks.\nThese requests are denied without prompting the user.\n\nIf you disable or don't configure this policy, Microsoft Edge handles\nthese requests using the default behavior, which may include showing warnings in DevTools\nand allowing the request to proceed depending on the context.\n\nNote: This feature improves local network security by deprecating direct access to private IP addresses from public websites\nunless explicitly granted by the user. For more information about Local Network Access, see https://wicg.github.io/local-network-access/.\n\nStarting in version 140, Microsoft Edge introduces support for policies that manage Local Network Access behavior on a per-URL basis.\n\nYou can configure exceptions to allow specific URLs to bypass Local Network Access restrictions.\n\nYou can also block specific URLs from making Local Network Access requests.\n\nStarting from Microsoft Edge version 144, this policy is deprecated because Local Network Access restrictions is enabled by default. The policy will be removed in a future release.",
    "helpText": null,
    "name": "LocalNetworkAccessRestrictionsEnabled",
    "displayName": "Specifies whether to block requests from public websites to devices on a user's local network. (Deprecated)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.localnetworkaccessrestrictionsenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.localnetworkaccessrestrictionsenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}