{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Time Limits"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "time-limits/weekend-curfew/rangeType",
    "rootDefinitionId": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
    "categoryId": "f71e7e3a-482a-4760-b7f9-0403b2b6f7d8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_rangetype",
    "description": "The type of day range.",
    "helpText": null,
    "name": "time-limits_weekend-curfew_rangeType",
    "displayName": "Range Type",
    "defaultOptionId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_rangetype_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_rangetype_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "Weekday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew",
                    "parentSettingId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew_rangetype_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "Weekend",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew",
                    "parentSettingId": "com.apple.familycontrols.timelimits.v2_time-limits_weekend-curfew"
                }
            ],
            "dependedOnBy": []
        }
    ]
}