{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "FileVault"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RecoveryKeyRotationInMonths",
    "rootDefinitionId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
    "categoryId": "3f56adc1-2207-4033-a6e2-07f64c08e3ff",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx.filevault2_recoverykeyrotationinmonths",
    "description": "The frequency to rotate the recovery key, in months",
    "helpText": null,
    "name": "RecoveryKeyRotationInMonths",
    "displayName": "Recovery Key Rotation In Months",
    "defaultOptionId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "Not configured",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "1 month",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_2",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "2 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_3",
            "description": null,
            "helpText": null,
            "name": "3",
            "displayName": "3 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_4",
            "description": null,
            "helpText": null,
            "name": "4",
            "displayName": "4 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_5",
            "description": null,
            "helpText": null,
            "name": "5",
            "displayName": "5 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_6",
            "description": null,
            "helpText": null,
            "name": "6",
            "displayName": "6 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 6
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_7",
            "description": null,
            "helpText": null,
            "name": "7",
            "displayName": "7 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 7
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_8",
            "description": null,
            "helpText": null,
            "name": "8",
            "displayName": "8 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 8
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_9",
            "description": null,
            "helpText": null,
            "name": "9",
            "displayName": "9 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 9
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_10",
            "description": null,
            "helpText": null,
            "name": "10",
            "displayName": "10 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 10
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_11",
            "description": null,
            "helpText": null,
            "name": "11",
            "displayName": "11 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 11
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mcx.filevault2_recoverykeyrotationinmonths_12",
            "description": null,
            "helpText": null,
            "name": "12",
            "displayName": "12 months",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 12
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                    "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
                }
            ],
            "dependedOnBy": []
        }
    ]
}