{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.DefaultWebBluetoothGuardSetting",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.defaultwebbluetoothguardsetting",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.defaultwebbluetoothguardsetting",
    "description": "Control whether websites can access nearby Bluetooth devices. You can completely block access or require the site to ask the user each time it wants to access a Bluetooth device.\n\nIf you don't configure this policy, the default value ('AskWebBluetooth', meaning users are asked each time) is used and users can change it.\n\nPolicy options mapping:\n\n* BlockWebBluetooth (2) = Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API\n\n* AskWebBluetooth (3) = Allow sites to ask the user to grant access to a nearby Bluetooth device\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "DefaultWebBluetoothGuardSetting",
    "displayName": "Control use of the Web Bluetooth API",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultwebbluetoothguardsetting_blockwebbluetooth",
            "description": null,
            "helpText": null,
            "name": "Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API",
            "displayName": "Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultwebbluetoothguardsetting_askwebbluetooth",
            "description": null,
            "helpText": null,
            "name": "Allow sites to ask the user to grant access to a nearby Bluetooth device",
            "displayName": "Allow sites to ask the user to grant access to a nearby Bluetooth device",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}