{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "UpdateCheckFrequency",
    "rootDefinitionId": "com.apple.managedclient.preferences_updatecheckfrequency",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_updatecheckfrequency",
    "description": "Specify how often AutoUpdate checks for updates. The allowed range is 240 minutes (4 hours) - 720 minutes (12 hours).",
    "helpText": null,
    "name": "UpdateCheckFrequency",
    "displayName": "Update check frequency (mins)",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 240
    },
    "dependentOn": [],
    "dependedOnBy": []
}