{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Finder"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.finder",
    "rootDefinitionId": "com.apple.finder_com.apple.finder",
    "categoryId": "d8f06fcf-7328-43ac-b5b7-f7166b5333de",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.finder_com.apple.finder",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.finder",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.finder_prohibitburn",
        "com.apple.finder_prohibitconnectto",
        "com.apple.finder_prohibiteject",
        "com.apple.finder_prohibitgotofolder",
        "com.apple.finder_showexternalharddrivesondesktop",
        "com.apple.finder_showharddrivesondesktop",
        "com.apple.finder_showmountedserversondesktop",
        "com.apple.finder_showremovablemediaondesktop",
        "com.apple.finder_warnonemptytrash"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.finder_prohibitburn",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_prohibitconnectto",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_prohibiteject",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_prohibitgotofolder",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_showexternalharddrivesondesktop",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_showharddrivesondesktop",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_showmountedserversondesktop",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_showremovablemediaondesktop",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.finder_warnonemptytrash",
            "required": false
        }
    ]
}