{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "minComplexChars",
    "rootDefinitionId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "categoryId": "d68abc4d-559a-4339-be48-c41a77a87034",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mobiledevice.passwordpolicy_mincomplexchars",
    "description": "The minimum number of complex characters that a passcode must contain. A complex character is a character other than a number or a letter, such as & % $ #. This property is ignored for User Enrollments.",
    "helpText": null,
    "name": "minComplexChars",
    "displayName": "Min Complex Characters",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
            "parentSettingId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy"
        }
    ],
    "dependedOnBy": []
}