{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "orientation",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_orientation",
    "description": "The orientation of the dock. ",
    "helpText": null,
    "name": "orientation",
    "displayName": "Orientation",
    "defaultOptionId": "com.apple.dock_orientation_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dock_orientation_0",
            "description": null,
            "helpText": null,
            "name": "bottom",
            "displayName": "Bottom",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bottom"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_orientation_1",
            "description": null,
            "helpText": null,
            "name": "left",
            "displayName": "Left",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "left"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_orientation_2",
            "description": null,
            "helpText": null,
            "name": "right",
            "displayName": "Right",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "right"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        }
    ]
}