{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft OneDrive",
        "Microsoft One Drive"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/sharepoint/deploy-and-configure-on-macos#filesondemandenabled"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.OneDrive/Forced/[0]/mcx_preference_settings",
    "offsetUri": "FilesOnDemandEnabled",
    "rootDefinitionId": "com.apple.managedclient.preferences_filesondemandenabled",
    "categoryId": "19ba782c-3594-45da-b829-72b54f6d45c7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_filesondemandenabled",
    "description": "Specifies whether Files On-Demand is enabled. When set to true, new users who set up the sync app will download online-only files by default. When set to false, Files On-Demand will be disabled and users won't be able to turn it on. NOTE: This setting only applies to macOS Monterey 12.1 and earlier.",
    "helpText": null,
    "name": "FilesOnDemandEnabled",
    "displayName": "Enable Files On-Demand",
    "defaultOptionId": "com.apple.managedclient.preferences_filesondemandenabled_true",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_filesondemandenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_filesondemandenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}