{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Proxy Configuration"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Proxies/GopherEnable",
    "rootDefinitionId": "com.apple.systemconfiguration_com.apple.systemconfiguration",
    "categoryId": "b8ed9eb3-17de-4091-b08b-7adb2fe13271",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systemconfiguration_proxies_gopherenable",
    "description": "If true, enables gopher proxy.",
    "helpText": null,
    "name": "Proxies_GopherEnable",
    "displayName": "Gopher Enable",
    "defaultOptionId": "com.apple.systemconfiguration_proxies_gopherenable_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.systemconfiguration_proxies_gopherenable_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.systemconfiguration_proxies",
                    "parentSettingId": "com.apple.systemconfiguration_proxies"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.systemconfiguration_proxies_gopherenable_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.systemconfiguration_proxies",
                    "parentSettingId": "com.apple.systemconfiguration_proxies"
                }
            ],
            "dependedOnBy": []
        }
    ]
}