{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Outlook"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployoffice/mac/preferences-outlook#specify-calendar-first-day-of-week"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Outlook/Forced/[0]/mcx_preference_settings",
    "offsetUri": "CalendarFirstDayOfWeek",
    "rootDefinitionId": "com.apple.managedclient.preferences_calendarfirstdayofweek",
    "categoryId": "191a84f2-13b5-4609-808f-8b743b7f0247",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_calendarfirstdayofweek",
    "description": "Set the first day of week in calendar view.",
    "helpText": null,
    "name": "CalendarFirstDayOfWeek",
    "displayName": "Specify first day of the week",
    "defaultOptionId": "com.apple.managedclient.preferences_calendarfirstdayofweek_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_calendarfirstdayofweek_0",
            "description": null,
            "helpText": null,
            "name": "Sunday",
            "displayName": "Sunday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_calendarfirstdayofweek_1",
            "description": null,
            "helpText": null,
            "name": "Monday",
            "displayName": "Monday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_calendarfirstdayofweek_2",
            "description": null,
            "helpText": null,
            "name": "Tuesday",
            "displayName": "Tuesday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_calendarfirstdayofweek_3",
            "description": null,
            "helpText": null,
            "name": "Wednesday",
            "displayName": "Wednesday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_calendarfirstdayofweek_4",
            "description": null,
            "helpText": null,
            "name": "Thursday",
            "displayName": "Thursday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_calendarfirstdayofweek_5",
            "description": null,
            "helpText": null,
            "name": "Friday",
            "displayName": "Friday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 6
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_calendarfirstdayofweek_6",
            "description": null,
            "helpText": null,
            "name": "Saturday",
            "displayName": "Saturday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 7
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}