{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "User Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.preference.users",
    "rootDefinitionId": "com.apple.preference.users_com.apple.preference.users",
    "categoryId": "0a9f982a-3515-4728-a231-fa000eb9e550",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.preference.users_com.apple.preference.users",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.preference.users",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.preference.users_disableusingicloudpassword"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.preference.users_disableusingicloudpassword",
            "required": false
        }
    ]
}