{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Time Limits"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "time-limits/weekday-allowance",
    "rootDefinitionId": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
    "categoryId": "f71e7e3a-482a-4760-b7f9-0403b2b6f7d8",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance",
    "description": "The weekday allowance settings.",
    "helpText": null,
    "name": "time-limits_weekday-allowance",
    "displayName": "Weekday Allowance",
    "childIds": [
        "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_enabled",
        "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_rangetype",
        "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_start",
        "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_end",
        "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_secondsperday"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.familycontrols.timelimits.v2_time-limits",
            "parentSettingId": "com.apple.familycontrols.timelimits.v2_time-limits"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_enabled",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_rangetype",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_start",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_end",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_secondsperday",
            "required": false
        }
    ]
}