{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Xsan"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.xsan",
    "rootDefinitionId": "com.apple.xsan_com.apple.xsan",
    "categoryId": "46af3391-ed6d-4ada-aef7-02dac2a1b136",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.xsan_com.apple.xsan",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.xsan",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.xsan_sanname",
        "com.apple.xsan_sanconfigurls",
        "com.apple.xsan_fsnameservers",
        "com.apple.xsan_sanauthmethod",
        "com.apple.xsan_sharedsecret"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.xsan_sanname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.xsan_sanconfigurls",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.xsan_fsnameservers",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.xsan_sanauthmethod",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.xsan_sharedsecret",
            "required": true
        }
    ]
}