{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ApplicationsSystem//Applications/Microsoft Teams.app/ChannelName",
    "rootDefinitionId": "com.apple.managedclient.preferences_applicationssystem",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app_channelname",
    "description": null,
    "helpText": null,
    "name": "ApplicationsSystem_Applications_Microsoft Teams.app_ChannelName",
    "displayName": "Channel Name (Deprecated)",
    "defaultOptionId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app_channelname_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app_channelname_0",
            "description": null,
            "helpText": null,
            "name": "Current Channel",
            "displayName": "Current Channel",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Current"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app",
                    "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app_channelname_1",
            "description": null,
            "helpText": null,
            "name": "Current Channel (Preview)",
            "displayName": "Current Channel (Preview)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Preview"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app",
                    "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app_channelname_2",
            "description": null,
            "helpText": null,
            "name": "Beta Channel",
            "displayName": "Beta Channel",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Beta"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app",
                    "parentSettingId": "com.apple.managedclient.preferences_applicationssystem_applications_microsoft teams.app"
                }
            ],
            "dependedOnBy": []
        }
    ]
}