{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Extensions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AllowedSystemExtensions",
    "rootDefinitionId": "com.apple.system-extension-policy_com.apple.system-extension-policy",
    "categoryId": "cb33668b-933f-4424-8d2d-8bdf0e61bddd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.system-extension-policy_allowedsystemextensions_generickey_keytobereplaced",
    "description": "Add a Team Identifier of valid and signed system extensions to load. The team identifier must be alphanumeric (letters and numbers) and have 10 characters. For example, enter ABCDE12345.",
    "helpText": null,
    "name": "AllowedSystemExtensions",
    "displayName": "Team Identifier",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "regEx",
        "inputValidationSchema": "^.*",
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.system-extension-policy_allowedsystemextensions",
            "parentSettingId": "com.apple.system-extension-policy_allowedsystemextensions"
        }
    ],
    "dependedOnBy": []
}