{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On",
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ExtensionData/{0}",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_ignored_$typepicker",
    "description": "Keys and values to pass to the app extension.",
    "helpText": null,
    "name": "ExtensionData_genericKey",
    "displayName": "Type",
    "defaultOptionId": "com.apple.extensiblesso_ignored_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_ignored_0",
            "description": "String",
            "helpText": null,
            "name": "String",
            "displayName": "String",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "String"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_extensiondata",
                    "parentSettingId": "com.apple.extensiblesso_extensiondata"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.extensiblesso_extensiondata_generickey_string",
                    "required": true
                }
            ]
        },
        {
            "itemId": "com.apple.extensiblesso_ignored_1",
            "description": "Integer",
            "helpText": null,
            "name": "Integer",
            "displayName": "Integer",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Integer"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_extensiondata",
                    "parentSettingId": "com.apple.extensiblesso_extensiondata"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.extensiblesso_extensiondata_generickey_integer",
                    "required": true
                }
            ]
        },
        {
            "itemId": "com.apple.extensiblesso_ignored_2",
            "description": "Boolean",
            "helpText": null,
            "name": "Boolean",
            "displayName": "Boolean",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Boolean"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_extensiondata",
                    "parentSettingId": "com.apple.extensiblesso_extensiondata"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.extensiblesso_extensiondata_generickey_boolean",
                    "required": true
                }
            ]
        }
    ]
}