{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "WebAppInstallForceList/[{0}]/default_launch_container",
    "rootDefinitionId": "com.apple.managedclient.preferences_webappinstallforcelist",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_webappinstallforcelist_item_default_launch_container",
    "description": null,
    "helpText": null,
    "name": "WebAppInstallForceList_item_default_launch_container",
    "displayName": "Default launch container",
    "defaultOptionId": "com.apple.managedclient.preferences_webappinstallforcelist_item_default_launch_container_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_webappinstallforcelist_item_default_launch_container_0",
            "description": null,
            "helpText": null,
            "name": "tab",
            "displayName": "tab",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tab"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_webappinstallforcelist",
                    "parentSettingId": "com.apple.managedclient.preferences_webappinstallforcelist"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_webappinstallforcelist_item_default_launch_container_1",
            "description": null,
            "helpText": null,
            "name": "window",
            "displayName": "window",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "window"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_webappinstallforcelist",
                    "parentSettingId": "com.apple.managedclient.preferences_webappinstallforcelist"
                }
            ],
            "dependedOnBy": []
        }
    ]
}