{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Privacy Preferences Policy Control"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Services",
    "rootDefinitionId": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
    "categoryId": "82d173f9-ba0b-4b09-bbb8-68cba4916162",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.tcc.configuration-profile-policy_services",
    "description": "A dictionary whose keys are limited to the privacy policy control services. In the case of conflicting specifications, the most restrictive setting (deny) is used.",
    "helpText": null,
    "name": "Services",
    "displayName": "Services",
    "childIds": [
        "com.apple.tcc.configuration-profile-policy_services_addressbook",
        "com.apple.tcc.configuration-profile-policy_services_calendar",
        "com.apple.tcc.configuration-profile-policy_services_reminders",
        "com.apple.tcc.configuration-profile-policy_services_photos",
        "com.apple.tcc.configuration-profile-policy_services_camera",
        "com.apple.tcc.configuration-profile-policy_services_microphone",
        "com.apple.tcc.configuration-profile-policy_services_accessibility",
        "com.apple.tcc.configuration-profile-policy_services_postevent",
        "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles",
        "com.apple.tcc.configuration-profile-policy_services_systempolicysysadminfiles",
        "com.apple.tcc.configuration-profile-policy_services_appleevents",
        "com.apple.tcc.configuration-profile-policy_services_medialibrary",
        "com.apple.tcc.configuration-profile-policy_services_fileproviderpresence",
        "com.apple.tcc.configuration-profile-policy_services_listenevent",
        "com.apple.tcc.configuration-profile-policy_services_screencapture",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition",
        "com.apple.tcc.configuration-profile-policy_services_systempolicydesktopfolder",
        "com.apple.tcc.configuration-profile-policy_services_systempolicydocumentsfolder",
        "com.apple.tcc.configuration-profile-policy_services_systempolicydownloadsfolder",
        "com.apple.tcc.configuration-profile-policy_services_systempolicynetworkvolumes",
        "com.apple.tcc.configuration-profile-policy_services_systempolicyremovablevolumes",
        "com.apple.tcc.configuration-profile-policy_services_systempolicyappbundles",
        "com.apple.tcc.configuration-profile-policy_services_systempolicyappdata",
        "com.apple.tcc.configuration-profile-policy_services_bluetoothalways"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
            "parentSettingId": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_addressbook",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_calendar",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_reminders",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_photos",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_camera",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_microphone",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_accessibility",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_postevent",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicysysadminfiles",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_appleevents",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_medialibrary",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_fileproviderpresence",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_listenevent",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_screencapture",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicydesktopfolder",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicydocumentsfolder",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicydownloadsfolder",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicynetworkvolumes",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicyremovablevolumes",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicyappbundles",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_systempolicyappdata",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways",
            "required": false
        }
    ]
}