{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Associated Domains"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Configuration/[{0}]/EnableDirectDownloads",
    "rootDefinitionId": "com.apple.associated-domains_com.apple.associated-domains",
    "categoryId": "8efd284f-5a56-4da8-8821-f51984ff954d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.associated-domains_configuration_item_enabledirectdownloads",
    "description": "If true, data for this domain should be downloaded directly instead of through a CDN. The entitlement value for this domain must be set to service:domain?mode=managed or this value will be ignored. Available in macOS 11 and later.",
    "helpText": null,
    "name": "Configuration_item_EnableDirectDownloads",
    "displayName": "Enable Direct Downloads",
    "defaultOptionId": "com.apple.associated-domains_configuration_item_enabledirectdownloads_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.associated-domains_configuration_item_enabledirectdownloads_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.associated-domains_configuration",
                    "parentSettingId": "com.apple.associated-domains_configuration"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.associated-domains_configuration_item_enabledirectdownloads_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.associated-domains_configuration",
                    "parentSettingId": "com.apple.associated-domains_configuration"
                }
            ],
            "dependedOnBy": []
        }
    ]
}