{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Subscribed Calendars"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.subscribedcalendar.account",
    "rootDefinitionId": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account",
    "categoryId": "fa20bbc3-d25d-4a7f-a349-9b211d186e21",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.subscribedcalendar.account",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.subscribedcalendar.account_subcalaccountdescription",
        "com.apple.subscribedcalendar.account_subcalaccounthostname",
        "com.apple.subscribedcalendar.account_subcalaccountusername",
        "com.apple.subscribedcalendar.account_subcalaccountpassword",
        "com.apple.subscribedcalendar.account_subcalaccountusessl",
        "com.apple.subscribedcalendar.account_vpnuuid"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.subscribedcalendar.account_subcalaccountdescription",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.subscribedcalendar.account_subcalaccounthostname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.subscribedcalendar.account_subcalaccountusername",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.subscribedcalendar.account_subcalaccountpassword",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.subscribedcalendar.account_subcalaccountusessl",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.subscribedcalendar.account_vpnuuid",
            "required": false
        }
    ]
}