{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Proxy Configuration"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Proxies/HTTPSProxy",
    "rootDefinitionId": "com.apple.systemconfiguration_com.apple.systemconfiguration",
    "categoryId": "b8ed9eb3-17de-4091-b08b-7adb2fe13271",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systemconfiguration_proxies_httpsproxy",
    "description": "The host name or IP address for the secure web proxy.",
    "helpText": null,
    "name": "Proxies_HTTPSProxy",
    "displayName": "HTTPS Proxy",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.systemconfiguration_proxies",
            "parentSettingId": "com.apple.systemconfiguration_proxies"
        }
    ],
    "dependedOnBy": []
}