{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Office"
    ],
    "infoUrls": [
        "https://aka.ms/macoce"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.office/Forced/[0]/mcx_preference_settings",
    "offsetUri": "OfficeExperiencesAnalyzingContentPreference",
    "rootDefinitionId": "com.apple.managedclient.preferences_officeexperiencesanalyzingcontentpreference",
    "categoryId": "b5169b74-41be-460a-9402-b13b6c22582b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_officeexperiencesanalyzingcontentpreference",
    "description": "Examples: PowerPoint Designer, editing suggestions, Excel data insights.",
    "helpText": null,
    "name": "OfficeExperiencesAnalyzingContentPreference",
    "displayName": "Allow experiences and functionality that analyzes user content",
    "defaultOptionId": "com.apple.managedclient.preferences_officeexperiencesanalyzingcontentpreference_true",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_officeexperiencesanalyzingcontentpreference_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_officeexperiencesanalyzingcontentpreference_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}