{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Scheduled scan configuration"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/scheduledScan",
    "offsetUri": "weeklyConfiguration/scanType",
    "rootDefinitionId": "com.apple.managedclient.preferences_weeklyconfiguration",
    "categoryId": "64c8233f-3057-4485-b902-d71a312318d7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_weeklyconfiguration_scantype",
    "description": "Specifies the type of scan to perform.",
    "helpText": null,
    "name": "weeklyConfiguration_scanType",
    "displayName": "Scan type",
    "defaultOptionId": "com.apple.managedclient.preferences_weeklyconfiguration_scantype_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_weeklyconfiguration_scantype_0",
            "description": null,
            "helpText": null,
            "name": "quick",
            "displayName": "quick",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "quick"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_weeklyconfiguration",
                    "parentSettingId": "com.apple.managedclient.preferences_weeklyconfiguration"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_weeklyconfiguration_scantype_1",
            "description": null,
            "helpText": null,
            "name": "full",
            "displayName": "full",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "full"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.managedclient.preferences_weeklyconfiguration",
                    "parentSettingId": "com.apple.managedclient.preferences_weeklyconfiguration"
                }
            ],
            "dependedOnBy": []
        }
    ]
}