{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#cookiesblockedforurls"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "CookiesBlockedForUrls",
    "rootDefinitionId": "com.apple.managedclient.preferences_cookiesblockedforurls",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_cookiesblockedforurls",
    "description": "Define a list of sites, based on URL patterns, that can't set cookies.\n\nIf you don't configure this policy, the global default value from the \"DefaultCookiesSetting\" policy (if set) or the user's personal configuration is used for all sites.\n\nSee the \"CookiesAllowedForUrls\" and \"CookiesSessionOnlyForUrls\" policies for more information.\n\nNote there cannot be conflicting URL patterns set between these three policies:\n\n- CookiesBlockedForUrls\n\n- \"CookiesAllowedForUrls\"\n\n- \"CookiesSessionOnlyForUrls\"",
    "helpText": null,
    "name": "CookiesBlockedForUrls",
    "displayName": "Block cookies on specific sites",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}