{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Vault Recovery Key Escrow",
        "FileVault Recovery Key Escrow"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Location",
    "rootDefinitionId": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
    "categoryId": "bd5533e1-f1ee-4994-8a79-cffe02b12d5c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.security.fderecoverykeyescrow_location",
    "description": "The description of the location where the recovery key will be escrowed. This text will be inserted into the message the user sees when enabling FileVault.",
    "helpText": null,
    "name": "Location",
    "displayName": "Location",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
            "parentSettingId": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow"
        }
    ],
    "dependedOnBy": []
}