{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#allowcrossoriginauthprompt"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "AllowCrossOriginAuthPrompt",
    "rootDefinitionId": "com.apple.managedclient.preferences_allowcrossoriginauthprompt",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_allowcrossoriginauthprompt",
    "description": "Controls whether third-party sub-content on a page can open an HTTP Basic Auth dialog box.\n\nTypically, this is disabled as a phishing defense. If you don't configure this policy, it's disabled and third-party sub-content can't open a HTTP Basic Auth dialog box.",
    "helpText": null,
    "name": "AllowCrossOriginAuthPrompt",
    "displayName": "Allow cross-origin HTTP Basic Auth prompts",
    "defaultOptionId": "com.apple.managedclient.preferences_allowcrossoriginauthprompt_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_allowcrossoriginauthprompt_false",
            "description": null,
            "helpText": null,
            "name": "Blocked",
            "displayName": "Blocked",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_allowcrossoriginauthprompt_true",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}