{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Xsan Preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.xsan.preferences",
    "rootDefinitionId": "com.apple.xsan.preferences_com.apple.xsan.preferences",
    "categoryId": "fd3717c1-dcf8-4038-b7f7-4ad3359a9d32",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.xsan.preferences_com.apple.xsan.preferences",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.xsan.preferences",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.xsan.preferences_onlymount",
        "com.apple.xsan.preferences_denymount",
        "com.apple.xsan.preferences_denydlc",
        "com.apple.xsan.preferences_preferdlc",
        "com.apple.xsan.preferences_usedlc"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.xsan.preferences_onlymount",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.xsan.preferences_denymount",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.xsan.preferences_denydlc",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.xsan.preferences_preferdlc",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.xsan.preferences_usedlc",
            "required": false
        }
    ]
}