{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Global HTTP Proxy"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ProxyServerPort",
    "rootDefinitionId": "com.apple.proxy.http.global_com.apple.proxy.http.global",
    "categoryId": "906df5cd-1d9e-49d0-ab32-cf5c5a041974",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.proxy.http.global_proxyserverport",
    "description": "The proxy server's port number.",
    "helpText": null,
    "name": "ProxyServerPort",
    "displayName": "Proxy Server Port",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.proxy.http.global_proxytype_0",
            "parentSettingId": "com.apple.proxy.http.global_proxytype"
        }
    ],
    "dependedOnBy": []
}