{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Vault",
        "FileVault"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DeferForceAtUserLoginMaxBypassAttempts",
    "rootDefinitionId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
    "categoryId": "3f56adc1-2207-4033-a6e2-07f64c08e3ff",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx.filevault2_deferforceatuserloginmaxbypassattempts",
    "description": "The maximum number of times users can bypass enabling FileVault before being required to enable it to log in. If the value is 0, the user will be required to enabled FileVault the next time they attempt to log in. Setting this key to –1 disables the feature.",
    "helpText": null,
    "name": "DeferForceAtUserLoginMaxBypassAttempts",
    "displayName": "Defer Force At User Login Max Bypass Attempts",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 9999,
        "minimumValue": -1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
            "parentSettingId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2"
        }
    ],
    "dependedOnBy": []
}