{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Associated Domains"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Configuration",
    "rootDefinitionId": "com.apple.associated-domains_com.apple.associated-domains",
    "categoryId": "8efd284f-5a56-4da8-8821-f51984ff954d",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.associated-domains_configuration",
    "description": "Map apps to their associated domains.",
    "helpText": null,
    "name": "Configuration",
    "displayName": "Configuration",
    "childIds": [
        "com.apple.associated-domains_configuration_item_applicationidentifier",
        "com.apple.associated-domains_configuration_item_associateddomains",
        "com.apple.associated-domains_configuration_item_enabledirectdownloads"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.associated-domains_com.apple.associated-domains",
            "parentSettingId": "com.apple.associated-domains_com.apple.associated-domains"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.associated-domains_configuration_item_applicationidentifier",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.associated-domains_configuration_item_associateddomains",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.associated-domains_configuration_item_enabledirectdownloads",
            "required": false
        }
    ]
}