{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Work",
        "Profile",
        "Password",
        "Sign",
        "In",
        "Failure",
        "Count",
        "Before",
        "Factory",
        "Reset",
        "Work profile password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/workProfilePasswordSignInFailureCountBeforeFactoryReset/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.workprofilepasswordsigninfailurecountbeforefactoryreset",
    "categoryId": "70c4566f-a079-4a8e-ac97-0736b405df1d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.workprofilepasswordsigninfailurecountbeforefactoryreset",
    "description": "Enter the number of wrong passwords allowed before the work profile is wiped, from 4-11. If the value is blank, Intune doesn't change or update this setting. Available for corporate-owned work profile devices (at work profile level).",
    "helpText": "Enter a number (4-11)",
    "name": "WorkProfilePasswordSignInFailureCountBeforeFactoryReset",
    "displayName": "Number of sign-in failures before wiping device",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 11,
        "minimumValue": 4
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 11
    },
    "dependentOn": [],
    "dependedOnBy": []
}