{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Privacy Preferences Policy Control"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Services/BluetoothAlways/[{0}]/Authorization",
    "rootDefinitionId": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
    "categoryId": "82d173f9-ba0b-4b09-bbb8-68cba4916162",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_authorization",
    "description": "The `Authorization` key is an optional replacement for the `Allowed` key, which has one of the following possible values:\n\n- `Allow`: Equivalent to a `true` value for the `Allowed` key\n- `Deny`: Equivalent to a `false` value for the `Allowed` key\n- `AllowStandardUserToSetSystemService`: Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the `ListenEvent` and `ScreenCapture` services\n\n> Note:\n> Every payload needs to include either `Authorization` or `Allowed`, but not both.\n\nAvailable in macOS 11 and later.",
    "helpText": null,
    "name": "Services_BluetoothAlways_item_Authorization",
    "displayName": "Authorization",
    "defaultOptionId": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_authorization_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_authorization_0",
            "description": null,
            "helpText": null,
            "name": "Allow",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Allow"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways",
                    "parentSettingId": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_authorization_1",
            "description": null,
            "helpText": null,
            "name": "Deny",
            "displayName": "Deny",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Deny"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways",
                    "parentSettingId": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_authorization_2",
            "description": null,
            "helpText": null,
            "name": "AllowStandardUserToSetSystemService",
            "displayName": "AllowStandardUserToSetSystemService",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AllowStandardUserToSetSystemService"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways",
                    "parentSettingId": "com.apple.tcc.configuration-profile-policy_services_bluetoothalways"
                }
            ],
            "dependedOnBy": []
        }
    ]
}