{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.SpellcheckLanguageBlocklist",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.spellchecklanguageblocklist",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "smallTextBox",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.spellchecklanguageblocklist",
    "description": "Force-disables spellcheck languages. Unrecognized languages in that list will be ignored.\n\nIf you enable this policy, spellcheck will be disabled for the languages specified. The user can still enable or disable spellcheck for languages not in the list.\n\nIf you do not set this policy, or disable it, there will be no change to the user's spellcheck preferences.\n\nIf the \"SpellcheckEnabled\" policy is set to disabled, this policy will have no effect.\n\nIf a language is included in both the \"SpellcheckLanguage\" and the 'SpellcheckLanguageBlocklist' policy, the spellcheck language is enabled.",
    "helpText": null,
    "name": "SpellcheckLanguageBlocklist",
    "displayName": "Force disable spellcheck languages",
    "maximumCount": 600,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}