{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "loginWindowIdleTime",
    "rootDefinitionId": "com.apple.screensaver_com.apple.screensaver",
    "categoryId": "8cefd936-362e-4a24-bc76-e078b6fd13fa",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.screensaver_loginwindowidletime",
    "description": "The number of seconds of inactivity before the screen saver activates (0 = Never activate). ",
    "helpText": null,
    "name": "loginWindowIdleTime",
    "displayName": "Login Window Idle Time",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.screensaver_com.apple.screensaver",
            "parentSettingId": "com.apple.screensaver_com.apple.screensaver"
        }
    ],
    "dependedOnBy": []
}