{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.DefaultJavaScriptSetting",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.defaultjavascriptsetting",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.defaultjavascriptsetting",
    "description": "Set whether websites can run JavaScript. You can allow it for all sites ('AllowJavaScript') or block it for all sites ('BlockJavaScript').\n\nIf you don't configure this policy, all sites can run JavaScript by default, and the user can change this setting.\n\nPolicy options mapping:\n\n* AllowJavaScript (1) = Allow all sites to run JavaScript\n\n* BlockJavaScript (2) = Don't allow any site to run JavaScript\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "DefaultJavaScriptSetting",
    "displayName": "Default JavaScript setting",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultjavascriptsetting_allowjavascript",
            "description": null,
            "helpText": null,
            "name": "Allow all sites to run JavaScript",
            "displayName": "Allow all sites to run JavaScript",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultjavascriptsetting_blockjavascript",
            "description": null,
            "helpText": null,
            "name": "Don't allow any site to run JavaScript",
            "displayName": "Don't allow any site to run JavaScript",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}