{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.dock",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_com.apple.dock",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.dock",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.dock_tilesize",
        "com.apple.dock_size-immutable",
        "com.apple.dock_magnification",
        "com.apple.dock_magnify-immutable",
        "com.apple.dock_largesize",
        "com.apple.dock_magsize-immutable",
        "com.apple.dock_orientation",
        "com.apple.dock_position-immutable",
        "com.apple.dock_mineffect",
        "com.apple.dock_mineffect-immutable",
        "com.apple.dock_windowtabbing",
        "com.apple.dock_windowtabbing-immutable",
        "com.apple.dock_dblclickbehavior",
        "com.apple.dock_dblclickbehavior-immutable",
        "com.apple.dock_minimize-to-application",
        "com.apple.dock_minintoapp-immutable",
        "com.apple.dock_launchanim",
        "com.apple.dock_launchanim-immutable",
        "com.apple.dock_autohide",
        "com.apple.dock_autohide-immutable",
        "com.apple.dock_show-process-indicators",
        "com.apple.dock_showindicators-immutable",
        "com.apple.dock_show-recents",
        "com.apple.dock_showrecents-immutable",
        "com.apple.dock_contents-immutable",
        "com.apple.dock_mcxdockspecialfolders",
        "com.apple.dock_allowdockfixupoverride",
        "com.apple.dock_static-only",
        "com.apple.dock_static-others",
        "com.apple.dock_static-apps",
        "com.apple.dock_persistent-apps",
        "com.apple.dock_persistent-others"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.dock_tilesize",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_size-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_magnification",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_magnify-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_largesize",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_magsize-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_orientation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_position-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_mineffect",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_mineffect-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_windowtabbing",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_windowtabbing-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_dblclickbehavior",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_dblclickbehavior-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_minimize-to-application",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_minintoapp-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_launchanim",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_launchanim-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_autohide",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_autohide-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_show-process-indicators",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_showindicators-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_show-recents",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_showrecents-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_contents-immutable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_mcxdockspecialfolders",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_allowdockfixupoverride",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_static-only",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_static-others",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_static-apps",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_persistent-apps",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dock_persistent-others",
            "required": false
        }
    ]
}