{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "allowPasswordAutoFill",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_allowpasswordautofill",
    "description": "If false, disables the AutoFill Passwords feature in iOS (with Keychain and third-party password managers) and the user isn’t prompted to use a saved password in Safari or in apps. This restriction also disables Automatic Strong Passwords, and strong passwords are no longer suggested to users. It doesn’t prevent AutoFill for contact info and credit cards in Safari. Requires a supervised device. Available in iOS 12 and later, and macOS 10.14 and later.",
    "helpText": null,
    "name": "allowPasswordAutoFill",
    "displayName": "Allow Password Auto Fill",
    "defaultOptionId": "com.apple.applicationaccess_allowpasswordautofill_true",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_allowpasswordautofill_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_allowpasswordautofill_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_com.apple.applicationaccess",
                    "parentSettingId": "com.apple.applicationaccess_com.apple.applicationaccess"
                }
            ],
            "dependedOnBy": []
        }
    ]
}