{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Media Management Disc Burning"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.DiscRecording",
    "rootDefinitionId": "com.apple.discrecording_com.apple.discrecording",
    "categoryId": "87f460f4-8403-419c-bfb4-44dec5edcccb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.discrecording_com.apple.discrecording",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.DiscRecording",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.discrecording_burnsupport"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.discrecording_burnsupport",
            "required": true
        }
    ]
}