{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Work",
        "Profile",
        "Password",
        "Previous",
        "Password",
        "Count",
        "To",
        "Block",
        "Work profile password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/workProfilePasswordPreviousPasswordCountToBlock/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.workprofilepasswordpreviouspasswordcounttoblock",
    "categoryId": "70c4566f-a079-4a8e-ac97-0736b405df1d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.workprofilepasswordpreviouspasswordcounttoblock",
    "description": "Use this setting to restrict users from creating previously used work profile passwords. Enter the number of previously used passwords that can't be used, from 1-24. For example, enter 5 so users can't set a new password to their current password or any of their previous four passwords. If the value is blank, Intune doesn't change or update this setting. Available for corporate-owned work profile devices (at work profile level).",
    "helpText": "Enter a number (1-24)",
    "name": "WorkProfilePasswordPreviousPasswordCountToBlock",
    "displayName": "Number of passwords required before user can reuse a password",
    "defaultValue": null,
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 24,
        "minimumValue": 1
    },
    "dependentOn": [],
    "dependedOnBy": []
}