{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Lock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "App/UserEnabledOptions",
    "rootDefinitionId": "com.apple.app.lock_com.apple.app.lock",
    "categoryId": "7b4e3f58-fb7a-4e6b-8f39-35d1cd90f508",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.app.lock_app_userenabledoptions",
    "description": "A dictionary of user-editable options.",
    "helpText": null,
    "name": "App_UserEnabledOptions",
    "displayName": "User Enabled Options",
    "childIds": [
        "com.apple.app.lock_app_userenabledoptions_voicecontrol",
        "com.apple.app.lock_app_userenabledoptions_voiceover",
        "com.apple.app.lock_app_userenabledoptions_zoom",
        "com.apple.app.lock_app_userenabledoptions_invertcolors",
        "com.apple.app.lock_app_userenabledoptions_assistivetouch"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.app.lock_app",
            "parentSettingId": "com.apple.app.lock_app"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.app.lock_app_userenabledoptions_voicecontrol",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_userenabledoptions_voiceover",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_userenabledoptions_zoom",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_userenabledoptions_invertcolors",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_userenabledoptions_assistivetouch",
            "required": false
        }
    ]
}