{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Associated Domains"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Configuration/[{0}]/AssociatedDomains",
    "rootDefinitionId": "com.apple.associated-domains_com.apple.associated-domains",
    "categoryId": "8efd284f-5a56-4da8-8821-f51984ff954d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.associated-domains_configuration_item_associateddomains",
    "description": "The domains to be associated with the app. Each string is in the form of \"service:domain\". Domains should be fully qualified hostnames, like www.example.com.",
    "helpText": null,
    "name": "Configuration_item_AssociatedDomains",
    "displayName": "Associated Domains",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.associated-domains_configuration",
            "parentSettingId": "com.apple.associated-domains_configuration"
        }
    ],
    "dependedOnBy": []
}