{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Web Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PermittedURLs",
    "rootDefinitionId": "com.apple.webcontent-filter_com.apple.webcontent-filter",
    "categoryId": "a6fe8038-136b-4d50-bf04-8e232409c0d2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.webcontent-filter_permittedurls",
    "description": "An array or URLs that are accessible whether or not the automatic filter allows access. The system uses this array only when Auto Filter Enabled is true. Otherwise, it ignores this field.",
    "helpText": null,
    "name": "PermittedURLs",
    "displayName": "Permitted URLs",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.webcontent-filter_com.apple.webcontent-filter",
            "parentSettingId": "com.apple.webcontent-filter_com.apple.webcontent-filter"
        }
    ],
    "dependedOnBy": []
}