{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Features"
    ],
    "infoUrls": [
        "https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/microsoft-defender-atp-for-mac-is-moving-to-system-extensions/ba-p/1608736"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/features",
    "offsetUri": "systemExtensions",
    "rootDefinitionId": "com.apple.managedclient.preferences_systemextensions",
    "categoryId": "a3ea4da3-445e-41c0-ac4d-c9ad2467ec26",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_systemextensions",
    "description": "Whether system extensions are used on MacOS 10.15 (Catalina) or not.",
    "helpText": null,
    "name": "systemExtensions",
    "displayName": "Use System Extensions",
    "defaultOptionId": "com.apple.managedclient.preferences_systemextensions_1",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_systemextensions_0",
            "description": null,
            "helpText": null,
            "name": "enabled",
            "displayName": "enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "enabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_systemextensions_1",
            "description": null,
            "helpText": null,
            "name": "disabled",
            "displayName": "disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}