{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#enforcement-level-for-antivirus-engine"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/antivirusEngine",
    "offsetUri": "enforcementLevel",
    "rootDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
    "description": "Antivirus engine enforcement mode",
    "helpText": null,
    "name": "enforcementLevel",
    "displayName": "Enforcement level",
    "defaultOptionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_0",
            "description": null,
            "helpText": null,
            "name": "passive",
            "displayName": "passive",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "passive"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_1",
            "description": null,
            "helpText": null,
            "name": "on_demand",
            "displayName": "on_demand",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "on_demand"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2",
            "description": null,
            "helpText": null,
            "name": "real_time",
            "displayName": "real_time",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "real_time"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}