{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Proxy Configuration"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Proxies/HTTPPort",
    "rootDefinitionId": "com.apple.systemconfiguration_com.apple.systemconfiguration",
    "categoryId": "b8ed9eb3-17de-4091-b08b-7adb2fe13271",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.systemconfiguration_proxies_httpport",
    "description": "The web proxy port.",
    "helpText": null,
    "name": "Proxies_HTTPPort",
    "displayName": "HTTP Port",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.systemconfiguration_proxies",
            "parentSettingId": "com.apple.systemconfiguration_proxies"
        }
    ],
    "dependedOnBy": []
}