{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PlatformSSO/TokenToUserMapping",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_platformsso_tokentousermapping",
    "description": "The attribute mapping used when creating new users or for authorization.",
    "helpText": null,
    "name": "PlatformSSO_TokenToUserMapping",
    "displayName": "Token To User Mapping",
    "childIds": [
        "com.apple.extensiblesso_platformsso_tokentousermapping_accountname",
        "com.apple.extensiblesso_platformsso_tokentousermapping_fullname"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.extensiblesso_platformsso",
            "parentSettingId": "com.apple.extensiblesso_platformsso"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_tokentousermapping_accountname",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_tokentousermapping_fullname",
            "required": false
        }
    ]
}