{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Privacy Preferences Policy Control"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Services/AppleEvents/[{0}]/AEReceiverIdentifierType",
    "rootDefinitionId": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
    "categoryId": "82d173f9-ba0b-4b09-bbb8-68cba4916162",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.tcc.configuration-profile-policy_services_appleevents_item_aereceiveridentifiertype",
    "description": "The type of AE Receiver Identifier value, either bundle ID or path.",
    "helpText": null,
    "name": "Services_AppleEvents_item_AEReceiverIdentifierType",
    "displayName": "AE Receiver Identifier Type",
    "defaultOptionId": "com.apple.tcc.configuration-profile-policy_services_appleevents_item_aereceiveridentifiertype_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.tcc.configuration-profile-policy_services_appleevents_item_aereceiveridentifiertype_0",
            "description": null,
            "helpText": null,
            "name": "bundleID",
            "displayName": "bundle ID",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bundleID"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.tcc.configuration-profile-policy_services_appleevents",
                    "parentSettingId": "com.apple.tcc.configuration-profile-policy_services_appleevents"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.tcc.configuration-profile-policy_services_appleevents_item_aereceiveridentifiertype_1",
            "description": null,
            "helpText": null,
            "name": "path",
            "displayName": "path",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "path"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.tcc.configuration-profile-policy_services_appleevents",
                    "parentSettingId": "com.apple.tcc.configuration-profile-policy_services_appleevents"
                }
            ],
            "dependedOnBy": []
        }
    ]
}