{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Air Print",
        "AirPrint"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AirPrint/[{0}]/ResourcePath",
    "rootDefinitionId": "com.apple.airprint_com.apple.airprint",
    "categoryId": "429c4b85-a2b4-46ed-afa0-6c89c08a5544",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.airprint_airprint_item_resourcepath",
    "description": "The resource path associated with the printer. This path corresponds to the rp parameter of the _ipps.tcp Bonjour record. For example:  printers/Canon_MG5300_series, printers/Xerox_Phaser_7600, ipp/print, Epson_IPP_Printer",
    "helpText": null,
    "name": "AirPrint_item_ResourcePath",
    "displayName": "Resource Path",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.airprint_airprint",
            "parentSettingId": "com.apple.airprint_airprint"
        }
    ],
    "dependedOnBy": []
}