{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#printingallowedbackgroundgraphicsmodes"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "PrintingAllowedBackgroundGraphicsModes",
    "rootDefinitionId": "com.apple.managedclient.preferences_printingallowedbackgroundgraphicsmodes",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_printingallowedbackgroundgraphicsmodes",
    "description": "Restricts background graphics printing mode. If this policy isn't set there's no restriction on printing background graphics.\n\nPolicy options mapping:\n\n* any (any) = Allow printing with and without background graphics\n\n* enabled (enabled) = Allow printing only with background graphics\n\n* disabled (disabled) = Allow printing only without background graphics\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "PrintingAllowedBackgroundGraphicsModes",
    "displayName": "Restrict background graphics printing mode",
    "defaultOptionId": "com.apple.managedclient.preferences_printingallowedbackgroundgraphicsmodes_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_printingallowedbackgroundgraphicsmodes_0",
            "description": null,
            "helpText": null,
            "name": "Allow printing with and without background graphics",
            "displayName": "Allow printing with and without background graphics",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "any"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_printingallowedbackgroundgraphicsmodes_1",
            "description": null,
            "helpText": null,
            "name": "Allow printing only without background graphics",
            "displayName": "Allow printing only without background graphics",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_printingallowedbackgroundgraphicsmodes_2",
            "description": null,
            "helpText": null,
            "name": "Allow printing only with background graphics",
            "displayName": "Allow printing only with background graphics",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "enabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}