{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft OneDrive",
        "Microsoft One Drive"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/sharepoint/deploy-and-configure-on-macos#enableallocsiclients"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.OneDrive/Forced/[0]/mcx_preference_settings",
    "offsetUri": "EnableAllOcsiClients",
    "rootDefinitionId": "com.apple.managedclient.preferences_enableallocsiclients",
    "categoryId": "19ba782c-3594-45da-b829-72b54f6d45c7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_enableallocsiclients",
    "description": "This setting lets multiple users use the Microsoft 365 Apps for enterprise, Office 2019, or Office 2016 desktop apps to simultaneously edit an Office file stored in OneDrive. It also lets users share files from the Office desktop apps.",
    "helpText": null,
    "name": "EnableAllOcsiClients",
    "displayName": "Enable simultaneous edits for Office apps",
    "defaultOptionId": "com.apple.managedclient.preferences_enableallocsiclients_true",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_enableallocsiclients_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_enableallocsiclients_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}