{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "pinHistory",
    "rootDefinitionId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "categoryId": "d68abc4d-559a-4339-be48-c41a77a87034",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mobiledevice.passwordpolicy_pinhistory",
    "description": "This value defines N, where the new passcode must be unique within the last N entries in the passcode history. ",
    "helpText": null,
    "name": "pinHistory",
    "displayName": "PIN History",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 50,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
            "parentSettingId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy"
        }
    ],
    "dependedOnBy": []
}