{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Accessibility"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "contrast",
    "rootDefinitionId": "com.apple.universalaccess_com.apple.universalaccess",
    "categoryId": "c00d6468-cac3-429c-ada5-ba3adf4982a8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.universalaccess_contrast",
    "description": "The contrast value in the Display options.",
    "helpText": null,
    "name": "contrast",
    "displayName": "Contrast",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 1,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.universalaccess_com.apple.universalaccess",
            "parentSettingId": "com.apple.universalaccess_com.apple.universalaccess"
        }
    ],
    "dependedOnBy": []
}