{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#printingwebpagelayout"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "PrintingWebpageLayout",
    "rootDefinitionId": "com.apple.managedclient.preferences_printingwebpagelayout",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_printingwebpagelayout",
    "description": "Configuring  this   policy  sets  the  layout  for  printing  webpages.\n\nIf  you  disable  or  don't  configure  this  policy,  users  can  decide  whether  to  print  webpages  in  Portrait  or  Landscape  layout.\n\nIf  you  enable  this  policy,  the  selected  option  is  set  as  the  layout  option.\n\nPolicy options mapping:\n\n* portrait (0) = Sets layout option as portrait\n\n* landscape (1) = Sets layout option as landscape\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "PrintingWebpageLayout",
    "displayName": "Sets layout for printing",
    "defaultOptionId": "com.apple.managedclient.preferences_printingwebpagelayout_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_printingwebpagelayout_0",
            "description": null,
            "helpText": null,
            "name": "Sets layout option as portrait",
            "displayName": "Sets layout option as portrait",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_printingwebpagelayout_1",
            "description": null,
            "helpText": null,
            "name": "Sets layout option as landscape",
            "displayName": "Sets layout option as landscape",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}