{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "USB",
        "USB Data Access",
        "File Transfer",
        "Data Transfer",
        "Data Access",
        "General"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/usbDataAccess/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.usbdataaccess",
    "categoryId": "b6733d23-eadc-486a-abfc-62b78698a16c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.usbdataaccess",
    "description": "Select what files and/or data can be transferred via USB. If you block file transfer, only files will be blocked from being transferred and other connection (such as mouse) will still be allowed. If you block USB data transfer, all data will be blocked. Available for fully managed, dedicated and corporate-owned work profile devices (at work profile level).",
    "helpText": null,
    "name": "UsbDataAccess",
    "displayName": "USB access",
    "defaultOptionId": "com.android.devicerestrictionpolicy.usbdataaccess_allowusbdatatransfer",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.usbdataaccess_allowusbdatatransfer",
            "description": "All types of USB data transfers are allowed. usbFileTransferDisabled is ignored.",
            "helpText": null,
            "name": "ALLOW_USB_DATA_TRANSFER",
            "displayName": "Allow USB data transfer",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ALLOW_USB_DATA_TRANSFER"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.usbdataaccess_disallowusbfiletransfer",
            "description": "Transferring files over USB is disallowed. Other types of USB data connections, such as mouse and keyboard connection, are allowed. usbFileTransferDisabled is ignored.",
            "helpText": null,
            "name": "DISALLOW_USB_FILE_TRANSFER",
            "displayName": "Disallow USB file transfer",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "DISALLOW_USB_FILE_TRANSFER"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.usbdataaccess_disallowusbdatatransfer",
            "description": "When set, all types of USB data transfers are prohibited. Supported for devices running Android 12 or above with USB HAL 1.3 or above. If the setting is not supported, DISALLOW_USB_FILE_TRANSFER will be set. A NonComplianceDetail with API_LEVEL is reported if the Android version is less than 12. A NonComplianceDetail with DEVICE_INCOMPATIBLE is reported if the device does not have USB HAL 1.3 or above. usbFileTransferDisabled is ignored.",
            "helpText": null,
            "name": "DISALLOW_USB_DATA_TRANSFER",
            "displayName": "Disallow USB data transfer",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "DISALLOW_USB_DATA_TRANSFER"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}