{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "OnDemandRules",
    "rootDefinitionId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
    "categoryId": "bbe51018-a17d-46c4-9517-ff45c54d8d18",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dnssettings.managed_ondemandrules",
    "description": "An array of rules defining the DNS settings. If rules are not present, the system always applies the DNS settings. These rules are identical to the OnDemandRules array in VPN payloads.",
    "helpText": null,
    "name": "OnDemandRules",
    "displayName": "On Demand Rules",
    "childIds": [
        "com.apple.dnssettings.managed_ondemandrules_item_action",
        "com.apple.dnssettings.managed_ondemandrules_item_actionparameters",
        "com.apple.dnssettings.managed_ondemandrules_item_dnsdomainmatch",
        "com.apple.dnssettings.managed_ondemandrules_item_dnsserveraddressmatch",
        "com.apple.dnssettings.managed_ondemandrules_item_interfacetypematch",
        "com.apple.dnssettings.managed_ondemandrules_item_ssidmatch",
        "com.apple.dnssettings.managed_ondemandrules_item_urlstringprobe"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.dnssettings.managed_com.apple.dnssettings.managed",
            "parentSettingId": "com.apple.dnssettings.managed_com.apple.dnssettings.managed"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_action",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_actionparameters",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_dnsdomainmatch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_dnsserveraddressmatch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_interfacetypematch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_ssidmatch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.dnssettings.managed_ondemandrules_item_urlstringprobe",
            "required": false
        }
    ]
}