{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Web Content Filter"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "FilterType",
    "rootDefinitionId": "com.apple.webcontent-filter_com.apple.webcontent-filter",
    "categoryId": "a6fe8038-136b-4d50-bf04-8e232409c0d2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.webcontent-filter_filtertype",
    "description": "The type of filter, built-in or plug-in. In macOS, the system supports only the plug-in value.",
    "helpText": null,
    "name": "FilterType",
    "displayName": "Filter Type",
    "defaultOptionId": "com.apple.webcontent-filter_filtertype_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.webcontent-filter_filtertype_0",
            "description": null,
            "helpText": null,
            "name": "BuiltIn",
            "displayName": "Built-in",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "BuiltIn"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.webcontent-filter_com.apple.webcontent-filter",
                    "parentSettingId": "com.apple.webcontent-filter_com.apple.webcontent-filter"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.webcontent-filter_filtertype_1",
            "description": null,
            "helpText": null,
            "name": "Plugin",
            "displayName": "Plug-in",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Plugin"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.webcontent-filter_com.apple.webcontent-filter",
                    "parentSettingId": "com.apple.webcontent-filter_com.apple.webcontent-filter"
                }
            ],
            "dependedOnBy": []
        }
    ]
}