{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On",
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Type",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_type",
    "description": "The type of SSO.",
    "helpText": null,
    "name": "Type",
    "displayName": "Type",
    "defaultOptionId": "com.apple.extensiblesso_type_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_type_0",
            "description": null,
            "helpText": null,
            "name": "Credential",
            "displayName": "Credential",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Credential"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_com.apple.extensiblesso",
                    "parentSettingId": "com.apple.extensiblesso_com.apple.extensiblesso"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.extensiblesso_type_1",
            "description": null,
            "helpText": null,
            "name": "Redirect",
            "displayName": "Redirect",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Redirect"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_com.apple.extensiblesso",
                    "parentSettingId": "com.apple.extensiblesso_com.apple.extensiblesso"
                }
            ],
            "dependedOnBy": []
        }
    ]
}