{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Outlook"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployoffice/mac/preferences-outlook#specify-default-weather-location"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Outlook/Forced/[0]/mcx_preference_settings",
    "offsetUri": "DefaultWeatherLocation",
    "rootDefinitionId": "com.apple.managedclient.preferences_defaultweatherlocation",
    "categoryId": "191a84f2-13b5-4609-808f-8b743b7f0247",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_defaultweatherlocation",
    "description": "Sets the default weather location in the Calendar view. Enter the city and state or country (e.g. Redmond, WA or Paris, France)",
    "helpText": null,
    "name": "DefaultWeatherLocation",
    "displayName": "Default weather location",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}