{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Air Play",
        "AirPlay"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Passwords/[{0}]/Password",
    "rootDefinitionId": "com.apple.airplay_com.apple.airplay",
    "categoryId": "132003c7-1130-4f59-96a7-dfb6adb8bd5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.airplay_passwords_item_password",
    "description": "The password for the AirPlay destination.",
    "helpText": null,
    "name": "Passwords_item_Password",
    "displayName": "Password",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 1,
        "isSecret": true,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
        "settingValueTemplateReference": null,
        "value": "",
        "valueState": "invalid"
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.airplay_passwords",
            "parentSettingId": "com.apple.airplay_passwords"
        }
    ],
    "dependedOnBy": []
}