{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Lock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "App/Options",
    "rootDefinitionId": "com.apple.app.lock_com.apple.app.lock",
    "categoryId": "7b4e3f58-fb7a-4e6b-8f39-35d1cd90f508",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.app.lock_app_options",
    "description": "A dictionary of options that the user cannot change.",
    "helpText": null,
    "name": "App_Options",
    "displayName": "Options",
    "childIds": [
        "com.apple.app.lock_app_options_disabletouch",
        "com.apple.app.lock_app_options_disabledevicerotation",
        "com.apple.app.lock_app_options_disablevolumebuttons",
        "com.apple.app.lock_app_options_disableringerswitch",
        "com.apple.app.lock_app_options_disablesleepwakebutton",
        "com.apple.app.lock_app_options_disableautolock",
        "com.apple.app.lock_app_options_enablevoiceover",
        "com.apple.app.lock_app_options_enablezoom",
        "com.apple.app.lock_app_options_enableinvertcolors",
        "com.apple.app.lock_app_options_enableassistivetouch",
        "com.apple.app.lock_app_options_enablespeakselection",
        "com.apple.app.lock_app_options_enablemonoaudio",
        "com.apple.app.lock_app_options_enablevoicecontrol"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.app.lock_app",
            "parentSettingId": "com.apple.app.lock_app"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.app.lock_app_options_disabletouch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_disabledevicerotation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_disablevolumebuttons",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_disableringerswitch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_disablesleepwakebutton",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_disableautolock",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_enablevoiceover",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_enablezoom",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_enableinvertcolors",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_enableassistivetouch",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_enablespeakselection",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_enablemonoaudio",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.app.lock_app_options_enablevoicecontrol",
            "required": false
        }
    ]
}