{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PlatformSSO",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_platformsso",
    "description": "This is the dictionary used to configure PlatformSSO.",
    "helpText": null,
    "name": "PlatformSSO",
    "displayName": "Platform SSO",
    "childIds": [
        "com.apple.extensiblesso_platformsso_authenticationmethod",
        "com.apple.extensiblesso_platformsso_useshareddevicekeys",
        "com.apple.extensiblesso_platformsso_accountdisplayname",
        "com.apple.extensiblesso_platformsso_loginfrequency",
        "com.apple.extensiblesso_platformsso_enablecreateuseratlogin",
        "com.apple.extensiblesso_platformsso_enablecreatefirstuserduringsetup",
        "com.apple.extensiblesso_platformsso_enableauthorization",
        "com.apple.extensiblesso_platformsso_tokentousermapping",
        "com.apple.extensiblesso_platformsso_newuserauthenticationmethods",
        "com.apple.extensiblesso_platformsso_newuserauthorizationmode",
        "com.apple.extensiblesso_platformsso_userauthorizationmode",
        "com.apple.extensiblesso_platformsso_administratorgroups",
        "com.apple.extensiblesso_platformsso_additionalgroups",
        "com.apple.extensiblesso_platformsso_authorizationgroups",
        "com.apple.extensiblesso_platformsso_accesskeyreadergroupidentifier",
        "com.apple.extensiblesso_platformsso_accesskeyterminalidentityuuid",
        "com.apple.extensiblesso_platformsso_allowaccesskeyexpressmode",
        "com.apple.extensiblesso_platformsso_filevaultpolicy",
        "com.apple.extensiblesso_platformsso_loginpolicy",
        "com.apple.extensiblesso_platformsso_unlockpolicy",
        "com.apple.extensiblesso_platformsso_offlinegraceperiod",
        "com.apple.extensiblesso_platformsso_authenticationgraceperiod",
        "com.apple.extensiblesso_platformsso_nonplatformssoaccounts",
        "com.apple.extensiblesso_platformsso_allowdeviceidentifiersinattestation",
        "com.apple.extensiblesso_platformsso_synchronizeprofilepicture",
        "com.apple.extensiblesso_platformsso_temporarysessionquicklogin",
        "com.apple.extensiblesso_platformsso_enableregistrationduringsetup"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.extensiblesso_com.apple.extensiblesso",
            "parentSettingId": "com.apple.extensiblesso_com.apple.extensiblesso"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_authenticationmethod",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_useshareddevicekeys",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_accountdisplayname",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_loginfrequency",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_enablecreateuseratlogin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_enablecreatefirstuserduringsetup",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_enableauthorization",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_tokentousermapping",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_newuserauthenticationmethods",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_newuserauthorizationmode",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_userauthorizationmode",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_administratorgroups",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_additionalgroups",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_authorizationgroups",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_accesskeyreadergroupidentifier",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_accesskeyterminalidentityuuid",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_allowaccesskeyexpressmode",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_filevaultpolicy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_loginpolicy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_unlockpolicy",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_offlinegraceperiod",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_authenticationgraceperiod",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_nonplatformssoaccounts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_allowdeviceidentifiersinattestation",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_synchronizeprofilepicture",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_temporarysessionquicklogin",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso_enableregistrationduringsetup",
            "required": false
        }
    ]
}