{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#usesystemprintdialog"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "UseSystemPrintDialog",
    "rootDefinitionId": "com.apple.managedclient.preferences_usesystemprintdialog",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_usesystemprintdialog",
    "description": "Shows the system print dialog instead of print preview.\n\nIf you enable this policy, Microsoft Edge opens the system print dialog instead of the built-in print preview when a user prints a page.\n\nIf you don't configure or disable this policy, print commands trigger the Microsoft Edge print preview screen.",
    "helpText": null,
    "name": "UseSystemPrintDialog",
    "displayName": "Print using system print dialog",
    "defaultOptionId": "com.apple.managedclient.preferences_usesystemprintdialog_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_usesystemprintdialog_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_usesystemprintdialog_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}