{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Firewall"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.security.firewall",
    "rootDefinitionId": "com.apple.security.firewall_com.apple.security.firewall",
    "categoryId": "70b5da13-9c31-4857-890d-b7eb223729c3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.security.firewall_com.apple.security.firewall",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.security.firewall",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.security.firewall_enablefirewall",
        "com.apple.security.firewall_blockallincoming",
        "com.apple.security.firewall_enablestealthmode",
        "com.apple.security.firewall_applications",
        "com.apple.security.firewall_enablelogging",
        "com.apple.security.firewall_loggingoption",
        "com.apple.security.firewall_allowsigned",
        "com.apple.security.firewall_allowsignedapp"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.security.firewall_enablefirewall",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.security.firewall_blockallincoming",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.firewall_enablestealthmode",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.firewall_applications",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.firewall_enablelogging",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.firewall_loggingoption",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.firewall_allowsigned",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.security.firewall_allowsignedapp",
            "required": false
        }
    ]
}