{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "DateTimeConfigurationBlocked",
        "DateTime",
        "Configuration",
        "Block",
        "General"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/dateTimeConfigurationBlocked/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.datetimeconfigurationblocked",
    "categoryId": "b6733d23-eadc-486a-abfc-62b78698a16c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.datetimeconfigurationblocked",
    "description": "If 'True', prevents users from manually setting the date and time. If False, Intune doesn't change or update this setting. By default, the OS might allow users to the set date and time on the device. Available for fully managed, dedicated and corporate-owned work profile (at work profile level) devices.",
    "helpText": "",
    "name": "dateTimeConfigurationBlocked",
    "displayName": "Block date and time changes",
    "defaultOptionId": "com.android.devicerestrictionpolicy.datetimeconfigurationblocked_false",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.android.devicerestrictionpolicy.datetimeconfigurationblocked_false",
            "description": "False",
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.android.devicerestrictionpolicy.datetimeconfigurationblocked_true",
            "description": "True",
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}