{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Auto Update",
        "Microsoft AutoUpdate (MAU)"
    ],
    "infoUrls": [
        "https://support.microsoft.com/office/update-office-for-mac-automatically-bfd1e497-c24d-4754-92ab-910a4074d7c1"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.autoupdate2/Forced/[0]/mcx_preference_settings",
    "offsetUri": "ChannelName",
    "rootDefinitionId": "com.apple.managedclient.preferences_channelname",
    "categoryId": "2373de26-8270-4e74-a53f-9aeb55d5553c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_channelname",
    "description": "Specifies the channel to receive updates. The most stable channel is the Current Channel, which is recommended for the majority of your fleet. Users subscribed to the Preview Channel will receive production-quality updates a week before Current Channel users. Users subscribed to the Beta Channel will receive unsupported nightly builds that are designed for testing.",
    "helpText": null,
    "name": "ChannelName",
    "displayName": "Update channel",
    "defaultOptionId": "com.apple.managedclient.preferences_channelname_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_channelname_0",
            "description": null,
            "helpText": null,
            "name": "Current Channel",
            "displayName": "Current Channel",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Current"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_channelname_1",
            "description": null,
            "helpText": null,
            "name": "Current Channel (Preview)",
            "displayName": "Current Channel (Preview)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Preview"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_channelname_2",
            "description": null,
            "helpText": null,
            "name": "Current Channel (Deferred)",
            "displayName": "Current Channel (Deferred)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Custom"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_channelname_3",
            "description": null,
            "helpText": null,
            "name": "Beta Channel",
            "displayName": "Beta Channel",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Beta"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_channelname_4",
            "description": null,
            "helpText": null,
            "name": "Current Channel (Monthly)",
            "displayName": "Current Channel (Monthly)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "CurrentThrottle"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}