{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On",
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ExtensionData/{0}",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_extensiondata_generickey_integer",
    "description": "Keys and values to pass to the app extension.",
    "helpText": null,
    "name": "ExtensionData_genericKey",
    "displayName": "Value",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.extensiblesso_ignored_1",
            "parentSettingId": "com.apple.extensiblesso_ignored_$typepicker"
        }
    ],
    "dependedOnBy": []
}