{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cellular"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AttachAPN",
    "rootDefinitionId": "com.apple.cellular_com.apple.cellular",
    "categoryId": "5c722b3f-9d77-428a-b859-3fb556162cd6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.cellular_attachapn",
    "description": "A configuration dictionary.",
    "helpText": null,
    "name": "AttachAPN",
    "displayName": "Attach APN",
    "childIds": [
        "com.apple.cellular_attachapn_name",
        "com.apple.cellular_attachapn_authenticationtype",
        "com.apple.cellular_attachapn_username",
        "com.apple.cellular_attachapn_password",
        "com.apple.cellular_attachapn_allowedprotocolmask"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.cellular_com.apple.cellular",
            "parentSettingId": "com.apple.cellular_com.apple.cellular"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.cellular_attachapn_name",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.cellular_attachapn_authenticationtype",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_attachapn_username",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_attachapn_password",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.cellular_attachapn_allowedprotocolmask",
            "required": false
        }
    ]
}