{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.screensaver",
    "rootDefinitionId": "com.apple.screensaver_com.apple.screensaver",
    "categoryId": "8cefd936-362e-4a24-bc76-e078b6fd13fa",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.screensaver_com.apple.screensaver",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.screensaver",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.screensaver_askforpassword",
        "com.apple.screensaver_askforpassworddelay",
        "com.apple.screensaver_loginwindowidletime",
        "com.apple.screensaver_loginwindowmodulepath",
        "com.apple.screensaver_modulename"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.screensaver_askforpassword",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.screensaver_askforpassworddelay",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.screensaver_loginwindowidletime",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.screensaver_loginwindowmodulepath",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.screensaver_modulename",
            "required": true
        }
    ]
}