{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Caldav"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.caldav.account",
    "rootDefinitionId": "com.apple.caldav.account_com.apple.caldav.account",
    "categoryId": "831dcaee-a6fa-4893-a32d-e13fdf7d3777",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.caldav.account_com.apple.caldav.account",
    "description": "com.apple.caldav.account",
    "helpText": null,
    "name": "com.apple.caldav.account",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.caldav.account_caldavaccountdescription",
        "com.apple.caldav.account_caldavhostname",
        "com.apple.caldav.account_caldavusername",
        "com.apple.caldav.account_caldavpassword",
        "com.apple.caldav.account_caldavprincipalurl",
        "com.apple.caldav.account_caldavusessl",
        "com.apple.caldav.account_caldavport",
        "com.apple.caldav.account_vpnuuid"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.caldav.account_caldavaccountdescription",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.caldav.account_caldavhostname",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.caldav.account_caldavusername",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.caldav.account_caldavpassword",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.caldav.account_caldavprincipalurl",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.caldav.account_caldavusessl",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.caldav.account_caldavport",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.caldav.account_vpnuuid",
            "required": false
        }
    ]
}