{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Carddav"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CardDAVPrincipalURL",
    "rootDefinitionId": "com.apple.carddav.account_com.apple.carddav.account",
    "categoryId": "45fe783f-a80b-42d9-ab3c-8c4081be8d05",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.carddav.account_carddavprincipalurl",
    "description": "The base URL to the user’s address book.",
    "helpText": null,
    "name": "CardDAVPrincipalURL",
    "displayName": "Card DAV Principal URL",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.carddav.account_com.apple.carddav.account",
            "parentSettingId": "com.apple.carddav.account_com.apple.carddav.account"
        }
    ],
    "dependedOnBy": []
}