{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Usage Rules"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "SIMRules",
    "rootDefinitionId": "com.apple.networkusagerules_com.apple.networkusagerules",
    "categoryId": "06a85f5b-2614-4467-91cf-4a64d0c9326f",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.networkusagerules_simrules",
    "description": "An array of SIM rules, that apply to all apps.",
    "helpText": null,
    "name": "SIMRules",
    "displayName": "SIM Rules",
    "childIds": [
        "com.apple.networkusagerules_simrules_item_iccids",
        "com.apple.networkusagerules_simrules_item_wifiassistpolicy"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.networkusagerules_com.apple.networkusagerules",
            "parentSettingId": "com.apple.networkusagerules_com.apple.networkusagerules"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.networkusagerules_simrules_item_iccids",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.networkusagerules_simrules_item_wifiassistpolicy",
            "required": true
        }
    ]
}