{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Global HTTP Proxy"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ProxyCaptiveLoginAllowed",
    "rootDefinitionId": "com.apple.proxy.http.global_com.apple.proxy.http.global",
    "categoryId": "906df5cd-1d9e-49d0-ab32-cf5c5a041974",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.proxy.http.global_proxycaptiveloginallowed",
    "description": "If true, allows the device to bypass the proxy server to display the login page for captive networks.",
    "helpText": null,
    "name": "ProxyCaptiveLoginAllowed",
    "displayName": "Proxy Captive Login Allowed",
    "defaultOptionId": "com.apple.proxy.http.global_proxycaptiveloginallowed_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.proxy.http.global_proxycaptiveloginallowed_false",
            "description": null,
            "helpText": null,
            "name": "Blocked",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.proxy.http.global_com.apple.proxy.http.global",
                    "parentSettingId": "com.apple.proxy.http.global_com.apple.proxy.http.global"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.proxy.http.global_proxycaptiveloginallowed_true",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.proxy.http.global_com.apple.proxy.http.global",
                    "parentSettingId": "com.apple.proxy.http.global_com.apple.proxy.http.global"
                }
            ],
            "dependedOnBy": []
        }
    ]
}