{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On",
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.extensiblesso",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_com.apple.extensiblesso",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.extensiblesso",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.extensiblesso_extensionidentifier",
        "com.apple.extensiblesso_teamidentifier",
        "com.apple.extensiblesso_type",
        "com.apple.extensiblesso_realm",
        "com.apple.extensiblesso_extensiondata",
        "com.apple.extensiblesso_urls",
        "com.apple.extensiblesso_hosts",
        "com.apple.extensiblesso_screenlockedbehavior",
        "com.apple.extensiblesso_deniedbundleidentifiers",
        "com.apple.extensiblesso_authenticationmethod",
        "com.apple.extensiblesso_registrationtoken",
        "com.apple.extensiblesso_platformsso"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.extensiblesso_extensionidentifier",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_teamidentifier",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_type",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_realm",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_extensiondata",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_urls",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_hosts",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_screenlockedbehavior",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_deniedbundleidentifiers",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_authenticationmethod",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_registrationtoken",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.extensiblesso_platformsso",
            "required": false
        }
    ]
}