{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Logging"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "System/Enable-Private-Data",
    "rootDefinitionId": "com.apple.system.logging_com.apple.system.logging",
    "categoryId": "0d4d90ab-7ad8-4524-ade0-bc01aa7b71a3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.system.logging_system_enable-private-data",
    "description": "Setting this value to true enables private data logging for the entire system.",
    "helpText": null,
    "name": "System_Enable-Private-Data",
    "displayName": "Enable Private Data",
    "defaultOptionId": "com.apple.system.logging_system_enable-private-data_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.system.logging_system_enable-private-data_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.system.logging_system",
                    "parentSettingId": "com.apple.system.logging_system"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.system.logging_system_enable-private-data_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.system.logging_system",
                    "parentSettingId": "com.apple.system.logging_system"
                }
            ],
            "dependedOnBy": []
        }
    ]
}