{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network Usage Rules"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ApplicationRules",
    "rootDefinitionId": "com.apple.networkusagerules_com.apple.networkusagerules",
    "categoryId": "06a85f5b-2614-4467-91cf-4a64d0c9326f",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.networkusagerules_applicationrules",
    "description": "An array of application rules, that apply to only managed apps.",
    "helpText": null,
    "name": "ApplicationRules",
    "displayName": "Application Rules",
    "childIds": [
        "com.apple.networkusagerules_applicationrules_item_appidentifiermatches",
        "com.apple.networkusagerules_applicationrules_item_allowroamingcellulardata",
        "com.apple.networkusagerules_applicationrules_item_allowcellulardata"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.networkusagerules_com.apple.networkusagerules",
            "parentSettingId": "com.apple.networkusagerules_com.apple.networkusagerules"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.networkusagerules_applicationrules_item_appidentifiermatches",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.networkusagerules_applicationrules_item_allowroamingcellulardata",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.networkusagerules_applicationrules_item_allowcellulardata",
            "required": false
        }
    ]
}