{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Autonomous Single App Mode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AllowedApplications",
    "rootDefinitionId": "com.apple.asam_com.apple.asam",
    "categoryId": "daa2ea69-8026-465a-942c-75eb0396d5b9",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.asam_allowedapplications",
    "description": "An array of dictionaries that specifies the apps that can be granted access to the Accessibility APIs.",
    "helpText": null,
    "name": "AllowedApplications",
    "displayName": "Allowed Applications",
    "childIds": [
        "com.apple.asam_allowedapplications_item_bundleidentifier",
        "com.apple.asam_allowedapplications_item_teamidentifier"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.asam_com.apple.asam",
            "parentSettingId": "com.apple.asam_com.apple.asam"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.asam_allowedapplications_item_bundleidentifier",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.asam_allowedapplications_item_teamidentifier",
            "required": true
        }
    ]
}