{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Directory Service"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ADForceHomeLocal",
    "rootDefinitionId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
    "categoryId": "5995d2ad-5ec7-49d2-ada2-d9c2b57746ba",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.directoryservice.managed_adforcehomelocal",
    "description": "If true, forces a local home directory.",
    "helpText": null,
    "name": "ADForceHomeLocal",
    "displayName": "AD Force Home Local",
    "defaultOptionId": "com.apple.directoryservice.managed_adforcehomelocal_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.directoryservice.managed_adforcehomelocal_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
                    "parentSettingId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.directoryservice.managed_adforcehomelocal_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
                    "parentSettingId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed"
                }
            ],
            "dependedOnBy": []
        }
    ]
}