{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Directory Service"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ADRestrictDDNS",
    "rootDefinitionId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
    "categoryId": "5995d2ad-5ec7-49d2-ada2-d9c2b57746ba",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.directoryservice.managed_adrestrictddns",
    "description": "If true, allows authentication from any domain in the namespace. ",
    "helpText": null,
    "name": "ADRestrictDDNS",
    "displayName": "AD Restrict DDNS",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
            "parentSettingId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed"
        }
    ],
    "dependedOnBy": []
}