{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge - All",
        "Microsoft Edge Apple",
        "Microsoft Edge"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sleepingtabsblockedforurls"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "SleepingTabsBlockedForUrls",
    "rootDefinitionId": "com.apple.managedclient.preferences_sleepingtabsblockedforurls",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_sleepingtabsblockedforurls",
    "description": "Define a list of sites, based on URL patterns, that are not allowed to be put to sleep by Sleeping Tabs.\n\nIf the policy \"SleepingTabsEnabled\" is disabled, this list is not used and no sites will be put to sleep automatically.\n\nIf you don't configure this policy, all sites will be eligible to be put to sleep unless the user's personal configuration blocks them.",
    "helpText": null,
    "name": "SleepingTabsBlockedForUrls",
    "displayName": "Block Sleeping Tabs on specific sites",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [],
    "dependedOnBy": []
}