{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "NS Extension Management"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DeniedExtensions",
    "rootDefinitionId": "com.apple.nsextension_com.apple.nsextension",
    "categoryId": "d875dca1-dc97-4cc5-9df3-c50b813622a3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.nsextension_deniedextensions",
    "description": "An array of identifiers for extensions that aren't allowed to run on the system.",
    "helpText": null,
    "name": "DeniedExtensions",
    "displayName": "Denied Extensions",
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.nsextension_com.apple.nsextension",
            "parentSettingId": "com.apple.nsextension_com.apple.nsextension"
        }
    ],
    "dependedOnBy": []
}