{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Privacy Preferences Policy Control"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Services/AppleEvents/[{0}]/Identifier",
    "rootDefinitionId": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
    "categoryId": "82d173f9-ba0b-4b09-bbb8-68cba4916162",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.tcc.configuration-profile-policy_services_appleevents_item_identifier",
    "description": "The bundle ID or installation path of the binary.\n\n> Note:\n> This value is case-sensitive.",
    "helpText": null,
    "name": "Services_AppleEvents_item_Identifier",
    "displayName": "Identifier",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.tcc.configuration-profile-policy_services_appleevents",
            "parentSettingId": "com.apple.tcc.configuration-profile-policy_services_appleevents"
        }
    ],
    "dependedOnBy": []
}