{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.CustomHelpLink",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.customhelplink",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "smallTextBox",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.customhelplink",
    "description": "Specify a link for the Help menu or the F1 key.\n\nIf you enable this policy, an admin can specify a link for the Help menu or the F1 key.\n\nIf you disable or don't configure this policy, the default link for the Help menu or the F1 key is used.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
    "helpText": null,
    "name": "CustomHelpLink",
    "displayName": "Specify custom help link",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}