{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Privacy Preferences Policy Control"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Services/SpeechRecognition",
    "rootDefinitionId": "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
    "categoryId": "82d173f9-ba0b-4b09-bbb8-68cba4916162",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.tcc.configuration-profile-policy_services_speechrecognition",
    "description": "Allows the application to use the system Speech Recognition facility and to send speech data to Apple.",
    "helpText": null,
    "name": "Services_SpeechRecognition",
    "displayName": "Speech Recognition",
    "childIds": [
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_identifier",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_identifiertype",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_coderequirement",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_staticcode",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_allowed",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_authorization",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_comment",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_aereceiveridentifier",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_aereceiveridentifiertype",
        "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_aereceivercoderequirement"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.tcc.configuration-profile-policy_services",
            "parentSettingId": "com.apple.tcc.configuration-profile-policy_services"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_identifier",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_identifiertype",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_coderequirement",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_staticcode",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_allowed",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_authorization",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_comment",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_aereceiveridentifier",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_aereceiveridentifiertype",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.tcc.configuration-profile-policy_services_speechrecognition_item_aereceivercoderequirement",
            "required": false
        }
    ]
}