{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Printing"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.mcxprinting",
    "rootDefinitionId": "com.apple.mcxprinting_com.apple.mcxprinting",
    "categoryId": "174ffe92-3770-4688-aa21-85b7535cf374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcxprinting_com.apple.mcxprinting",
    "description": "com.apple.mcxprinting",
    "helpText": null,
    "name": "com.apple.mcxprinting",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcxprinting_requireadmintoaddprinters",
        "com.apple.mcxprinting_allowlocalprinters",
        "com.apple.mcxprinting_requireadmintoprintlocally",
        "com.apple.mcxprinting_showonlymanagedprinters",
        "com.apple.mcxprinting_printfooter",
        "com.apple.mcxprinting_printmacaddress",
        "com.apple.mcxprinting_footerfontsize",
        "com.apple.mcxprinting_footerfontname",
        "com.apple.mcxprinting_defaultprinter",
        "com.apple.mcxprinting_userprinterlist"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcxprinting_requireadmintoaddprinters",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_allowlocalprinters",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_requireadmintoprintlocally",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_showonlymanagedprinters",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_printfooter",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_printmacaddress",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_footerfontsize",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_footerfontname",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_defaultprinter",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcxprinting_userprinterlist",
            "required": false
        }
    ]
}