{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Energy Saver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.MCX",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-energysaver",
    "categoryId": "8c75a12d-664d-43ba-a3aa-5259425f9b37",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.mcx-energysaver",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.MCX",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcx_com.apple.energysaver.desktop.acpower",
        "com.apple.mcx_com.apple.energysaver.portable.acpower",
        "com.apple.mcx_com.apple.energysaver.portable.batterypower",
        "com.apple.mcx_com.apple.energysaver.desktop.schedule",
        "com.apple.mcx_sleepdisabled",
        "com.apple.mcx_destroyfvkeyonstandby"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.desktop.acpower",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.acpower",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.portable.batterypower",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.desktop.schedule",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_sleepdisabled",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_destroyfvkeyonstandby",
            "required": false
        }
    ]
}