{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Service Management",
        "Service Management - Managed Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.servicemanagement",
    "rootDefinitionId": "com.apple.servicemanagement_com.apple.servicemanagement",
    "categoryId": "9859957e-34f1-4669-9f95-2b7c79fff052",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.servicemanagement_com.apple.servicemanagement",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.servicemanagement",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.servicemanagement_rules"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.servicemanagement_rules",
            "required": true
        }
    ]
}