{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Time Server"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.MCX",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-timeserver",
    "categoryId": "853f4181-42e8-411c-91cf-c06968c0a543",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.mcx-timeserver",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.MCX",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcx_timeserver",
        "com.apple.mcx_timezone"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx_timeserver",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_timezone",
            "required": false
        }
    ]
}