{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Firewall"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "EnableFirewall",
    "rootDefinitionId": "com.apple.security.firewall_com.apple.security.firewall",
    "categoryId": "70b5da13-9c31-4857-890d-b7eb223729c3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.security.firewall_enablefirewall",
    "description": "If true, enables the firewall.",
    "helpText": null,
    "name": "EnableFirewall",
    "displayName": "Enable Firewall",
    "defaultOptionId": "com.apple.security.firewall_enablefirewall_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.security.firewall_enablefirewall_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.security.firewall_com.apple.security.firewall",
                    "parentSettingId": "com.apple.security.firewall_com.apple.security.firewall"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.security.firewall_enablefirewall_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.security.firewall_com.apple.security.firewall",
                    "parentSettingId": "com.apple.security.firewall_com.apple.security.firewall"
                }
            ],
            "dependedOnBy": []
        }
    ]
}