{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#updatepolicyoverride"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "UpdatePolicyOverride",
    "rootDefinitionId": "com.apple.managedclient.preferences_updatepolicyoverride",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_updatepolicyoverride",
    "description": "If you enable this policy, Microsoft Edge Update handles Microsoft Edge updates according to how you configure the following options:\n\n- Automatic silent updates only: Updates are applied only when they're found by the periodic update check.\n\n- Manual updates only: Updates are applied only when the user runs a manual update check. (Not all apps provide an interface for this option.)\n\nIf you select manual updates, make sure you periodically check for updates by using Microsoft Autoupdate.\n\nIf you don't enable and configure this policy, Microsoft Edge Update automatically checks for updates.\n\nPolicy options mapping:\n\n* automatic-silent-only (automatic-silent-only) = Updates are applied only when they're found by the periodic update check.\n\n* manual-only (manual-only) = Updates are applied only when the user runs a manual update check. (Not all apps provide an interface for this option.)\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "UpdatePolicyOverride",
    "displayName": "Specifies how Microsoft Edge Update handles available updates from Microsoft Edge",
    "defaultOptionId": "com.apple.managedclient.preferences_updatepolicyoverride_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_updatepolicyoverride_0",
            "description": null,
            "helpText": null,
            "name": "silent-only - Updates are applied only when they're found by the periodic update check.",
            "displayName": "silent-only - Updates are applied only when they're found by the periodic update check.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "automatic-silent-only"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_updatepolicyoverride_1",
            "description": null,
            "helpText": null,
            "name": "only - Updates are applied only when the user runs a manual update check. (Not all apps provide an interface for this option.)",
            "displayName": "only - Updates are applied only when the user runs a manual update check. (Not all apps provide an interface for this option.)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "manual-only"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}