{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "File Vault Options",
        "FileVault Options"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.MCX",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-fdefilevaultoptions",
    "categoryId": "5b327ef8-f9fb-4e10-ba9e-8a8ca9bf4ed9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.mcx-fdefilevaultoptions",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.MCX",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcx_dontallowfdedisable",
        "com.apple.mcx_dontallowfdeenable"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx_dontallowfdedisable",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_dontallowfdeenable",
            "required": false
        }
    ]
}