{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content Caching"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AllowSharedCaching",
    "rootDefinitionId": "com.apple.assetcache.managed_com.apple.assetcache.managed",
    "categoryId": "e95335ec-2704-47ab-8b40-f602b31eeb9d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.assetcache.managed_allowsharedcaching",
    "description": "If true, caches non-iCloud content, such as apps and software updates. Clients may take some time (hours, days) to react to changes to this setting; it does not have an immediate effect.\r\nAt least one of the Allow Personal Caching or Allow Shared Caching settings must be true. ",
    "helpText": null,
    "name": "AllowSharedCaching",
    "displayName": "Allow Shared Caching",
    "defaultOptionId": "com.apple.assetcache.managed_allowsharedcaching_true",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.assetcache.managed_allowsharedcaching_false",
            "description": null,
            "helpText": null,
            "name": "Blocked",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.assetcache.managed_com.apple.assetcache.managed",
                    "parentSettingId": "com.apple.assetcache.managed_com.apple.assetcache.managed"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.assetcache.managed_allowsharedcaching_true",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.assetcache.managed_com.apple.assetcache.managed",
                    "parentSettingId": "com.apple.assetcache.managed_com.apple.assetcache.managed"
                }
            ],
            "dependedOnBy": []
        }
    ]
}