{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Restrictions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ratingMovies",
    "rootDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
    "categoryId": "eda31027-9270-4959-801b-397fa05512e2",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.applicationaccess_ratingmoviesde",
    "description": "The maximum level of movie content allowed on the device. Available in iOS 4 and later.",
    "helpText": null,
    "name": "ratingMovies",
    "displayName": "Rating Movies - Germany",
    "defaultOptionId": "com.apple.applicationaccess_ratingmoviesde_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesde_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_3",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesde_1",
            "description": null,
            "helpText": null,
            "name": "Ab 0 Jahren",
            "displayName": "Ab 0 Jahren",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 75
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_3",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesde_2",
            "description": null,
            "helpText": null,
            "name": "Ab 6 Jahren",
            "displayName": "Ab 6 Jahren",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 100
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_3",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesde_3",
            "description": null,
            "helpText": null,
            "name": "Ab 12 Jahren",
            "displayName": "Ab 12 Jahren",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 200
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_3",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesde_4",
            "description": null,
            "helpText": null,
            "name": "Ab 16 Jahren",
            "displayName": "Ab 16 Jahren",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 500
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_3",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesde_5",
            "description": null,
            "helpText": null,
            "name": "Ab 18 Jahren",
            "displayName": "Ab 18 Jahren",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 600
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_3",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.applicationaccess_ratingmoviesde_6",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1000
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.applicationaccess_ratingregion_3",
                    "parentSettingId": "com.apple.applicationaccess_ratingregion"
                }
            ],
            "dependedOnBy": []
        }
    ]
}