{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Accounts"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.MCX",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-accounts",
    "categoryId": "5214f1e7-a5a9-4de5-80b4-2f7084a8d068",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mcx_com.apple.mcx-accounts",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.MCX",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.mcx_enableguestaccount",
        "com.apple.mcx_disableguestaccount"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx_enableguestaccount",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_disableguestaccount",
            "required": false
        }
    ]
}