{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cloud delivered protection preferences"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-automatic-sample-submissions"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "automaticSampleSubmissionConsent",
    "rootDefinitionId": "com.apple.managedclient.preferences_automaticsamplesubmissionconsent",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_automaticsamplesubmissionconsent",
    "description": "Sends sample files to Microsoft to help protect device users and your organization from potential threats",
    "helpText": null,
    "name": "automaticSampleSubmissionConsent",
    "displayName": "Automatic sample submission Consent",
    "defaultOptionId": "com.apple.managedclient.preferences_automaticsamplesubmissionconsent_1",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_automaticsamplesubmissionconsent_0",
            "description": null,
            "helpText": null,
            "name": "none",
            "displayName": "none",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "none"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_automaticsamplesubmissionconsent_1",
            "description": null,
            "helpText": null,
            "name": "safe",
            "displayName": "safe",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "safe"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_automaticsamplesubmissionconsent_2",
            "description": null,
            "helpText": null,
            "name": "all",
            "displayName": "all",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "all"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}