{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Desktop"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "override-picture-path",
    "rootDefinitionId": "com.apple.desktop_com.apple.desktop",
    "categoryId": "e42edcd8-fcb0-4255-a774-c78b34f0b0c9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.desktop_override-picture-path",
    "description": "The path to the desktop picture. If set, this picture is always locked.",
    "helpText": null,
    "name": "override-picture-path",
    "displayName": "Override Picture Path",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.desktop_com.apple.desktop",
            "parentSettingId": "com.apple.desktop_com.apple.desktop"
        }
    ],
    "dependedOnBy": []
}