{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Dock"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "windowtabbing",
    "rootDefinitionId": "com.apple.dock_com.apple.dock",
    "categoryId": "cc388035-b49c-493e-a598-14b0d0de4359",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.dock_windowtabbing",
    "description": "Set the \"Prefer tabs when opening documents\" to the provided value.",
    "helpText": null,
    "name": "windowtabbing",
    "displayName": "Window Tabbing",
    "defaultOptionId": "com.apple.dock_windowtabbing_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.dock_windowtabbing_0",
            "description": null,
            "helpText": null,
            "name": "manual",
            "displayName": "Manual",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "manual"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_windowtabbing_1",
            "description": null,
            "helpText": null,
            "name": "always",
            "displayName": "Always",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "always"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.dock_windowtabbing_2",
            "description": null,
            "helpText": null,
            "name": "fullscreen",
            "displayName": "Full Screen",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fullscreen"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.dock_com.apple.dock",
                    "parentSettingId": "com.apple.dock_com.apple.dock"
                }
            ],
            "dependedOnBy": []
        }
    ]
}