{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultwebbluetoothguardsetting"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "DefaultWebBluetoothGuardSetting",
    "rootDefinitionId": "com.apple.managedclient.preferences_defaultwebbluetoothguardsetting",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_defaultwebbluetoothguardsetting",
    "description": "Control whether websites can access nearby Bluetooth devices. You can completely block access or require the site to ask the user each time it wants to access a Bluetooth device.\n\nIf you don't configure this policy, the default value (3, meaning users are asked each time) is used and users can change it.\n\n* 2 = Don't allow any site to request access to Bluetooth devices by using the Web Bluetooth API\n\n* 3 = Allow sites to ask the user to grant access to a nearby Bluetooth device",
    "helpText": null,
    "name": "DefaultWebBluetoothGuardSetting",
    "displayName": "Control use of the Web Bluetooth API",
    "defaultOptionId": "com.apple.managedclient.preferences_defaultwebbluetoothguardsetting_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_defaultwebbluetoothguardsetting_0",
            "description": null,
            "helpText": null,
            "name": "Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API",
            "displayName": "Do not allow any site to request access to Bluetooth devices via the Web Bluetooth API",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_defaultwebbluetoothguardsetting_1",
            "description": null,
            "helpText": null,
            "name": "Allow sites to ask the user to grant access to a nearby Bluetooth device",
            "displayName": "Allow sites to ask the user to grant access to a nearby Bluetooth device",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}