{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Parental Controls Time Limits"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "time-limits/weekday-allowance/secondsPerDay",
    "rootDefinitionId": "com.apple.familycontrols.timelimits.v2_com.apple.familycontrols.timelimits.v2",
    "categoryId": "f71e7e3a-482a-4760-b7f9-0403b2b6f7d8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance_secondsperday",
    "description": "The allowance for that day, in seconds. ",
    "helpText": null,
    "name": "time-limits_weekday-allowance_secondsPerDay",
    "displayName": "Seconds Per Day",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance",
            "parentSettingId": "com.apple.familycontrols.timelimits.v2_time-limits_weekday-allowance"
        }
    ],
    "dependedOnBy": []
}