{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Store"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.appstore",
    "rootDefinitionId": "com.apple.appstore_com.apple.appstore",
    "categoryId": "f14014f5-a401-41e3-8a97-1a9e3c5e3614",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.appstore_com.apple.appstore",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.appstore",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "com.apple.appstore_restrict-store-softwareupdate-only",
        "com.apple.appstore_restrict-store-disable-app-adoption",
        "com.apple.appstore_disablesoftwareupdatenotifications"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.appstore_restrict-store-softwareupdate-only",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.appstore_restrict-store-disable-app-adoption",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.appstore_disablesoftwareupdatenotifications",
            "required": false
        }
    ]
}