{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "askForPassword",
    "rootDefinitionId": "com.apple.screensaver_com.apple.screensaver",
    "categoryId": "8cefd936-362e-4a24-bc76-e078b6fd13fa",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.screensaver_askforpassword",
    "description": "If true, the user is prompted for a password when the screen saver is unlocked or stopped. When you use this prompt, you must also provide Ask For Password Delay. Available in macOS 10.13 and later.",
    "helpText": null,
    "name": "askForPassword",
    "displayName": "Ask For Password",
    "defaultOptionId": "com.apple.screensaver_askforpassword_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.screensaver_askforpassword_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.screensaver_com.apple.screensaver",
                    "parentSettingId": "com.apple.screensaver_com.apple.screensaver"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.screensaver_askforpassword_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.screensaver_com.apple.screensaver",
                    "parentSettingId": "com.apple.screensaver_com.apple.screensaver"
                }
            ],
            "dependedOnBy": []
        }
    ]
}