{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Carddav"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CardDAVPort",
    "rootDefinitionId": "com.apple.carddav.account_com.apple.carddav.account",
    "categoryId": "45fe783f-a80b-42d9-ab3c-8c4081be8d05",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.carddav.account_carddavport",
    "description": "The server’s port.",
    "helpText": null,
    "name": "CardDAVPort",
    "displayName": "Card DAV Port",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.carddav.account_com.apple.carddav.account",
            "parentSettingId": "com.apple.carddav.account_com.apple.carddav.account"
        }
    ],
    "dependedOnBy": []
}