{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On Kerberos"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "IGNORED",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso-kerberos_kerberos",
    "categoryId": "f35cc803-3a06-4262-b38b-a5295321f756",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_ignored_kerberos_$typepicker",
    "description": null,
    "helpText": null,
    "name": "IGNORED_Kerberos",
    "displayName": "IGNORED",
    "defaultOptionId": "com.apple.extensiblesso_ignored_kerberos_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.extensiblesso_ignored_kerberos_0",
            "description": null,
            "helpText": null,
            "name": "Array",
            "displayName": "Array",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Array"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.extensiblesso_extensiondata_domainrealmmapping_kerberos",
                    "parentSettingId": "com.apple.extensiblesso_extensiondata_domainrealmmapping_kerberos"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "com.apple.extensiblesso_extensiondata_domainrealmmapping_generickey_kerberos_string",
                    "required": true
                }
            ]
        }
    ]
}