{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "NewTabPageCompanyLogo/light_logo",
    "rootDefinitionId": "com.apple.managedclient.preferences_newtabpagecompanylogo",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_newtabpagecompanylogo_light_logo",
    "description": null,
    "helpText": null,
    "name": "NewTabPageCompanyLogo_light_logo",
    "displayName": "Light logo",
    "childIds": [
        "com.apple.managedclient.preferences_newtabpagecompanylogo_light_logo_url",
        "com.apple.managedclient.preferences_newtabpagecompanylogo_light_logo_hash"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.managedclient.preferences_newtabpagecompanylogo",
            "parentSettingId": "com.apple.managedclient.preferences_newtabpagecompanylogo"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.managedclient.preferences_newtabpagecompanylogo_light_logo_url",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.managedclient.preferences_newtabpagecompanylogo_light_logo_hash",
            "required": true
        }
    ]
}