{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Air Print",
        "AirPrint"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AirPrint/[{0}]/Port",
    "rootDefinitionId": "com.apple.airprint_com.apple.airprint",
    "categoryId": "429c4b85-a2b4-46ed-afa0-6c89c08a5544",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.airprint_airprint_item_port",
    "description": "The listening port of the AirPrint destination. Available only in iOS 11 and later.",
    "helpText": null,
    "name": "AirPrint_item_Port",
    "displayName": "Port",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 65535,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.airprint_airprint",
            "parentSettingId": "com.apple.airprint_airprint"
        }
    ],
    "dependedOnBy": []
}