{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#suppressunsupportedoswarning"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "SuppressUnsupportedOSWarning",
    "rootDefinitionId": "com.apple.managedclient.preferences_suppressunsupportedoswarning",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_suppressunsupportedoswarning",
    "description": "Suppresses the warning that appears when Microsoft Edge is running on a computer or operating system that is no longer supported.\n\nIf this policy is false or unset, the warnings will appear on such unsupported computers or operating systems.",
    "helpText": null,
    "name": "SuppressUnsupportedOSWarning",
    "displayName": "Suppress the unsupported OS warning",
    "defaultOptionId": "com.apple.managedclient.preferences_suppressunsupportedoswarning_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_suppressunsupportedoswarning_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_suppressunsupportedoswarning_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}