{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Extensions"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "NonRemovableFromUISystemExtensions",
    "rootDefinitionId": "com.apple.system-extension-policy_com.apple.system-extension-policy",
    "categoryId": "cb33668b-933f-4424-8d2d-8bdf0e61bddd",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.system-extension-policy_nonremovablefromuisystemextensions",
    "description": "A dictionary of system extensions on the computer. The dictionary maps the team identifiers (keys) to arrays of bundle identifiers, where the bundle identifier defines the system extension which cannot be disabled or uninstalled from System Settings or Finder. The set of system extensions between 'RemovableSystemExtensions' and 'NonRemovableFromUISystemExtensions' are allowed to overlap.",
    "helpText": null,
    "name": "NonRemovableFromUISystemExtensions",
    "displayName": "Non Removable From UI System Extensions",
    "childIds": [
        "com.apple.system-extension-policy_nonremovablefromuisystemextensions_generickey",
        "com.apple.system-extension-policy_nonremovablefromuisystemextensions_generickey_keytobereplaced"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.system-extension-policy_com.apple.system-extension-policy",
            "parentSettingId": "com.apple.system-extension-policy_com.apple.system-extension-policy"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.system-extension-policy_nonremovablefromuisystemextensions_generickey",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.system-extension-policy_nonremovablefromuisystemextensions_generickey_keytobereplaced",
            "required": true
        }
    ]
}