{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extensible Single Sign On (SSO)"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "PlatformSSO/OfflineGracePeriod",
    "rootDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
    "categoryId": "7b6ddf4e-7136-4fde-adbf-38e6bdfcc962",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.extensiblesso_platformsso_offlinegraceperiod",
    "description": "The amount of time after the last successful Platform SSO login a local account password can be used offline. Required when 'AllowOfflineGracePeriod' is set.",
    "helpText": null,
    "name": "PlatformSSO_OfflineGracePeriod",
    "displayName": "Offline Grace Period",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.extensiblesso_platformsso",
            "parentSettingId": "com.apple.extensiblesso_platformsso"
        }
    ],
    "dependedOnBy": []
}