{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Password",
        "Passcode",
        "Password Length",
        "Device password"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "/com.android.deviceRestrictionPolicy/",
    "offsetUri": "/passwordMinimumLength/",
    "rootDefinitionId": "com.android.devicerestrictionpolicy.passwordrequiredtype",
    "categoryId": "f350f9a2-3a91-4d6d-90ed-7e3849b0d5f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.android.devicerestrictionpolicy.passwordminimumlength",
    "description": "Enter the minimum number of digits or characters the password must have, between 4 and 16 characters. Available for fully managed, dedicated and corporate-owned work profile devices (at work profile level).",
    "helpText": "Enter a number (4-16)",
    "name": "PasswordMinimumLength",
    "displayName": "Minimum password length",
    "applicability": {
        "description": null,
        "platform": "androidEnterprise",
        "deviceMode": "none",
        "technologies": "android"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 16,
        "minimumValue": 4
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 4
    },
    "dependentOn": [
        {
            "dependentOn": "com.android.devicerestrictionpolicy.passwordrequiredtype_numeric",
            "parentSettingId": "com.android.devicerestrictionpolicy.passwordrequiredtype"
        },
        {
            "dependentOn": "com.android.devicerestrictionpolicy.passwordrequiredtype_numericcomplex",
            "parentSettingId": "com.android.devicerestrictionpolicy.passwordrequiredtype"
        },
        {
            "dependentOn": "com.android.devicerestrictionpolicy.passwordrequiredtype_alphabetic",
            "parentSettingId": "com.android.devicerestrictionpolicy.passwordrequiredtype"
        },
        {
            "dependentOn": "com.android.devicerestrictionpolicy.passwordrequiredtype_alphanumeric",
            "parentSettingId": "com.android.devicerestrictionpolicy.passwordrequiredtype"
        },
        {
            "dependentOn": "com.android.devicerestrictionpolicy.passwordrequiredtype_alphanumericwithsymbols",
            "parentSettingId": "com.android.devicerestrictionpolicy.passwordrequiredtype"
        }
    ],
    "dependedOnBy": []
}