{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "customRegex",
    "rootDefinitionId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "categoryId": "d68abc4d-559a-4339-be48-c41a77a87034",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mobiledevice.passwordpolicy_customregex",
    "description": "Specifies a regular expression, and its description, used to enforce password compliance. Use the simpler passcode restrictions whenever possible, and rely on regular expression matching only when necessary. Mistakes in regular expressions can lead to frustrating user experiences, such as unsatisfiable passcode policies, or policy descriptions that don't match the enforced policy.\n\nAvailable in macOS 14 and later.",
    "helpText": null,
    "name": "customRegex",
    "displayName": "Custom Regex",
    "childIds": [
        "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentregex",
        "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentdescription"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
            "parentSettingId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentregex",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.mobiledevice.passwordpolicy_customregex_passwordcontentdescription",
            "required": false
        }
    ]
}