{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Energy Saver"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.EnergySaver.desktop.Schedule/RepeatingPowerOn",
    "rootDefinitionId": "com.apple.mcx_com.apple.mcx-energysaver",
    "categoryId": "8c75a12d-664d-43ba-a3aa-5259425f9b37",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "id": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweron",
    "description": "The schedule for powering the device on. ",
    "helpText": null,
    "name": "com.apple.EnergySaver.desktop.Schedule_RepeatingPowerOn",
    "displayName": "Repeating Power On",
    "childIds": [
        "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweron_eventtype",
        "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweron_weekdays",
        "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweron_time"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.mcx_com.apple.energysaver.desktop.schedule",
            "parentSettingId": "com.apple.mcx_com.apple.energysaver.desktop.schedule"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweron_eventtype",
            "required": true
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweron_weekdays",
            "required": false
        },
        {
            "dependedOnBy": "com.apple.mcx_com.apple.energysaver.desktop.schedule_repeatingpoweron_time",
            "required": false
        }
    ]
}