{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.InternetExplorerIntegrationLevel",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.internetexplorerintegrationlevel",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.internetexplorerintegrationlevel",
    "description": "For guidance about configuring the optimal experience for Internet Explorer mode see <a href=\"https://go.microsoft.com/fwlink/?linkid=2094210\">https://go.microsoft.com/fwlink/?linkid=2094210</a>\n\nPolicy options mapping:\n\n* None (0) = None\n\n* IEMode (1) = Internet Explorer mode\n\n* NeedIE (2) = Internet Explorer 11\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "InternetExplorerIntegrationLevel",
    "displayName": "Configure Internet Explorer integration",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.internetexplorerintegrationlevel_none",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.internetexplorerintegrationlevel_iemode",
            "description": null,
            "helpText": null,
            "name": "Internet Explorer mode",
            "displayName": "Internet Explorer mode",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.internetexplorerintegrationlevel_needie",
            "description": null,
            "helpText": null,
            "name": "Internet Explorer 11",
            "displayName": "Internet Explorer 11",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}