{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Cloud delivered protection preferences"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences?view=o365-worldwide#configure-cloud-block-level"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.wdav/Forced/[0]/mcx_preference_settings/cloudService",
    "offsetUri": "cloudBlockLevel",
    "rootDefinitionId": "com.apple.managedclient.preferences_cloudblocklevel",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_cloudblocklevel",
    "description": "Determines how aggressive Defender for Endpoint will be in blocking and scanning suspicious files.",
    "helpText": null,
    "name": "cloudBlockLevel",
    "displayName": "Cloud Block Level",
    "defaultOptionId": "com.apple.managedclient.preferences_cloudblocklevel_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_cloudblocklevel_0",
            "description": null,
            "helpText": null,
            "name": "normal",
            "displayName": "normal",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "normal"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_cloudblocklevel_1",
            "description": null,
            "helpText": null,
            "name": "moderate",
            "displayName": "moderate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "moderate"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_cloudblocklevel_2",
            "description": null,
            "helpText": null,
            "name": "high",
            "displayName": "high",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "high"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_cloudblocklevel_3",
            "description": null,
            "helpText": null,
            "name": "high_plus",
            "displayName": "high_plus",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "high_plus"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_cloudblocklevel_4",
            "description": null,
            "helpText": null,
            "name": "zero_tolerance",
            "displayName": "zero_tolerance",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zero_tolerance"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}