{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Edge",
        "Microsoft Edge Apple"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/deployedge/microsoft-edge-policies#linkedaccountenabled"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/com.microsoft.Edge/Forced/[0]/mcx_preference_settings",
    "offsetUri": "LinkedAccountEnabled",
    "rootDefinitionId": "com.apple.managedclient.preferences_linkedaccountenabled",
    "categoryId": "9d14bbed-327d-4c38-ac02-6b916909bdd9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.managedclient.preferences_linkedaccountenabled",
    "description": "Microsoft Edge guides a user to the account management page where they can link a Microsoft Account (MSA) to an Azure Active Directory (Azure AD) account.\n\nIf you enable or don't configure this policy, linked account information will be shown on a flyout. When the Azure AD profile doesn't have a linked account it will show \"Add account\".\n\nIf you disable this policy, linked accounts will be turned off and no extra information will be shown.",
    "helpText": null,
    "name": "LinkedAccountEnabled",
    "displayName": "Enable the linked account feature",
    "defaultOptionId": "com.apple.managedclient.preferences_linkedaccountenabled_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.managedclient.preferences_linkedaccountenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.managedclient.preferences_linkedaccountenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}