{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Directory Service"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ADMountStyle",
    "rootDefinitionId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
    "categoryId": "5995d2ad-5ec7-49d2-ada2-d9c2b57746ba",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.directoryservice.managed_admountstyle",
    "description": "The network home protocol to use: afp or smb.",
    "helpText": null,
    "name": "ADMountStyle",
    "displayName": "AD Mount Style",
    "defaultOptionId": "com.apple.directoryservice.managed_admountstyle_0",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.directoryservice.managed_admountstyle_0",
            "description": null,
            "helpText": null,
            "name": "afp",
            "displayName": "afp",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "afp"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
                    "parentSettingId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.directoryservice.managed_admountstyle_1",
            "description": null,
            "helpText": null,
            "name": "smb",
            "displayName": "smb",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "smb"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.directoryservice.managed_com.apple.directoryservice.managed",
                    "parentSettingId": "com.apple.directoryservice.managed_com.apple.directoryservice.managed"
                }
            ],
            "dependedOnBy": []
        }
    ]
}