{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "allowSimple",
    "rootDefinitionId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
    "categoryId": "d68abc4d-559a-4339-be48-c41a77a87034",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.mobiledevice.passwordpolicy_allowsimple",
    "description": "If true, allows a simple passcode. A simple passcode contains repeated characters, or increasing or decreasing characters (such as 123 or CBA). Setting this value to false has the same result as setting Min Complex Characters to 1.",
    "helpText": null,
    "name": "allowSimple",
    "displayName": "Allow Simple Passcode",
    "defaultOptionId": "com.apple.mobiledevice.passwordpolicy_allowsimple_true",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.mobiledevice.passwordpolicy_allowsimple_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
                    "parentSettingId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.mobiledevice.passwordpolicy_allowsimple_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy",
                    "parentSettingId": "com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy"
                }
            ],
            "dependedOnBy": []
        }
    ]
}