{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "System Logging"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "System",
    "rootDefinitionId": "com.apple.system.logging_com.apple.system.logging",
    "categoryId": "0d4d90ab-7ad8-4524-ade0-bc01aa7b71a3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.system.logging_system",
    "description": "This dictionary has one key, Enable Private Data. Setting that value to true enables private data logging for the entire system.",
    "helpText": null,
    "name": "System",
    "displayName": "System",
    "childIds": [
        "com.apple.system.logging_system_enable-private-data"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "com.apple.system.logging_com.apple.system.logging",
            "parentSettingId": "com.apple.system.logging_com.apple.system.logging"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "com.apple.system.logging_system_enable-private-data",
            "required": false
        }
    ]
}