{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Uncategorized"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.ImportOnEachLaunch",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.importoneachlaunch",
    "categoryId": "ce3ba7d1-c101-4ab6-bf2a-0c683e921bf8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.importoneachlaunch",
    "description": "If you enable this policy, users will see a prompt to import their browsing data from other browsers on each Microsoft Edge launch.\n\nIf you disable this policy, users will never see a prompt to import their browsing data from other browsers on each Microsoft Edge launch.\n\nIf the policy is left unconfigured, users can activate this feature from a Microsoft Edge prompt or from the Settings page.\n\nNote: A similar policy named \"AutoImportAtFirstRun\" exists. This policy should be used if you want to import supported data from other browsers only once while setting up your device.",
    "helpText": null,
    "name": "ImportOnEachLaunch",
    "displayName": "Allow import of data from other browsers on each Microsoft Edge launch",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.importoneachlaunch_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.importoneachlaunch_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}