{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Content settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.microsoft.edge.DefaultAutomaticDownloadsSetting",
    "rootDefinitionId": "com.microsoft.edge.mamedgeappconfigsettings.defaultautomaticdownloadssetting",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog",
    "riskLevel": "low",
    "id": "com.microsoft.edge.mamedgeappconfigsettings.defaultautomaticdownloadssetting",
    "description": "Administrators can use this policy to control whether websites can perform multiple downloads successively. Individual site behavior can be managed using the AutomaticDownloadsAllowedForUrls and AutomaticDownloadsBlockedForUrls policies.\n\nDefault behavior:\n\n- A user gesture is required for each additional download.\n\n- Users can modify their browser settings to disable successive downloads.\n\nPolicy options mapping:\n\n* AllowAutomaticDownloads (1) = Allow all websites to perform multiple downloads without requiring a user gesture between each download.\n\n* BlockAutomaticDownloads (2) = Prevent all websites from performing multiple downloads, even after a user gesture.\n\nUse the preceding information when configuring this policy.",
    "helpText": null,
    "name": "DefaultAutomaticDownloadsSetting",
    "displayName": "Default automatic downloads setting",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationApplicationSettingApplicability",
        "description": null,
        "platform": "macOS,windows10",
        "deviceMode": "none",
        "technologies": "mobileApplicationManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultautomaticdownloadssetting_allowautomaticdownloads",
            "description": null,
            "helpText": null,
            "name": "Allow all websites to perform multiple downloads without requiring a user gesture between each download.",
            "displayName": "Allow all websites to perform multiple downloads without requiring a user gesture between each download.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "com.microsoft.edge.mamedgeappconfigsettings.defaultautomaticdownloadssetting_blockautomaticdownloads",
            "description": null,
            "helpText": null,
            "name": "Prevent all websites from performing multiple downloads, even after a user gesture.",
            "displayName": "Prevent all websites from performing multiple downloads, even after a user gesture.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}