{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Screensaver User"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "idleTime",
    "rootDefinitionId": "com.apple.screensaver.user_com.apple.screensaver.user",
    "categoryId": "11c4cf0f-a03d-4309-93b2-011be4c410d5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.screensaver.user_idletime",
    "description": "The number of seconds of inactivity before the screen saver activates (0 = Never activate).",
    "helpText": null,
    "name": "idleTime",
    "displayName": "Idle Time",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "com.apple.screensaver.user_com.apple.screensaver.user",
            "parentSettingId": "com.apple.screensaver.user_com.apple.screensaver.user"
        }
    ],
    "dependedOnBy": []
}