{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Login Items"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutoLaunchedApplicationDictionary-managed/[{0}]/Hide",
    "rootDefinitionId": "com.apple.loginitems.managed_com.apple.loginitems.managed",
    "categoryId": "6efb8802-223a-46a7-b13f-a68f28f8b2c2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_hide",
    "description": "If true, hide this item in the Users & Groups login items list.",
    "helpText": null,
    "name": "AutoLaunchedApplicationDictionary-managed_item_Hide",
    "displayName": "Hide",
    "defaultOptionId": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_hide_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_hide_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed",
                    "parentSettingId": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed_item_hide_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed",
                    "parentSettingId": "com.apple.loginitems.managed_autolaunchedapplicationdictionary-managed"
                }
            ],
            "dependedOnBy": []
        }
    ]
}