{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Remote Desktop"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RemoteDesktop",
    "rootDefinitionId": "command_remotedesktop",
    "categoryId": "c14c2e8b-0081-46e0-89ac-48ade3b83408",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "command_remotedesktop",
    "description": "",
    "helpText": null,
    "name": "Remote Desktop",
    "displayName": "Remote Desktop",
    "childIds": [
        "command_remotedesktop_remotedesktop"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "command_remotedesktop_remotedesktop",
            "required": false
        }
    ]
}