{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Remote Desktop"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "EnableRemoteDesktop",
    "rootDefinitionId": "command_remotedesktop",
    "categoryId": "c14c2e8b-0081-46e0-89ac-48ade3b83408",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "command_remotedesktop_remotedesktop",
    "description": "Enable/Disable Remote Desktop on the device",
    "helpText": null,
    "name": "Remote Desktop",
    "displayName": "Remote Desktop",
    "defaultOptionId": "command_remotedesktop_remotedesktop_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "command_remotedesktop_remotedesktop_true",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "Enable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "command_remotedesktop",
                    "parentSettingId": "command_remotedesktop"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "command_remotedesktop_remotedesktop_false",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "Disable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "command_remotedesktop",
                    "parentSettingId": "command_remotedesktop"
                }
            ],
            "dependedOnBy": []
        }
    ]
}