{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Enforce Latest"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "DDM-LatestSoftwareUpdate",
    "offsetUri": "DDM-LatestSoftwareUpdate",
    "rootDefinitionId": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate",
    "categoryId": "15be55d8-7477-4274-9b09-b775bce68416",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "DDM-LatestSoftwareUpdate",
    "displayName": "Top Level Setting Group Collection",
    "childIds": [
        "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion",
        "ddm-latestsoftwareupdate_delayindays",
        "ddm-latestsoftwareupdate_installtime"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion",
            "required": true
        },
        {
            "dependedOnBy": "ddm-latestsoftwareupdate_delayindays",
            "required": false
        },
        {
            "dependedOnBy": "ddm-latestsoftwareupdate_installtime",
            "required": false
        }
    ]
}