{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Web Sign In For Primary User",
        "Federated Authentication"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-FederatedAuthentication#federatedauthentication-enablewebsigninforprimaryuser"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FederatedAuthentication/EnableWebSignInForPrimaryUser",
    "rootDefinitionId": "device_vendor_msft_policy_config_federatedauthentication_enablewebsigninforprimaryuser",
    "categoryId": "e3a7d1a6-ab02-4c88-86d9-0b541c033d13",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_federatedauthentication_enablewebsigninforprimaryuser",
    "description": "Specifies whether web-based sign-in is enabled with the Primary User experience",
    "helpText": "",
    "name": "EnableWebSignInForPrimaryUser",
    "displayName": "Enable Web Sign In For Primary User",
    "defaultOptionId": "device_vendor_msft_policy_config_federatedauthentication_enablewebsigninforprimaryuser_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_federatedauthentication_enablewebsigninforprimaryuser_0",
            "description": "Feature defaults as appropriate for edition and device capabilities. As of now, all editions/devices exhibit Disabled behavior by default. However, this may change for future editions/devices.",
            "helpText": null,
            "name": "Feature defaults as appropriate for edition and device capabilities. As of now, all editions/devices exhibit Disabled behavior by default. However, this may change for future editions/devices.",
            "displayName": "Feature defaults as appropriate for edition and device capabilities. As of now, all editions/devices exhibit Disabled behavior by default. However, this may change for future editions/devices.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_federatedauthentication_enablewebsigninforprimaryuser_1",
            "description": "Enabled. Web Sign-in Credential Provider will be enabled for device sign-in.",
            "helpText": null,
            "name": "Enabled. Web Sign-in Credential Provider will be enabled for device sign-in.",
            "displayName": "Enabled. Web Sign-in Credential Provider will be enabled for device sign-in.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_federatedauthentication_enablewebsigninforprimaryuser_2",
            "description": "Disabled. Web Sign-in Credential Provider will be not be enabled for device sign-in.",
            "helpText": null,
            "name": "Disabled. Web Sign-in Credential Provider will be not be enabled for device sign-in.",
            "displayName": "Disabled. Web Sign-in Credential Provider will be not be enabled for device sign-in.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}