{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_UpdatePolicyMicrosoftEdgeCanary",
        "Update policy override",
        "\\Microsoft Edge Update\\Applications\\Microsoft Edge Canary",
        "Microsoft Edge Update\\Applications\\Microsoft Edge Canary",
        "Microsoft Edge Canary"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/update~Policy~Cat_Google~Cat_GoogleUpdate~Cat_Applications~Cat_MicrosoftEdgeCanary/Pol_UpdatePolicyMicrosoftEdgeCanary",
    "rootDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary",
    "categoryId": "797ac384-f48e-4567-b931-33a6ce923b94",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_part_updatepolicy",
    "description": "",
    "helpText": "",
    "name": "Part_UpdatePolicy",
    "displayName": "Policy (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_part_updatepolicy_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_part_updatepolicy_1",
            "description": null,
            "helpText": null,
            "name": "Always allow updates (recommended)",
            "displayName": "Always allow updates (recommended)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_part_updatepolicy_2",
            "description": null,
            "helpText": null,
            "name": "Manual updates only",
            "displayName": "Manual updates only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_part_updatepolicy_3",
            "description": null,
            "helpText": null,
            "name": "Automatic silent updates only",
            "displayName": "Automatic silent updates only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_part_updatepolicy_0",
            "description": null,
            "helpText": null,
            "name": "Updates disabled",
            "displayName": "Updates disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedgecanary_pol_updatepolicymicrosoftedgecanary"
                }
            ],
            "dependedOnBy": []
        }
    ]
}