{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OrgIdEDUEnabledCentennial",
        "Enable EDU Org ID Sign In in Office from Windows Store",
        "\\Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Licensing Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_LicensingSettings/L_OrgIdEDUEnabledCentennial",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_licensingsettings_l_orgideduenabledcentennial",
    "categoryId": "2e3f0407-6387-41b4-b6c2-ada4354be759",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_licensingsettings_l_orgideduenabledcentennial",
    "description": "This policy setting controls whether Office product is activated with the student’s email account. By default, Org Id sign in is not allowed.\r\n\r\nIf you enable this policy setting, student’s email Id sign in will be used to activate the version of Office installed on the computer.\r\n\r\nIf you disable this policy setting, student’s email Id sign in won’t be used to activate the version of Office installed on the computer.\r\n\r\nEnabling or disabling this policy setting takes precedence over any setting that’s been configured by using the Office Deployment Tool or by manually editing the registry.\r\n\r\nIf you don’t configure this policy setting, student’s email Id sign in won’t be used to activate the version of Office installed on the computer unless you’ve enabled Org ID to sign in by manually editing the registry.\r\n      ",
    "helpText": "",
    "name": "L_OrgIdEDUEnabledCentennial",
    "displayName": "Enable EDU Org ID Sign In in Office from Windows Store",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_licensingsettings_l_orgideduenabledcentennial_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_licensingsettings_l_orgideduenabledcentennial_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_licensingsettings_l_orgideduenabledcentennial_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}