{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_GraphicsFilterImport",
        "Graphics filter import",
        "\\Microsoft Office 2016 (Machine)\\Security Settings",
        "Microsoft Office 2016 (Machine)\\Security Settings",
        "Security Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_SecuritySettingsMachine/L_GraphicsFilterImport",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_securitysettingsmachine_l_graphicsfilterimport",
    "categoryId": "f0190b73-0d5c-410e-bce1-e03aa1f62ed4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_securitysettingsmachine_l_graphicsfilterimport",
    "description": "This policy setting allows you to specify a list of graphic filters that 2016 Office applications load. \r\n\r\nIf you enable this policy setting, you can specify a list of graphic filters that 2016 Office applications load. The graphic filters you specify must be assigned a string value FILTER.FLT (where FILTER.FLT is replaced with the name of a real filter), the value of which is XX.YY.ZZ.WW, where XX, YY, ZZ, and WW are each positive numbers less than 2^16, where the version in the registry is less than or equal to the version of the filter.  For example: ''myfilter.flt''=''2006.1200.1000.1000''\r\n\r\nIf you disable or do not configure this policy setting, 2016 Office applications does not restrict any graphics filters from loading.\r\n",
    "helpText": "",
    "name": "L_GraphicsFilterImport",
    "displayName": "Graphics filter import",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_securitysettingsmachine_l_graphicsfilterimport_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_securitysettingsmachine_l_graphicsfilterimport_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_securitysettingsmachine_l_graphicsfilterimport_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}