{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnterpriseProfileCreationKeepBrowsingData_recommended",
        "Keep browsing data when creating enterprise profile by default",
        "\\Google\\Google Chrome - Default Settings (users can override)",
        "Both",
        "Software\\Policies\\Google\\Chrome\\Recommended",
        "EnterpriseProfileCreationKeepBrowsingData",
        "Google Chrome - Default Settings users can override"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome_recommended/EnterpriseProfileCreationKeepBrowsingData_recommended",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended_enterpriseprofilecreationkeepbrowsingdata_recommended",
    "categoryId": "c3857f91-3df8-472f-9b5a-b10778c715c0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended_enterpriseprofilecreationkeepbrowsingdata_recommended",
    "description": "If this policy is Enabled, the option to keep any existing browsing data when creating an enterprise profile will be checked by default.\r\n\r\nIf this policy is unset or Disabled, the option to keep any existing browsing data when creating an enterprise profile will not be checked by default.\r\n\r\nRegardless of the value, the user will be able to decide whether or not to keep any existing browsing data when creating an enterprise profile.\r\n\r\nThis policy has no effect if the option to keep existing browsing data is not available; this happens if enterprise profile separation is strictly enforced, or if the data would be from an already managed profile.\r\n",
    "helpText": "",
    "name": "EnterpriseProfileCreationKeepBrowsingData_recommended",
    "displayName": "Keep browsing data when creating enterprise profile by default",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended_enterpriseprofilecreationkeepbrowsingdata_recommended_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended_enterpriseprofilecreationkeepbrowsingdata_recommended_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended_enterpriseprofilecreationkeepbrowsingdata_recommended_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}