{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "PKCS Certificate",
        "Renewal Threshold"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/mem/intune/protect/certificates-pfx-configure"
    ],
    "baseUri": "./device/vendor/msft/pkcscertificate",
    "offsetUri": "/renewalthreshold",
    "rootDefinitionId": "device_vendor_msft_pkcscertificate_renewalthreshold",
    "categoryId": "dbbe5cb3-fe2e-4d28-8918-24d075a91676",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_pkcscertificate_renewalthreshold",
    "description": "Enter the percentage (between 1 and 99 percent) of remaining certificate lifetime that is allowed before a device can request renewal of the certificate. The recommended amount in Intune is 20%. (1-99)",
    "helpText": "",
    "name": "renewalthreshold",
    "displayName": "Renewal threshold (%)",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10PKCS/policyJourneyState/0",
    "redirectMessage": "Create a PKCS certificate policy",
    "redirectReason": "The \"PKCS certificate\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}