{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MathSolverEnabled",
        "Let users snip a Math problem and get the solution with a step-by-step explanation in Microsoft Edge",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev91~Policy~microsoft_edge/MathSolverEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge_mathsolverenabled",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge_mathsolverenabled",
    "description": "This policy lets you manage whether users can use the Math Solver tool in Microsoft Edge or not.\r\n\r\nIf you enable or don't configure the policy, then a user can take a snip of the Math problem and get the solution including a step-by-step explanation of the solution in a Microsoft Edge side pane.\r\n\r\nIf you disable the policy, then the Math Solver tool will be disabled and users will not be able to use it.\r\n\r\nNote: Setting the 'ComponentUpdatesEnabled' (Enable component updates in Microsoft Edge) policy to disabled will also disable the Math Solver component.",
    "helpText": "",
    "name": "MathSolverEnabled",
    "displayName": "Let users snip a Math problem and get the solution with a step-by-step explanation in Microsoft Edge",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge_mathsolverenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge_mathsolverenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge_mathsolverenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}