{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableShellAccessCheck",
        "Enable access-denied assistance on client for all file types",
        "\\System\\Access-Denied Assistance",
        "Administrative Templates\\System\\Access-Denied Assistance",
        "Access-Denied Assistance",
        "Machine",
        "SOFTWARE\\Policies\\Microsoft\\Windows\\Explorer",
        "EnableShellExecuteFileStreamCheck"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-srmfci#admx-srmfci-enableshellaccesscheck"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_srmfci/EnableShellAccessCheck",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_srmfci_enableshellaccesscheck",
    "categoryId": "734bed4f-be52-46ef-ae60-8fd195dc8f4d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_srmfci_enableshellaccesscheck",
    "description": "This Group Policy Setting should be set on Windows clients  to enable access-denied assistance for all file types\r\n ",
    "helpText": "",
    "name": "EnableShellAccessCheck",
    "displayName": "Enable access-denied assistance on client for all file types",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_srmfci_enableshellaccesscheck_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_srmfci_enableshellaccesscheck_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_srmfci_enableshellaccesscheck_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}