{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "DS Access Audit Directory Service Replication",
        "Audit",
        "Auditing"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#dsaccess_auditdirectoryservicereplication"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Audit/DSAccess_AuditDirectoryServiceReplication",
    "rootDefinitionId": "device_vendor_msft_policy_config_audit_dsaccess_auditdirectoryservicereplication",
    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_audit_dsaccess_auditdirectoryservicereplication",
    "description": "This policy setting allows you to audit replication between two Active Directory Domain Services (AD DS) domain controllers.  If you configure this policy setting, an audit event is generated during AD DS replication. Success audits record successful replication and Failure audits record unsuccessful replication. If you do not configure this policy setting, no audit event is generated during AD DS replication.",
    "helpText": "",
    "name": "DSAccess_AuditDirectoryServiceReplication",
    "displayName": "DS Access Audit Directory Service Replication",
    "defaultOptionId": "device_vendor_msft_policy_config_audit_dsaccess_auditdirectoryservicereplication_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134.1039",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_audit_dsaccess_auditdirectoryservicereplication_0",
            "description": "Off/None",
            "helpText": null,
            "name": "Off/None",
            "displayName": "Off/ None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_audit_dsaccess_auditdirectoryservicereplication_1",
            "description": "Success",
            "helpText": null,
            "name": "Success",
            "displayName": "Success",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_audit_dsaccess_auditdirectoryservicereplication_2",
            "description": "Failure",
            "helpText": null,
            "name": "Failure",
            "displayName": "Failure",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_audit_dsaccess_auditdirectoryservicereplication_3",
            "description": "Success+Failure",
            "helpText": null,
            "name": "Success+Failure",
            "displayName": "Success+ Failure",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}