{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ACStartMenuButtonAction_2",
        "Select the Start menu Power button action (plugged in)",
        "\\System\\Power Management\\Button Settings",
        "Administrative Templates\\System\\Power Management\\Button Settings",
        "Button Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/ACStartMenuButtonAction_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2",
    "categoryId": "17f0fdd3-e292-4ecb-ab5f-e4848e9cae1a",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_selectacstartmenubuttonaction",
    "description": null,
    "helpText": "",
    "name": "SelectACStartMenuButtonAction",
    "displayName": "User Interface Sleep Button Action (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_selectacstartmenubuttonaction_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_selectacstartmenubuttonaction_0",
            "description": null,
            "helpText": null,
            "name": "Sleep",
            "displayName": "Sleep",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_selectacstartmenubuttonaction_1",
            "description": null,
            "helpText": null,
            "name": "Hibernate",
            "displayName": "Hibernate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_selectacstartmenubuttonaction_2",
            "description": null,
            "helpText": null,
            "name": "Shut down",
            "displayName": "Shut down",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_acstartmenubuttonaction_2"
                }
            ],
            "dependedOnBy": []
        }
    ]
}