{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultWindowPlacementSetting",
        "Default Window Placement permission setting",
        "\\Google\\Google Chrome\\Deprecated policies",
        "Google\\Google Chrome\\Deprecated policies",
        "Deprecated policies"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~DeprecatedPolicies/DefaultWindowPlacementSetting",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting",
    "categoryId": "5900ac65-f656-459c-bd82-1329a862544d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting_defaultwindowplacementsetting",
    "description": "",
    "helpText": "",
    "name": "DefaultWindowPlacementSetting",
    "displayName": "Default Window Placement permission setting (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting_defaultwindowplacementsetting_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting_defaultwindowplacementsetting_2",
            "description": null,
            "helpText": null,
            "name": "Denies the Window Placement permission on all sites by default",
            "displayName": "Denies the Window Placement permission on all sites by default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting_defaultwindowplacementsetting_3",
            "description": null,
            "helpText": null,
            "name": "Ask every time a site wants obtain the Window Placement permission",
            "displayName": "Ask every time a site wants obtain the Window Placement permission",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultwindowplacementsetting"
                }
            ],
            "dependedOnBy": []
        }
    ]
}