{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IZ_PolicyLogon_3",
        "Logon options",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Intranet Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Intranet Zone",
        "Intranet Zone"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/IntranetZoneLogonOptions",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions",
    "categoryId": "76f2d08c-0a3f-4f4e-ad04-51aa16aea0bf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_iz_partname1a00",
    "description": "",
    "helpText": "",
    "name": "IZ_Partname1A00",
    "displayName": "Logon options (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_iz_partname1a00_131072",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.3758",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_iz_partname1a00_196608",
            "description": null,
            "helpText": null,
            "name": "Anonymous logon",
            "displayName": "Anonymous logon",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "196608"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_iz_partname1a00_131072",
            "description": null,
            "helpText": null,
            "name": "Automatic logon only in Intranet zone",
            "displayName": "Automatic logon only in Intranet zone",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "131072"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_iz_partname1a00_0",
            "description": null,
            "helpText": null,
            "name": "Automatic logon with current username and password",
            "displayName": "Automatic logon with current username and password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_iz_partname1a00_65536",
            "description": null,
            "helpText": null,
            "name": "Prompt for user name and password",
            "displayName": "Prompt for user name and password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "65536"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions_1",
                    "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_intranetzonelogonoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}