{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Microsoft Managed Desktop Processing",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-System#system-allowmicrosoftmanageddesktopprocessing"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/System/AllowMicrosoftManagedDesktopProcessing",
    "rootDefinitionId": "device_vendor_msft_policy_config_system_allowmicrosoftmanageddesktopprocessing",
    "categoryId": "f62e0f2a-4363-4246-8057-1dc811fe4360",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_system_allowmicrosoftmanageddesktopprocessing",
    "description": "Allows diagnostic data from this device to be processed by Microsoft Managed Desktop.                                              The following list shows the supported values:                                                   0 (default)– Diagnostic data is not processed by Microsoft Managed Desktop.                                                  32 – Diagnostic data is processed by Microsoft Managed Desktop.                                              If this policy is disabled or not configured, diagnostic data from this device will not be processed by Microsoft Managed Desktop.",
    "helpText": "",
    "name": "AllowMicrosoftManagedDesktopProcessing",
    "displayName": "Allow Microsoft Managed Desktop Processing",
    "defaultOptionId": "device_vendor_msft_policy_config_system_allowmicrosoftmanageddesktopprocessing_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763.1217",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "unknown",
            "windowsCloudN"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_system_allowmicrosoftmanageddesktopprocessing_0",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_system_allowmicrosoftmanageddesktopprocessing_32",
            "description": "Allowed",
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 32
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}