{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WorkspacesNavigationSettings",
        "Configure navigation settings per groups of URLs in Microsoft Edge Workspaces",
        "\\Microsoft Edge\\Edge Workspaces settings",
        "Microsoft Edge\\Edge Workspaces settings",
        "Edge Workspaces settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev110~Policy~microsoft_edge~EdgeWorkspaces/WorkspacesNavigationSettings",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~edgeworkspaces_workspacesnavigationsettings",
    "categoryId": "ef6a4e8c-07b2-4f55-9e94-5701cb2268b1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~edgeworkspaces_workspacesnavigationsettings",
    "description": "This setting lets you to define groups of URLs, and apply specific Microsoft Edge Workspaces navigation settings to each group.\r\n\r\nIf this policy is configured, Microsoft Edge Workspaces will use the configured settings when deciding whether and how to share navigations among collaborators in a Microsoft Edge Workspace.\r\n\r\nIf this policy is not configured, Microsoft Edge Workspaces will use only default and internally configured navigation settings.\r\n\r\nFor more information about configuration options, see https://go.microsoft.com/fwlink/?linkid=2218655\r\n\r\nNote, format url_patterns according to https://go.microsoft.com/fwlink/?linkid=2095322. You can configure the url_regex_patterns in this policy to match multiple URLs using a Perl style regular expression for the pattern. Note that pattern matches are case sensitive. For more information about the regular expression rules that are used, refer to https://go.microsoft.com/fwlink/p/?linkid=2133903.\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"url_patterns\": [\r\n      \"https://contoso.com\",\r\n      \"https://www.fabrikam.com\",\r\n      \".exact.hostname.com\"\r\n    ],\r\n    \"navigation_options\": {\r\n      \"do_not_send_to\": true,\r\n      \"remove_all_query_parameters\": true\r\n    }\r\n  },\r\n  {\r\n    \"url_patterns\": [\r\n      \"https://adatum.com\"\r\n    ],\r\n    \"navigation_options\": {\r\n      \"query_parameters_to_remove\": [\r\n        \"username\",\r\n        \"login_hint\"\r\n      ]\r\n    }\r\n  },\r\n  {\r\n    \"url_regex_patterns\": [\r\n      \"\\\\Ahttps://.*?tafe\\\\..*?trs.*?\\\\.fabrikam.com/Sts\"\r\n    ],\r\n    \"navigation_options\": {\r\n      \"prefer_initial_url\": true,\r\n      \"do_not_send_from\": true\r\n    }\r\n  }\r\n]",
    "helpText": "",
    "name": "WorkspacesNavigationSettings",
    "displayName": "Configure navigation settings per groups of URLs in Microsoft Edge Workspaces",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~edgeworkspaces_workspacesnavigationsettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~edgeworkspaces_workspacesnavigationsettings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~edgeworkspaces_workspacesnavigationsettings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev110~policy~microsoft_edge~edgeworkspaces_workspacesnavigationsettings_workspacesnavigationsettings",
                    "required": true
                }
            ]
        }
    ]
}