{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EfficiencyMode_recommended",
        "Configure when efficiency mode should become active",
        "\\Microsoft Edge - Default Settings (users can override)\\Performance",
        "Microsoft Edge - Default Settings (users can override)\\Performance",
        "Performance"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev96~Policy~microsoft_edge_recommended~Performance_recommended/EfficiencyMode_recommended",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_recommended~performance_recommended_efficiencymode_recommended",
    "categoryId": "7db75ddb-f702-49f8-ae2b-991d1afd2d17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_recommended~performance_recommended_efficiencymode_recommended",
    "description": "This policy setting lets you configure when efficiency mode will become active. By default, efficiency mode is set to 'BalancedSavings'. On devices with no battery, the default is for efficiency mode to never become active.\r\n\r\nIndividual sites may be blocked from participating in efficiency mode by configuring the policy 'SleepingTabsBlockedForUrls' (Block sleeping tabs on specific sites).\r\n\r\nSet this policy to 'AlwaysActive' and efficiency mode will always be active.\r\n\r\nSet this policy to 'NeverActive' and efficiency mode will never become active.\r\n\r\nSet this policy to 'ActiveWhenUnplugged' and efficiency mode will become active when the device is unplugged.\r\n\r\nSet this policy to 'ActiveWhenUnpluggedBatteryLow' and efficiency mode will become active when the device is unplugged and the battery is low.\r\n\r\nSet this policy to 'BalancedSavings' and when the device is unplugged, efficiency mode will take moderate steps to save battery. When the device is unplugged and the battery is low, efficiency mode will take additional steps to save battery.\r\n\r\nSet this policy to 'MaximumSavings' and when the device is unplugged or unplugged and the battery is low, efficiency mode takes additional steps to save battery.\r\n\r\nIf the device does not have a battery, efficiency mode will never become active in any mode other than 'AlwaysActive' unless the setting or 'EfficiencyModeEnabled' (Efficiency mode enabled) policy is enabled.\r\n\r\nThis policy has no effect if the 'EfficiencyModeEnabled' policy is disabled.\r\n\r\nLearn more about efficiency mode: https://go.microsoft.com/fwlink/?linkid=2173921\r\n\r\nPolicy options mapping:\r\n\r\n* AlwaysActive (0) = Efficiency mode is always active\r\n\r\n* NeverActive (1) = Efficiency mode is never active\r\n\r\n* ActiveWhenUnplugged (2) = Efficiency mode is active when the device is unplugged\r\n\r\n* ActiveWhenUnpluggedBatteryLow (3) = Efficiency mode is active when the device is unplugged and the battery is low\r\n\r\n* BalancedSavings (4) = When the device is unplugged, efficiency mode takes moderate steps to save battery. When the device is unplugged and the battery is low, efficiency mode takes additional steps to save battery.\r\n\r\n* MaximumSavings (5) = When the device is unplugged or unplugged and the battery is low, efficiency mode takes additional steps to save battery.\r\n\r\nUse the preceding information when configuring this policy.",
    "helpText": "",
    "name": "EfficiencyMode_recommended",
    "displayName": "Configure when efficiency mode should become active",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_recommended~performance_recommended_efficiencymode_recommended_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_recommended~performance_recommended_efficiencymode_recommended_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_recommended~performance_recommended_efficiencymode_recommended_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_recommended~performance_recommended_efficiencymode_recommended_efficiencymode",
                    "required": true
                }
            ]
        }
    ]
}