{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CachePowerModePolicy",
        "Turn off cache power mode",
        "\\System\\Disk NV Cache",
        "Administrative Templates\\System\\Disk NV Cache",
        "Disk NV Cache"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-disknvcache#admx-disknvcache-cachepowermodepolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DiskNVCache/CachePowerModePolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_disknvcache_cachepowermodepolicy",
    "categoryId": "297f09f9-0a48-4058-81b8-66a630a3c0ea",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_disknvcache_cachepowermodepolicy",
    "description": "This policy setting turns off power save mode on the hybrid hard disks in the system.\r\n\r\nIf you enable this policy setting, the hard disks are not put into NV cache power save mode and no power savings are achieved.\r\n\r\nIf you disable this policy setting, the hard disks are put into an NV cache power saving mode. In this mode, the system tries to save power by aggressively spinning down the disk.\r\n\r\nIf you do not configure this policy setting, the default behavior is to allow the hybrid hard disks to be in power save mode.\r\n\r\nNote: This policy setting is applicable only if the NV cache feature is on.\r\n ",
    "helpText": "",
    "name": "CachePowerModePolicy",
    "displayName": "Turn off cache power mode",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_disknvcache_cachepowermodepolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_disknvcache_cachepowermodepolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_disknvcache_cachepowermodepolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}