{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BrowserLabsEnabled",
        "Browser experiments icon in toolbar",
        "\\Google\\Google Chrome",
        "Administrative Templates\\Google\\Google Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome/BrowserLabsEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserlabsenabled",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserlabsenabled",
    "description": "Setting the policy to Enabled or leaving the policy unset means that users can access browser experimental features through an icon in the toolbar\r\n\r\nSetting the policy to Disabled removes the browser experimental features icon from the toolbar.\r\n\r\nchrome://flags and any other means of turning off and on browser features will still behave as expected regardless of whether this policy is Enabled or Disabled.",
    "helpText": "",
    "name": "BrowserLabsEnabled",
    "displayName": "Browser experiments icon in toolbar",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserlabsenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserlabsenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_browserlabsenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}