{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "get",
    "keywords": [
        "e UICC",
        "e UIC Cs",
        "eSIM"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/eUICCs",
    "offsetUri": "/Default",
    "rootDefinitionId": "device_vendor_msft_euiccs_{euicc}",
    "categoryId": "3c46dc04-e649-41b9-be99-04b771303fdd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_euiccs_{euicc}",
    "description": "Represents information associated with an eUICC. There is one subtree for each known eUICC, created by the Local Profile Assistant (LPA) when the eUICC is first seen. The node name is the eUICC ID (EID). The node name \"Default\" represents the currently active eUICC.",
    "helpText": "",
    "name": "{eUICC}",
    "displayName": "eSIM",
    "childIds": [
        "device_vendor_msft_euiccs_{euicc}_policies_localuienabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_policies_localuienabled",
            "required": false
        }
    ]
}