{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ProxyServerMode",
        "Choose how to specify proxy server settings",
        "\\Google\\Google Chrome\\Deprecated policies",
        "Administrative Templates\\Google\\Google Chrome\\Deprecated policies",
        "Deprecated policies"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~DeprecatedPolicies/ProxyServerMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode",
    "categoryId": "5900ac65-f656-459c-bd82-1329a862544d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_proxyservermode",
    "description": "",
    "helpText": "",
    "name": "ProxyServerMode",
    "displayName": "Choose how to specify proxy server settings (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_proxyservermode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_proxyservermode_0",
            "description": null,
            "helpText": null,
            "name": "Never use a proxy",
            "displayName": "Never use a proxy",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_proxyservermode_1",
            "description": null,
            "helpText": null,
            "name": "Auto detect proxy settings",
            "displayName": "Auto detect proxy settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_proxyservermode_2",
            "description": null,
            "helpText": null,
            "name": "Manually specify proxy settings",
            "displayName": "Manually specify proxy settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_proxyservermode_3",
            "description": null,
            "helpText": null,
            "name": "Use system proxy settings",
            "displayName": "Use system proxy settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~deprecatedpolicies_proxyservermode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}