{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Defender",
        "DeviceControl",
        "Device Control"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/device-control-removable-storage-access-control"
    ],
    "baseUri": "./device/vendor/msft/defender",
    "offsetUri": "/configuration/devicecontrol/policyrules/{0}/ruledata",
    "rootDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policyrules_{ruleid}",
    "categoryId": "5ed18ca1-36d1-4375-bfd6-fd67801c2659",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_defender_configuration_devicecontrol_policyrules_{ruleid}_ruledata_excludedidlist",
    "description": "The group(s) that the policy will not be applied to.",
    "helpText": "",
    "name": "ExcludedIdList",
    "displayName": "Excluded Devices",
    "childIds": [
        "device_vendor_msft_defender_configuration_devicecontrol_policyrules_{ruleid}_ruledata_excludedidlist_groupid"
    ],
    "maximumCount": 100,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.3",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_defender_configuration_devicecontrol_policyrules_{ruleid}_ruledata",
            "parentSettingId": "device_vendor_msft_defender_configuration_devicecontrol_policyrules_{ruleid}_ruledata"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_defender_configuration_devicecontrol_policyrules_{ruleid}_ruledata_excludedidlist_groupid",
            "required": false
        }
    ]
}