{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultNetworkingMode",
        "Configure default networking mode",
        "\\Windows Subsystem For Linux",
        "Windows Subsystem For Linux"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/WSLv3~Policy~WSL/DefaultNetworkingMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode",
    "categoryId": "57514d69-d9b1-469a-9b54-b5e94320c2a1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_defaultnetworkingmode_dropdown",
    "description": "",
    "helpText": "",
    "name": "DefaultNetworkingMode_Dropdown",
    "displayName": "Default Networking Mode (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_defaultnetworkingmode_dropdown_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_defaultnetworkingmode_dropdown_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_defaultnetworkingmode_dropdown_1",
            "description": null,
            "helpText": null,
            "name": "NAT",
            "displayName": "NAT",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_defaultnetworkingmode_dropdown_3",
            "description": null,
            "helpText": null,
            "name": "Mirrored",
            "displayName": "Mirrored",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_defaultnetworkingmode_dropdown_4",
            "description": null,
            "helpText": null,
            "name": "VirtioProxy",
            "displayName": "VirtioProxy",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}