{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Fallback Diagnostics",
        "Mixed Reality"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-MixedReality#fallbackdiagnostics"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/MixedReality/FallbackDiagnostics",
    "rootDefinitionId": "device_vendor_msft_policy_config_mixedreality_fallbackdiagnostics",
    "categoryId": "f10138ba-123a-43bc-8031-4458ba327374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_mixedreality_fallbackdiagnostics",
    "description": "This policy setting controls, when and if diagnostic logs can be collected using specific button combination on HoloLens.",
    "helpText": "",
    "name": "FallbackDiagnostics",
    "displayName": "Fallback Diagnostics",
    "defaultOptionId": "device_vendor_msft_policy_config_mixedreality_fallbackdiagnostics_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "holographicForBusiness"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_fallbackdiagnostics_0",
            "description": "Not allowed. Diagnostic logs cannot be collected by pressing the button combination.",
            "helpText": null,
            "name": "Not allowed. Diagnostic logs cannot be collected by pressing the button combination.",
            "displayName": "Not allowed. Diagnostic logs cannot be collected by pressing the button combination.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_fallbackdiagnostics_1",
            "description": "Allowed for device owners only. Diagnostics logs can be collected by pressing the button combination only if signed-in user is considered as device owner.",
            "helpText": null,
            "name": "Allowed for device owners only. Diagnostics logs can be collected by pressing the button combination only if signed-in user is considered as device owner.",
            "displayName": "Allowed for device owners only. Diagnostics logs can be collected by pressing the button combination only if signed-in user is considered as device owner.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_fallbackdiagnostics_2",
            "description": "Allowed for all users. Diagnostic logs can be collected by pressing the button combination.",
            "helpText": null,
            "name": "Allowed for all users. Diagnostic logs can be collected by pressing the button combination.",
            "displayName": "Allowed for all users. Diagnostic logs can be collected by pressing the button combination.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}