{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcReattachInterval",
        "Reattach Interval",
        "\\FSLogix\\ODFC Containers",
        "Administrative Templates\\FSLogix\\ODFC Containers",
        "ODFC Containers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC/OdfcReattachInterval",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval",
    "categoryId": "5c645a3e-bc39-44e9-8786-4c82e0553d22",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval",
    "description": "When a VHD(x) volume is detached unexpectedly, the FSLogix system will attempt to reattach the volume. This value specifies the number of seconds to wait between retries. The default value is 10 seconds which is the same as \"Not Configured\".\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\Policies\\FSLogix\\ODFC\\ReAttachIntervalSeconds\r\nType:  DWORD\r\nValues:  Min = 1, Max = 60",
    "helpText": "",
    "name": "OdfcReattachInterval",
    "displayName": "Reattach Interval",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcreattachinterval_odfcreattachinterval",
                    "required": true
                }
            ]
        }
    ]
}