{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "Slot Selection Enabled",
        "Multi SIM"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/MultiSIM-csp/"
    ],
    "baseUri": "./Vendor/MSFT/MultiSIM",
    "offsetUri": "/{0}/Policies/SlotSelectionEnabled",
    "rootDefinitionId": "device_vendor_msft_multisim_{modemid}",
    "categoryId": "83fb8ae9-dfc0-4ff8-8a98-3a04f0edd919",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_multisim_{modemid}_policies_slotselectionenabled",
    "description": "Determines whether the user is allowed to change slots in the Cellular settings UI. Default is true.",
    "helpText": "",
    "name": "SlotSelectionEnabled",
    "displayName": "Slot Selection Enabled",
    "defaultOptionId": "device_vendor_msft_multisim_{modemid}_policies_slotselectionenabled_true",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_multisim_{modemid}_policies_slotselectionenabled_false",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_multisim_{modemid}",
                    "parentSettingId": "device_vendor_msft_multisim_{modemid}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_multisim_{modemid}_policies_slotselectionenabled_true",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_multisim_{modemid}",
                    "parentSettingId": "device_vendor_msft_multisim_{modemid}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}