{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        " Server Name",
        "e UIC Cs",
        "eSIM"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/eUICCs",
    "offsetUri": "/Default/DownloadServers/{0}",
    "rootDefinitionId": "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}",
    "categoryId": "3c46dc04-e649-41b9-be99-04b771303fdd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}",
    "description": "Node representing the discovery operation for a server name. The node name is the fully qualified domain name of the SM-DP+ server that will be used for profile discovery. Creation of this subtree triggers a discovery request.",
    "helpText": "",
    "name": "{ServerName}",
    "displayName": "Download Servers",
    "childIds": [
        "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_servername",
        "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_autoenable",
        "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_isdiscoveryserver",
        "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_maximumattempts"
    ],
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_servername",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_autoenable",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_isdiscoveryserver",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_downloadservers_{servername}_maximumattempts",
            "required": false
        }
    ]
}