{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "DO Group Id Source",
        "Delivery Optimization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-DeliveryOptimization#dogroupidsource"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeliveryOptimization/DOGroupIdSource",
    "rootDefinitionId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource",
    "categoryId": "e2ec9af6-6143-4cd8-952c-1b3e849ee0dc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource",
    "description": "Specifies the source of group ID used for peer selection.",
    "helpText": "",
    "name": "DOGroupIdSource",
    "displayName": "DO Group Id Source",
    "defaultOptionId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource_0",
            "description": "Not Set",
            "helpText": null,
            "name": "Not Set",
            "displayName": "Not Set",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource_1",
            "description": "AD site",
            "helpText": null,
            "name": "AD site",
            "displayName": "AD site",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource_2",
            "description": "Authenticated domain SID",
            "helpText": null,
            "name": "Authenticated domain SID",
            "displayName": "Authenticated domain SID",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource_3",
            "description": "DHCP Option ID",
            "helpText": null,
            "name": "DHCP Option ID",
            "displayName": "DHCP Option ID",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource_4",
            "description": "DNS Suffix",
            "helpText": null,
            "name": "DNS Suffix",
            "displayName": "DNS Suffix",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_deliveryoptimization_dogroupidsource_5",
            "description": "Entra ID Tenant ID",
            "helpText": null,
            "name": "Entra ID Tenant ID",
            "displayName": "Entra ID Tenant ID",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}