{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableWindowsBranchCache_HostedMultipleServers",
        "Configure Hosted Cache Servers",
        "\\Network\\BranchCache",
        "Administrative Templates\\Network\\BranchCache",
        "BranchCache"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PeerToPeerCaching/EnableWindowsBranchCache_HostedMultipleServers",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedmultipleservers",
    "categoryId": "1cda8821-d9e2-485e-8d78-1829593d41ca",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedmultipleservers_wbc_multipleservers_listbox",
    "description": null,
    "helpText": "",
    "name": "WBC_MultipleServers_Listbox",
    "displayName": "\r\nHosted cache servers\r\n",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedmultipleservers_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_peertopeercaching_enablewindowsbranchcache_hostedmultipleservers"
        }
    ],
    "dependedOnBy": []
}