{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "IZ_Policy_AllowScriptlets_9",
        "Allow scriptlets",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Local Machine Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Local Machine Zone",
        "Local Machine Zone"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-localmachinezoneallowscriptlets"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/LocalMachineZoneAllowScriptlets",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_localmachinezoneallowscriptlets",
    "categoryId": "80f5fb2f-e74a-4533-81aa-a92163f49e16",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_internetexplorer_localmachinezoneallowscriptlets",
    "description": "This policy setting allows you to manage whether the user can run scriptlets.\r\n\r\nIf you enable this policy setting, the user can run scriptlets.\r\n\r\nIf you disable this policy setting, the user cannot run scriptlets.\r\n\r\nIf you do not configure this policy setting, the user can enable or disable scriptlets.",
    "helpText": "",
    "name": "IZ_Policy_AllowScriptlets_9",
    "displayName": "Allow scriptlets",
    "defaultOptionId": "device_vendor_msft_policy_config_internetexplorer_localmachinezoneallowscriptlets_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_localmachinezoneallowscriptlets_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_internetexplorer_localmachinezoneallowscriptlets_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_internetexplorer_localmachinezoneallowscriptlets_iz_partname1209",
                    "required": true
                }
            ]
        }
    ]
}