{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SSLVersionMin",
        "Minimum SSL version enabled",
        "\\Google\\Google Chrome",
        "Administrative Templates\\Google\\Google Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome/SSLVersionMin",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_sslversionmin",
    "description": "",
    "helpText": "",
    "name": "SSLVersionMin",
    "displayName": "Minimum SSL version enabled (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_sslversionmin_tls1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_sslversionmin_tls1",
            "description": null,
            "helpText": null,
            "name": "TLS 1.0",
            "displayName": "TLS 1.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tls1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_sslversionmin_tls1.1",
            "description": null,
            "helpText": null,
            "name": "TLS 1.1",
            "displayName": "TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tls1.1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_sslversionmin_tls1.2",
            "description": null,
            "helpText": null,
            "name": "TLS 1.2",
            "displayName": "TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tls1.2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_sslversionmin"
                }
            ],
            "dependedOnBy": []
        }
    ]
}