{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebAuthenticationRemoteDesktopAllowedOrigins",
        "Allowed Origins for Proxied WebAuthn Requests from Remote Desktop Applications.",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/WebAuthenticationRemoteDesktopAllowedOrigins",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_webauthenticationremotedesktopallowedorigins",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_webauthenticationremotedesktopallowedorigins",
    "description": "A list of origins of remote desktop client apps that may execute WebAuthn API\r\nrequests that originate from a browsing session on a remote host.\r\n\r\nAny origin configured in this policy can make WebAuthn requests for Relying\r\nParty IDs (RP IDs) that it would normally not allowed to be able to claim.\r\n\r\nOnly valid HTTPS origins are allowed. Wildcards are not supported.\r\nAny invalid entries are ignored.\r\n\r\nExample value:\r\n\r\nhttps://remotedesktop.google.com\r\nhttps://vdi.corp.example\r\nhttps://server:8080/",
    "helpText": "",
    "name": "WebAuthenticationRemoteDesktopAllowedOrigins",
    "displayName": "Allowed Origins for Proxied WebAuthn Requests from Remote Desktop Applications.",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_webauthenticationremotedesktopallowedorigins_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_webauthenticationremotedesktopallowedorigins_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_webauthenticationremotedesktopallowedorigins_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_webauthenticationremotedesktopallowedorigins_webauthenticationremotedesktopallowedoriginsdesc",
                    "required": true
                }
            ]
        }
    ]
}