{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CbacAndArmor",
        "KDC support for claims, compound authentication and Kerberos armoring",
        "\\System\\KDC",
        "Administrative Templates\\System\\KDC",
        "KDC"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_kdc/CbacAndArmor",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor",
    "categoryId": "bc4f0cce-a5cc-44c9-9e50-b504e09e7eb1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_cbacandarmor_levels",
    "description": null,
    "helpText": "",
    "name": "CbacAndArmor_Levels",
    "displayName": "Claims, compound authentication for Dynamic Access Control and Kerberos armoring options: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_cbacandarmor_levels_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_cbacandarmor_levels_0",
            "description": null,
            "helpText": null,
            "name": "Not supported",
            "displayName": "Not supported",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_cbacandarmor_levels_1",
            "description": null,
            "helpText": null,
            "name": "Supported",
            "displayName": "Supported",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_cbacandarmor_levels_2",
            "description": null,
            "helpText": null,
            "name": "Always provide claims",
            "displayName": "Always provide claims",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_cbacandarmor_levels_3",
            "description": null,
            "helpText": null,
            "name": "Fail unarmored authentication requests",
            "displayName": "Fail unarmored authentication requests",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor"
                }
            ],
            "dependedOnBy": []
        }
    ]
}