{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableNewAccountDetection",
        "Disable a toast and activity center message to encourage a user to sign in OneDrive using an existing credential that is made available to Microsoft applications",
        "\\OneDrive",
        "OneDrive"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv7~Policy~OneDriveNGSC/DisableNewAccountDetection",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv7~policy~onedrivengsc_disablenewaccountdetection",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_onedrivengscv7~policy~onedrivengsc_disablenewaccountdetection",
    "description": "If admins enable this setting (value 1), the user won't see the toast and the activity center message about new accounts that can be used to sign-in with OneDrive.\r\n\r\nIf admins disable (value 0) or do not configure this setting, the user will see the toast and the activity center message when OneDrive detects a new account on the device.\r\n      ",
    "helpText": "",
    "name": "DisableNewAccountDetection",
    "displayName": "Disable a toast and activity center message to encourage a user to sign in OneDrive using an existing credential that is made available to Microsoft applications",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv7~policy~onedrivengsc_disablenewaccountdetection_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv7~policy~onedrivengsc_disablenewaccountdetection_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv7~policy~onedrivengsc_disablenewaccountdetection_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}