{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PruneDownlevel",
        "Prune printers that are not automatically republished",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing2/PruneDownlevel",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_prunedownleveltitle",
    "description": null,
    "helpText": "",
    "name": "PruneDownlevelTitle",
    "displayName": "Prune non-republishing printers: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_prunedownleveltitle_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_prunedownleveltitle_0",
            "description": null,
            "helpText": null,
            "name": "Never",
            "displayName": "Never",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_prunedownleveltitle_1",
            "description": null,
            "helpText": null,
            "name": "Only if Print Server is found",
            "displayName": "Only if Print Server is found",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_prunedownleveltitle_2",
            "description": null,
            "helpText": null,
            "name": "Whenever printer is not found",
            "displayName": "Whenever printer is not found",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_printing2_prunedownlevel"
                }
            ],
            "dependedOnBy": []
        }
    ]
}