{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AuthSchemes",
        "Supported authentication schemes",
        "\\Google\\Google Chrome\\HTTP authentication",
        "Administrative Templates\\Google\\Google Chrome\\HTTP authentication",
        "HTTP authentication",
        "Both",
        "Software\\Policies\\Google\\Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~HTTPAuthentication/AuthSchemes",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes",
    "categoryId": "93ed2300-658d-40f3-8211-9295a240579c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes",
    "description": "Setting the policy specifies which HTTP authentication schemes Google Chrome supports.\r\n\r\nLeaving the policy unset employs all 4 schemes.\r\n\r\nValid values:\r\n\r\n* basic\r\n\r\n* digest\r\n\r\n* ntlm\r\n\r\n* negotiate\r\n\r\nNote: Separate multiple values with commas.\r\n\r\nExample value: basic,digest,ntlm,negotiate",
    "helpText": "",
    "name": "AuthSchemes",
    "displayName": "Supported authentication schemes",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~httpauthentication_authschemes_authschemes",
                    "required": true
                }
            ]
        }
    ]
}