{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Application Control",
        "App Control for Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/security/threat-protection/windows-defender-application-control/select-types-of-rules-to-create"
    ],
    "baseUri": "./Vendor/MSFT/ApplicationControl/Policies",
    "offsetUri": "/{0}/Policy",
    "rootDefinitionId": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions",
    "categoryId": "56b82fc9-c632-4c76-bb4f-dcf8757f003e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps",
    "description": "By default, any devices targeted with this App Control for Business policy will have the setting to Trust Windows components and Store apps enabled, in either audit or enforce mode based on your selection./nFurther, you can optionally add some additional rules to your policy, such as selecting Trust apps with good reputation to allow reputable apps as defined by the Microsoft Intelligent Security Graph to run./nSelect Trust apps from managed installers to allow apps deployed via authorized sources of application deployment (managed installers). The Intune management extension will be considered a managed installer if it has been set as such within your organization. Any apps not marked as coming from a managed installer will not be allowed to run./nAll other apps and files not specified by the rules in this App Control for Business policy will be audited only in local client logs (if Audit only is selected), or blocked (if Enforce is selected) from running on devices.",
    "helpText": "",
    "name": "ConfigureApplicationControlSelectAdditionalRulesForTrustingApps",
    "displayName": "Select additional rules for trusting apps",
    "defaultOptionId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps_0",
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps_0",
            "description": "Trust app with good reputation",
            "helpText": null,
            "name": "Trust apps with good reputation",
            "displayName": "Trust apps with good reputation",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_trust_apps_1",
            "description": "Trust apps from managed installers",
            "helpText": null,
            "name": "Trust apps from managed installers",
            "displayName": "Trust apps from managed installers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls"
                }
            ],
            "dependedOnBy": []
        }
    ]
}