{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "HSS_HeadlinesPolicy",
        "Turn off Help and Support Center \"Did you know?\" content",
        "\\System\\Internet Communication Management\\Internet Communication settings",
        "Administrative Templates\\System\\Internet Communication Management\\Internet Communication settings",
        "Internet Communication settings",
        "Machine",
        "Software\\Policies\\Microsoft\\PCHealth\\HelpSvc",
        "Headlines"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-icm#admx-icm-hss-headlinespolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ICM/HSS_HeadlinesPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_icm_hss_headlinespolicy",
    "categoryId": "72dfdba4-e7bb-4f09-862c-e003ea763452",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_icm_hss_headlinespolicy",
    "description": "This policy setting specifies whether to show the \"Did you know?\" section of Help and Support Center.\r\n\r\nThis content is dynamically updated when users who are connected to the Internet open Help and Support Center, and provides up-to-date information about Windows and the computer.\r\n\r\nIf you enable this policy setting, the Help and Support Center no longer retrieves nor displays \"Did you know?\" content.\r\n\r\nIf you disable or do not configure this policy setting, the Help and Support Center retrieves and displays \"Did you know?\" content.\r\n\r\nYou might want to enable this policy setting for users who do not have Internet access, because the content in the \"Did you know?\" section will remain static indefinitely without an Internet connection.\r\n ",
    "helpText": "",
    "name": "HSS_HeadlinesPolicy",
    "displayName": "Turn off Help and Support Center \"Did you know?\" content",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_icm_hss_headlinespolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_icm_hss_headlinespolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_icm_hss_headlinespolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}