{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ScreenCaptureAllowed",
        "Allow or deny screen capture",
        "\\Google\\Google Chrome\\Allow or deny screen capture",
        "Administrative Templates\\Google\\Google Chrome\\Allow or deny screen capture"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~ScreenCapture/ScreenCaptureAllowed",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~screencapture_screencaptureallowed",
    "categoryId": "4aa852ab-6269-4883-906f-0a0944fa1261",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~screencapture_screencaptureallowed",
    "description": "If enabled or not configured (default), a Web page can use\r\nscreen-share APIs (e.g., getDisplayMedia() or the Desktop Capture extension API)\r\nto prompt the user to select a tab, window or desktop to capture.\r\n\r\nWhen this policy is disabled, any calls to screen-share APIs will fail\r\nwith an error; however this policy is not considered (and a site will be\r\nallowed to use screen-share APIs) if the site matches an origin pattern in\r\nany of the following policies:\r\nScreenCaptureAllowedByOrigins,\r\nWindowCaptureAllowedByOrigins,\r\nTabCaptureAllowedByOrigins,\r\nSameOriginTabCaptureAllowedByOrigins.\r\n",
    "helpText": "",
    "name": "ScreenCaptureAllowed",
    "displayName": "Allow or deny screen capture",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~screencapture_screencaptureallowed_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~screencapture_screencaptureallowed_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~screencapture_screencaptureallowed_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}