{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,get,replace",
    "keywords": [
        "Is Enabled",
        "e UIC Cs",
        "eSIM"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/eUICCs-csp/"
    ],
    "baseUri": "./Vendor/MSFT/eUICCs",
    "offsetUri": "/Default/Profiles/{0}/IsEnabled",
    "rootDefinitionId": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}",
    "categoryId": "3c46dc04-e649-41b9-be99-04b771303fdd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_isenabled",
    "description": "Indicates whether this eSIM profile is enabled. Can be set by both the MDM and the CSP.",
    "helpText": "",
    "name": "IsEnabled",
    "displayName": "Is Enabled",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_isenabled_false",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}",
                    "parentSettingId": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_isenabled_true",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}",
                    "parentSettingId": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}