{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WdiScenarioExecutionPolicy",
        "Configure Scenario Execution Level",
        "\\System\\Troubleshooting and Diagnostics\\Windows Memory Leak Diagnosis",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\Windows Memory Leak Diagnosis",
        "Windows Memory Leak Diagnosis"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-leakdiagnostic#admx-leakdiagnostic-wdiscenarioexecutionpolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LeakDiagnostic/WdiScenarioExecutionPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_leakdiagnostic_wdiscenarioexecutionpolicy",
    "categoryId": "8eb61398-1074-4fa0-8bd4-04d751a9ccad",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_leakdiagnostic_wdiscenarioexecutionpolicy",
    "description": "This policy setting determines whether Diagnostic Policy Service (DPS) diagnoses memory leak problems.\r\n\r\nIf you enable or do not configure this policy setting, the DPS enables Windows Memory Leak Diagnosis by default.\r\n\r\nIf you disable this policy setting, the DPS is not able to diagnose memory leak problems.\r\n\r\nThis policy setting takes effect only under the following conditions: \r\n-- If the diagnostics-wide scenario execution policy is not configured. \r\n-- When the Diagnostic Policy Service is in the running state. When the service is stopped or disabled, diagnostic scenarios are not executed.\r\n\r\nNote: The DPS can be configured with the Services snap-in to the Microsoft Management Console.\r\n\r\nNo operating system restart or service restart is required for this policy to take effect. Changes take effect immediately.\r\n ",
    "helpText": "",
    "name": "WdiScenarioExecutionPolicy",
    "displayName": "Configure Scenario Execution Level",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_leakdiagnostic_wdiscenarioexecutionpolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_leakdiagnostic_wdiscenarioexecutionpolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_leakdiagnostic_wdiscenarioexecutionpolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}