{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ICCID",
        "e UIC Cs",
        "eSIM"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/eUICCs",
    "offsetUri": "/Default/Profiles/{0}",
    "rootDefinitionId": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}",
    "categoryId": "3c46dc04-e649-41b9-be99-04b771303fdd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}",
    "description": "Node representing an enterprise-owned eUICC profile. The node name is the ICCID of the profile (which is a unique identifier). Creation of this subtree triggers an AddProfile request by the LPA (which installs the profile on the eUICC). Removal of this subtree triggers the LPA to delete the profile (if resident on the eUICC).",
    "helpText": "",
    "name": "{ICCID}",
    "displayName": "ICCID",
    "childIds": [
        "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_servername",
        "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_matchingid",
        "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_isenabled"
    ],
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_servername",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_matchingid",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_euiccs_{euicc}_profiles_{iccid}_isenabled",
            "required": false
        }
    ]
}