{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OSManagedAuth_Name",
        "Configure the level of TPM owner authorization information available to the operating system",
        "\\System\\Trusted Platform Module Services",
        "Administrative Templates\\System\\Trusted Platform Module Services",
        "Trusted Platform Module Services"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TPM/OSManagedAuth_Name",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name",
    "categoryId": "78d3d93f-03d0-4fa0-be56-be4bca0a7b3b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_selectosmanagedauthlevel",
    "description": null,
    "helpText": "",
    "name": "SelectOSManagedAuthLevel",
    "displayName": "Operating system managed TPM authentication level: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_selectosmanagedauthlevel_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_selectosmanagedauthlevel_4",
            "description": null,
            "helpText": null,
            "name": "Full",
            "displayName": "Full",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_selectosmanagedauthlevel_2",
            "description": null,
            "helpText": null,
            "name": "Delegated",
            "displayName": "Delegated",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_selectosmanagedauthlevel_0",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tpm_osmanagedauth_name"
                }
            ],
            "dependedOnBy": []
        }
    ]
}