{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Touch Keyboard Narrow Mode Availability",
        "Text Input"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-TextInput#touchkeyboardnarrowmodeavailability"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/TextInput/TouchKeyboardNarrowModeAvailability",
    "rootDefinitionId": "device_vendor_msft_policy_config_textinput_touchkeyboardnarrowmodeavailability",
    "categoryId": "cb8e8500-0336-4277-b3d9-9177cc967dcf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_textinput_touchkeyboardnarrowmodeavailability",
    "description": "Specifies whether the narrow keyboard mode is enabled or disabled for the touch keyboard. When this policy is set to disabled, the narrow keyboard mode for touch keyboard is disabled.",
    "helpText": "",
    "name": "TouchKeyboardNarrowModeAvailability",
    "displayName": "Touch Keyboard Narrow Mode Availability",
    "defaultOptionId": "device_vendor_msft_policy_config_textinput_touchkeyboardnarrowmodeavailability_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_textinput_touchkeyboardnarrowmodeavailability_0",
            "description": "The OS determines when it's most appropriate to be available.",
            "helpText": null,
            "name": "The OS determines when it's most appropriate to be available.",
            "displayName": "The OS determines when it's most appropriate to be available.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_textinput_touchkeyboardnarrowmodeavailability_1",
            "description": "Narrow keyboard is always available.",
            "helpText": null,
            "name": "Narrow keyboard is always available.",
            "displayName": "Narrow keyboard is always available.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_textinput_touchkeyboardnarrowmodeavailability_2",
            "description": "Narrow keyboard is always disabled.",
            "helpText": null,
            "name": "Narrow keyboard is always disabled.",
            "displayName": "Narrow keyboard is always disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}