{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PermitDisablePermissionInheritance",
        "Allow OneDrive to disable Windows permission inheritance in folders synced read-only",
        "\\OneDrive",
        "OneDrive",
        "One Drive",
        "Machine",
        "SOFTWARE\\Policies\\Microsoft\\OneDrive"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv3~Policy~OneDriveNGSC/PermitDisablePermissionInheritance",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_permitdisablepermissioninheritance",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_permitdisablepermissioninheritance",
    "description": "This setting lets the OneDrive sync app remove all inherited permissions within read-only folders syncing on a user's PC.\r\n\r\nIf you enable this setting, the OneDrive sync app can disable permission inheritance in read-only folders to improve sync speed.\r\n\r\nIf you disable or do not configure this setting, the OneDrive sync app will preserve permission inheritance in read-only folders. Sync speed may be significantly slower.",
    "helpText": "",
    "name": "PermitDisablePermissionInheritance",
    "displayName": "Allow OneDrive to disable Windows permission inheritance in folders synced read-only",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_permitdisablepermissioninheritance_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_permitdisablepermissioninheritance_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_permitdisablepermissioninheritance_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}