{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "Local UI Enabled",
        "e UIC Cs",
        "eSIM"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/eUICCs-csp/"
    ],
    "baseUri": "./Vendor/MSFT/eUICCs",
    "offsetUri": "/Default/Policies/LocalUIEnabled",
    "rootDefinitionId": "device_vendor_msft_euiccs_{euicc}",
    "categoryId": "3c46dc04-e649-41b9-be99-04b771303fdd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_euiccs_{euicc}_policies_localuienabled",
    "description": "Determines whether the local user interface of the LUI is available (true if available, false otherwise). Initially populated by the LPA when the eUICC tree is created, can be queried and changed by the MDM server.",
    "helpText": "",
    "name": "LocalUIEnabled",
    "displayName": "Display Local UI",
    "defaultOptionId": "device_vendor_msft_euiccs_{euicc}_policies_localuienabled_true",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_euiccs_{euicc}_policies_localuienabled_false",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_euiccs_{euicc}",
                    "parentSettingId": "device_vendor_msft_euiccs_{euicc}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_euiccs_{euicc}_policies_localuienabled_true",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_euiccs_{euicc}",
                    "parentSettingId": "device_vendor_msft_euiccs_{euicc}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}