{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableLanguageSettingSync",
        "Do not sync language preferences settings",
        "\\Windows Components\\Sync your settings",
        "Administrative Templates\\Windows Components\\Sync your settings",
        "Sync your settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-settingssync#settingssync-disablelanguagesettingsync"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/SettingsSync/DisableLanguageSettingSync",
    "rootDefinitionId": "device_vendor_msft_policy_config_settingssync_disablelanguagesettingsync",
    "categoryId": "7574a907-5608-491f-8011-c57d487457f4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_settingssync_disablelanguagesettingsync",
    "description": "\r\n        Prevent the \"language preferences\" group from syncing to and from this PC. This turns off and disables the \"languages preferences\" group on the \"Windows backup\" settings page in PC settings.\r\n\r\nIf you enable this policy setting, the \"language preferences\" group will not be synced.\r\n\r\nUse the option \"Allow users to turn language preferences syncing on\" so that syncing is turned off by default but not disabled.\r\n\r\nIf you do not set or disable this setting, syncing of the \"language preferences\" group is on by default and configurable by the user.\r\n      ",
    "helpText": "",
    "name": "DisableLanguageSettingSync",
    "displayName": "Do not sync language preferences settings",
    "defaultOptionId": "device_vendor_msft_policy_config_settingssync_disablelanguagesettingsync_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.6141",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_settingssync_disablelanguagesettingsync_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_settingssync_disablelanguagesettingsync_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_settingssync_disablelanguagesettingsync_checkbox_useroverride",
                    "required": true
                }
            ]
        }
    ]
}