{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Search Suggestionsin Address Bar",
        "Browser"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Browser#allowsearchsuggestionsinaddressbar"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Browser/AllowSearchSuggestionsinAddressBar",
    "rootDefinitionId": "device_vendor_msft_policy_config_browser_allowsearchsuggestionsinaddressbar",
    "categoryId": "5d835ac8-2e5e-4887-8e4d-0c3846d0ad9f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_browser_allowsearchsuggestionsinaddressbar",
    "description": "This setting lets you decide whether search suggestions should appear in the Address bar of Microsoft Edge.",
    "helpText": "",
    "name": "AllowSearchSuggestionsinAddressBar",
    "displayName": "Allow Search Suggestionsin Address Bar",
    "defaultOptionId": "device_vendor_msft_policy_config_browser_allowsearchsuggestionsinaddressbar_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_browser_allowsearchsuggestionsinaddressbar_0",
            "description": "Prevented/Not allowed. Hide the search suggestions.",
            "helpText": null,
            "name": "Prevented/Not allowed. Hide the search suggestions.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_browser_allowsearchsuggestionsinaddressbar_1",
            "description": "Allowed. Show the search suggestions.",
            "helpText": null,
            "name": "Allowed. Show the search suggestions.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}