{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableVisualStudioDevTunnels",
        "Disable dev tunnels in Visual Studio",
        "\\Visual Studio\\Dev Tunnel Settings",
        "Visual Studio\\Dev Tunnel Settings",
        "Dev Tunnel Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov2.1~Policy~VisualStudio~VisualStudioDevTunnelsSettings/DisableVisualStudioDevTunnels",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov2.1~policy~visualstudio~visualstudiodevtunnelssettings_disablevisualstudiodevtunnels",
    "categoryId": "b3b30966-47ac-4b54-a75a-04418d5c6153",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_visualstudiov2.1~policy~visualstudio~visualstudiodevtunnelssettings_disablevisualstudiodevtunnels",
    "description": "This policy disables dev tunnels in Visual Studio. For more information, see: https://aka.ms/devtunnels/vs/admx",
    "helpText": "",
    "name": "DisableVisualStudioDevTunnels",
    "displayName": "Disable dev tunnels in Visual Studio",
    "defaultOptionId": "device_vendor_msft_policy_config_visualstudiov2.1~policy~visualstudio~visualstudiodevtunnelssettings_disablevisualstudiodevtunnels_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov2.1~policy~visualstudio~visualstudiodevtunnelssettings_disablevisualstudiodevtunnels_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov2.1~policy~visualstudio~visualstudiodevtunnelssettings_disablevisualstudiodevtunnels_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}