{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RestrictRunFromHelp_Comp",
        "Restrict these programs from being launched from Help",
        "\\System",
        "Administrative Templates\\System",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-help#admx-help-restrictrunfromhelp-comp"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Help/RestrictRunFromHelp_Comp",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_help_restrictrunfromhelp_comp",
    "categoryId": "fd66cd4e-474b-4d6c-8dec-65a6a49e75d7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_help_restrictrunfromhelp_comp",
    "description": "\r\n        This policy setting allows you to restrict programs from being run from online Help.\r\n        \r\n        If you enable this policy setting, you can prevent specified programs from being run from Help. When you enable this policy setting, enter the file names names of the programs you want to restrict, separated by commas.\r\n        \r\n        If you disable or do not configure this policy setting, users can run all applications from online Help.\r\n        \r\n        Note: You can also restrict users from running applications by using the Software Restriction Policy settings available in Computer Configuration\\Security Settings.\r\n        \r\n        Note: This policy setting is available under Computer Configuration and User Configuration. If both are settings are used, any programs listed in either of these locations cannot launched from Help\r\n      \r\n ",
    "helpText": "",
    "name": "RestrictRunFromHelp_Comp",
    "displayName": "Restrict these programs from being launched from Help",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_help_restrictrunfromhelp_comp_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_help_restrictrunfromhelp_comp_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_help_restrictrunfromhelp_comp_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_help_restrictrunfromhelp_comp_restrictrunfromhelp_edit",
                    "required": true
                }
            ]
        }
    ]
}