{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SourceAutoUpdateInterval",
        "Set App Installer Source Auto Update Interval In Minutes",
        "\\Windows Components\\Desktop App Installer",
        "Administrative Templates\\Windows Components\\Desktop App Installer",
        "Desktop App Installer",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\AppInstaller"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-desktopappinstaller#desktopappinstaller-sourceautoupdateinterval"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DesktopAppInstaller/SourceAutoUpdateInterval",
    "rootDefinitionId": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval",
    "categoryId": "70063d93-03f0-462e-9943-b0241b88d54d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval",
    "description": "This policy controls the auto-update interval for package-based sources. The default source for Windows Package Manager is configured such that an index of the packages is cached on the local machine. The index is downloaded when a user invokes a command, and the interval has passed.\r\n\r\nIf you disable or do not configure this setting, the default interval or the value specified in the Windows Package Manager settings will be used.\r\n\r\nIf you enable this setting, the number of minutes specified will be used by the Windows Package Manager.",
    "helpText": "",
    "name": "SourceAutoUpdateInterval",
    "displayName": "Set App Installer Source Auto Update Interval In Minutes",
    "defaultOptionId": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_desktopappinstaller_sourceautoupdateinterval_sourceautoupdateinterval",
                    "required": true
                }
            ]
        }
    ]
}