{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "get",
    "keywords": [
        "Mute",
        "Notifications",
        "Outlook",
        "Allday",
        "All day",
        "DaysOfTheWeek",
        "Days of the week"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsAllday",
    "offsetUri": "/DaysOfTheWeek",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
    "categoryId": "ad1ecbf4-75da-4dc1-9354-7d00c0e2af72",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek",
    "description": null,
    "helpText": null,
    "name": "DaysOfTheWeek",
    "displayName": "Days of the week",
    "defaultOptionId": null,
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
        "description": null,
        "platform": "android,iOS",
        "deviceMode": "none",
        "technologies": "exchangeOnline"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_0",
            "description": null,
            "helpText": null,
            "name": "Sunday",
            "displayName": "Sunday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_1",
            "description": null,
            "helpText": null,
            "name": "Monday",
            "displayName": "Monday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_2",
            "description": null,
            "helpText": null,
            "name": "Tuesday",
            "displayName": "Tuesday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_3",
            "description": null,
            "helpText": null,
            "name": "Wednesday",
            "displayName": "Wednesday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 8
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_4",
            "description": null,
            "helpText": null,
            "name": "Thursday",
            "displayName": "Thursday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 16
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_5",
            "description": null,
            "helpText": null,
            "name": "Friday",
            "displayName": "Friday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 32
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek_6",
            "description": null,
            "helpText": null,
            "name": "Saturday",
            "displayName": "Saturday",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 64
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_1",
                    "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday"
                }
            ],
            "dependedOnBy": []
        }
    ]
}