{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_RollbackToTargetVersionMicrosoftEdgeBeta",
        "Rollback to Target version",
        "\\Microsoft Edge Update\\Applications\\Microsoft Edge Beta",
        "Microsoft Edge Update\\Applications\\Microsoft Edge Beta",
        "Microsoft Edge Beta",
        "Machine",
        "Software\\Policies\\Microsoft\\EdgeUpdate",
        "RollbackToTargetVersion{2CD8A007-E189-409D-A2C8-9AF4EF3C72AA}"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev86~Policy~Cat_EdgeUpdate~Cat_Applications~Cat_MicrosoftEdgeBeta/Pol_RollbackToTargetVersionMicrosoftEdgeBeta",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev86~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_rollbacktotargetversionmicrosoftedgebeta",
    "categoryId": "7b91ab31-7ed5-4de9-bd49-d04303fd3c74",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_updatev86~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_rollbacktotargetversionmicrosoftedgebeta",
    "description": "Specifies that Microsoft Edge Update should rollback installations of Microsoft Edge to the version indicated in 'Target version override'.\r\n\r\nThis policy has no effect unless 'Target version override' is set and 'Update policy override' is set to one of the ON states (Always allow updates, Automatic silent updates only, Manual updates only).\r\n\r\nIf you disable this policy or don't configure it, installs that have a version higher than that specified by 'Target version override' will be left as-is.\r\n\r\nIf you enable this policy, installs that have a current version higher than specified by the 'Target version override' will be downgraded to the target version.\r\n\r\nWe recommend that users install the latest version of the Microsoft Edge browser to ensure protection by the latest security updates. Rollback to an earlier version risks exposure to known security issues. This policy is meant to be used as a temporary fix to address issues in a Microsoft Edge browser update.\r\n\r\nBefore temporarily rolling back your browser version, we recommend that you turn on Sync (https://go.microsoft.com/fwlink/?linkid=2133032) for all users in your organization. If you don't turn on Sync, there is a risk of permanent browsing data loss. Use this policy at your own risk.\r\n\r\nNote: All versions available for rollback can be viewed here https://aka.ms/EdgeEnterprise.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft® Active Directory® domain.\r\n\r\nThis policy applies to Microsoft Edge version 86 or later.\r\n\r\nSee https://go.microsoft.com/fwlink/?linkid=2133918 for more information. This policy is meant to serve as temporary measure when Enterprise Administrators need to downgrade for business reasons. To ensure users are protected by the latest security updates, the most recent version should be used. When versions are downgraded to older versions, there could be incompatibilities.",
    "helpText": "",
    "name": "Pol_RollbackToTargetVersionMicrosoftEdgeBeta",
    "displayName": "Rollback to Target version",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev86~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_rollbacktotargetversionmicrosoftedgebeta_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev86~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_rollbacktotargetversionmicrosoftedgebeta_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev86~policy~cat_edgeupdate~cat_applications~cat_microsoftedgebeta_pol_rollbacktotargetversionmicrosoftedgebeta_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}