{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PortableOperatingSystem_Hibernate",
        "Allow hibernate (S4) when starting from a Windows To Go workspace",
        "\\Windows Components\\Portable Operating System",
        "Administrative Templates\\Windows Components\\Portable Operating System",
        "Portable Operating System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-externalboot#admx-externalboot-portableoperatingsystem-hibernate"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ExternalBoot/PortableOperatingSystem_Hibernate",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_externalboot_portableoperatingsystem_hibernate",
    "categoryId": "176ed477-020a-41af-8859-0605c2caad98",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_externalboot_portableoperatingsystem_hibernate",
    "description": "\r\n\r\nSpecifies whether the PC can use the hibernation sleep state (S4) when started from a Windows To Go workspace.\r\n\r\nIf you enable this setting, Windows, when started from a Windows To Go workspace, can hibernate the PC.\r\n\r\nIf you disable or don't configure this setting, Windows, when started from a Windows To Go workspace, can't hibernate the PC.\r\n ",
    "helpText": "",
    "name": "PortableOperatingSystem_Hibernate",
    "displayName": "Allow hibernate (S4) when starting from a Windows To Go workspace",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_externalboot_portableoperatingsystem_hibernate_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_externalboot_portableoperatingsystem_hibernate_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_externalboot_portableoperatingsystem_hibernate_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}