{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AutomaticProfileSwitchingSiteList",
        "Configure the automatic profile switching site list",
        "\\Microsoft Edge\\Identity and sign-in",
        "Microsoft Edge\\Identity and sign-in",
        "Identity and sign-in"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev120~Policy~microsoft_edge~Identity/AutomaticProfileSwitchingSiteList",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev120~policy~microsoft_edge~identity_automaticprofileswitchingsitelist",
    "categoryId": "45a89c1f-0a34-4f78-b28f-d30b623fa423",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev120~policy~microsoft_edge~identity_automaticprofileswitchingsitelist",
    "description": "Set this policy to control which profiles Microsoft Edge will use to open sites in. Switching configurations for sites listed in this policy take precedence over other heuristics Microsoft Edge uses for switching sites but note that sites not listed on this policy are still subject to switching by those heuristics. If this policy is not configured, Microsoft Edge will continue using its heuristics to automatically switch sites.\r\n\r\nThis policy maps a URL hostname to a profile that it should be opened in.\r\n\r\nThe 'site' field should take the form of a URL hostname.\r\n\r\nThe 'profile' field can take one of the following values:\r\n- 'Work': The most recently used Microsoft Entra signed-in profile will be used to open 'site'.\r\n- 'Personal': The most recently used MSA signed-in profile will be used to open 'site'.\r\n- 'No preference': The currently used profile will be used to open 'site'.\r\n- Wildcard email address: This takes the form of '*@contoso.com'. A profile whose username ends with the contents following the '*' will be used to open 'site'.\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"site\": \"work.com\",\r\n    \"profile\": \"Work\"\r\n  },\r\n  {\r\n    \"site\": \"personal.com\",\r\n    \"profile\": \"Personal\"\r\n  },\r\n  {\r\n    \"site\": \"nopreference.com\",\r\n    \"profile\": \"No preference\"\r\n  },\r\n  {\r\n    \"site\": \"contoso.com\",\r\n    \"profile\": \"*@contoso.com\"\r\n  }\r\n]",
    "helpText": "",
    "name": "AutomaticProfileSwitchingSiteList",
    "displayName": "Configure the automatic profile switching site list",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev120~policy~microsoft_edge~identity_automaticprofileswitchingsitelist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev120~policy~microsoft_edge~identity_automaticprofileswitchingsitelist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev120~policy~microsoft_edge~identity_automaticprofileswitchingsitelist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev120~policy~microsoft_edge~identity_automaticprofileswitchingsitelist_automaticprofileswitchingsitelist",
                    "required": true
                }
            ]
        }
    ]
}