{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableTrainingOfAdaptiveFloatieMachine",
        "Disable Training of the Adaptive Floatie feature on the computer",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v17~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_DisableTrainingOfAdaptiveFloatieMachine",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingofadaptivefloatiemachine",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingofadaptivefloatiemachine",
    "description": "\r\nThis policy setting disables local training of the Adaptive Floatie feature for the computer.\r\n\r\nFor local training policy, feature-specific settings are prioritized over general settings and computer settings are prioritized over user settings.\r\n\r\n- If this policy setting is enabled, local training of the Adaptive Floatie feature is disabled for the computer.\r\n- If this policy setting is disabled, local training of the Adaptive Floatie feature is enabled for the computer.\r\n- If this policy setting is not configured, local training of the Adaptive Floatie feature is determined by lower priority policy settings.\r\n- If this policy setting is not configured and lower priority policy settings are also not configured, local training of the Adaptive Floatie feature is enabled for the computer.\r\n\r\nFor this policy setting, the order of priority is:\r\n1. Disable local training of the Adaptive Floatie feature for the computer.\r\n2. Disable local training of all features for the computer.\r\n3. Disable local training of the Adaptive Floatie feature for the user.\r\n4. Disable local training of all features for the user.",
    "helpText": "",
    "name": "L_DisableTrainingOfAdaptiveFloatieMachine",
    "displayName": "Disable local training of the Adaptive Floatie feature for the computer.",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingofadaptivefloatiemachine_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingofadaptivefloatiemachine_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingofadaptivefloatiemachine_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}