{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Application Control",
        "Rules",
        "Rule",
        "Publisher",
        "App Control for Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/applicationcontrol-csp"
    ],
    "occurrence": null,
    "baseUri": "./Vendor/MSFT/ApplicationControl",
    "offsetUri": "/Policies/{PolicyGuid}/Policy/{0}",
    "rootDefinitionId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions",
    "categoryId": "a7b1c291-6bec-499b-9018-6120950cd5a6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails",
    "description": "Creates a rule for a file that is signed by the software publisher. Upload the output generated by the binary file information extractor for your selected reference file.",
    "helpText": null,
    "name": "ApplicationControlV2_SupplementalPolicy_Rule_PublisherDetails",
    "displayName": "Publisher",
    "defaultOptionId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails_issuingca",
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails_issuingca",
            "description": null,
            "helpText": null,
            "name": "IssuingCA",
            "displayName": "Issuing certificate authority",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisher",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails_issuingcadetails",
                    "required": true
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails_publishername",
            "description": null,
            "helpText": null,
            "name": "Publisher",
            "displayName": "Publisher",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisher",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails_publishernamedetails",
                    "required": true
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails_minimumversion",
            "description": null,
            "helpText": null,
            "name": "MinVersion",
            "displayName": "Minimum version",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisher",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherdetails_minimumversiondetails",
                    "required": true
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherfilename",
            "description": null,
            "helpText": null,
            "name": "FileName",
            "displayName": "File name",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisher",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrolv2_supplementalpolicy_buildoptions_{ruleid}_type_publisherfilenamedetails",
                    "required": true
                }
            ]
        }
    ]
}