{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WdiScenarioExecutionPolicy",
        "Configure MSI Corrupted File Recovery behavior",
        "\\System\\Troubleshooting and Diagnostics\\MSI Corrupted File Recovery",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\MSI Corrupted File Recovery",
        "MSI Corrupted File Recovery"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MsiFileRecovery/WdiScenarioExecutionPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy",
    "categoryId": "2ac8fe19-ca17-4533-8818-a5e12030de51",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_wdiscenarioexecutionpolicylevel",
    "description": null,
    "helpText": "",
    "name": "WdiScenarioExecutionPolicyLevel",
    "displayName": "Scenario Execution Level (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_wdiscenarioexecutionpolicylevel_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_wdiscenarioexecutionpolicylevel_1",
            "description": null,
            "helpText": null,
            "name": "Troubleshooting Only",
            "displayName": "Troubleshooting Only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_wdiscenarioexecutionpolicylevel_2",
            "description": null,
            "helpText": null,
            "name": "Prompt for Resolution",
            "displayName": "Prompt for Resolution",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_wdiscenarioexecutionpolicylevel_3",
            "description": null,
            "helpText": null,
            "name": "Silent",
            "displayName": "Silent",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_msifilerecovery_wdiscenarioexecutionpolicy"
                }
            ],
            "dependedOnBy": []
        }
    ]
}