{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_ForceTunneling",
        "Route all traffic through the internal network",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_ForceTunneling",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling_stateselect",
    "description": null,
    "helpText": "",
    "name": "StateSelect",
    "displayName": "Select from the following states: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling_stateselect_enabled",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling_stateselect_enabled",
            "description": null,
            "helpText": null,
            "name": "Enabled State",
            "displayName": "Enabled State",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Enabled"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling_stateselect_disabled",
            "description": null,
            "helpText": null,
            "name": "Disabled State",
            "displayName": "Disabled State",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Disabled"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_networkconnections_nc_forcetunneling"
                }
            ],
            "dependedOnBy": []
        }
    ]
}