{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PreventQuickLaunchShortcut",
        "Prevent Quick Launch Toolbar Shortcut Creation",
        "\\Windows Components\\Windows Media Player",
        "Administrative Templates\\Windows Components\\Windows Media Player",
        "Windows Media Player"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsmediaplayer#admx-windowsmediaplayer-preventquicklaunchshortcut"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/PreventQuickLaunchShortcut",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventquicklaunchshortcut",
    "categoryId": "22ebd92b-80b6-493d-99d8-3c72f1a0827e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventquicklaunchshortcut",
    "description": "This policy setting allows you to prevent a shortcut for the Player from being added to the Quick Launch bar.\r\n\r\nIf you enable this policy setting, the user cannot add the shortcut for the Player to the Quick Launch bar.\r\n\r\nIf you disable or do not configure this policy setting, the user can choose whether to add the shortcut for the Player to the Quick Launch bar.\r\n ",
    "helpText": "",
    "name": "PreventQuickLaunchShortcut",
    "displayName": "Prevent Quick Launch Toolbar Shortcut Creation",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventquicklaunchshortcut_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventquicklaunchshortcut_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_preventquicklaunchshortcut_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}