{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShutdownReason",
        "Display Shutdown Event Tracker",
        "\\System",
        "Administrative Templates\\System",
        "System"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Reliability/ShutdownReason",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason",
    "categoryId": "fd66cd4e-474b-4d6c-8dec-65a6a49e75d7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_shutdownreason_box",
    "description": null,
    "helpText": "",
    "name": "ShutdownReason_Box",
    "displayName": "Shutdown Event Tracker should be displayed: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_shutdownreason_box_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_shutdownreason_box_1",
            "description": null,
            "helpText": null,
            "name": "Always",
            "displayName": "Always",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_shutdownreason_box_2",
            "description": null,
            "helpText": null,
            "name": "Workstation Only",
            "displayName": "Workstation Only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_shutdownreason_box_3",
            "description": null,
            "helpText": null,
            "name": "Server Only",
            "displayName": "Server Only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason"
                }
            ],
            "dependedOnBy": []
        }
    ]
}