{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RpcExtendedErrorInformation",
        "Propagate extended error information",
        "\\System\\Remote Procedure Call",
        "Administrative Templates\\System\\Remote Procedure Call",
        "Remote Procedure Call",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\Rpc"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-rpc#admx-rpc-rpcextendederrorinformation"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RPC/RpcExtendedErrorInformation",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_rpc_rpcextendederrorinformation",
    "categoryId": "73a3a483-dcba-4b34-b7cb-9c68c871864c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_rpc_rpcextendederrorinformation",
    "description": "This policy setting controls whether the RPC runtime generates extended error information when an error occurs.\r\n\r\nExtended error information includes the local time that the error occurred, the RPC version, and the name of the computer on which the error occurred, or from which it was propagated. Programs can retrieve the extended error information by using standard Windows application programming interfaces (APIs).\r\n\r\nIf you disable this policy setting, the RPC Runtime only generates a status code to indicate an error condition.\r\n\r\nIf you do not configure this policy setting, it remains disabled.  It will only generate a status code to indicate an error condition.\r\n\r\nIf you enable this policy setting, the RPC runtime will generate extended error information.  You must select an error response type in the drop-down box.\r\n\r\n--  \"Off\" disables all extended error information for all processes. RPC only generates an error code.\r\n\r\n--  \"On with Exceptions\" enables extended error information, but lets you disable it for selected processes. To disable extended error information for a process while this policy setting is in effect, the command that starts the process must begin with one of the strings in the Extended Error Information Exception field.\r\n\r\n--  \"Off with Exceptions\" disables extended error information, but lets you enable it for selected processes. To enable extended error information for a process while this policy setting is in effect, the command that starts the process must begin with one of the strings in the Extended Error Information Exception field.\r\n\r\n--  \"On\" enables extended error information for all processes.\r\n\r\nNote: For information about the Extended Error Information Exception field, see the Windows Software Development Kit (SDK).\r\n\r\nNote: Extended error information is formatted to be compatible with other operating systems and older Microsoft operating systems, but only newer Microsoft operating systems can read and respond to the information.\r\n\r\nNote: The default policy setting, \"Off,\" is designed for systems where extended error information is considered to be sensitive, and it should not be made available remotely.\r\n\r\nNote: This policy setting will not be applied until the system is rebooted.\r\n ",
    "helpText": "",
    "name": "RpcExtendedErrorInformation",
    "displayName": "Propagate extended error information",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_rpc_rpcextendederrorinformation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcextendederrorinformation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcextendederrorinformation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_rpc_rpcextendederrorinformation_rpcextendederrorinformationlist",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_rpc_rpcextendederrorinformation_rpcexterrorexceptions",
                    "required": true
                }
            ]
        }
    ]
}