{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "child process",
        "Elevation",
        "Privilege Management"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/PrivilegeManagement/ElevationRules/{0}/ChildProcessBehavior",
    "rootDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
    "categoryId": "4f3a6fca-a74c-448d-95b1-9d6d7a5d4449",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_childprocessbehavior",
    "description": "",
    "helpText": null,
    "name": "ChildProcessBehavior",
    "displayName": "Child process behavior",
    "defaultOptionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_allowrunelevatedrulerequired",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "endpointPrivilegeManagement",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19042",
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_allowrunelevated",
            "description": null,
            "helpText": null,
            "name": "AllowRunElevated",
            "displayName": "Allow all child processes to run elevated",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AllowRunElevated"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
                    "parentSettingId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_allowrunelevatedrulerequired",
            "description": null,
            "helpText": null,
            "name": "AllowRunElevatedRuleRequired",
            "displayName": "Require rule to elevate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AllowRunElevatedRuleRequired"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
                    "parentSettingId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_deny",
            "description": null,
            "helpText": null,
            "name": "Deny",
            "displayName": "Deny all",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Deny"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
                    "parentSettingId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}