{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShowJobTitleInEventLogs",
        "Allow job name in event logs",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-printing#admx-printing-showjobtitleineventlogs"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing/ShowJobTitleInEventLogs",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing_showjobtitleineventlogs",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_printing_showjobtitleineventlogs",
    "description": "\r\n        This policy controls whether the print job name will be included in print event logs.\r\n\r\n        If you disable or do not configure this policy setting, the print job name will not be included.\r\n\r\n        If you enable this policy setting, the print job name will be included in new log entries.\r\n\r\n        Note: This setting does not apply to Branch Office Direct Printing jobs.\r\n      \r\n ",
    "helpText": "",
    "name": "ShowJobTitleInEventLogs",
    "displayName": "Allow job name in event logs",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing_showjobtitleineventlogs_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_showjobtitleineventlogs_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_showjobtitleineventlogs_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}