{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BITS_MaxBandwidthV2_Work",
        "Set up a work schedule to limit the maximum network bandwidth used for BITS background transfers",
        "\\Network\\Background Intelligent Transfer Service (BITS)",
        "Administrative Templates\\Network\\Background Intelligent Transfer Service (BITS)",
        "Background Intelligent Transfer Service (BITS)"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Bits/BITS_MaxBandwidthV2_Work",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_work",
    "categoryId": "f2345e03-bcd9-48fc-9c52-11ae06ba625a",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_work_bits_nonworknormalprioritylimit",
    "description": null,
    "helpText": "",
    "name": "BITS_NonWorkNormalPriorityLimit",
    "displayName": "Normal Priority Limit: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4294967200,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_work_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_work"
        }
    ],
    "dependedOnBy": []
}