{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BITS_DisablePeercachingServer",
        "Do not allow the computer to act as a BITS Peercaching server",
        "\\Network\\Background Intelligent Transfer Service (BITS)",
        "Administrative Templates\\Network\\Background Intelligent Transfer Service (BITS)",
        "Background Intelligent Transfer Service (BITS)",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\BITS",
        "DisablePeerCachingServer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-bits#admx-bits-bits-disablepeercachingserver"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Bits/BITS_DisablePeercachingServer",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_bits_bits_disablepeercachingserver",
    "categoryId": "f2345e03-bcd9-48fc-9c52-11ae06ba625a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_bits_bits_disablepeercachingserver",
    "description": "This policy setting specifies whether the computer will act as a BITS peer caching server. By default, when BITS peer caching is enabled, the computer acts as both a peer caching server (offering files to its peers) and a peer caching client (downloading files from its peers).\r\n\r\n          If you enable this policy setting, the computer will no longer cache downloaded files and offer them to its peers. However, the computer will still download files from peers.\r\n\r\n          If you disable or do not configure this policy setting, the computer will offer downloaded and cached files to its peers.\r\n\r\n          Note: This setting has no effect if the \"Allow BITS peer caching\" setting is disabled or not configured.\r\n ",
    "helpText": "",
    "name": "BITS_DisablePeercachingServer",
    "displayName": "Do not allow the computer to act as a BITS Peercaching server",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_bits_bits_disablepeercachingserver_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_disablepeercachingserver_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_disablepeercachingserver_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}