{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableTrainingMachine",
        "Disable Training of all features on the computer",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v17~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_DisableTrainingMachine",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingmachine",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingmachine",
    "description": "\r\nThis policy setting allows you to disable Training of all features on the computer.\r\n\r\nIf you enable this policy setting, Training of all features will be disabled on the computer.\r\n\r\nIf you disable this policy setting, Training of all features is enabled on the computer.\r\n\r\nIf you do not configure this policy setting, Training of all features is determined based on user policy settings.",
    "helpText": "",
    "name": "L_DisableTrainingMachine",
    "displayName": "Disable Training of all features on the computer",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingmachine_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingmachine_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v17~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletrainingmachine_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}