{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RelaunchNotification",
        "Notify a user that a browser relaunch or device restart is recommended or required",
        "\\Google\\Google Chrome",
        "Administrative Templates\\Google\\Google Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome/RelaunchNotification",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_relaunchnotification",
    "description": "",
    "helpText": "",
    "name": "RelaunchNotification",
    "displayName": "Notify a user that a browser relaunch or device restart is recommended or required (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_relaunchnotification_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_relaunchnotification_1",
            "description": null,
            "helpText": null,
            "name": "Show a recurring prompt to the user indicating that a relaunch is recommended",
            "displayName": "Show a recurring prompt to the user indicating that a relaunch is recommended",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_relaunchnotification_2",
            "description": null,
            "helpText": null,
            "name": "Show a recurring prompt to the user indicating that a relaunch is required",
            "displayName": "Show a recurring prompt to the user indicating that a relaunch is required",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_relaunchnotification"
                }
            ],
            "dependedOnBy": []
        }
    ]
}