{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PowerThrottlingTurnOff",
        "Turn off Power Throttling",
        "\\System\\Power Management\\Power Throttling Settings",
        "Administrative Templates\\System\\Power Management\\Power Throttling Settings",
        "Power Throttling Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-power#admx-power-powerthrottlingturnoff"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/PowerThrottlingTurnOff",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_powerthrottlingturnoff",
    "categoryId": "7120bf9e-e5f6-42cd-8f7e-15d2ca445c37",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_power_powerthrottlingturnoff",
    "description": "This policy setting allows you to turn off Power Throttling.\r\n\r\nIf you enable this policy setting, Power Throttling will be turned off.\r\n\r\nIf you disable or do not configure this policy setting, users control this setting.\r\n ",
    "helpText": "",
    "name": "PowerThrottlingTurnOff",
    "displayName": "Turn off Power Throttling",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_powerthrottlingturnoff_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_powerthrottlingturnoff_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_powerthrottlingturnoff_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}