{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ApplicationGuardTrafficIdentificationEnabled",
        "Application Guard Traffic Identification",
        "\\Microsoft Edge\\Application Guard settings",
        "Microsoft Edge\\Application Guard settings",
        "Application Guard settings",
        "Both",
        "Software\\Policies\\Microsoft\\Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev91~Policy~microsoft_edge~ApplicationGuard/ApplicationGuardTrafficIdentificationEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge~applicationguard_applicationguardtrafficidentificationenabled",
    "categoryId": "5bd0eaf1-1818-44e8-9168-fc75c5739cc8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge~applicationguard_applicationguardtrafficidentificationenabled",
    "description": "If you enable or don't configure this policy, Application Guard will add an extra HTTP header (X-MS-ApplicationGuard-Initiated) to all outbound HTTP requests made from the Application Guard container.\r\n\r\nIf you disable this policy, the extra header is not added to the traffic.",
    "helpText": "",
    "name": "ApplicationGuardTrafficIdentificationEnabled",
    "displayName": "Application Guard Traffic Identification",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge~applicationguard_applicationguardtrafficidentificationenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge~applicationguard_applicationguardtrafficidentificationenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev91~policy~microsoft_edge~applicationguard_applicationguardtrafficidentificationenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}