{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BlockTenantList",
        "Block syncing OneDrive accounts for specific organizations",
        "\\OneDrive",
        "OneDrive",
        "One Drive"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv2~Policy~OneDriveNGSC/BlockTenantList",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blocktenantlist",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blocktenantlist",
    "description": "This setting lets you prevent users from easily uploading files to another organization by specifying a list of blocked tenant IDs.\r\n\r\nIf you enable this setting, users will get an error if they attempt to add an account from an organization that is blocked. If a user has already added the account, the files will stop syncing.\r\n\r\nIf you disable or do not configure this setting, users can add accounts from any organization.\r\n\r\nTo specify a list of allowed organizations instead, use \"Allow syncing OneDrive accounts for only specific organizations.\"\r\n\r\nThis setting will NOT work if you have the \"Allow syncing OneDrive accounts for only specific organizations.\" enabled. Do not enable both policies at the same time.",
    "helpText": "",
    "name": "BlockTenantList",
    "displayName": "Block syncing OneDrive accounts for specific organizations",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blocktenantlist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blocktenantlist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blocktenantlist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blocktenantlist_blocktenantlistbox",
                    "required": true
                }
            ]
        }
    ]
}