{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "allow",
        "user",
        "allowuser",
        "change setting",
        "End User Overrides"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
    "offsetUri": "/AllowUserToChangeSetting",
    "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting",
    "categoryId": "a876b9c1-f22c-48aa-9826-e112f4fbe6d8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting",
    "description": "Disallowing end users from changing this setting will prevent them from editing their global quiet time settings. Note: If Non-working time policy is applied to the user, they will be prevented from editing their global quiet time settings by default.",
    "helpText": "",
    "name": "AllowUserToChangeSetting",
    "displayName": "Allow user to change setting",
    "defaultOptionId": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
        "description": null,
        "platform": "android,iOS",
        "deviceMode": "none",
        "technologies": "exchangeOnline"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "No",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}