{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Set Time To Reboot",
        "Remote Remediation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/RemoteRemediation-csp/"
    ],
    "baseUri": "./Vendor/MSFT/RemoteRemediation",
    "offsetUri": "/CloudRemediationSettings/AutoRemediationSettings/SetTimeToReboot",
    "rootDefinitionId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation",
    "categoryId": "52e76943-bfc9-4fb5-bdc8-5d4e8c6a436e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_settimetoreboot",
    "description": "Refers to the time in minutes that a device will spend in the recovery environment before attempting to reboot. The maximum time to reboot possible is 72 hours, should be greater than or equal to the retry interval, and only takes effect if auto remediation is on. Otherwise an invalid argument error will be returned and no changes will be made.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "SetTimeToReboot",
    "displayName": "Set Time To Reboot (Windows Insiders only)",
    "defaultValue": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.25272",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4320,
        "minimumValue": 1
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation_true",
            "parentSettingId": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation"
        }
    ],
    "dependedOnBy": []
}