{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RpcMinimumHttpConnectionTimeout",
        "Set Minimum Idle Connection Timeout for RPC/HTTP connections",
        "\\System\\Remote Procedure Call",
        "Administrative Templates\\System\\Remote Procedure Call",
        "Remote Procedure Call",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\Rpc"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-rpc#admx-rpc-rpcminimumhttpconnectiontimeout"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RPC/RpcMinimumHttpConnectionTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout",
    "categoryId": "73a3a483-dcba-4b34-b7cb-9c68c871864c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout",
    "description": "This policy setting controls the idle connection timeout for RPC/HTTP connections.  \r\n\r\nThis policy setting is useful in cases where a network agent like an HTTP proxy or a router uses a lower idle connection timeout than the IIS server running the RPC/HTTP proxy. In such cases, RPC/HTTP clients may encounter errors because connections will be timed out faster than expected. Using this policy setting you can force the RPC Runtime and the RPC/HTTP Proxy to use a lower connection timeout.\r\n\r\nThis policy setting is only applicable when the RPC Client, the RPC Server and the RPC HTTP Proxy are all running Windows Server 2003 family/Windows XP SP1 or higher versions. If either the RPC Client or the RPC Server or the RPC HTTP Proxy run on an older version of Windows, this policy setting will be ignored.\r\n\r\nThe minimum allowed value for this policy setting is 90 seconds. The maximum is 7200 seconds (2 hours).\r\n\r\nIf you disable this policy setting, the idle connection timeout on the IIS server running the RPC HTTP proxy will be used.\r\n\r\nIf you do not configure this policy setting, it will remain disabled.  The idle connection timeout on the IIS server running the RPC HTTP proxy will be used.\r\n\r\nIf you enable this policy setting, and the IIS server running the RPC HTTP proxy is configured with a lower idle connection timeout, the timeout on the IIS server is used. Otherwise, the provided timeout value is used.  The timeout is given in seconds.\r\n\r\nNote: This policy setting will not be applied until the system is rebooted.\r\n ",
    "helpText": "",
    "name": "RpcMinimumHttpConnectionTimeout",
    "displayName": "Set Minimum Idle Connection Timeout for RPC/HTTP connections",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_rpc_rpcminimumhttpconnectiontimeout_rpcminimumhttpconnectiontimeoutvalue",
                    "required": true
                }
            ]
        }
    ]
}