{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Disable Account Protection UI",
        "Windows Defender Security Center"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-WindowsDefenderSecurityCenter#disableaccountprotectionui"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/WindowsDefenderSecurityCenter/DisableAccountProtectionUI",
    "rootDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableaccountprotectionui",
    "categoryId": "f72e61e9-7e84-4c6d-8057-fa0a4f79cbea",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableaccountprotectionui",
    "description": "Use this policy setting to specify if to display the Account protection area in Windows Defender Security Center. If you disable or do not configure this setting, Windows defender Security Center will display this area.",
    "helpText": "",
    "name": "DisableAccountProtectionUI",
    "displayName": "Disable Account Protection UI",
    "defaultOptionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableaccountprotectionui_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableaccountprotectionui_0",
            "description": "(Disable) The users can see the display of the Account protection area in Windows Defender Security Center.",
            "helpText": null,
            "name": "(Disable) The users can see the display of the Account protection area in Windows Defender Security Center.",
            "displayName": "(Disable) The users can see the display of the Account protection area in Windows Defender Security Center.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disableaccountprotectionui_1",
            "description": "(Enable) The users cannot see the display of the Account protection area in Windows Defender Security Center.",
            "helpText": null,
            "name": "(Enable) The users cannot see the display of the Account protection area in Windows Defender Security Center.",
            "displayName": "(Enable) The users cannot see the display of the Account protection area in Windows Defender Security Center.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}