{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NonDomainPrinters",
        "Add Printer wizard - Network scan page (Unmanaged network)",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\Printers\\Wizard",
        "NonDomainDisplayPrinters_State"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-printing#admx-printing-nondomainprinters"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing/NonDomainPrinters",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing_nondomainprinters",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_printing_nondomainprinters",
    "description": "This policy sets the maximum number of printers (of each type) that the Add Printer wizard will display on a computer on an unmanaged network (when the computer is not able to reach a domain controller, e.g. a domain-joined laptop on a home network.)\r\n\r\nIf this setting is disabled, the network scan page will not be displayed.\r\n\r\nIf this setting is not configured, the Add Printer wizard will display the default number of printers of each type:\r\nTCP/IP printers: 50\r\nWeb Services printers: 50\r\nBluetooth printers: 10\r\nShared printers: 50\r\n\r\nIf you would like to not display printers of a certain type, enable this policy and set the number of printers to display to 0.\r\n\r\nIn Windows 10 and later, only TCP/IP printers can be shown in the wizard. If you enable this policy setting, only TCP/IP printer limits are applicable. On Windows 10 only, if you disable or do not configure this policy setting, the default limit is applied.\r\n          \r\nIn Windows 8 and later, Bluetooth printers are not shown so its limit does not apply to those versions of Windows.\r\n ",
    "helpText": "",
    "name": "NonDomainPrinters",
    "displayName": "Add Printer wizard - Network scan page (Unmanaged network)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing_nondomainprinters_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_nondomainprinters_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing_nondomainprinters_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_nondomainprinters_ipprinters",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_nondomainprinters_wsdprinters",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_nondomainprinters_bluetoothprinters",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_printing_nondomainprinters_shareprinters",
                    "required": true
                }
            ]
        }
    ]
}