{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "BITS_MaxBandwidthV2_Maintenance",
        "Set up a maintenance schedule to limit the maximum network bandwidth used for BITS background transfers",
        "\\Network\\Background Intelligent Transfer Service (BITS)",
        "Administrative Templates\\Network\\Background Intelligent Transfer Service (BITS)",
        "Background Intelligent Transfer Service (BITS)",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\BITS\\Throttling",
        "EnableMaintenanceLimits"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-bits#admx-bits-bits-maxbandwidthv2-maintenance"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Bits/BITS_MaxBandwidthV2_Maintenance",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance",
    "categoryId": "f2345e03-bcd9-48fc-9c52-11ae06ba625a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance",
    "description": "This policy setting limits the network bandwidth that Background Intelligent Transfer Service (BITS) uses for background transfers during the maintenance days and hours. Maintenance schedules further limit the network bandwidth that is used for background transfers.\r\n\r\n          If you enable this policy setting, you can define a separate set of network bandwidth limits and set up a schedule for the maintenance period.\r\n\r\n          You can specify a limit to use for background jobs during a maintenance schedule. For example, if normal priority jobs are currently limited to 256 Kbps on a work schedule, you can further limit the network bandwidth of normal priority jobs to 0 Kbps from 8:00 A.M. to 10:00 A.M. on a maintenance schedule.\r\n\r\n          If you disable or do not configure this policy setting, the limits defined for work or nonwork schedules will be used.\r\n\r\n          Note:  The bandwidth limits that are set for the maintenance period supersede any limits defined for work and other schedules.\r\n      \r\n ",
    "helpText": "",
    "name": "BITS_MaxBandwidthV2_Maintenance",
    "displayName": "Set up a maintenance schedule to limit the maximum network bandwidth used for BITS background transfers",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancedaysfrom",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancedaysto",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursfrom",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehoursto",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehighprioritylimit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancehighpriorityunit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancenormalprioritylimit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancenormalpriorityunit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancelowprioritylimit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_bits_bits_maxbandwidthv2_maintenance_bits_maintenancelowpriorityunit",
                    "required": true
                }
            ]
        }
    ]
}