{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Force Touch Keyboard Docked State",
        "Text Input"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-TextInput#forcetouchkeyboarddockedstate"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/TextInput/ForceTouchKeyboardDockedState",
    "rootDefinitionId": "device_vendor_msft_policy_config_textinput_forcetouchkeyboarddockedstate",
    "categoryId": "cb8e8500-0336-4277-b3d9-9177cc967dcf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_textinput_forcetouchkeyboarddockedstate",
    "description": "Specifies the touch keyboard is always docked. When this policy is set to enabled, the touch keyboard is always docked.",
    "helpText": "",
    "name": "ForceTouchKeyboardDockedState",
    "displayName": "Force Touch Keyboard Docked State",
    "defaultOptionId": "device_vendor_msft_policy_config_textinput_forcetouchkeyboarddockedstate_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_textinput_forcetouchkeyboarddockedstate_0",
            "description": "The OS determines when it's most appropriate to be available.",
            "helpText": null,
            "name": "The OS determines when it's most appropriate to be available.",
            "displayName": "The OS determines when it's most appropriate to be available.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_textinput_forcetouchkeyboarddockedstate_1",
            "description": "Touch keyboard is always docked.",
            "helpText": null,
            "name": "Touch keyboard is always docked.",
            "displayName": "Touch keyboard is always docked.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_textinput_forcetouchkeyboarddockedstate_2",
            "description": "Touch keyboard docking can be changed.",
            "helpText": null,
            "name": "Touch keyboard docking can be changed.",
            "displayName": "Touch keyboard docking can be changed.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}