{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow SIM Error Dialog Prompt When No SIM",
        "Experience"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Experience#allowsimerrordialogpromptwhennosim"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Experience/AllowSIMErrorDialogPromptWhenNoSIM",
    "rootDefinitionId": "device_vendor_msft_policy_config_experience_allowsimerrordialogpromptwhennosim",
    "categoryId": "139974ad-f615-442b-b3dc-84a44e3ec663",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_experience_allowsimerrordialogpromptwhennosim",
    "description": "Allow SIM error diaglog prompts when no SIM is inserted.",
    "helpText": "",
    "name": "AllowSIMErrorDialogPromptWhenNoSIM",
    "displayName": "Allow SIM Error Dialog Prompt When No SIM",
    "defaultOptionId": "device_vendor_msft_policy_config_experience_allowsimerrordialogpromptwhennosim_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_experience_allowsimerrordialogpromptwhennosim_0",
            "description": "Not allowed.",
            "helpText": null,
            "name": "Not allowed.",
            "displayName": "Not allowed.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_experience_allowsimerrordialogpromptwhennosim_1",
            "description": "Allowed.",
            "helpText": null,
            "name": "Allowed.",
            "displayName": "Allowed.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}