{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DCBatteryDischargeLevel0_2",
        "Critical battery notification level",
        "\\System\\Power Management\\Notification Settings",
        "Administrative Templates\\System\\Power Management\\Notification Settings",
        "Notification Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-power#admx-power-dcbatterydischargelevel0-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/DCBatteryDischargeLevel0_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargelevel0_2",
    "categoryId": "d5585700-13a0-4ab4-9b19-4c15c1ead170",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_power_dcbatterydischargelevel0_2",
    "description": "This policy setting specifies the percentage of battery capacity remaining that triggers the critical battery notification action.\r\n\r\nIf you enable this policy setting, you must enter a numeric value (percentage) to set the battery level that triggers the critical notification.\r\n\r\nTo set the action that is triggered, see the \"Critical Battery Notification Action\" policy setting.\r\n\r\nIf you disable this policy setting or do not configure it, users control this setting.\r\n ",
    "helpText": "",
    "name": "DCBatteryDischargeLevel0_2",
    "displayName": "Critical battery notification level",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargelevel0_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargelevel0_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_dcbatterydischargelevel0_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_power_dcbatterydischargelevel0_2_enterdcbatterydischargelevel0",
                    "required": true
                }
            ]
        }
    ]
}