{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RemoveOutOfSupport",
        "Remove out-of-support components during updates",
        "\\Visual Studio\\Install and Update Settings",
        "Administrative Templates\\Visual Studio\\Install and Update Settings",
        "Install and Update Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov1~Policy~VisualStudio~InstallandUpdateSettings/RemoveOutOfSupport",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_removeoutofsupport",
    "categoryId": "175ddbac-b0ae-4d9d-b76e-4eb1a487fc93",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_removeoutofsupport",
    "description": "This setting will cause updates to automatically remove all components from all Visual Studio installations that have transitioned to an out-of-support state.\r\n        \r\nIf set to 1 (enabled), then the Visual Studio installer will remove all out-of-support components during all subsequent updates.  \r\n        \r\nIf set to 0 (disabled) or missing entirely, then the remove out-of-support components behavior will respect other locations where this can be configured, such as commandline parameter or the Update Settings dialog.\r\n        \r\nThis functionality requires the Visual Studio 2022 version 17.4 installer to be installed on the client machine.        \r\n\r\nFor more information, see http://aka.ms/vs/setup/policies.",
    "helpText": "",
    "name": "RemoveOutOfSupport",
    "displayName": "Remove out-of-support components during updates",
    "defaultOptionId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_removeoutofsupport_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_removeoutofsupport_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_removeoutofsupport_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}