{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_AllowInstallationMicrosoftEdgeWebView",
        "Allow installation",
        "\\Microsoft Edge Update\\Microsoft Edge WebView",
        "Microsoft Edge Update\\Microsoft Edge WebView",
        "Microsoft Edge WebView",
        "Machine",
        "Software\\Policies\\Microsoft\\EdgeUpdate"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev87.Updates.1~Policy~Cat_EdgeUpdate~Cat_WebView/Pol_AllowInstallationMicrosoftEdgeWebView",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev87.updates.1~policy~cat_edgeupdate~cat_webview_pol_allowinstallationmicrosoftedgewebview",
    "categoryId": "43fc9dcc-1e66-4108-bded-2d005eeb7ccb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_updatev87.updates.1~policy~cat_edgeupdate~cat_webview_pol_allowinstallationmicrosoftedgewebview",
    "description": "Lets you specify whether Microsoft Edge WebView can be installed using Microsoft Edge Update.\r\n\r\n  If you enable this policy, users can install Microsoft Edge WebView through Microsoft Edge Update.\r\n\r\n  If you disable this policy (or set it to 'Installs disabled'), users cannot install Microsoft Edge WebView through Microsoft Edge Update.\r\n\r\n  If you set this policy to Always allow Machine-Wide Installs but not Per-User Installs,  Microsoft Edge WebView will only be deployed machine-wide.\r\n\r\n  If you set the policy to Force Installs (Machine-Wide), users can install Microsoft Edge WebView to all machines where Microsoft Edge Update is pre-installed. Requires Microsoft Edge Update 1.3.155.43 or higher.\r\n\r\n  If you don't configure this policy, the 'Allow installation default' policy configuration determines whether users can install Microsoft Edge WebView through Microsoft Edge Update.",
    "helpText": "",
    "name": "Pol_AllowInstallationMicrosoftEdgeWebView",
    "displayName": "Allow installation",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev87.updates.1~policy~cat_edgeupdate~cat_webview_pol_allowinstallationmicrosoftedgewebview_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev87.updates.1~policy~cat_edgeupdate~cat_webview_pol_allowinstallationmicrosoftedgewebview_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev87.updates.1~policy~cat_edgeupdate~cat_webview_pol_allowinstallationmicrosoftedgewebview_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_updatev87.updates.1~policy~cat_edgeupdate~cat_webview_pol_allowinstallationmicrosoftedgewebview_part_installpolicy",
                    "required": true
                }
            ]
        }
    ]
}