{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExcludedCredentialProviders",
        "Exclude credential providers",
        "\\System\\Logon",
        "Administrative Templates\\System\\Logon",
        "Logon",
        "Machine",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-credentialproviders#admx-credentialproviders-excludedcredentialproviders"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_CredentialProviders/ExcludedCredentialProviders",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders",
    "categoryId": "f4fd69bc-8622-411d-91bb-0e214f8fb112",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders",
    "description": "This policy setting allows the administrator to exclude the specified\r\ncredential providers from use during authentication.\r\n\r\nNote: credential providers are used to process and validate user\r\ncredentials during logon or when authentication is required.\r\nWindows Vista provides two default credential providers:\r\nPassword and Smart Card. An administrator can install additional\r\ncredential providers for different sets of credentials\r\n(for example, to support biometric authentication).\r\n\r\nIf you enable this policy, an administrator can specify the CLSIDs\r\nof the credential providers to exclude from the set of installed\r\ncredential providers available for authentication purposes.\r\n\r\nIf you disable or do not configure this policy, all installed and otherwise enabled credential providers are available for authentication purposes.\r\n ",
    "helpText": "",
    "name": "ExcludedCredentialProviders",
    "displayName": "Exclude credential providers",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders_excludedcredentialproviders_message",
                    "required": true
                }
            ]
        }
    ]
}