{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ServerAcceptsCompound",
        "Support compound authentication",
        "\\System\\Kerberos",
        "Administrative Templates\\System\\Kerberos",
        "Kerberos",
        "Machine",
        "Software\\Policies\\Microsoft\\Netlogon\\Parameters",
        "CompoundIdDisabled"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-kerberos#admx-kerberos-serveracceptscompound"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Kerberos/ServerAcceptsCompound",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_kerberos_serveracceptscompound",
    "categoryId": "9b0b8f3b-8e08-4083-9e2b-2e6bfeb01f83",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_kerberos_serveracceptscompound",
    "description": "This policy setting controls configuring the device's Active Directory account for compound authentication.\r\n\r\nSupport for providing compound authentication which is used for access control will require enough domain controllers in the resource account domains to support the requests. The Domain Administrator must configure the policy \"Support Dynamic Access Control and Kerberos armoring\" on all the domain controllers to support this policy.\r\n\r\nIf you enable this policy setting, the device's Active Directory account will be configured for compound authentication by the following options:\r\n\r\nNever: Compound authentication is never provided for this computer account.\r\n\r\nAutomatic: Compound authentication is provided for this computer account when one or more applications are configured for Dynamic Access Control.\r\n\r\nAlways: Compound authentication is always provided for this computer account.\r\n\r\nIf you disable this policy setting, Never will be used.\r\nIf you do not configure this policy setting, Automatic will be used.\r\n\r\n ",
    "helpText": "",
    "name": "ServerAcceptsCompound",
    "displayName": "Support compound authentication",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_kerberos_serveracceptscompound_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_kerberos_serveracceptscompound_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_kerberos_serveracceptscompound_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_kerberos_serveracceptscompound_compoundidenabled",
                    "required": true
                }
            ]
        }
    ]
}