{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_DefaultAllowInstallation",
        "Allow installation default",
        "\\Microsoft Edge Update\\Applications",
        "Microsoft Edge Update\\Applications",
        "Applications",
        "Machine",
        "Software\\Policies\\Microsoft\\EdgeUpdate"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updateUpdates.1~Policy~Cat_EdgeUpdate~Cat_Applications/Pol_DefaultAllowInstallation",
    "rootDefinitionId": "device_vendor_msft_policy_config_updateupdates.1~policy~cat_edgeupdate~cat_applications_pol_defaultallowinstallation",
    "categoryId": "2c7e8e8e-47fe-48ba-8cb4-55ce296edced",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_updateupdates.1~policy~cat_edgeupdate~cat_applications_pol_defaultallowinstallation",
    "description": "You can specify the default behavior of all channels to allow or block Microsoft Edge on domain-joined devices.\r\n\r\nYou can override this policy for individual channels by enabling the 'Allow installation' policy for specific channels.\r\n\r\nIf you disable this policy, the installation of Microsoft Edge is blocked. This only affects the installation of Microsoft Edge software when the 'Allow installation' policy is set to Not Configured.\r\n\r\nThis policy doesn't prevent Microsoft Edge Update from running or prevent users from installing Microsoft Edge software using other methods.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft® Active Directory® domain.",
    "helpText": "",
    "name": "Pol_DefaultAllowInstallation",
    "displayName": "Allow installation default",
    "defaultOptionId": "device_vendor_msft_policy_config_updateupdates.1~policy~cat_edgeupdate~cat_applications_pol_defaultallowinstallation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updateupdates.1~policy~cat_edgeupdate~cat_applications_pol_defaultallowinstallation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updateupdates.1~policy~cat_edgeupdate~cat_applications_pol_defaultallowinstallation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_updateupdates.1~policy~cat_edgeupdate~cat_applications_pol_defaultallowinstallation_part_installpolicy",
                    "required": true
                }
            ]
        }
    ]
}