{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Live Dump",
        "Memory Dump"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/MemoryDump/AllowLiveDump",
    "rootDefinitionId": "device_vendor_msft_policy_config_memorydump_allowlivedump",
    "categoryId": "de9a9583-d660-4bdc-83bc-404c8c488267",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_memorydump_allowlivedump",
    "description": "This policy setting decides if live dump collection on the machine is allowed or not.\n\nSupported values:\n0 - Disable live dump collection.\n1 (default) - Allow live dump collection.",
    "helpText": "",
    "name": "AllowLiveDump",
    "displayName": "Allow Live Dump",
    "defaultOptionId": "device_vendor_msft_policy_config_memorydump_allowlivedump_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_memorydump_allowlivedump_0",
            "description": "Disable live dump collection.",
            "helpText": null,
            "name": "Disable live dump collection.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_memorydump_allowlivedump_1",
            "description": "Allow live dump collection.",
            "helpText": null,
            "name": "Allow live dump collection.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}