{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ViewerMode",
        "Use Viewer Mode",
        "\\Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Licensing Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v6~Policy~L_MicrosoftOfficemachine~L_LicensingSettings/L_ViewerMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v6~policy~l_microsoftofficemachine~l_licensingsettings_l_viewermode",
    "categoryId": "2e3f0407-6387-41b4-b6c2-ada4354be759",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v6~policy~l_microsoftofficemachine~l_licensingsettings_l_viewermode",
    "description": "This policy setting controls whether Office, Project, and Visio open in Viewer mode, which means the user can only view and print the contents of the file. Viewer mode, which is turned off by default, is intended for users who aren’t licensed for Office, Project, or Visio.\r\n\r\nIf you enable this policy setting, Office, Project, and Visio will open in Viewer mode. Also, the Activate Product button under File > Account will be hidden. Note: If you enable this policy setting, you can’t use shared computer activation.\r\n\r\nIf you disable or don’t configure this policy setting, an unlicensed user will be prompted to activate Office, Project, or Visio each time they open the app. If the user doesn’t activate, the user can only view and print the contents of the file.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise, and to subscription versions of Project and Visio.",
    "helpText": "",
    "name": "L_ViewerMode",
    "displayName": "Use Viewer Mode",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v6~policy~l_microsoftofficemachine~l_licensingsettings_l_viewermode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v6~policy~l_microsoftofficemachine~l_licensingsettings_l_viewermode_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v6~policy~l_microsoftofficemachine~l_licensingsettings_l_viewermode_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}