{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LiveShareDomainName",
        "Allow only company domain accounts",
        "\\Visual Studio\\Live Share Settings",
        "Administrative Templates\\Visual Studio\\Live Share Settings",
        "Live Share Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov1~Policy~VisualStudio~LiveShareSettings/LiveShareDomainName",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~livesharesettings_livesharedomainname",
    "categoryId": "d9d5f333-9402-4459-8ef1-e29330cac8be",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~livesharesettings_livesharedomainname_liveshare_domainname_textbox",
    "description": "",
    "helpText": "",
    "name": "LiveShare_DomainName_TextBox",
    "displayName": "Enter Domain Name: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~livesharesettings_livesharedomainname_1",
            "parentSettingId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~livesharesettings_livesharedomainname"
        }
    ],
    "dependedOnBy": []
}