{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WFPDllCacheDir",
        "Specify Windows File Protection cache location",
        "\\System\\Windows File Protection",
        "Administrative Templates\\System\\Windows File Protection",
        "Windows File Protection"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsfileprotection#admx-windowsfileprotection-wfpdllcachedir"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsFileProtection/WFPDllCacheDir",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir",
    "categoryId": "dbb76878-34a9-4f87-bbc6-4de7ea223ff4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir",
    "description": "This policy setting specifies an alternate location for the Windows File Protection cache.\r\n\r\nIf you enable this policy setting, enter the fully qualified local path to the new location in the \"Cache file path\" box.\r\n\r\nIf you disable this setting or do not configure it, the Windows File Protection cache is located in the %Systemroot%\\System32\\Dllcache directory.\r\n\r\nNote: Do not put the cache on a network shared directory.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "WFPDllCacheDir",
    "displayName": "Specify Windows File Protection cache location (Windows Insiders only)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.9",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.21322",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpdllcachedir_wfpdllcachedirbox",
                    "required": true
                }
            ]
        }
    ]
}