{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SharedWorkerBlobURLFixEnabled",
        "Make SharedWorker blob URL behavior aligned with the specification",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/SharedWorkerBlobURLFixEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_sharedworkerbloburlfixenabled",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_sharedworkerbloburlfixenabled",
    "description": "Upon https://w3c.github.io/ServiceWorker/#control-and-use-worker-client,\r\nworkers should inherit controllers for the blob URL.  However, existing code\r\nallows only DedicatedWorkers to inherit the controller, and SharedWorkers do\r\nnot inherit the controller.\r\n\r\nSetting the policy to Enabled or leaving it unset means\r\nGoogle Chrome inherit the controller\r\nif a blob URL is used as a SharedWorker URL.\r\n\r\nSetting the policy to Disabled leaves the behavior not aligned with the\r\nspecification as-is.\r\n\r\nThis policy is intended to be temporary and will be removed in the future.",
    "helpText": "",
    "name": "SharedWorkerBlobURLFixEnabled",
    "displayName": "Make SharedWorker blob URL behavior aligned with the specification",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_sharedworkerbloburlfixenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_sharedworkerbloburlfixenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_sharedworkerbloburlfixenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}