{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "WiFi Connection",
        "WlanXml",
        "Wlan",
        "Wi-Fi Connection"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/wifi-csp"
    ],
    "baseUri": "./device/vendor/msft/wifi",
    "offsetUri": "/profile/{ssid}/wlanxml",
    "rootDefinitionId": "device_vendor_msft_wifi_profile_{ssid}_wlanxml",
    "categoryId": "c4e48b1b-6d88-434f-a717-d5bab28eb245",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_wifi_profile_{ssid}_wlanxml",
    "description": "XML describing the network configuration and follows Windows WLAN_profile schema. Link to schema: http://msdn.microsoft.com/en-us/library/windows/desktop/ms707341(v=vs.85).aspx",
    "helpText": "",
    "name": "WlanXml",
    "displayName": "Wireless security type",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10WiFi/policyJourneyState/0",
    "redirectMessage": "Create a Wi-Fi connection policy",
    "redirectReason": "The \"Wi-Fi connection\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}