{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_HashSupportVersion",
        "Hash Version support for BranchCache",
        "\\Network\\Lanman Server",
        "Administrative Templates\\Network\\Lanman Server",
        "Lanman Server"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LanmanServer/Pol_HashSupportVersion",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion",
    "categoryId": "fd49df1b-bfad-4ed5-85c2-046a32fa8782",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_lbl_hashversionsupportactioncombo",
    "description": null,
    "helpText": "",
    "name": "Lbl_HashVersionSupportActionCombo",
    "displayName": "Hash version supported: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_lbl_hashversionsupportactioncombo_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_lbl_hashversionsupportactioncombo_1",
            "description": null,
            "helpText": null,
            "name": "Supports V1 hash version only",
            "displayName": "Supports V1 hash version only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_lbl_hashversionsupportactioncombo_2",
            "description": null,
            "helpText": null,
            "name": "Supports V2 hash version only",
            "displayName": "Supports V2 hash version only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_lbl_hashversionsupportactioncombo_3",
            "description": null,
            "helpText": null,
            "name": "Supports V1 as well as V2 versions",
            "displayName": "Supports V1 as well as V2 versions",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashsupportversion"
                }
            ],
            "dependedOnBy": []
        }
    ]
}