{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Auto Remediation",
        "Remote Remediation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/RemoteRemediation-csp/"
    ],
    "baseUri": "./Vendor/MSFT/RemoteRemediation",
    "offsetUri": "/CloudRemediationSettings/AutoRemediationSettings/EnableAutoRemediation",
    "rootDefinitionId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation",
    "categoryId": "52e76943-bfc9-4fb5-bdc8-5d4e8c6a436e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation",
    "description": "Enable to automatically check for remediation solutions. Disable to check manually.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "EnableAutoRemediation",
    "displayName": "Enable Auto Remediation (Windows Insiders only)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "88.8.88888",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation_true",
            "description": "Auto remediation enabled",
            "helpText": null,
            "name": "Auto remediation enabled",
            "displayName": "Auto remediation enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation_true",
                    "parentSettingId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_settimetoreboot",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_setretryinterval",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkssid",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkpassword",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkpasswordencryptiontype",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkpasswordencryptionstore",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation_false",
            "description": "Auto remediation disabled",
            "helpText": null,
            "name": "Auto remediation disabled",
            "displayName": "Auto remediation disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation_true",
                    "parentSettingId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation"
                }
            ],
            "dependedOnBy": []
        }
    ]
}