{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Channel_LogFilePath_4",
        "Control the location of the log file",
        "\\Windows Components\\Event Log Service\\System",
        "Administrative Templates\\Windows Components\\Event Log Service\\System",
        "System",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\EventLog\\System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eventlog#admx-eventlog-channel-logfilepath-4"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventLog/Channel_LogFilePath_4",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventlog_channel_logfilepath_4",
    "categoryId": "9d26f3a1-6a54-4043-bda2-bfeb84e80524",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_eventlog_channel_logfilepath_4",
    "description": "This policy setting controls the location of the log file. The location of the file must be writable by the Event Log service and should only be accessible to administrators.\r\n\r\nIf you enable this policy setting, the Event Log uses the path specified in this policy setting.\r\n\r\nIf you disable or do not configure this policy setting, the Event Log uses the folder %SYSTEMROOT%\\System32\\winevt\\Logs.\r\n ",
    "helpText": "",
    "name": "Channel_LogFilePath_4",
    "displayName": "Control the location of the log file",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_eventlog_channel_logfilepath_4_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventlog_channel_logfilepath_4_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventlog_channel_logfilepath_4_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_eventlog_channel_logfilepath_4_channel_logfilepath",
                    "required": true
                }
            ]
        }
    ]
}