{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Find My Files",
        "Search"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Search#allowfindmyfiles"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Search/AllowFindMyFiles",
    "rootDefinitionId": "device_vendor_msft_policy_config_search_allowfindmyfiles",
    "categoryId": "794337be-8833-4b9a-bb88-8a030141578d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_search_allowfindmyfiles",
    "description": "This feature allows you to disable find my files completely on the machine",
    "helpText": "",
    "name": "AllowFindMyFiles",
    "displayName": "Allow Find My Files",
    "defaultOptionId": "device_vendor_msft_policy_config_search_allowfindmyfiles_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_search_allowfindmyfiles_1",
            "description": "Find My Files feature can be toggled (still off by default), and the settings UI is present.",
            "helpText": null,
            "name": "Find My Files feature can be toggled (still off by default), and the settings UI is present.",
            "displayName": "Find My Files feature can be toggled (still off by default), and the settings UI is present.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_search_allowfindmyfiles_0",
            "description": "Find My Files feature is turned off completely, and the settings UI is disabled.",
            "helpText": null,
            "name": "Find My Files feature is turned off completely, and the settings UI is disabled.",
            "displayName": "Find My Files feature is turned off completely, and the settings UI is disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}