{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_ProxyMode",
        "Choose how to specify proxy server settings",
        "\\Microsoft Edge Update\\Proxy Server",
        "Microsoft Edge Update\\Proxy Server",
        "Proxy Server"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/update~Policy~Cat_Google~Cat_GoogleUpdate~Cat_ProxyServer/Pol_ProxyMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode",
    "categoryId": "ff543267-540e-4e37-a1e9-daf6a5e16ba7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode",
    "description": "",
    "helpText": "",
    "name": "Part_ProxyMode",
    "displayName": "Choose how to specify proxy server settings (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode_direct",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode_direct",
            "description": null,
            "helpText": null,
            "name": "Never use a proxy",
            "displayName": "Never use a proxy",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "direct"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode_auto_detect",
            "description": null,
            "helpText": null,
            "name": "Auto detect proxy settings",
            "displayName": "Auto detect proxy settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "auto_detect"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode_pac_script",
            "description": null,
            "helpText": null,
            "name": "Use a .pac proxy script",
            "displayName": "Use a .pac proxy script",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pac_script"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode_fixed_servers",
            "description": null,
            "helpText": null,
            "name": "Use fixed proxy servers",
            "displayName": "Use fixed proxy servers",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fixed_servers"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode_system",
            "description": null,
            "helpText": null,
            "name": "Use system proxy settings",
            "displayName": "Use system proxy settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "system"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}