{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RA_EncryptedTicketOnly",
        "Allow only Windows Vista or later connections",
        "\\System\\Remote Assistance",
        "Administrative Templates\\System\\Remote Assistance",
        "Remote Assistance",
        "Machine",
        "Software\\policies\\Microsoft\\Windows NT\\Terminal Services",
        "CreateEncryptedOnlyTickets"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-remoteassistance#admx-remoteassistance-ra-encryptedticketonly"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemoteAssistance/RA_EncryptedTicketOnly",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_encryptedticketonly",
    "categoryId": "12a1b259-a0d5-4505-aedf-b8ca811cd5f9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_remoteassistance_ra_encryptedticketonly",
    "description": "This policy setting enables Remote Assistance invitations to be generated with improved encryption so that only computers running this version (or later versions) of the operating system can connect. This policy setting does not affect Remote Assistance connections that are initiated by instant messaging contacts or the unsolicited Offer Remote Assistance.\r\n\r\nIf you enable this policy setting, only computers running this version (or later versions) of the operating system can connect to this computer.\r\n\r\nIf you disable this policy setting, computers running this version and a previous version of the operating system can connect to this computer.\r\n\r\nIf you do not configure this policy setting, users can configure the setting in System Properties in the Control Panel.\r\n ",
    "helpText": "",
    "name": "RA_EncryptedTicketOnly",
    "displayName": "Allow only Windows Vista or later connections",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_encryptedticketonly_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_encryptedticketonly_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_remoteassistance_ra_encryptedticketonly_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}