{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_SERVER_REMOTEAPP_USE_SHELLAPPRUNTIME",
        "Enable enhanced shell experience for RemoteApp",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Remote Session Environment",
        "Remote Session Environment"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-remotedesktopservices#remotedesktopservices-ts-server-remoteapp-use-shellappruntime"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteDesktopServices/TS_SERVER_REMOTEAPP_USE_SHELLAPPRUNTIME",
    "rootDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_ts_server_remoteapp_use_shellappruntime",
    "categoryId": "ce572b49-4d47-47b6-b787-ac1252753581",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_remotedesktopservices_ts_server_remoteapp_use_shellappruntime",
    "description": "This policy setting enables an enhanced shell experience for RemoteApp sessions, offering support for default file associations, Run/RunOnce registry keys, and more. This policy setting applies only to RemoteApp sessions and does not apply to Remote Desktop sessions.\r\n\r\nIf you enable or do not configure this policy setting, RemoteApp sessions on RD Session Host servers will have the enhanced shell experience.\r\n\r\nIf you disable this policy setting, RemoteApp sessions will not have the enhanced shell experience and will use the legacy shell behavior. This may be needed if compatibility issues arise in published RemoteApp programs.\r\n    ",
    "helpText": "",
    "name": "TS_SERVER_REMOTEAPP_USE_SHELLAPPRUNTIME",
    "displayName": "Enable enhanced shell experience for RemoteApp",
    "defaultOptionId": "device_vendor_msft_policy_config_remotedesktopservices_ts_server_remoteapp_use_shellappruntime_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.20348.2400",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_remotedesktopservices_ts_server_remoteapp_use_shellappruntime_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remotedesktopservices_ts_server_remoteapp_use_shellappruntime_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}