{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Servicing",
        "Specify settings for optional component installation and component repair",
        "\\System",
        "Administrative Templates\\System",
        "System",
        "Machine",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Servicing"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-servicing#admx-servicing-servicing"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Servicing/Servicing",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_servicing_servicing",
    "categoryId": "fd66cd4e-474b-4d6c-8dec-65a6a49e75d7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_servicing_servicing",
    "description": "\r\nThis policy setting specifies the network locations that will be used for the repair of operating system corruption and for enabling optional features that have had their payload files removed.\r\n\r\nIf you enable this policy setting and specify the new location, the files in that location will be used to repair operating system corruption and for enabling optional features that have had their payload files removed. You must enter the fully qualified path to the new location in the \"Alternate source file path\" text box. Multiple locations can be specified when each path is separated by a semicolon. \r\n\r\nThe network location can be either a folder, or a WIM file. If it is a WIM file, the location should be specified by prefixing the path with “wim:” and include the index of the image to use in the WIM file. For example “wim:\\\\server\\share\\install.wim:3”.\r\n\r\nIf you disable or do not configure this policy setting, or if the required files cannot be found at the locations specified in this policy setting, the files will be downloaded from Windows Update, if that is allowed by the policy settings for the computer.\r\n      \r\n ",
    "helpText": "",
    "name": "Servicing",
    "displayName": "Specify settings for optional component installation and component repair",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_servicing_servicing_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_servicing_servicing_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_servicing_servicing_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_servicing_servicing_localsourcepath_textbox",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_servicing_servicing_checkbox_neverusewu",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_servicing_servicing_checkbox_sidestepwsus",
                    "required": true
                }
            ]
        }
    ]
}