{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultNetworkingMode",
        "Configure default networking mode",
        "\\Windows Subsystem For Linux",
        "Windows Subsystem For Linux"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/WSLv3~Policy~WSL/DefaultNetworkingMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode",
    "categoryId": "57514d69-d9b1-469a-9b54-b5e94320c2a1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode",
    "description": "This policy specifies the default networking mode to be used for WSL2.",
    "helpText": "",
    "name": "DefaultNetworkingMode",
    "displayName": "Configure default networking mode",
    "defaultOptionId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_wslv3~policy~wsl_defaultnetworkingmode_defaultnetworkingmode_dropdown",
                    "required": true
                }
            ]
        }
    ]
}