{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Reporting_Server_Policy",
        "Reporting Server",
        "\\System\\App-V\\Reporting",
        "AppVirtualization",
        "App Virtualization",
        "Reporting"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-appvirtualization#appvirtualization-allowreportingserver"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/AllowReportingServer",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver",
    "categoryId": "48f508a5-5a2c-4d20-8d89-2d352a209907",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver",
    "description": "Reporting Server URL: Displays the URL of reporting server.\r\n\r\n      Reporting Time: When the client data should be reported to the server. Acceptable range is 0~23, corresponding to the 24 hours in a day. A good practice is, don't set this time to a busy hour, e.g. 9AM.\r\n      \r\n      Delay reporting for the random minutes: The maximum minutes of random delay on top of the reporting time. For a busy system, the random delay will help reduce the server load.\r\n      \r\n      Repeat reporting for every (days): The periodical interval in days for sending the reporting data.\r\n      \r\n      Data Cache Limit: This value specifies the maximum size in megabytes (MB) of the XML cache for storing reporting information. The default value is 20 MB. The size applies to the cache in memory. When the limit is reached, the log file will roll over. When a new record is to be added (bottom of the list), one or more of the oldest records (top of the list) will be deleted to make room. A warning will be logged to the Client log and the event log the first time this occurs, and will not be logged again until after the cache has been successfully cleared on transmission and the log has filled up again.\r\n\r\n      Data Block Size: This value specifies the maximum size in bytes to transmit to the server at once on a reporting upload, to avoid permanent transmission failures when the log has reached a significant size. The  default value is 65536. When transmitting report data to the server, one block at a time of application records that is less than or equal to the block size in bytes of XML data will be removed from the cache and sent to the server. Each block will have the general Client data and global package list data prepended, and these will not factor into the block size calculations; the potential exists for an extremely large package list to result in transmission failures over low bandwidth or unreliable connections.\r\n      ",
    "helpText": "",
    "name": "Reporting_Server_Policy",
    "displayName": "Reporting Server",
    "defaultOptionId": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_reporting_server_url_prompt",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_start_time",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_random_delay",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_interval",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_data_cache_limit",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_appvirtualization_allowreportingserver_data_block_size",
                    "required": true
                }
            ]
        }
    ]
}