{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AVD_SERVER_HEVC",
        "Configure H.265/HEVC hardware encoding for Remote Desktop Connections",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Azure Virtual Desktop"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/terminalServer-AVDv2~Policy~AVD_GP_NODE/AVD_SERVER_HEVC",
    "rootDefinitionId": "device_vendor_msft_policy_config_terminalserver-avdv2~policy~avd_gp_node_avd_server_hevc",
    "categoryId": "845ff38a-408b-449c-9ef3-7fdc331027df",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_terminalserver-avdv2~policy~avd_gp_node_avd_server_hevc",
    "description": "This policy setting lets you enable HEVC hardware encoding support for Remote Desktop Connections. \r\n      \r\nWhen you enable HEVC, this policy will supersede the Configure H.264/AVC hardware encoding for Remote Desktop Connections GP. \r\n      \r\nWhen you enable HEVC, if an error occurs, we will attempt to use AVC software encoding. If you disable or do not configure this policy, HEVC will not be leveraged. \r\n      ",
    "helpText": "",
    "name": "AVD_SERVER_HEVC",
    "displayName": "Configure H.265/HEVC hardware encoding for Remote Desktop Connections",
    "defaultOptionId": "device_vendor_msft_policy_config_terminalserver-avdv2~policy~avd_gp_node_avd_server_hevc_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_terminalserver-avdv2~policy~avd_gp_node_avd_server_hevc_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_terminalserver-avdv2~policy~avd_gp_node_avd_server_hevc_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}