{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LocalFontsBlockedForUrls",
        "Block Local Fonts permission on these sites",
        "\\Google\\Google Chrome\\Content settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~ContentSettings/LocalFontsBlockedForUrls",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_localfontsblockedforurls",
    "categoryId": "59d29716-55b0-4014-a458-38b408ff9530",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_localfontsblockedforurls",
    "description": "Sets a list of site url patterns that specify sites which will automatically deny the local fonts permission. This will limit the ability of sites to see information about local fonts.\r\n\r\nFor detailed information on valid site url patterns, please see https://cloud.google.com/docs/chrome-enterprise/policies/url-patterns. Wildcards, *, are allowed. This policy only matches based on origin, so any path in the URL pattern is ignored.\r\n\r\nIf this policy is not set for a site then the policy from DefaultLocalFontsSetting applies to the site, if set, otherwise the permission will follow the browser's defaults and allow users to choose this permission per site.\r\n\r\nExample value:\r\n\r\nhttps://www.example.com\r\n[*.]example.edu",
    "helpText": "",
    "name": "LocalFontsBlockedForUrls",
    "displayName": "Block Local Fonts permission on these sites",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_localfontsblockedforurls_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_localfontsblockedforurls_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_localfontsblockedforurls_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_localfontsblockedforurls_localfontsblockedforurlsdesc",
                    "required": true
                }
            ]
        }
    ]
}