{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RAMResourceControlsEnabled",
        "Enable RAM (memory) resource controls",
        "\\Microsoft Edge\\Performance",
        "Both",
        "Software\\Policies\\Microsoft\\Edge",
        "Performance"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev143~Policy~microsoft_edge~Performance/RAMResourceControlsEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~performance_ramresourcecontrolsenabled",
    "categoryId": "3edb2860-b77b-4240-af16-fb34d45d6ba1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~performance_ramresourcecontrolsenabled",
    "description": "This policy controls whether users can access the RAM (memory) resource control feature. This feature lets users set an individual limit on how much RAM (memory) the browser can use.\r\n\r\nTo set a specific memory limit, use the 'TotalMemoryLimitMb' (Set limit on megabytes of memory a single Microsoft Edge instance can use) policy.\r\n\r\nIf you enable or don't configure this policy, users can enable resource control and set the amount of RAM that Microsoft Edge can use. Browser performance may be affected by low limits.\r\n\r\nIf you disable this policy, users can't use resource control.",
    "helpText": "",
    "name": "RAMResourceControlsEnabled",
    "displayName": "Enable RAM (memory) resource controls",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~performance_ramresourcecontrolsenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~performance_ramresourcecontrolsenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~performance_ramresourcecontrolsenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}