{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Cloud Remediation",
        "Remote Remediation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/RemoteRemediation-csp/"
    ],
    "baseUri": "./Vendor/MSFT/RemoteRemediation",
    "offsetUri": "/CloudRemediationSettings/EnableCloudRemediation",
    "rootDefinitionId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation",
    "categoryId": "52e76943-bfc9-4fb5-bdc8-5d4e8c6a436e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation",
    "description": "Enable or disable cloud remediation.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "EnableCloudRemediation",
    "displayName": "Enable Cloud Remediation (Windows Insiders only)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.25272",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation_true",
            "description": "Cloud remediation enabled",
            "helpText": null,
            "name": "Cloud remediation enabled",
            "displayName": "Cloud remediation enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation_false",
            "description": "Cloud remediation disabled",
            "helpText": null,
            "name": "Cloud remediation disabled",
            "displayName": "Cloud remediation disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}