{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Network Access Remotely Accessible Registry Paths And Subpaths",
        "Local Policies Security Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networkaccess_remotelyaccessibleregistrypathsandsubpaths"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkAccess_RemotelyAccessibleRegistryPathsAndSubpaths",
    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_remotelyaccessibleregistrypathsandsubpaths",
    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_remotelyaccessibleregistrypathsandsubpaths",
    "description": "Network access: Remotely accessible registry paths and subpaths  This security setting determines which registry paths and subpaths can be accessed over the network, regardless of the users or groups listed in the access control list (ACL) of the winreg registry key.  Default:  System\\CurrentControlSet\\Control\\Print\\Printers  System\\CurrentControlSet\\Services\\Eventlog  Software\\Microsoft\\OLAP Server  Software\\Microsoft\\Windows NT\\CurrentVersion\\Print  Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows  System\\CurrentControlSet\\Control\\ContentIndex  System\\CurrentControlSet\\Control\\Terminal Server  System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig  System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration  Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib  System\\CurrentControlSet\\Services\\SysmonLog  System\\CurrentControlSet\\Services\\CertSvc  System\\CurrentControlSet\\Services\\Wins  Caution  Incorrectly editing the registry may severely damage your system. Before making changes to the registry, you should back up any valued data on the computer.  Note: On Windows XP, this security setting was called \"Network access: Remotely accessible registry paths.\" If you configure this setting on a member of the Windows Server 2003 family that is joined to a domain, this setting is inherited by computers running Windows XP, but will appear as the \"Network access: Remotely accessible registry paths\" security option. For more information, see Network access: Remotely accessible registry paths and subpaths.\r\n ",
    "helpText": "",
    "name": "NetworkAccess_RemotelyAccessibleRegistryPathsAndSubpaths",
    "displayName": "Network Access Remotely Accessible Registry Paths And Subpaths",
    "maximumCount": 1000,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621.5126",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}