{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NCSI_DomainLocationDeterminationUrl",
        "Specify domain location determination URL",
        "\\Network\\Network Connectivity Status Indicator",
        "Administrative Templates\\Network\\Network Connectivity Status Indicator",
        "Network Connectivity Status Indicator",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\NetworkConnectivityStatusIndicator\\CorporateConnectivity"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-ncsi#admx-ncsi-ncsi-domainlocationdeterminationurl"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NCSI/NCSI_DomainLocationDeterminationUrl",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_ncsi_ncsi_domainlocationdeterminationurl",
    "categoryId": "de5640ce-1975-407e-a1b6-7eaa164cd159",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_ncsi_ncsi_domainlocationdeterminationurl",
    "description": "This policy setting enables you to specify the HTTPS URL of the corporate website that clients use to determine the current domain location (i.e. whether the computer is inside or outside the corporate network). Reachability of the URL destination indicates that the client location is inside corporate network; otherwise it is outside the network.\r\n ",
    "helpText": "",
    "name": "NCSI_DomainLocationDeterminationUrl",
    "displayName": "Specify domain location determination URL",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_ncsi_ncsi_domainlocationdeterminationurl_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_ncsi_ncsi_domainlocationdeterminationurl_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_ncsi_ncsi_domainlocationdeterminationurl_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_ncsi_ncsi_domainlocationdeterminationurl_ncsi_domainlocationdeterminationurlbox",
                    "required": true
                }
            ]
        }
    ]
}