{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SharePointOnPremPrioritization",
        "Specify the OneDrive location in a hybrid environment",
        "\\OneDrive",
        "OneDrive",
        "One Drive"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv2~Policy~OneDriveNGSC/SharePointOnPremPrioritization",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization_sharepointonpremprioritization_dropdown",
    "description": "",
    "helpText": "",
    "name": "SharePointOnPremPrioritization_Dropdown",
    "displayName": "Authenticate first against: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization_sharepointonpremprioritization_dropdown_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization_sharepointonpremprioritization_dropdown_0",
            "description": null,
            "helpText": null,
            "name": "SharePoint Online",
            "displayName": "SharePoint Online",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization_1",
                    "parentSettingId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization_sharepointonpremprioritization_dropdown_1",
            "description": null,
            "helpText": null,
            "name": "SharePoint Server 2019",
            "displayName": "SharePoint Server 2019",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization_1",
                    "parentSettingId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremprioritization"
                }
            ],
            "dependedOnBy": []
        }
    ]
}