{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CbacAndArmor",
        "KDC support for claims, compound authentication and Kerberos armoring",
        "\\System\\KDC",
        "Administrative Templates\\System\\KDC",
        "KDC",
        "Machine",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\KDC\\Parameters",
        "EnableCbacAndArmor"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-kdc#admx-kdc-cbacandarmor"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_kdc/CbacAndArmor",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor",
    "categoryId": "bc4f0cce-a5cc-44c9-9e50-b504e09e7eb1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor",
    "description": "This policy setting allows you to configure a domain controller to support claims and compound authentication for Dynamic Access Control and Kerberos armoring using Kerberos authentication.\r\n\r\nIf you enable this policy setting, client computers that support claims and compound authentication for Dynamic Access Control and are Kerberos armor-aware will use this feature for Kerberos authentication messages. This policy should be applied to all domain controllers to ensure consistent application of this policy in the domain. \r\n\r\nIf you disable or do not configure this policy setting, the domain controller does not support claims, compound authentication or armoring.\r\n\r\nIf you configure the \"Not supported\" option, the domain controller does not support claims, compound authentication or armoring which is the default behavior for domain controllers running Windows Server 2008 R2 or earlier operating systems.\r\n\r\nNote:  For the following options of this KDC policy to be effective, the Kerberos Group Policy \"Kerberos client support for claims, compound authentication and Kerberos armoring\" must be enabled on supported systems. If the Kerberos policy setting is not enabled, Kerberos authentication messages will not use these features.  \r\n\r\nIf you configure \"Supported\", the domain controller supports claims, compound authentication and Kerberos armoring. The domain controller advertises to Kerberos client computers that the domain is capable of claims and compound authentication for Dynamic Access Control and Kerberos armoring. \r\n\r\nDomain functional level requirements\r\nFor the options \"Always provide claims\" and \"Fail unarmored authentication requests\", when the domain functional level is set to Windows Server 2008 R2 or earlier then domain controllers behave as if the \"Supported\" option is selected. \r\n\r\nWhen the domain functional level is set to Windows Server 2012 then the domain controller advertises to Kerberos client computers that the domain is capable of claims and compound authentication for Dynamic Access Control and Kerberos armoring, and:\r\n   - If you set the \"Always provide claims\" option, always returns claims for accounts and supports the RFC behavior for advertising the flexible authentication secure tunneling (FAST).\r\n   - If you set the \"Fail unarmored authentication requests\" option, rejects unarmored Kerberos messages.\r\n\r\nWarning: When \"Fail unarmored authentication requests\" is set, then client computers which do not support Kerberos armoring will fail to authenticate to the domain controller.\r\n\r\nTo ensure this feature is effective, deploy enough domain controllers that support claims and compound authentication for Dynamic Access Control and are Kerberos armor-aware to handle the authentication requests. Insufficient number of domain controllers that support this policy result in authentication failures whenever Dynamic Access Control or Kerberos armoring is required (that is, the \"Supported\" option is enabled).\r\n\r\nImpact on domain controller performance when this policy setting is enabled:\r\n   - Secure Kerberos domain capability discovery is required resulting in additional message exchanges.\r\n   - Claims and compound authentication for Dynamic Access Control increases the size and complexity of the data in the message which results in more processing time and greater Kerberos service ticket size.\r\n   - Kerberos armoring fully encrypts Kerberos messages and signs Kerberos errors which results in increased processing time, but does not change the service ticket size.\r\n\r\n ",
    "helpText": "",
    "name": "CbacAndArmor",
    "displayName": "KDC support for claims, compound authentication and Kerberos armoring",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_kdc_cbacandarmor_cbacandarmor_levels",
                    "required": true
                }
            ]
        }
    ]
}