{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "FDVDenyWriteAccess_Name",
        "Deny write access to fixed drives not protected by BitLocker",
        "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
        "Fixed Data Drives"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/FixedDrivesRequireEncryption",
    "rootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption",
    "categoryId": "36aafec3-7ffb-4ab9-bef9-b8bb431bf8b3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption",
    "description": "This policy setting determines whether BitLocker protection is required for fixed data drives to be writable on a computer.\r\n\r\nIf you enable this policy setting, all fixed data drives that are not BitLocker-protected will be mounted as read-only. If the drive is protected by BitLocker, it will be mounted with read and write access.\r\n\r\nIf you disable or do not configure this policy setting, all fixed data drives on the computer will be mounted with read and write access.\r\n\r\n      ",
    "helpText": "",
    "name": "FDVDenyWriteAccess_Name",
    "displayName": "Deny write access to fixed drives not protected by BitLocker",
    "defaultOptionId": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}