{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ApprovedEnStorDevices",
        "Configure list of Enhanced Storage devices usable on your computer",
        "\\System\\Enhanced Storage Access",
        "Administrative Templates\\System\\Enhanced Storage Access",
        "Enhanced Storage Access"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-enhancedstorage#admx-enhancedstorage-approvedenstordevices"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EnhancedStorage/ApprovedEnStorDevices",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedenstordevices",
    "categoryId": "71f349a7-1ca3-4945-8c7d-fd68df3759ac",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedenstordevices",
    "description": "This policy setting allows you to configure a list of Enhanced Storage devices by manufacturer and product ID that are usable on your computer.\r\n\r\nIf you enable this policy setting, only Enhanced Storage devices that contain a manufacturer and product ID specified in this policy are usable on your computer.\r\n\r\nIf you disable or do not configure this policy setting, all Enhanced Storage devices are usable on your computer.\r\n ",
    "helpText": "",
    "name": "ApprovedEnStorDevices",
    "displayName": "Configure list of Enhanced Storage devices usable on your computer",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedenstordevices_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedenstordevices_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedenstordevices_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_enhancedstorage_approvedenstordevices_approvedenstordevices_list",
                    "required": true
                }
            ]
        }
    ]
}