{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Fast First Sign In",
        "Authentication"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Authentication#enablefastfirstsignin"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Authentication/EnableFastFirstSignIn",
    "rootDefinitionId": "device_vendor_msft_policy_config_authentication_enablefastfirstsignin",
    "categoryId": "a79b2d36-7dea-4a84-81ef-27f99296bccf",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_authentication_enablefastfirstsignin",
    "description": "Specifies whether new non-admin AAD accounts should auto-connect to pre-created candidate local accounts",
    "helpText": "",
    "name": "EnableFastFirstSignIn",
    "displayName": "Enable Fast First Sign In",
    "defaultOptionId": "device_vendor_msft_policy_config_authentication_enablefastfirstsignin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablefastfirstsignin_0",
            "description": "The feature defaults to the existing SKU and device capabilities.",
            "helpText": null,
            "name": "The feature defaults to the existing SKU and device capabilities.",
            "displayName": "The feature defaults to the existing SKU and device capabilities.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablefastfirstsignin_1",
            "description": "Enabled. Auto-connect new non-admin Azure AD accounts to pre-configured candidate local accounts",
            "helpText": null,
            "name": "Enabled. Auto-connect new non-admin Azure AD accounts to pre-configured candidate local accounts",
            "displayName": "Enabled. Auto-connect new non-admin Azure AD accounts to pre-configured candidate local accounts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_authentication_enablefastfirstsignin_2",
            "description": "Disabled. Do not auto-connect new non-admin Azure AD accounts to pre-configured local accounts",
            "helpText": null,
            "name": "Disabled. Do not auto-connect new non-admin Azure AD accounts to pre-configured local accounts",
            "displayName": "Disabled. Do not auto-connect new non-admin Azure AD accounts to pre-configured local accounts",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}