{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableWindowsBackup",
        "Enable Windows Backup",
        "\\Windows Components\\Sync your settings",
        "Administrative Templates\\Windows Components\\Sync your settings",
        "Sync your settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-settingssync#settingssync-enablewindowsbackup"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/SettingsSync/EnableWindowsBackup",
    "rootDefinitionId": "device_vendor_msft_policy_config_settingssync_enablewindowsbackup",
    "categoryId": "7574a907-5608-491f-8011-c57d487457f4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_settingssync_enablewindowsbackup",
    "description": "This policy setting allows administrators to configure and manage windows backup for their organization.\r\n\r\nIf you enable this policy setting, windows backup will occur periodically.\r\n\r\nIf you disable or do not configure this policy setting, windows backup will not take place.\r\n      ",
    "helpText": "",
    "name": "EnableWindowsBackup",
    "displayName": "Enable Windows Backup",
    "defaultOptionId": "device_vendor_msft_policy_config_settingssync_enablewindowsbackup_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.6141",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_settingssync_enablewindowsbackup_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_settingssync_enablewindowsbackup_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}