{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShutdownTimeoutHungSessionsDescription",
        "Timeout for hung logon sessions during shutdown",
        "\\Windows Components\\Shutdown Options",
        "Administrative Templates\\Windows Components\\Shutdown Options",
        "Shutdown Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-wininit#admx-wininit-shutdowntimeouthungsessionsdescription"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WinInit/ShutdownTimeoutHungSessionsDescription",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription",
    "categoryId": "60a3188c-7ee3-40db-8f9f-33648dc74555",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription",
    "description": "This policy setting configures the number of minutes the system waits for the hung logon sessions before proceeding with the system shutdown.\r\n\r\nIf you enable this policy setting, the system waits for the hung logon sessions for the number of minutes specified.\r\n\r\nIf you disable or do not configure this policy setting, the default timeout value is 3 minutes for workstations and 15 minutes for servers.\r\n ",
    "helpText": "",
    "name": "ShutdownTimeoutHungSessionsDescription",
    "displayName": "Timeout for hung logon sessions during shutdown",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_wininit_shutdowntimeouthungsessionsdescription_shutdownsessiontimeout_time",
                    "required": true
                }
            ]
        }
    ]
}