{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Attack Surface Reduction Rules",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Defender/AttackSurfaceReductionRules",
    "rootDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription",
    "description": "This rule prevents malware from abusing WMI to attain persistence on a device. Fileless threats employ various tactics to stay hidden, to avoid being seen in the file system, and to gain periodic execution control. Some threats can abuse the WMI repository and event model to stay hidden.",
    "helpText": "",
    "name": "BlockPersistenceThroughWMIEventSubscription",
    "displayName": "Block persistence through WMI event subscription",
    "defaultOptionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_off",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_off",
            "description": null,
            "helpText": null,
            "name": "Off",
            "displayName": "Off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "e6db77e5-3df2-4cf1-b95a-636979351e5b=0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_block",
            "description": null,
            "helpText": null,
            "name": "Block",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "e6db77e5-3df2-4cf1-b95a-636979351e5b=1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_audit",
            "description": null,
            "helpText": null,
            "name": "Audit",
            "displayName": "Audit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "e6db77e5-3df2-4cf1-b95a-636979351e5b=2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_warn",
            "description": null,
            "helpText": null,
            "name": "Warn",
            "displayName": "Warn",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "e6db77e5-3df2-4cf1-b95a-636979351e5b=6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": []
        }
    ]
}