{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SharePointOnPremFrontDoorUrl",
        "Specify SharePoint Server URL and organization name",
        "\\OneDrive",
        "OneDrive",
        "One Drive",
        "Machine",
        "SOFTWARE\\Policies\\Microsoft\\OneDrive"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv2~Policy~OneDriveNGSC/SharePointOnPremFrontDoorUrl",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremfrontdoorurl",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremfrontdoorurl",
    "description": "This setting lets you enable users to use the OneDrive sync app (OneDrive.exe) to sync files in SharePoint Server 2019. The URL defines the location of the SharePoint Server and enables the sync app to authenticate and set up sync. The organization name lets you specify the OneDrive and SharePoint folder names that will be created in File Explorer. The organization name is optional. If you don't provide it, the sync app will use the first segment of the URL as the name. For example, office.sharepoint.com would become \"Office,\" and the OneDrive folder name would be \"OneDrive - Office.\"\r\n\r\nIf you enable this setting and provide the SharePoint Server URL, users will be able to sync files in SharePoint Server 2019.\r\n\r\nIf you disable or do not configure this setting, or do not provide the SharePoint Server URL, users will not be able to sync files in SharePoint Server 2019. ",
    "helpText": "",
    "name": "SharePointOnPremFrontDoorUrl",
    "displayName": "Specify SharePoint Server URL and organization name",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremfrontdoorurl_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremfrontdoorurl_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremfrontdoorurl_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremfrontdoorurl_sharepointonpremfrontdoorurlbox",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_sharepointonpremfrontdoorurl_sharepointonpremtenantnamebox",
                    "required": true
                }
            ]
        }
    ]
}