{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "ViewXFAPDFInIEModeAllowedOrigins",
        "View XFA-based PDF files using IE Mode for allowed file origin.",
        "\\Microsoft Edge\\PDF Reader",
        "Microsoft Edge\\PDF Reader",
        "PDF Reader"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev132~Policy~microsoft_edge~pdf/ViewXFAPDFInIEModeAllowedOrigins",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~pdf_viewxfapdfiniemodeallowedorigins",
    "categoryId": "b3c8c6d9-28bb-475a-9353-4a0e657b33c7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~pdf_viewxfapdfiniemodeallowedorigins_viewxfapdfiniemodeallowedoriginsdesc",
    "description": "",
    "helpText": "",
    "name": "ViewXFAPDFInIEModeAllowedOriginsDesc",
    "displayName": "View XFA-based PDF files using IE Mode for allowed file origin. (Device)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~pdf_viewxfapdfiniemodeallowedorigins_1",
            "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev132~policy~microsoft_edge~pdf_viewxfapdfiniemodeallowedorigins"
        }
    ],
    "dependedOnBy": []
}