{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShutdownReason",
        "Display Shutdown Event Tracker",
        "\\System",
        "Administrative Templates\\System",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-reliability#admx-reliability-shutdownreason"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Reliability/ShutdownReason",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason",
    "categoryId": "fd66cd4e-474b-4d6c-8dec-65a6a49e75d7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_reliability_shutdownreason",
    "description": "The Shutdown Event Tracker can be displayed when you shut down a workstation or server.  This is an extra set of questions that is displayed when you invoke a shutdown to collect information related to why you are shutting down the computer.\r\n\r\nIf you enable this setting and choose \"Always\" from the drop-down menu list, the Shutdown Event Tracker is displayed when the computer shuts down.\r\n\r\nIf you enable this policy setting and choose \"Server Only\" from the drop-down menu list, the Shutdown Event Tracker is displayed when you shut down a computer running Windows Server. (See \"Supported on\" for supported versions.)\r\n\r\nIf you enable this policy setting and choose \"Workstation Only\" from the drop-down menu list, the Shutdown Event Tracker is displayed when you shut down a computer running a client version of Windows. (See \"Supported on\" for supported versions.)\r\n\r\nIf you disable this policy setting, the Shutdown Event Tracker is not displayed when you shut down the computer.\r\n\r\nIf you do not configure this policy setting, the default behavior for the Shutdown Event Tracker occurs.\r\n\r\nNote: By default, the Shutdown Event Tracker is only displayed on computers running Windows Server.\r\n ",
    "helpText": "",
    "name": "ShutdownReason",
    "displayName": "Display Shutdown Event Tracker",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_reliability_shutdownreason_shutdownreason_box",
                    "required": true
                }
            ]
        }
    ]
}