{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Attack Surface Reduction Rules",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Defender/AttackSurfaceReductionRules",
    "rootDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers",
    "description": "This rule prevents an application from writing a vulnerable signed driver to disk. In-the-wild, vulnerable signed drivers can be exploited by local applications - that have sufficient privileges - to gain access to the kernel. Vulnerable signed drivers enable attackers to disable or circumvent security solutions, eventually leading to system compromise. The Block abuse of exploited vulnerable signed drivers rule does not block a driver already existing on the system from being loaded.",
    "helpText": "",
    "name": "BlockAbuseOfExploitedVulnerableSignedDrivers",
    "displayName": "Block abuse of exploited vulnerable signed drivers (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_off",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_off",
            "description": null,
            "helpText": null,
            "name": "Off",
            "displayName": "Off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "56a863a9-875e-4185-98a7-b882c64b5ce5=0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_block",
            "description": null,
            "helpText": null,
            "name": "Block",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "56a863a9-875e-4185-98a7-b882c64b5ce5=1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_perruleexclusions",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_audit",
            "description": null,
            "helpText": null,
            "name": "Audit",
            "displayName": "Audit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "56a863a9-875e-4185-98a7-b882c64b5ce5=2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_perruleexclusions",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_warn",
            "description": null,
            "helpText": null,
            "name": "Warn",
            "displayName": "Warn",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "56a863a9-875e-4185-98a7-b882c64b5ce5=6"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "parentSettingId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules"
                }
            ],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_perruleexclusions",
                    "required": false
                }
            ]
        }
    ]
}