{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_VLtoSubscription",
        "Upgrade Office 2019 to Office 365 ProPlus",
        "\\Microsoft Office 2016 (Machine)\\Updates",
        "Microsoft Office 2016 (Machine)\\Updates",
        "Updates"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_Updates/L_VLtoSubscription",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_vltosubscription",
    "categoryId": "86dae9f9-7eb1-4566-8558-b63fa2e20fee",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_vltosubscription",
    "description": "This policy setting allows you to upgrade volume licensed versions of Office Professional Plus 2019 to Office 365 ProPlus.\r\n\r\nNote: For the user to be able to use Office 365 ProPlus, you must have purchased an Office 365 plan that includes Office 365 ProPlus, and you must have assigned the user a license to use Office 365 ProPlus.\r\n\r\nIf you enable this policy setting, the installed volume licensed version of Office 2019 on the user's computer will be upgraded to Office 365 ProPlus.  We also recommend that you use Group Policy to specify an update path and an update channel for Office 365 ProPlus.\r\n\r\nNote: If there are volume licensed versions of Visio and Project on the user's computer, those won't be upgraded to Office 365 subscription versions.\r\n\r\nIf you disable or don't configure this policy setting, Office 2019 isn't automatically upgraded to Office 365 ProPlus. But, you can initiate the upgrade by using some other method, such as by using the Office Deployment Tool.",
    "helpText": "",
    "name": "L_VLtoSubscription",
    "displayName": "Upgrade Office 2019 to Office 365 ProPlus",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_vltosubscription_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_vltosubscription_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_vltosubscription_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}