{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_CLIENT_CLIPBOARDRESTRICTION_SC",
        "Restrict clipboard transfer from server to client",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Device and Resource Redirection",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Device and Resource Redirection",
        "Device and Resource Redirection"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-remotedesktopservices#remotedesktopservices-limitservertoclientclipboardredirection"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/RemoteDesktopServices/LimitServerToClientClipboardRedirection",
    "rootDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection",
    "categoryId": "fe52de11-190e-4429-96c1-106b22724456",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection",
    "description": "This policy setting allows you to restrict clipboard data transfers from server to client.\r\n\r\nIf you enable this policy setting, you must choose from the following behaviors:\r\n\r\n- Disable clipboard transfers from server to client.\r\n\r\n- Allow plain text copying from server to client.\r\n\r\n- Allow plain text and images copying from server to client.\r\n\r\n- Allow plain text, images and Rich Text Format copying from server to client.\r\n\r\n- Allow plain text, images, Rich Text Format and HTML copying from server to client.\r\n\r\nIf you disable or do not configure this policy setting, users can copy arbitrary contents from server to client if clipboard redirection is enabled.\r\n\r\nNote: This policy setting appears in both Computer Configuration and User Configuration. If both policy settings are configured, the stricter restriction will be used.\r\n\r\n ",
    "helpText": "",
    "name": "TS_CLIENT_CLIPBOARDRESTRICTION_SC",
    "displayName": "Restrict clipboard transfer from server to client",
    "defaultOptionId": "device_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.20348.2523",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_remotedesktopservices_limitservertoclientclipboardredirection_ts_sc_clipboard_restriction_text",
                    "required": true
                }
            ]
        }
    ]
}