{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SerialAskForUrls",
        "Allow the Serial API on specific sites",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev86~Policy~microsoft_edge/SerialAskForUrls",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev86~policy~microsoft_edge_serialaskforurls",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev86~policy~microsoft_edge_serialaskforurls",
    "description": "Define a list of sites, based on URL patterns, that can ask the user for access to a serial port.\r\n\r\nIf you don't configure this policy, the global default value from the 'DefaultSerialGuardSetting' (Control use of the Serial API) policy (if set) or the user's personal configuration is used for all sites.\r\n\r\nFor URL patterns that don't match this policy, the following order of precedence is used: The 'SerialBlockedForUrls' (Block the Serial API on specific sites) policy (if there is a match), the 'DefaultSerialGuardSetting' policy (if set), or the user's personal settings.\r\n\r\nThe URL patterns defined in this policy can't conflict with those configured in the 'SerialBlockedForUrls' policy. You can't allow and block a URL.\r\n\r\nFor detailed information about valid url patterns, please see https://go.microsoft.com/fwlink/?linkid=2095322.\r\n\r\nExample value:\r\n\r\nhttps://www.contoso.com\r\n[*.]contoso.edu",
    "helpText": "",
    "name": "SerialAskForUrls",
    "displayName": "Allow the Serial API on specific sites",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev86~policy~microsoft_edge_serialaskforurls_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev86~policy~microsoft_edge_serialaskforurls_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev86~policy~microsoft_edge_serialaskforurls_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev86~policy~microsoft_edge_serialaskforurls_serialaskforurlsdesc",
                    "required": true
                }
            ]
        }
    ]
}