{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AVD_SERVER_WATERMARKING",
        "Enable watermarking",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Azure Virtual Desktop"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/terminalServer-AVDv1~Policy~AVD_GP_NODE/AVD_SERVER_WATERMARKING",
    "rootDefinitionId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking",
    "categoryId": "845ff38a-408b-449c-9ef3-7fdc331027df",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking",
    "description": "This policy setting allows you to specify whether watermarking is enabled for a remote session.\r\nIf you enable this policy setting, then the RD Session Host server will instruct the client to project the watermarking QR code in a remote session. \r\n\r\nIf client is not compatible with watermarking, then connection will be denied.\r\n\r\nIf you disable or do not configure this policy setting, then the watermarking will be disabled.\r\n            ",
    "helpText": "",
    "name": "AVD_SERVER_WATERMARKING",
    "displayName": "[Deprecated] Enable watermarking",
    "defaultOptionId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "88.8.88888",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking_part_watermarkingqrscale",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking_part_watermarkingopacity",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking_part_watermarkingwidthfactor",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_watermarking_part_watermarkingheightfactor",
                    "required": true
                }
            ]
        }
    ]
}