{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Channel_Log_AutoBackup_1",
        "Back up log automatically when full",
        "\\Windows Components\\Event Log Service\\Application",
        "Administrative Templates\\Windows Components\\Event Log Service\\Application",
        "Application",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\EventLog\\Application",
        "AutoBackupLogFiles"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eventlog#admx-eventlog-channel-log-autobackup-1"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventLog/Channel_Log_AutoBackup_1",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_autobackup_1",
    "categoryId": "de8dd733-3bb6-4ce5-9f93-475caac1862c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_eventlog_channel_log_autobackup_1",
    "description": "This policy setting controls Event Log behavior when the log file reaches its maximum size and takes effect only if the \"Retain old events\" policy setting is enabled.\r\n\r\nIf you enable this policy setting and the \"Retain old events\" policy setting is enabled, the Event Log file is automatically closed and renamed when it is full. A new file is then started.\r\n\r\nIf you disable this policy setting and the \"Retain old events\" policy setting is enabled, new events are discarded and old events are retained.\r\n\r\nIf you do not configure this policy setting and the \"Retain old events\" policy setting is enabled, new events are discarded and the old events are retained.\r\n ",
    "helpText": "",
    "name": "Channel_Log_AutoBackup_1",
    "displayName": "Back up log automatically when full",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_autobackup_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_autobackup_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_eventlog_channel_log_autobackup_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}