{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Boot To Cloud Shared PC Mode",
        "Cloud Desktop"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/CloudDesktop-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/CloudDesktop",
    "offsetUri": "/EnableBootToCloudSharedPCMode",
    "rootDefinitionId": "device_vendor_msft_clouddesktop_enableboottocloudsharedpcmode",
    "categoryId": "39e4c352-be9c-4e75-8111-8236279c7f1e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_clouddesktop_enableboottocloudsharedpcmode",
    "description": "Setting this node to \"true\" configures boot to cloud for Shared PC mode. Boot to cloud mode enables users to seamlessly sign-in to a Cloud PC. Shared PC mode allows multiple users to sign-in on the device and use for shared purpose. For enabling boot to cloud shared pc feature, Cloud Provider application must be installed on the PC and the user must have a Cloud PC provisioned.\r\n ",
    "helpText": "",
    "name": "EnableBootToCloudSharedPCMode",
    "displayName": "[Deprecated] Enable Boot To Cloud Shared PC Mode",
    "defaultOptionId": "device_vendor_msft_clouddesktop_enableboottocloudsharedpcmode_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "88.8.88888",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "holographicForBusiness",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_clouddesktop_enableboottocloudsharedpcmode_false",
            "description": "Not configured",
            "helpText": null,
            "name": "Not configured",
            "displayName": "Not configured",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_clouddesktop_enableboottocloudsharedpcmode_true",
            "description": "Boot to cloud shared pc mode enabled",
            "helpText": null,
            "name": "Boot to cloud shared pc mode enabled",
            "displayName": "Boot to cloud shared pc mode enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}