{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "SetHoursToLimitForegroundDownloadBandwidth",
        "Set Business Hours to Limit Foreground Download Bandwidth",
        "\\Windows Components\\Delivery Optimization",
        "Administrative Templates\\Windows Components\\Delivery Optimization",
        "Delivery Optimization"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeliveryOptimization/DOSetHoursToLimitForegroundDownloadBandwidth",
    "rootDefinitionId": "device_vendor_msft_policy_config_deliveryoptimization_dosethourstolimitforegrounddownloadbandwidth",
    "categoryId": "e2ec9af6-6143-4cd8-952c-1b3e849ee0dc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_deliveryoptimization_dosethourstolimitforegrounddownloadbandwidth_sethourstolimitforegrounddownloadbandwidthout",
    "description": "",
    "helpText": "",
    "name": "SetHoursToLimitForegroundDownloadBandwidthOut",
    "displayName": "\r\nMaximum Foreground Download Bandwidth (percentage) outside of Business Hours:\r\n",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 100,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_deliveryoptimization_dosethourstolimitforegrounddownloadbandwidth_1",
            "parentSettingId": "device_vendor_msft_policy_config_deliveryoptimization_dosethourstolimitforegrounddownloadbandwidth"
        }
    ],
    "dependedOnBy": []
}