{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrintPostScriptMode",
        "Print PostScript Mode",
        "\\Google\\Google Chrome\\Printing",
        "Administrative Templates\\Google\\Google Chrome\\Printing",
        "Printing",
        "Both",
        "Software\\Policies\\Google\\Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~Printing/PrintPostScriptMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printpostscriptmode",
    "categoryId": "62499519-97eb-43e7-ae96-d7909c5820d3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printpostscriptmode",
    "description": "Controls how Google Chrome prints on Microsoft® Windows®.\r\n\r\nWhen printing to a PostScript printer on Microsoft® Windows® different PostScript generation methods can affect printing performance.\r\n\r\nWhen this policy is set to Default, Google Chrome will use a set of default options when generating PostScript. For text in particular, text will always be rendered using Type 3 fonts.\r\n\r\nWhen this policy is set to Type42, Google Chrome will render text using Type 42 fonts if possible. This should increase printing speed for some PostScript printers.\r\n\r\nWhen this policy is not set, Google Chrome will be in Default mode.",
    "helpText": "",
    "name": "PrintPostScriptMode",
    "displayName": "Print PostScript Mode",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printpostscriptmode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printpostscriptmode_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printpostscriptmode_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printpostscriptmode_printpostscriptmode",
                    "required": true
                }
            ]
        }
    ]
}