{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IdleTimeoutActions",
        "Actions to run when the computer is idle",
        "\\Microsoft Edge\\Idle Browser Actions",
        "Microsoft Edge\\Idle Browser Actions",
        "Idle Browser Actions"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev134~Policy~microsoft_edge~BrowserIdle/IdleTimeoutActions",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeoutactions",
    "categoryId": "526e363a-84db-4256-a13c-e01c8c646e26",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeoutactions",
    "description": "List of actions to run when the timeout from the IdleTimeout policy is reached.\r\n\r\nIf the IdleTimeout policy is unset, this policy has no effect.\r\n\r\nWhen the timeout from the IdleTimeout policy is reached, the browser runs the actions configured in this policy.\r\n\r\nIf you do not set this policy or no actions are selected, the IdleTimeout policy has no effect.\r\n\r\nSupported actions are:\r\n\r\n'close_browsers': close all browser windows and PWAs for this profile.\r\n\r\n'reload_pages': reload all webpages. For some pages, the user may be prompted for confirmation first.\r\n\r\n'clear_browsing_history', 'clear_download_history', 'clear_cookies_and_other_site_data', 'clear_cached_images_and_files', 'clear_password_signing', 'clear_autofill', 'clear_site_settings': clear the corresponding browsing data.\r\n\r\nSetting 'clear_browsing_history', 'clear_password_signing', 'clear_autofill', and 'clear_site_settings' will disable sync for the respective data types if neither `Chrome Sync` is disabled by setting the SyncDisabled policy nor BrowserSignin is disabled.\r\n\r\nPolicy options mapping:\r\n\r\n* close_browsers (close_browsers) = Close Browsers\r\n\r\n* clear_browsing_history (clear_browsing_history) = Clear Browsing History\r\n\r\n* clear_download_history (clear_download_history) = Clear Download History\r\n\r\n* clear_cookies_and_other_site_data (clear_cookies_and_other_site_data) = Clear Cookies and Other Site Data\r\n\r\n* clear_cached_images_and_files (clear_cached_images_and_files) = Clear Cached Images and Files\r\n\r\n* clear_password_signin (clear_password_signin) = Clear Password Signin\r\n\r\n* clear_autofill (clear_autofill) = Clear Autofill\r\n\r\n* clear_site_settings (clear_site_settings) = Clear Site Settings\r\n\r\n* reload_pages (reload_pages) = Reload Pages\r\n\r\nUse the preceding information when configuring this policy.\r\n\r\nExample value:\r\n\r\nclose_browsers",
    "helpText": "",
    "name": "IdleTimeoutActions",
    "displayName": "Actions to run when the computer is idle",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeoutactions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeoutactions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeoutactions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge~browseridle_idletimeoutactions_idletimeoutactionsdesc",
                    "required": true
                }
            ]
        }
    ]
}