{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ConfigCIPolicy",
        "Deploy Windows Defender Application Control",
        "\\System\\Device Guard",
        "Administrative Templates\\System\\Device Guard",
        "Device Guard"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-deviceguard#admx-deviceguard-configcipolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DeviceGuard/ConfigCIPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_deviceguard_configcipolicy",
    "categoryId": "df0be435-d790-485a-b355-6f00eae29511",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_deviceguard_configcipolicy",
    "description": "Deploy Windows Defender Application Control\r\n\r\nThis policy setting lets you deploy a Code Integrity Policy to a machine to control what is allowed to run on that machine.\r\n\r\nIf you deploy a Code Integrity Policy, Windows will restrict what can run in both kernel mode and on the Windows Desktop based on the policy. To enable this policy the machine must be rebooted. \r\n\r\nThe file path must be either a UNC path (for example, \\\\ServerName\\ShareName\\SIPolicy.p7b), or a locally valid path (for example, C:\\FolderName\\SIPolicy.p7b).  The local machine account (LOCAL SYSTEM) must have access permission to the policy file.\r\n \r\nIf using a signed and protected policy then disabling this policy setting doesn't remove the feature from the computer. Instead, you must either:\r\n\r\n   1) first update the policy to a non-protected policy and then disable the setting, or\r\n   2) disable the setting and then remove the policy from each computer, with a physically present user.\r\n      \r\n ",
    "helpText": "",
    "name": "ConfigCIPolicy",
    "displayName": "Deploy App Control for Business",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_deviceguard_configcipolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_deviceguard_configcipolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_deviceguard_configcipolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_deviceguard_configcipolicy_configcipolicyfilepathtext",
                    "required": true
                }
            ]
        }
    ]
}