{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PruningRetryLog",
        "Log directory pruning retry events",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-printing2#admx-printing2-pruningretrylog"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Printing2/PruningRetryLog",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_printing2_pruningretrylog",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_printing2_pruningretrylog",
    "description": "Specifies whether or not to log events when the pruning service on a domain controller attempts to contact a computer before pruning the computer's printers.\r\n\r\n          The pruning service periodically contacts computers that have published printers to verify that the printers are still available for use. If a computer does not respond to the contact attempt, the attempt is retried a specified number of times, at a specified interval. The \"Directory pruning retry\" setting determines the number of times the attempt is retried; the default value is two retries. The \"Directory Pruning Interval\" setting determines the time interval between retries; the default value is every eight hours. If the computer has not responded by the last contact attempt, its printers are pruned from the directory.\r\n\r\n          If you enable this policy setting, the contact events are recorded in the event log.\r\n\r\n          If you disable or do not configure this policy setting, the contact events are not recorded in the event log.\r\n\r\n          Note: This setting does not affect the logging of pruning events; the actual pruning of a printer is always logged.\r\n\r\n          Note: This setting is used only on domain controllers.\r\n ",
    "helpText": "",
    "name": "PruningRetryLog",
    "displayName": "Log directory pruning retry events",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_printing2_pruningretrylog_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretrylog_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_printing2_pruningretrylog_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}