{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AdministratorUpdatesNotifications",
        "Display administrator update notifications",
        "\\Visual Studio\\Install and Update Settings",
        "Visual Studio\\Install and Update Settings",
        "Install and Update Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov3~Policy~VisualStudio~InstallandUpdateSettings/AdministratorUpdatesNotifications",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov3~policy~visualstudio~installandupdatesettings_administratorupdatesnotifications",
    "categoryId": "175ddbac-b0ae-4d9d-b76e-4eb1a487fc93",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_visualstudiov3~policy~visualstudio~installandupdatesettings_administratorupdatesnotifications",
    "description": "This setting enables Visual Studio to provide administrator update prompts and status information to end users via the Windows toast notification feature.  \r\n \r\nIf set to a 1 (enabled), then Visual Studio will display administrator update notifications.  \r\n\r\nThe Visual Studio administrator update notifications will report administrator update success or failure. In the case of administrator update failure, these notifications will provide information as to what the problem is, which should help facilitate diagnosis and resolution. One common reason that Visual Studio administrator updates fail to apply is because Visual Studio is open and in use. In this situation, the administrator update notifications will also prompt the user to close Visual Studio so that the administrator update can then be applied.  \r\n\r\nThe administrator update notifications are governed by the settings that control Windows toast notifications on the client machine. \r\n\r\nFor more information, see https://aka.ms/vs/admin/updates/control.",
    "helpText": "",
    "name": "AdministratorUpdatesNotifications",
    "displayName": "Display administrator update notifications",
    "defaultOptionId": "device_vendor_msft_policy_config_visualstudiov3~policy~visualstudio~installandupdatesettings_administratorupdatesnotifications_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov3~policy~visualstudio~installandupdatesettings_administratorupdatesnotifications_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov3~policy~visualstudio~installandupdatesettings_administratorupdatesnotifications_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}