{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Automatic Account Management Target",
        "LAPS"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/LAPS-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/LAPS",
    "offsetUri": "/Policies/AutomaticAccountManagementTarget",
    "rootDefinitionId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled",
    "categoryId": "f1dcf7b6-2d89-41bf-b5eb-02a879c6db5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_laps_policies_automaticaccountmanagementtarget",
    "description": "Use this setting to configure which account is automatically managed.\n\nThe allowable settings are:\n\n0=The builtin administrator account will be managed.\n1=A new account created by Windows LAPS will be managed.\n\nIf not specified, this setting will default to 1.",
    "helpText": "",
    "name": "AutomaticAccountManagementTarget",
    "displayName": "Automatic Account Management Target",
    "defaultOptionId": "device_vendor_msft_laps_policies_automaticaccountmanagementtarget_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_laps_policies_automaticaccountmanagementtarget_0",
            "description": "Manage the built-in administrator account",
            "helpText": null,
            "name": "Manage the built-in administrator account",
            "displayName": "Manage the built-in administrator account",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_true",
                    "parentSettingId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_laps_policies_automaticaccountmanagementtarget_1",
            "description": "Manage a new custom administrator account",
            "helpText": null,
            "name": "Manage a new custom administrator account",
            "displayName": "Manage a new custom administrator account",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_true",
                    "parentSettingId": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled"
                }
            ],
            "dependedOnBy": []
        }
    ]
}