{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RoamRecycleBin",
        "Roam Recycle Bin",
        "\\FSLogix",
        "Administrative Templates\\FSLogix",
        "FS Logix",
        "FSLogix"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix/RoamRecycleBin",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_roamrecyclebin",
    "categoryId": "e099d9e1-4ffa-42ed-a250-5fd7875469f2",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_roamrecyclebin",
    "description": "[ENABLED BY DEFAULT]\r\n\r\nNOTE:  Once this policy is Enabled or Disabled, setting it back to Not Configured has NO EFFECT.\r\n\r\nCreates a redirection for the user's specific Recycle Bin into the VHD(x) container. Limited to the Recycle Bin on the System Drive only.\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\FSLogix\\Apps\\RoamRecycleBin\r\nType:  DWORD\r\nValues: 0 = Disabled, 1 = Enabled",
    "helpText": "",
    "name": "RoamRecycleBin",
    "displayName": "Roam Recycle Bin",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_roamrecyclebin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_roamrecyclebin_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix_roamrecyclebin_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}