{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableAutoExclusions",
        "Turn off Auto Exclusions",
        "\\Windows Components\\Microsoft Defender Antivirus\\Exclusions",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Exclusions",
        "Exclusions"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-microsoftdefenderantivirus#admx-microsoftdefenderantivirus-disableautoexclusions"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/DisableAutoExclusions",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_disableautoexclusions",
    "categoryId": "edba50d5-da3c-48cb-8e50-381ad0bfaaaf",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_disableautoexclusions",
    "description": "\r\n        Allows an administrator to specify if Automatic Exclusions feature for Server SKUs should be turned off.\r\n\r\n        Disabled (Default):\r\n        Microsoft Defender will exclude pre-defined list of paths from the scan to improve performance.\r\n\r\n        Enabled:\r\n        Microsoft Defender will not exclude pre-defined list of paths from scans. This can impact machine performance in some scenarios.\r\n\r\n        Not configured:\r\n        Same as Disabled.\r\n    \r\n ",
    "helpText": "",
    "name": "DisableAutoExclusions",
    "displayName": "Turn off Auto Exclusions",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_disableautoexclusions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_disableautoexclusions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_disableautoexclusions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}