{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WFPScan",
        "Set Windows File Protection scanning",
        "\\System\\Windows File Protection",
        "Administrative Templates\\System\\Windows File Protection",
        "Windows File Protection"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsFileProtection/WFPScan",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan",
    "categoryId": "dbb76878-34a9-4f87-bbc6-4de7ea223ff4",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_wfpscanlist",
    "description": "\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "WFPScanList",
    "displayName": "Scanning frequency: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_wfpscanlist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.9",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.21322",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_wfpscanlist_0",
            "description": null,
            "helpText": null,
            "name": "Do not scan during startup",
            "displayName": "Do not scan during startup",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_wfpscanlist_1",
            "description": null,
            "helpText": null,
            "name": "Scan during startup",
            "displayName": "Scan during startup",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan"
                }
            ],
            "dependedOnBy": []
        }
    ]
}