{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Set Max Connection Timeout",
        "Cloud Desktop"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-CloudDesktop#setmaxconnectiontimeout"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/CloudDesktop/SetMaxConnectionTimeout",
    "rootDefinitionId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout",
    "categoryId": "39e4c352-be9c-4e75-8111-8236279c7f1e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout",
    "description": "IT admins can use this policy to set the max connection timeout. The connection timeout decides the max wait time for connecting to Cloud PC after sign in. The default max value is 5 min. For best user experience, it is recommended to continue with the default timeout of 5 min. Update only if it takes more than 5 min to connect to the Cloud PC in your organization.\r\n ",
    "helpText": "",
    "name": "SetMaxConnectionTimeout",
    "displayName": "Set Max Connection Timeout",
    "defaultOptionId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_5",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621.2338",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_5",
            "description": "5 min",
            "helpText": null,
            "name": "5 min",
            "displayName": "5 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 5
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_6",
            "description": "6 min",
            "helpText": null,
            "name": "6 min",
            "displayName": "6 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 6
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_7",
            "description": "7 min",
            "helpText": null,
            "name": "7 min",
            "displayName": "7 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 7
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_8",
            "description": "8 min",
            "helpText": null,
            "name": "8 min",
            "displayName": "8 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 8
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_9",
            "description": "9 min",
            "helpText": null,
            "name": "9 min",
            "displayName": "9 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 9
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_10",
            "description": "10 min",
            "helpText": null,
            "name": "10 min",
            "displayName": "10 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 10
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_11",
            "description": "11 min",
            "helpText": null,
            "name": "11 min",
            "displayName": "11 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 11
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_12",
            "description": "12 min",
            "helpText": null,
            "name": "12 min",
            "displayName": "12 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 12
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_13",
            "description": "13 min",
            "helpText": null,
            "name": "13 min",
            "displayName": "13 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 13
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_14",
            "description": "14 min",
            "helpText": null,
            "name": "14 min",
            "displayName": "14 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 14
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_15",
            "description": "15 min",
            "helpText": null,
            "name": "15 min",
            "displayName": "15 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 15
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_16",
            "description": "16 min",
            "helpText": null,
            "name": "16 min",
            "displayName": "16 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 16
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_17",
            "description": "17 min",
            "helpText": null,
            "name": "17 min",
            "displayName": "17 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 17
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_18",
            "description": "18 min",
            "helpText": null,
            "name": "18 min",
            "displayName": "18 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 18
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_19",
            "description": "19 min",
            "helpText": null,
            "name": "19 min",
            "displayName": "19 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 19
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_clouddesktop_setmaxconnectiontimeout_20",
            "description": "20 min",
            "helpText": null,
            "name": "20 min",
            "displayName": "20 min",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 20
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}