{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DoNotLaunchServerManager",
        "Do not display Server Manager automatically at logon",
        "\\System\\Server Manager",
        "Administrative Templates\\System\\Server Manager",
        "Server Manager"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-servermanager#admx-servermanager-donotlaunchservermanager"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ServerManager/DoNotLaunchServerManager",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_servermanager_donotlaunchservermanager",
    "categoryId": "1526dde4-6726-470e-aebf-3272ae70a99c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_servermanager_donotlaunchservermanager",
    "description": "This policy setting allows you to turn off the automatic display of Server Manager at logon.\r\n\r\nIf you enable this policy setting, Server Manager is not displayed automatically when a user logs on to the server.\r\n\r\nIf you disable this policy setting, Server Manager is displayed automatically when a user logs on to the server.\r\n\r\nIf you do not configure this policy setting, Server Manager is displayed when a user logs on to the server. However, if the \"Do not show me this console at logon\" (Windows Server 2008 and Windows Server 2008 R2) or “Do not start Server Manager automatically at logon” (Windows Server 2012) option is selected, the console is not displayed automatically at logon.\r\n\r\nNote: Regardless of the status of this policy setting, Server Manager is available from the Start menu or the Windows taskbar.\r\n\r\n ",
    "helpText": "",
    "name": "DoNotLaunchServerManager",
    "displayName": "Do not display Server Manager automatically at logon",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_servermanager_donotlaunchservermanager_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_servermanager_donotlaunchservermanager_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_servermanager_donotlaunchservermanager_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}