{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MediaCacheSize",
        "Set media disk cache size in bytes",
        "\\Google\\Google Chrome\\Removed policies",
        "Administrative Templates\\Google\\Google Chrome\\Removed policies",
        "Removed policies"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~RemovedPolicies/MediaCacheSize",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~removedpolicies_mediacachesize",
    "categoryId": "3634c01b-1a85-4f50-9f52-63bc10bf0e39",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~removedpolicies_mediacachesize_mediacachesize",
    "description": "",
    "helpText": "",
    "name": "MediaCacheSize",
    "displayName": "Set media disk cache size: (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2000000000,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~removedpolicies_mediacachesize_1",
            "parentSettingId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~removedpolicies_mediacachesize"
        }
    ],
    "dependedOnBy": []
}