{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableNamedPipeShutdownPolicyDescription",
        "Turn off legacy remote shutdown interface",
        "\\Windows Components\\Shutdown Options",
        "Administrative Templates\\Windows Components\\Shutdown Options",
        "Shutdown Options",
        "Machine",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System",
        "DisableShutdownNamedPipe"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-wininit#admx-wininit-disablenamedpipeshutdownpolicydescription"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WinInit/DisableNamedPipeShutdownPolicyDescription",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_wininit_disablenamedpipeshutdownpolicydescription",
    "categoryId": "60a3188c-7ee3-40db-8f9f-33648dc74555",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_wininit_disablenamedpipeshutdownpolicydescription",
    "description": "This policy setting controls the legacy remote shutdown interface (named pipe). The named pipe remote shutdown interface is needed in order to shutdown this system from a remote Windows XP or Windows Server 2003 system.\r\n\r\nIf you enable this policy setting, the system does not create the named pipe remote shutdown interface.\r\n\r\nIf you disable or do not configure this policy setting, the system creates the named pipe remote shutdown interface.\r\n ",
    "helpText": "",
    "name": "DisableNamedPipeShutdownPolicyDescription",
    "displayName": "Turn off legacy remote shutdown interface",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_wininit_disablenamedpipeshutdownpolicydescription_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_wininit_disablenamedpipeshutdownpolicydescription_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_wininit_disablenamedpipeshutdownpolicydescription_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}