{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Network Password Encryption Type",
        "Remote Remediation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/RemoteRemediation-csp/"
    ],
    "baseUri": "./Vendor/MSFT/RemoteRemediation",
    "offsetUri": "/CloudRemediationSettings/NetworkSettings/NetworkCredentials/NetworkPasswordEncryptionType",
    "rootDefinitionId": "device_vendor_msft_remoteremediation_cloudremediationsettings_enablecloudremediation",
    "categoryId": "52e76943-bfc9-4fb5-bdc8-5d4e8c6a436e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkpasswordencryptiontype",
    "description": "Refers to the type of encryption that can be used for the network password. If you specify \"Encrypt with custom certificate\" you must also enter the encryption store.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "NetworkPasswordEncryptionType",
    "displayName": "Network Password Encryption Type (Windows Insiders only) [Pending fix]",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "88.8.88888",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkpasswordencryptiontype_1",
            "description": "No encryption",
            "helpText": null,
            "name": "No encryption",
            "displayName": "No encryption",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation_true",
                    "parentSettingId": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkpasswordencryptiontype_2",
            "description": "Encrypt using Mdm certificate",
            "helpText": null,
            "name": "Encrypt using Mdm certificate",
            "displayName": "Encrypt using Mdm certificate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation_true",
                    "parentSettingId": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_remoteremediation_cloudremediationsettings_networksettings_networkcredentials_networkpasswordencryptiontype_3",
            "description": "Encrypt with custom certificate",
            "helpText": null,
            "name": "Encrypt with custom certificate",
            "displayName": "Encrypt with custom certificate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation_true",
                    "parentSettingId": "device_vendor_msft_remoteremediation_cloudremediationsettings_autoremediationsettings_enableautoremediation"
                }
            ],
            "dependedOnBy": []
        }
    ]
}