{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LockMachineUILanguage",
        "Restricts the UI language Windows uses for all logged users",
        "\\Control Panel\\Regional and Language Options",
        "Administrative Templates\\Control Panel\\Regional and Language Options",
        "Regional and Language Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-lockmachineuilanguage"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/LockMachineUILanguage",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_globalization_lockmachineuilanguage",
    "categoryId": "18db3d59-661b-47ec-900a-bf75495ca598",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_globalization_lockmachineuilanguage",
    "description": "This policy setting restricts the Windows UI language for all users.\r\n\r\nThis is a policy setting for computers with more than one UI language installed.\r\n\r\nIf you enable this policy setting, the UI language of Windows menus and dialogs for systems with more than one language will follow the language specified by the administrator as the system UI languages. The UI language selected by the user will be ignored if it is different than any of the system UI languages.\r\n\r\nIf you disable or do not configure this policy setting, the user can specify which UI language is used.\r\n ",
    "helpText": "",
    "name": "LockMachineUILanguage",
    "displayName": "Restricts the UI language Windows uses for all logged users",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_globalization_lockmachineuilanguage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_globalization_lockmachineuilanguage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_globalization_lockmachineuilanguage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_globalization_lockmachineuilanguage_uilangselect",
                    "required": true
                }
            ]
        }
    ]
}