{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ShutdownEventTrackerStateFile",
        "Activate Shutdown Event Tracker System State Data feature",
        "\\System",
        "Administrative Templates\\System",
        "System",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\Reliability",
        "SnapShot"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-reliability#admx-reliability-shutdowneventtrackerstatefile"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Reliability/ShutdownEventTrackerStateFile",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_reliability_shutdowneventtrackerstatefile",
    "categoryId": "fd66cd4e-474b-4d6c-8dec-65a6a49e75d7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_reliability_shutdowneventtrackerstatefile",
    "description": "This policy setting defines when the Shutdown Event Tracker System State Data feature is activated.\r\n\r\nThe system state data file contains information about the basic system state as well as the state of all running processes.\r\n\r\nIf you enable this policy setting, the System State Data feature is activated when the user indicates that the shutdown or restart is unplanned.\r\n\r\nIf you disable this policy setting, the System State Data feature is never activated.\r\n\r\nIf you do not configure this policy setting, the default behavior for the System State Data feature occurs.\r\n\r\nNote: By default, the System State Data feature is always enabled on Windows Server 2003. See \"Supported on\" for all supported versions.\r\n ",
    "helpText": "",
    "name": "ShutdownEventTrackerStateFile",
    "displayName": "Activate Shutdown Event Tracker System State Data feature",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_reliability_shutdowneventtrackerstatefile_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_shutdowneventtrackerstatefile_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_shutdowneventtrackerstatefile_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}