{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Recovery Console Allow Floppy Copy And Access To All Drives And All Folders",
        "Local Policies Security Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#recoveryconsole_allowfloppycopyandaccesstoalldrivesandallfolders"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/LocalPoliciesSecurityOptions/RecoveryConsole_AllowFloppyCopyAndAccessToAllDrivesAndAllFolders",
    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_recoveryconsole_allowfloppycopyandaccesstoalldrivesandallfolders",
    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_recoveryconsole_allowfloppycopyandaccesstoalldrivesandallfolders",
    "description": "Recovery console: Allow floppy copy and access to all drives and all folders  Enabling this security option makes the Recovery Console SET command available, which allows you to set the following Recovery Console environment variables:  AllowWildCards: Enable wildcard support for some commands (such as the DEL command).  AllowAllPaths: Allow access to all files and folders on the computer.  AllowRemovableMedia: Allow files to be copied to removable media, such as a floppy disk.  NoCopyPrompt: Do not prompt when overwriting an existing file.  Default: This policy is not defined and the recover console SET command is not available.\r\n ",
    "helpText": "",
    "name": "RecoveryConsole_AllowFloppyCopyAndAccessToAllDrivesAndAllFolders",
    "displayName": "Recovery Console Allow Floppy Copy And Access To All Drives And All Folders",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621.5126",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 1,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}