{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Let Apps Access Gaze Input",
        "Privacy"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Privacy#letappsaccessgazeinput"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Privacy/LetAppsAccessGazeInput",
    "rootDefinitionId": "device_vendor_msft_policy_config_privacy_letappsaccessgazeinput",
    "categoryId": "98e76d3e-9e52-45b3-b0c7-f029023121e9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_privacy_letappsaccessgazeinput",
    "description": "This policy setting specifies whether Windows apps can access the eye tracker.",
    "helpText": "",
    "name": "LetAppsAccessGazeInput",
    "displayName": "Let Apps Access Gaze Input",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "7.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17134",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}