{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Manual Wi Fi Configuration",
        "Wifi",
        "Wi-Fi Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-wifi#allowmanualwificonfiguration"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Wifi/AllowManualWiFiConfiguration",
    "rootDefinitionId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration",
    "categoryId": "0a803a48-789a-48b0-b928-e52d56ab17f1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "high",
    "id": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration",
    "description": "Allow or block connections to Wi-Fi outside of MDM server-installed networks. If you change this setting to Block, you must deploy enterprise Wi-Fi profiles to the device using the Wi-Fi CSP before you apply this setting. Otherwise, the device will go offline since it won't be able to connect to Wi-Fi. Note that choosing to block Wi-Fi connections will delete any previously installed user-configured Wi-Fi profiles from the device, though not all non-MDM profiles will be deleted.",
    "helpText": "",
    "name": "AllowManualWiFiConfiguration",
    "displayName": "Allow Manual Wi Fi Configuration",
    "defaultOptionId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10240",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration_0",
            "description": "No Wi-Fi connection outside of MDM provisioned network is allowed.",
            "helpText": null,
            "name": "No Wi-Fi connection outside of MDM provisioned network is allowed.",
            "displayName": "Block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_wifi_allowmanualwificonfiguration_1",
            "description": "Adding new network SSIDs beyond the already MDM provisioned ones is allowed.",
            "helpText": null,
            "name": "Adding new network SSIDs beyond the already MDM provisioned ones is allowed.",
            "displayName": "Allow",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}