{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AVD_SERVER_UDP_STUN_CLIENT_PORT_RANGE",
        "Use port range for RDP Shortpath for unmanaged networks",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Azure Virtual Desktop",
        "Azure Virtual Desktop"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/terminalServer-AVDv1~Policy~AVD_GP_NODE/AVD_SERVER_UDP_STUN_CLIENT_PORT_RANGE",
    "rootDefinitionId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range",
    "categoryId": "845ff38a-408b-449c-9ef3-7fdc331027df",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range_part_iceclientportrange",
    "description": "",
    "helpText": "",
    "name": "Part_ICEClientPortRange",
    "displayName": "Port pool size (Device)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 65535,
        "minimumValue": 100
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1000
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range_1",
            "parentSettingId": "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_udp_stun_client_port_range"
        }
    ],
    "dependedOnBy": []
}