{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Email",
        "Account",
        "Account Name"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/email2-csp"
    ],
    "baseUri": "./device/vendor/msft/email",
    "offsetUri": "/accountName",
    "rootDefinitionId": "device_vendor_msft_email_accountname",
    "categoryId": "48cb2bee-74be-4165-bc19-89c5b1c50c00",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_email_accountname",
    "description": "Exchange ActiveSync account name, displayed to user as name of EAS profile.",
    "helpText": "",
    "name": "AccountName",
    "displayName": "Account Name",
    "deepLink": "/#blade/Microsoft_Intune_DeviceSettings/CreatePolicyFullScreenBlade/policyId/00000000-0000-0000-0000-000000000000/policyType/Windows10EmailProfile/policyJourneyState/0",
    "redirectMessage": "Create an Email policy",
    "redirectReason": "The \"Email\" settings cannot be configured in the settings catalog. A template policy must be used.",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": []
}