{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Require Microsoft Signed Boot Chain",
        "Device Guard"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-DeviceGuard#requiremicrosoftsignedbootchain"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeviceGuard/RequireMicrosoftSignedBootChain",
    "rootDefinitionId": "device_vendor_msft_policy_config_deviceguard_requiremicrosoftsignedbootchain",
    "categoryId": "992a8a1e-428e-41cb-948e-4e5da86105fa",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_deviceguard_requiremicrosoftsignedbootchain",
    "description": "Require Microsoft Signed Boot Chain: 1 - Require Microsoft Signed Boot Chain.",
    "helpText": "",
    "name": "RequireMicrosoftSignedBootChain",
    "displayName": "Require Microsoft Signed Boot Chain",
    "defaultOptionId": "device_vendor_msft_policy_config_deviceguard_requiremicrosoftsignedbootchain_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26200.6584",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_deviceguard_requiremicrosoftsignedbootchain_1",
            "description": "Require Microsoft Signed Boot Chain.",
            "helpText": null,
            "name": "Require Microsoft Signed Boot Chain.",
            "displayName": "Require Microsoft Signed Boot Chain.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}