{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcVHDNamePattern",
        "VHD Name Pattern",
        "\\FSLogix\\ODFC Containers\\Container and Directory Naming",
        "Administrative Templates\\FSLogix\\ODFC Containers\\Container and Directory Naming",
        "Container and Directory Naming"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC~ODFC_ContainerandDirectoryNaming/OdfcVHDNamePattern",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcvhdnamepattern",
    "categoryId": "81eb92d0-acda-4ea2-8183-29ed5457276b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcvhdnamepattern",
    "description": "Specifies a string pattern used when creating a users ODFC container. Use this setting to define how FSLogix will attempt to create a users ODFC container (VHD(x) file). FSLogix will use the VHDLocations or CCDLocations as the location where to search and this setting defines what to create.\r\n\r\nNOTE: When using this configuration setting, be sure the VHDNameMatch value matches this setting.\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\Policies\\FSLogix\\ODFC\\VHDNamePattern\r\nType: REG_SZ",
    "helpText": "",
    "name": "OdfcVHDNamePattern",
    "displayName": "VHD Name Pattern",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcvhdnamepattern_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcvhdnamepattern_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcvhdnamepattern_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcvhdnamepattern_odfcvhdnamepattern",
                    "required": true
                }
            ]
        }
    ]
}