{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcSIDDirectoryNameMatch",
        "SID Directory Name Match",
        "\\FSLogix\\ODFC Containers\\Container and Directory Naming",
        "Administrative Templates\\FSLogix\\ODFC Containers\\Container and Directory Naming",
        "Container and Directory Naming"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC~ODFC_ContainerandDirectoryNaming/OdfcSIDDirectoryNameMatch",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcsiddirectorynamematch",
    "categoryId": "81eb92d0-acda-4ea2-8183-29ed5457276b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcsiddirectorynamematch",
    "description": "Specifies a string pattern used when matching a Profile or ODFC container folder. Use this setting to define how FSLogix will attempt to locate a users Profile or ODFC container. FSLogix will use the VHDLocations or CCDLocations as the location where to search and this setting defines what to search.\r\n\r\nNOTE:  When using this configuration setting, be sure the SIDDIRNamePattern value matches this setting.\r\n\r\n- This setting has NO EFFECT when FlipFlopProfileDirectoryName is enabled.\r\n- This setting has NO EFFECT when NoProfileContainingFolder is enabled.\r\n- NoProfileContainingFolder > FlipFlopProfileDirectoryName > SIDDirNameMatch (this setting)\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\Policies\\FSLogix\\ODFC\\SIDDirNameMatch\r\nType:  REG_SZ",
    "helpText": "",
    "name": "OdfcSIDDirectoryNameMatch",
    "displayName": "SID Directory Name Match",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcsiddirectorynamematch_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcsiddirectorynamematch_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcsiddirectorynamematch_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcsiddirectorynamematch_odfcsiddirectorynamematch",
                    "required": true
                }
            ]
        }
    ]
}