{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Elevation Rule",
        "Endpoint Privilege Management",
        "Privilege Management"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/PrivilegeManagement/ElevationRules/{0}",
    "rootDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
    "categoryId": "4f3a6fca-a74c-448d-95b1-9d6d7a5d4449",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}",
    "description": "Unique alpha numeric identifier for the rule.  The rule name must not include a forward slash (/).",
    "helpText": null,
    "name": "ElevationRuleName",
    "displayName": "Elevation Rule Name",
    "childIds": [
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_name",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_description",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filename",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_fileversion",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filepath",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filehash",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_ruletype",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_appliesto",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_childprocessbehavior",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filedescription",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_productname",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_internalname",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_signaturesource",
        "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_arguments"
    ],
    "maximumCount": 100,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "endpointPrivilegeManagement",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19042",
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": null
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_name",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_description",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filename",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_fileversion",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filepath",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filehash",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_ruletype",
            "required": true
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_appliesto",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_childprocessbehavior",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filedescription",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_productname",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_internalname",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_signaturesource",
            "required": false
        },
        {
            "dependedOnBy": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_arguments",
            "required": false
        }
    ]
}