{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Client Settings",
        "Reporting scope",
        "Privilege Management",
        "Privilege Management Elevation Client Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "PrivilegeManagement/ElevationClientSettings/ReportingScope",
    "rootDefinitionId": "device_vendor_msft_policy_elevationclientsettings_enableepm",
    "categoryId": "b750fe41-33c4-4293-8dfc-42285be35752",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "device_vendor_msft_policy_elevationclientsettings_reportingscope",
    "description": "",
    "helpText": null,
    "name": "ReportingScope",
    "displayName": "Reporting scope",
    "defaultOptionId": "device_vendor_msft_policy_elevationclientsettings_reportingscope_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,endpointPrivilegeManagement",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19042",
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_elevationclientsettings_reportingscope_1",
            "description": "Diagnostic data and managed elevations only",
            "helpText": null,
            "name": "DiagnosticDataAndManagedElevationsOnly",
            "displayName": "Diagnostic data and managed elevations only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_elevationclientsettings_senddata_1",
                    "parentSettingId": "device_vendor_msft_policy_elevationclientsettings_senddata"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_elevationclientsettings_reportingscope_2",
            "description": "Diagnostic data and all endpoint elevations",
            "helpText": null,
            "name": "DiagnosticDataAndAllEndpointElevations",
            "displayName": "Diagnostic data and all endpoint elevations",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_elevationclientsettings_senddata_1",
                    "parentSettingId": "device_vendor_msft_policy_elevationclientsettings_senddata"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_elevationclientsettings_reportingscope_0",
            "description": "Diagnostic data only",
            "helpText": null,
            "name": "DiagnosticDataOnly",
            "displayName": "Diagnostic data only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_elevationclientsettings_senddata_1",
                    "parentSettingId": "device_vendor_msft_policy_elevationclientsettings_senddata"
                }
            ],
            "dependedOnBy": []
        }
    ]
}