{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Passive Remediation",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Defender-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Defender",
    "offsetUri": "/Configuration/PassiveRemediation",
    "rootDefinitionId": "device_vendor_msft_defender_configuration_passiveremediation",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_defender_configuration_passiveremediation",
    "description": "Setting to control automatic remediation for Sense scans.",
    "helpText": "",
    "name": "PassiveRemediation",
    "displayName": "Passive Remediation",
    "defaultOptionId": "device_vendor_msft_defender_configuration_passiveremediation_0",
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.3",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_defender_configuration_passiveremediation_0",
            "description": "Passive Remediation is turned off (default)",
            "helpText": null,
            "name": "Passive Remediation is turned off (default)",
            "displayName": "Passive Remediation is turned off (default)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_defender_configuration_passiveremediation_1",
            "description": "PASSIVE_REMEDIATION_FLAG_SENSE_AUTO_REMEDIATION: Passive Remediation Sense AutoRemediation",
            "helpText": null,
            "name": "PASSIVE_REMEDIATION_FLAG_SENSE_AUTO_REMEDIATION: Passive Remediation Sense AutoRemediation",
            "displayName": "PASSIVEREMEDIATIONFLAGSENSEAUTOREMEDIATION: Passive Remediation Sense AutoRemediation",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_defender_configuration_passiveremediation_2",
            "description": "PASSIVE_REMEDIATION_FLAG_RTP_AUDIT: Passive Remediation Realtime Protection Audit",
            "helpText": null,
            "name": "PASSIVE_REMEDIATION_FLAG_RTP_AUDIT: Passive Remediation Realtime Protection Audit",
            "displayName": "PASSIVEREMEDIATIONFLAGRTPAUDIT: Passive Remediation Realtime Protection Audit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_defender_configuration_passiveremediation_4",
            "description": "PASSIVE_REMEDIATION_FLAG_RTP_REMEDIATION: Passive Remediation Realtime Protection Remediation",
            "helpText": null,
            "name": "PASSIVE_REMEDIATION_FLAG_RTP_REMEDIATION: Passive Remediation Realtime Protection Remediation",
            "displayName": "PASSIVEREMEDIATIONFLAGRTPREMEDIATION: Passive Remediation Realtime Protection Remediation",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}