{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UserInfoAccessAction",
        "User management of sharing user name, account picture, and domain information with apps (not desktop apps)",
        "\\System\\User Profiles",
        "Administrative Templates\\System\\User Profiles",
        "User Profiles"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserProfiles/UserInfoAccessAction",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction",
    "categoryId": "b49cb414-bdfb-49d4-af5d-176ded4f9591",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction_allowuserinfoaccess",
    "description": null,
    "helpText": "",
    "name": "AllowUserInfoAccess",
    "displayName": "Action: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction_allowuserinfoaccess_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction_allowuserinfoaccess_1",
            "description": null,
            "helpText": null,
            "name": "Always on",
            "displayName": "Always on",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction_allowuserinfoaccess_2",
            "description": null,
            "helpText": null,
            "name": "Always off",
            "displayName": "Always off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_userprofiles_userinfoaccessaction"
                }
            ],
            "dependedOnBy": []
        }
    ]
}