{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PartitionedBlobUrlUsage",
        "Manage Blob URL Partitioning During Fetching and Navigation",
        "\\Microsoft Edge\\Content settings",
        "Microsoft Edge\\Content settings",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev135~Policy~microsoft_edge~ContentSettings/PartitionedBlobUrlUsage",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~contentsettings_partitionedbloburlusage",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~contentsettings_partitionedbloburlusage",
    "description": "This policy controls whether Blob URLs are partitioned during fetching and navigation.\r\nIf this policy is set to Enabled or not set, Blob URLs will be partitioned.\r\nIf this policy is set to Disabled, Blob URLs won't be partitioned.  This is the Blob URL behavior prior to\r\nMicrosoft Edge version 135.\r\n\r\nIf storage partitioning is disabled for a given top-level origin by either\r\nThirdPartyStoragePartitioningBlockedForOrigins\r\nor DefaultThirdPartyStoragePartitioningSetting,\r\nthen Blob URLs will also not be partitioned.\r\n\r\nThe policy is scheduled to be available through Microsoft Edge version 140. After this\r\nversion, the policy will be removed, and Microsoft Edge will no longer support unpartitioned\r\nblob storage.\r\n\r\nFor detailed information on third-party storage partitioning, please see https://github.com/privacycg/storage-partitioning.",
    "helpText": "",
    "name": "PartitionedBlobUrlUsage",
    "displayName": "Manage Blob URL Partitioning During Fetching and Navigation",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~contentsettings_partitionedbloburlusage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~contentsettings_partitionedbloburlusage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~contentsettings_partitionedbloburlusage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}