{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PCH_ReportShutdownEvents",
        "Report unplanned shutdown events",
        "\\Windows Components\\Windows Error Reporting\\Advanced Error Reporting Settings",
        "Administrative Templates\\Windows Components\\Windows Error Reporting\\Advanced Error Reporting Settings",
        "Advanced Error Reporting Settings",
        "Machine",
        "Software\\Policies\\Microsoft\\PCHealth\\ErrorReporting",
        "IncludeShutdownErrs"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-reliability#admx-reliability-pch-reportshutdownevents"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Reliability/PCH_ReportShutdownEvents",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_reliability_pch_reportshutdownevents",
    "categoryId": "23e93393-4a75-44e6-9693-208eedb06976",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_reliability_pch_reportshutdownevents",
    "description": "This policy setting controls whether or not unplanned shutdown events can be reported when error reporting is enabled.\r\n\r\nIf you enable this policy setting, error reporting includes unplanned shutdown events.\r\n\r\nIf you disable this policy setting, unplanned shutdown events are not included in error reporting.\r\n\r\nIf you do not configure this policy setting, users can adjust this setting using the control panel, which is set to \"Upload unplanned shutdown events\" by default.\r\n\r\nAlso see the \"Configure Error Reporting\" policy setting.\r\n ",
    "helpText": "",
    "name": "PCH_ReportShutdownEvents",
    "displayName": "Report unplanned shutdown events",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_reliability_pch_reportshutdownevents_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_pch_reportshutdownevents_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_reliability_pch_reportshutdownevents_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}