{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CustomClasses_DenyWrite_Access_2",
        "Custom Classes: Deny write access",
        "\\System\\Removable Storage Access",
        "Administrative Templates\\System\\Removable Storage Access",
        "Removable Storage Access",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\RemovableStorageDevices\\Custom\\Deny_Write",
        "Deny_Write"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-removablestorage#admx-removablestorage-customclasses-denywrite-access-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_RemovableStorage/CustomClasses_DenyWrite_Access_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_removablestorage_customclasses_denywrite_access_2",
    "categoryId": "180b2a03-16d4-43cd-ba84-9b4546753ef4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_removablestorage_customclasses_denywrite_access_2",
    "description": "This policy setting denies write access to custom removable storage classes.\r\n\r\nIf you enable this policy setting, write access is denied to these removable storage classes.\r\n\r\nIf you disable or do not configure this policy setting, write access is allowed to these removable storage classes.\r\n ",
    "helpText": "",
    "name": "CustomClasses_DenyWrite_Access_2",
    "displayName": "Custom Classes: Deny write access",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_removablestorage_customclasses_denywrite_access_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_removablestorage_customclasses_denywrite_access_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_removablestorage_customclasses_denywrite_access_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_removablestorage_customclasses_denywrite_access_2_customclasses_list",
                    "required": true
                }
            ]
        }
    ]
}