{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WFPScan",
        "Set Windows File Protection scanning",
        "\\System\\Windows File Protection",
        "Administrative Templates\\System\\Windows File Protection",
        "Windows File Protection"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsfileprotection#admx-windowsfileprotection-wfpscan"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsFileProtection/WFPScan",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan",
    "categoryId": "dbb76878-34a9-4f87-bbc6-4de7ea223ff4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan",
    "description": "This policy setting allows you to set when Windows File Protection scans protected files. This policy setting directs Windows File Protection to enumerate and scan all system files for changes.\r\n\r\nIf you enable this policy setting, select a rate from the \"Scanning Frequency\" box. You can use this setting to direct Windows File Protection to scan files more often.\r\n\r\n--  \"Do not scan during startup,\" the default, scans files only during setup.\r\n\r\n--  \"Scan during startup\" also scans files each time you start Windows XP. This setting delays each startup.\r\n\r\nIf you disable or do not configure this policy setting, by default, files are scanned only during setup.\r\n\r\nNote: This policy setting affects file scanning only. It does not affect the standard background file change detection that Windows File Protection provides.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "WFPScan",
    "displayName": "Set Windows File Protection scanning (Windows Insiders only)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.9",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.21322",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_windowsfileprotection_wfpscan_wfpscanlist",
                    "required": true
                }
            ]
        }
    ]
}