{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Captive Portal Before Logon",
        "Mixed Reality"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-MixedReality#mixedreality-allowcaptiveportalbeforelogon"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/MixedReality/AllowCaptivePortalBeforeLogon",
    "rootDefinitionId": "device_vendor_msft_policy_config_mixedreality_allowcaptiveportalbeforelogon",
    "categoryId": "f10138ba-123a-43bc-8031-4458ba327374",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_mixedreality_allowcaptiveportalbeforelogon",
    "description": "This policy controls whether the device will display the captive portal flow on the HoloLens sign in screen's network selection page when a captive portal network is detected. Displaying the captive portal flow is disabled by default to reduce the potential of gaining unauthorized access to the device through the browser.",
    "helpText": "",
    "name": "AllowCaptivePortalBeforeLogon",
    "displayName": "Allow Captive Portal Before Logon",
    "defaultOptionId": "device_vendor_msft_policy_config_mixedreality_allowcaptiveportalbeforelogon_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.20348",
        "windowsSkus": [
            "holographicForBusiness"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_allowcaptiveportalbeforelogon_0",
            "description": "Displaying captive portal is not allowed.",
            "helpText": null,
            "name": "Displaying captive portal is not allowed.",
            "displayName": "Displaying captive portal is not allowed.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mixedreality_allowcaptiveportalbeforelogon_1",
            "description": "Displaying captive portal is allowed.",
            "helpText": null,
            "name": "Displaying captive portal is allowed.",
            "displayName": "Displaying captive portal is allowed.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}