{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrivacySandboxAdTopicsEnabled",
        "Choose whether the Privacy Sandbox Ad topics setting can be disabled",
        "\\Google\\Google Chrome\\Privacy Sandbox policies",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Privacy Sandbox policies"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~PrivacySandbox/PrivacySandboxAdTopicsEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxadtopicsenabled",
    "categoryId": "d4ad9168-8c49-45d6-a7e5-86ba990fff3e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxadtopicsenabled",
    "description": "A policy to control whether the Privacy Sandbox Ad topics setting can be disabled for your users.\r\n\r\nIf you set this policy to Disabled, then the Ad topics setting will be turned off for your users.\r\nIf you set this policy to Enabled or keep it unset, your users will be able to turn on or off the Privacy Sandbox Ad topics setting on their device.\r\n\r\nSetting this policy requires setting the PrivacySandboxPromptEnabled policy to Disabled.",
    "helpText": "",
    "name": "PrivacySandboxAdTopicsEnabled",
    "displayName": "Choose whether the Privacy Sandbox Ad topics setting can be disabled",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxadtopicsenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxadtopicsenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxadtopicsenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}