{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_SecGuide_0050_NetbtNodeTypeConfig",
        "NetBT NodeType configuration",
        "\\MS Security Guide",
        "Administrative Templates\\MS Security Guide",
        "MS Security Guide"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/MSSecurityGuide/NetBTNodeTypeConfiguration",
    "rootDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration",
    "categoryId": "5371d50c-0aaa-425a-a075-2cb1c59968b9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_pol_secguide_secguide_netbtnodetypecfg",
    "description": "",
    "helpText": "",
    "name": "Pol_SecGuide_SecGuide_NetbtNodeTypeCfg",
    "displayName": "Configure NetBT NodeType (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_pol_secguide_secguide_netbtnodetypecfg_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621.5126",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_pol_secguide_secguide_netbtnodetypecfg_1",
            "description": null,
            "helpText": null,
            "name": "B-node",
            "displayName": "B-node",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_1",
                    "parentSettingId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_pol_secguide_secguide_netbtnodetypecfg_2",
            "description": null,
            "helpText": null,
            "name": "P-node (recommended)",
            "displayName": "P-node (recommended)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_1",
                    "parentSettingId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_pol_secguide_secguide_netbtnodetypecfg_4",
            "description": null,
            "helpText": null,
            "name": "M-node",
            "displayName": "M-node",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_1",
                    "parentSettingId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_pol_secguide_secguide_netbtnodetypecfg_8",
            "description": null,
            "helpText": null,
            "name": "H-node",
            "displayName": "H-node",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration_1",
                    "parentSettingId": "device_vendor_msft_policy_config_mssecurityguide_netbtnodetypeconfiguration"
                }
            ],
            "dependedOnBy": []
        }
    ]
}