{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PCH_ConfigureReport",
        "Configure Error Reporting",
        "\\Windows Components\\Windows Error Reporting",
        "Administrative Templates\\Windows Components\\Windows Error Reporting",
        "Windows Error Reporting"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ErrorReporting/PCH_ConfigureReport",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport",
    "categoryId": "d9b7efad-fe18-4c98-925b-c4a5db0f2815",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_nofilecollect_chk",
    "description": null,
    "helpText": "",
    "name": "PCH_NoFileCollect_Chk",
    "displayName": "Do not collect additional files (Device)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_nofilecollect_chk_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_pch_nofilecollect_chk_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_errorreporting_pch_configurereport"
                }
            ],
            "dependedOnBy": []
        }
    ]
}