{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebWidgetAllowed",
        "Enable the Web widget",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev88~Policy~microsoft_edge/WebWidgetAllowed",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_webwidgetallowed",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_webwidgetallowed",
    "description": "Enables the Web widget. When enabled, users can use the widget to search the web from their desktop or from an application. The widget provides a search box that shows web suggestions and opens all web searches in Microsoft Edge. The search box provides search (powered by Bing) and URL suggestions. The widget also includes feed tiles that users can click to see more information on msn.com in a new Microsoft Edge browser tab or window. The feed tiles may include ads. The widget can be launched from the Microsoft Edge settings or from the \"More tools\" menu in Microsoft Edge.\r\n\r\nIf you enable or don't configure this policy:\r\n  The Web widget will be automatically enabled for all profiles.\r\n  In the Microsoft Edge settings, users will see option to launch the widget.\r\n  In the Microsoft Edge settings, users will see the menu item to run the widget at Windows startup (auto-start).\r\n    The option to enable the widget at startup will be toggled on if the 'WebWidgetIsEnabledOnStartup' (Allow the Web widget at Windows startup) policy is enabled.\r\n    If the 'WebWidgetIsEnabledOnStartup' is disabled or not configured, the option to enable the widget at startup will be toggled off.\r\n  Users will see the menu item to launch the widget from the Microsoft Edge \"More tools\" menu. Users can launch the widget from \"More tools\".\r\n  The widget can be turned off by the \"Quit\" option in the System tray or by closing the widget from the taskbar. The widget will be restarted on system reboot if auto-start is enabled.\r\n\r\nIf you disable this policy:\r\n  The Web widget will be disabled for all profiles.\r\n  The option to launch the widget from Microsoft Edge Settings will be disabled.\r\n  The option to launch start the widget at Windows startup (auto-start) will be disabled.\r\n  The option to launch the widget from Microsoft Edge \"More tools\" menu will be disabled.",
    "helpText": "",
    "name": "WebWidgetAllowed",
    "displayName": "Enable the Web widget",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_webwidgetallowed_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_webwidgetallowed_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88~policy~microsoft_edge_webwidgetallowed_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}