{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable Profile Manager",
        "Account Management"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/AccountManagement-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/AccountManagement",
    "offsetUri": "/UserProfileManagement/EnableProfileManager",
    "rootDefinitionId": "device_vendor_msft_accountmanagement_userprofilemanagement_enableprofilemanager",
    "categoryId": "3b384fc5-5906-4dc4-bc48-a52b52fb054b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_accountmanagement_userprofilemanagement_enableprofilemanager",
    "description": "Enable profile lifetime mangement for shared or communal device scenarios.",
    "helpText": "",
    "name": "EnableProfileManager",
    "displayName": "Enable Profile Manager",
    "defaultOptionId": "device_vendor_msft_accountmanagement_userprofilemanagement_enableprofilemanager_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "holographicForBusiness"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_accountmanagement_userprofilemanagement_enableprofilemanager_false",
            "description": "False",
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_accountmanagement_userprofilemanagement_enableprofilemanager_true",
            "description": "True",
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}