{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_MachineEnableWorkFolders",
        "Force automatic setup for all users",
        "\\Windows Components\\Work Folders",
        "Administrative Templates\\Windows Components\\Work Folders",
        "Work Folders",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\WorkFolders",
        "AutoProvision"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-workfoldersclient#admx-workfoldersclient-pol-machineenableworkfolders"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WorkFoldersClient/Pol_MachineEnableWorkFolders",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_workfoldersclient_pol_machineenableworkfolders",
    "categoryId": "a53581a1-e9d7-4ba4-9dea-cea90d40cca1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_workfoldersclient_pol_machineenableworkfolders",
    "description": "This policy setting specifies whether Work Folders should be set up automatically for all users of the affected computer.\r\n      \r\nIf you enable this policy setting, Work Folders will be set up automatically for all users of the affected computer. This prevents users from choosing not to use Work Folders on the computer; it also prevents them from manually specifying the local folder in which Work Folders stores files. Work Folders will use the settings specified in the \"Specify Work Folders settings\" policy setting in User Configuration\\Administrative Templates\\Windows Components\\WorkFolders. If the \"Specify Work Folders settings\" policy setting does not apply to a user, Work Folders is not automatically set up.\r\n      \r\nIf you disable or do not configure this policy setting, Work Folders uses the \"Force automatic setup\" option of the \"Specify Work Folders settings\" policy setting to determine whether to automatically set up Work Folders for a given user.\r\n      \r\n ",
    "helpText": "",
    "name": "Pol_MachineEnableWorkFolders",
    "displayName": "Force automatic setup for all users",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_workfoldersclient_pol_machineenableworkfolders_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_workfoldersclient_pol_machineenableworkfolders_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_workfoldersclient_pol_machineenableworkfolders_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}