{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExemptSmartScreenDownloadWarnings",
        "Disable SmartScreen AppRep based warnings for specified file types on specified domains",
        "\\Microsoft Edge\\SmartScreen settings",
        "Microsoft Edge\\SmartScreen settings",
        "SmartScreen settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev118~Policy~microsoft_edge~SmartScreen/ExemptSmartScreenDownloadWarnings",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev118~policy~microsoft_edge~smartscreen_exemptsmartscreendownloadwarnings",
    "categoryId": "08c5f391-e156-4a72-bbb9-3670f2f63a56",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev118~policy~microsoft_edge~smartscreen_exemptsmartscreendownloadwarnings",
    "description": "You can enable this policy to create a dictionary of file type extensions with a corresponding list of domains that will be exempted from SmartScreen AppRep warnings. For example, if  the \"vbe\" extension is associated with \"website1.com\", users would not see a SmartScreen AppRep warning when downloading \"vbe\" files from \"website1.com\", but may see a download warning when downloading \"vbe\" files from \"website2.com\".\r\n\r\nFiles with file type extensions specified for domains identified by this policy will still be subject to file type extension-based security warnings and mixed-content download warnings.\r\n\r\nIf you disable this policy or don't configure it, files that trigger SmartScreen AppRep download warnings will show warnings to the user.\r\n\r\nIf you enable this policy:\r\n\r\n* The URL pattern should be formatted according to https://go.microsoft.com/fwlink/?linkid=2095322.\r\n* The file type extension entered must be in lower-cased ASCII. The leading separator should not be included when listing the file type extension, so \"vbe\" should be used instead of \".vbe\".\r\n\r\nExample:\r\n\r\nThe following example value would prevent SmartScreen AppRep warnings on msi, exe, and vbe extensions for *.contoso.com domains. It may show the user a SmartScreen AppRep warning on any other domain for exe and msi files, but not for vbe files.\r\n\r\n[\r\n  { \"file_extension\": \"msi\", \"domains\": [\"contoso.com\"] },\r\n  { \"file_extension\": \"exe\", \"domains\": [\"contoso.com\"] },\r\n  { \"file_extension\": \"vbe\", \"domains\": [\"*\"] }\r\n]\r\n\r\nNote that while the preceding example shows the suppression of SmartScreen AppRep download warnings for \"vbe\" files for all domains, applying suppression of such warnings for all domains is not recommended due to security concerns. It is shown in the example merely to demonstrate the ability to do so.\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"domains\": [\r\n      \"https://contoso.com\",\r\n      \"contoso2.com\"\r\n    ],\r\n    \"file_extension\": \"msi\"\r\n  },\r\n  {\r\n    \"domains\": [\r\n      \"*\"\r\n    ],\r\n    \"file_extension\": \"vbe\"\r\n  }\r\n]",
    "helpText": "",
    "name": "ExemptSmartScreenDownloadWarnings",
    "displayName": "Disable SmartScreen AppRep based warnings for specified file types on specified domains",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev118~policy~microsoft_edge~smartscreen_exemptsmartscreendownloadwarnings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev118~policy~microsoft_edge~smartscreen_exemptsmartscreendownloadwarnings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev118~policy~microsoft_edge~smartscreen_exemptsmartscreendownloadwarnings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev118~policy~microsoft_edge~smartscreen_exemptsmartscreendownloadwarnings_exemptsmartscreendownloadwarnings",
                    "required": true
                }
            ]
        }
    ]
}