{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IgnoreWebProxy",
        "Cause sync client to ignore normal web proxy detection logic",
        "\\OneDrive",
        "OneDrive",
        "One Drive"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv4~Policy~OneDriveNGSC/IgnoreWebProxy",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_ignorewebproxy",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_ignorewebproxy",
    "description": "\r\n        This setting controls whether the OneDrive sync client does its default web proxy detection logic or not.\r\n\r\n        If you enable this setting, the sync client will not do its normal web proxy detection and will attempt direct connections to the internet web endpoints it needs to communicate with.  This is equivalent of having no web proxy settings configured and no automatic proxy script.\r\n\r\n        If you disable or do not configure this setting, the sync client will detect if a web proxy is configured on your network and use it if so.\r\n\r\n        For more info see https://docs.microsoft.com/en-us/troubleshoot/windows-client/networking/use-group-policy-apply-winhttp-proxy-settings ",
    "helpText": "",
    "name": "IgnoreWebProxy",
    "displayName": "Cause sync client to ignore normal web proxy detection logic",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_ignorewebproxy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_ignorewebproxy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_ignorewebproxy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}