{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_ProxyMode",
        "Choose how to specify proxy server settings",
        "\\Microsoft Edge Update\\Proxy Server",
        "Microsoft Edge Update\\Proxy Server",
        "Proxy Server",
        "Machine",
        "Software\\Policies\\Microsoft\\EdgeUpdate"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/update~Policy~Cat_Google~Cat_GoogleUpdate~Cat_ProxyServer/Pol_ProxyMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode",
    "categoryId": "ff543267-540e-4e37-a1e9-daf6a5e16ba7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode",
    "description": "Allows you to specify the proxy server settings that are used by Microsoft Edge Update.\r\n\r\n  If you enable this policy, you can choose between the following proxy server options:\r\n   - If you choose to never use a proxy server and always connect directly, all other options are ignored.\r\n   - If you choose to use system proxy settings or auto-detect the proxy server, all other options are ignored.\r\n   - If you choose fixed server proxy mode, you can specify further options in 'Address or URL of proxy server'.\r\n   - If you choose to use a .pac proxy script, you must specify the URL for the script in 'URL to a proxy .pac file'.\r\n\r\n  If you enable this policy, users in your organization can't change the proxy settings in Microsoft Edge Update.\r\n\r\n  If you disable or don't configure this policy, no proxy server settings are configured, but users in your organization can choose their own proxy settings for Microsoft Edge Update.",
    "helpText": "",
    "name": "Pol_ProxyMode",
    "displayName": "Choose how to specify proxy server settings",
    "defaultOptionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_proxyserver_pol_proxymode_part_proxymode",
                    "required": true
                }
            ]
        }
    ]
}