{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AllowDeploymentInSpecialProfiles",
        "Allow deployment operations in special profiles",
        "\\Windows Components\\App Package Deployment",
        "Administrative Templates\\Windows Components\\App Package Deployment",
        "App Package Deployment"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-appxpackagemanager#admx-appxpackagemanager-allowdeploymentinspecialprofiles"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AppxPackageManager/AllowDeploymentInSpecialProfiles",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_appxpackagemanager_allowdeploymentinspecialprofiles",
    "categoryId": "ffb6de77-8f2d-4b45-9cd4-00bb75cd496c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_appxpackagemanager_allowdeploymentinspecialprofiles",
    "description": "This policy setting allows you to manage the deployment of Windows Store apps when the user is signed in using a special profile. Special profiles are the following user profiles, where changes are discarded after the user signs off:\r\n\r\nRoaming user profiles to which the \"Delete cached copies of roaming profiles\" Group Policy setting applies\r\n\r\nMandatory user profiles and super-mandatory profiles, which are created by an administrator\r\n\r\nTemporary user profiles, which are created when an error prevents the correct profile from loading\r\n\r\nUser profiles for the Guest account and members of the Guests group\r\n\r\n\r\nIf you enable this policy setting, Group Policy allows deployment operations (adding, registering, staging, updating, or removing an app package) of Windows Store apps when using a special profile.\r\n\r\nIf you disable or do not configure this policy setting, Group Policy blocks deployment operations of Windows Store apps when using a special profile.\r\n ",
    "helpText": "",
    "name": "AllowDeploymentInSpecialProfiles",
    "displayName": "Allow deployment operations in special profiles",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_appxpackagemanager_allowdeploymentinspecialprofiles_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_appxpackagemanager_allowdeploymentinspecialprofiles_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_appxpackagemanager_allowdeploymentinspecialprofiles_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}