{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ScarewareBlockerAllowListDomains",
        "Configure the list of domains where Microsoft Edge scareware blocker won't run",
        "\\Microsoft Edge\\Scareware Blocker settings",
        "Microsoft Edge\\Scareware Blocker settings",
        "Scareware Blocker settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev142~Policy~microsoft_edge~ScarewareBlocker/ScarewareBlockerAllowListDomains",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev142~policy~microsoft_edge~scarewareblocker_scarewareblockerallowlistdomains",
    "categoryId": "16ea64a1-563e-43cc-b34a-728c8e7cd13c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev142~policy~microsoft_edge~scarewareblocker_scarewareblockerallowlistdomains",
    "description": "This policy configures the list of trusted domains for Microsoft Edge scareware blocker. When a website's source URL matches any domain in this list, Edge scareware blocker won’t analyze that site.\r\n\r\nThis policy takes effect only if the ScarewareBlockerProtectionEnabled policy is enabled.\r\n\r\nIf you enable this policy, Microsoft Edge scareware blocker will trust the specified domains.\r\n\r\nIf you disable or don't configure this policy, Microsoft Edge scareware blocker will analyze all sites.\r\n\r\nExample value:\r\n\r\nmydomain.com\r\nmyuniversity.edu",
    "helpText": "",
    "name": "ScarewareBlockerAllowListDomains",
    "displayName": "Configure the list of domains where Microsoft Edge scareware blocker won't run",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev142~policy~microsoft_edge~scarewareblocker_scarewareblockerallowlistdomains_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev142~policy~microsoft_edge~scarewareblocker_scarewareblockerallowlistdomains_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev142~policy~microsoft_edge~scarewareblocker_scarewareblockerallowlistdomains_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev142~policy~microsoft_edge~scarewareblocker_scarewareblockerallowlistdomains_scarewareblockerallowlistdomainsdesc",
                    "required": true
                }
            ]
        }
    ]
}