{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_HashPublication",
        "Hash Publication for BranchCache",
        "\\Network\\Lanman Server",
        "Administrative Templates\\Network\\Lanman Server",
        "Lanman Server"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_LanmanServer/Pol_HashPublication",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication",
    "categoryId": "fd49df1b-bfad-4ed5-85c2-046a32fa8782",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_lbl_hashpublicationactioncombo",
    "description": null,
    "helpText": "",
    "name": "Lbl_HashPublicationActionCombo",
    "displayName": "Hash publication actions: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_lbl_hashpublicationactioncombo_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_lbl_hashpublicationactioncombo_0",
            "description": null,
            "helpText": null,
            "name": "Allow hash publication only for shared folders on which BranchCache is enabled",
            "displayName": "Allow hash publication only for shared folders on which BranchCache is enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_lbl_hashpublicationactioncombo_1",
            "description": null,
            "helpText": null,
            "name": "Disallow hash publication on all shared folders",
            "displayName": "Disallow hash publication on all shared folders",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_lbl_hashpublicationactioncombo_2",
            "description": null,
            "helpText": null,
            "name": "Allow hash publication for all shared folders",
            "displayName": "Allow hash publication for all shared folders",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_lanmanserver_pol_hashpublication"
                }
            ],
            "dependedOnBy": []
        }
    ]
}