{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcNoProfileContainingFolder",
        "No Profile Containing Folder",
        "\\FSLogix\\ODFC Containers\\Container and Directory Naming",
        "Administrative Templates\\FSLogix\\ODFC Containers\\Container and Directory Naming",
        "Container and Directory Naming"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC~ODFC_ContainerandDirectoryNaming/OdfcNoProfileContainingFolder",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcnoprofilecontainingfolder",
    "categoryId": "81eb92d0-acda-4ea2-8183-29ed5457276b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcnoprofilecontainingfolder",
    "description": "VHD(x) file is placed and used in the root VHDLocation rather than in a SID directory under VHDLocation\r\n\r\nNOTE:  This setting will override ANY OTHER setting related to container folders.\r\n\r\n- SIDDIRNameMatch has NO EFFECT when used in conjunction with this setting.\r\n- SIDDIRNamePattern has NO EFFECT when used in conjunction with this setting.\r\n- FlipFlopProfileDirectoryName has NO EFFECT when used in conjunction with this setting.\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\Policies\\FSLogix\\ODFC\\NoProfileContainingFolder\r\nType:  DWORD\r\nValues:  0 = Disable, 1 = Enabled",
    "helpText": "",
    "name": "OdfcNoProfileContainingFolder",
    "displayName": "No Profile Containing Folder",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcnoprofilecontainingfolder_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcnoprofilecontainingfolder_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc~odfc_containeranddirectorynaming_odfcnoprofilecontainingfolder_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}