{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultLocalFontsSetting",
        "Default Local Fonts permission setting",
        "\\Google\\Google Chrome\\Content settings",
        "Google\\Google Chrome\\Content settings",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~ContentSettings/DefaultLocalFontsSetting",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting",
    "categoryId": "59d29716-55b0-4014-a458-38b408ff9530",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting_defaultlocalfontssetting",
    "description": "",
    "helpText": "",
    "name": "DefaultLocalFontsSetting",
    "displayName": "Default Local Fonts permission setting (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting_defaultlocalfontssetting_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting_defaultlocalfontssetting_2",
            "description": null,
            "helpText": null,
            "name": "Denies the Local Fonts permission on all sites by default",
            "displayName": "Denies the Local Fonts permission on all sites by default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting_defaultlocalfontssetting_3",
            "description": null,
            "helpText": null,
            "name": "Ask every time a site wants obtain the Local Fonts permission",
            "displayName": "Ask every time a site wants obtain the Local Fonts permission",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting_1",
                    "parentSettingId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_defaultlocalfontssetting"
                }
            ],
            "dependedOnBy": []
        }
    ]
}