{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ConfigureRpcAuthnLevelPrivacyEnabled",
        "Configure RPC packet level privacy setting for incoming connections",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-printers#printers-configurerpcauthnlevelprivacyenabled"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Printers/ConfigureRpcAuthnLevelPrivacyEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcauthnlevelprivacyenabled",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_printers_configurerpcauthnlevelprivacyenabled",
    "description": "\r\nThis policy setting controls whether packet level privacy is enabled for RPC for incoming connections.\r\n\r\nBy default packet level privacy is enabled for RPC for incoming connections.\r\n\r\nIf you enable or do not configure this policy setting, packet level privacy is enabled for RPC for incoming connections.\r\n      ",
    "helpText": "",
    "name": "ConfigureRpcAuthnLevelPrivacyEnabled",
    "displayName": "Configure RPC packet level privacy setting for incoming connections",
    "defaultOptionId": "device_vendor_msft_policy_config_printers_configurerpcauthnlevelprivacyenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_printers_configurerpcauthnlevelprivacyenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_printers_configurerpcauthnlevelprivacyenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}