{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "FDVRecoveryUsage_Name",
        "Choose how BitLocker-protected fixed drives can be recovered",
        "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
        "Fixed Data Drives"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/FixedDrivesRecoveryOptions",
    "rootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
    "categoryId": "36aafec3-7ffb-4ab9-bef9-b8bb431bf8b3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
    "description": "",
    "helpText": "",
    "name": "FDVRecoveryPasswordUsageDropDown_Name",
    "displayName": "\r\nConfigure user storage of BitLocker recovery information:\r\n",
    "defaultOptionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
            "description": null,
            "helpText": null,
            "name": "Allow 48-digit recovery password",
            "displayName": "Allow 48-digit recovery password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_1",
            "description": null,
            "helpText": null,
            "name": "Require 48-digit recovery password",
            "displayName": "Require 48-digit recovery password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_0",
            "description": null,
            "helpText": null,
            "name": "Do not allow 48-digit recovery password",
            "displayName": "Do not allow 48-digit recovery password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}