{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UX_Configuration_Notification_Suppress",
        "Suppress all notifications",
        "\\Windows Components\\Microsoft Defender Antivirus\\Client Interface",
        "Administrative Templates\\Windows Components\\Microsoft Defender Antivirus\\Client Interface",
        "Client Interface",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows Defender\\UX Configuration",
        "Notification_Suppress"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-microsoftdefenderantivirus#admx-microsoftdefenderantivirus-ux-configuration-notification-suppress"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MicrosoftDefenderAntivirus/UX_Configuration_Notification_Suppress",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_notification_suppress",
    "categoryId": "e06fb472-94c1-4dd9-afdf-6bb2ddaa3dc6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_notification_suppress",
    "description": "Use this policy setting to specify if you want Microsoft Defender Antivirus notifications to display on clients.\r\n      If you disable or do not configure this setting, Microsoft Defender Antivirus notifications will display on clients.\r\n\r\n      If you enable this setting, Microsoft Defender Antivirus notifications will not display on clients.\r\n    \r\n ",
    "helpText": "",
    "name": "UX_Configuration_Notification_Suppress",
    "displayName": "Suppress all notifications",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_notification_suppress_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_notification_suppress_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_ux_configuration_notification_suppress_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}