{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UserAgentReduction",
        "Enable or disable the User-Agent Reduction",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev99~Policy~microsoft_edge/UserAgentReduction",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_useragentreduction",
    "description": "",
    "helpText": "",
    "name": "UserAgentReduction",
    "displayName": "Enable or disable the User-Agent Reduction (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_useragentreduction_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_useragentreduction_0",
            "description": null,
            "helpText": null,
            "name": "User-Agent reduction will be controllable via Experimentation",
            "displayName": "User-Agent reduction will be controllable via Experimentation",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_1",
                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_useragentreduction_1",
            "description": null,
            "helpText": null,
            "name": "User-Agent reduction diabled, and not enabled by Experimentation",
            "displayName": "User-Agent reduction diabled, and not enabled by Experimentation",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_1",
                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_useragentreduction_2",
            "description": null,
            "helpText": null,
            "name": "User-Agent reduction will be enabled for all origins",
            "displayName": "User-Agent reduction will be enabled for all origins",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_1",
                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction"
                }
            ],
            "dependedOnBy": []
        }
    ]
}