{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebRtcIPHandlingUrl",
        "WebRTC IP Handling Policy for URL Patterns",
        "\\Microsoft Edge\\WebRtc settings",
        "Microsoft Edge\\WebRtc settings",
        "Web Rtc settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev135~Policy~microsoft_edge~WebRtc/WebRtcIPHandlingUrl",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl",
    "categoryId": "08677354-6f67-455e-a430-4d8d2fbabe84",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl",
    "description": "Controls which IP addresses and network interfaces WebRTC can use\r\nwhen establishing connections for specific URL patterns.\r\n\r\nHow It Works:\r\nAccepts a list of URL patterns, each paired with a handling type.\r\nWebRTC evaluates patterns sequentially; the first match determines the handling type.\r\nIf no match is found, WebRTC defaults to the WebRtcLocalhostIpHandling WebRtcLocalhostIpHandling. policy.\r\nThis policy applies only to origins—URL path components are ignored.\r\nWildcards (*) are supported in URL patterns.\r\n\r\nSupported Handling Values:\r\ndefault – Uses all available network interfaces.\r\ndefault_public_and_private_interfaces – WebRTC uses all public and private interfaces.\r\ndefault_public_interface_only – WebRTC uses only public interfaces.\r\ndisable_non_proxied_udp – WebRTC uses UDP SOCKS proxying or falls back to TCP proxying.\r\n\r\nMore Information:\r\nValid input patterns: https://go.microsoft.com/fwlink/?linkid=2095322\r\nHandling types: https://tools.ietf.org/html/rfc8828.html#section-5.2\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"url\": \"https://www.example.com\",\r\n    \"handling\": \"default_public_and_private_interfaces\"\r\n  },\r\n  {\r\n    \"url\": \"https://[*.]example.edu\",\r\n    \"handling\": \"default_public_interface_only\"\r\n  },\r\n  {\r\n    \"url\": \"*\",\r\n    \"handling\": \"disable_non_proxied_udp\"\r\n  }\r\n]",
    "helpText": "",
    "name": "WebRtcIPHandlingUrl",
    "displayName": "WebRTC IP Handling Policy for URL Patterns",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev135~policy~microsoft_edge~webrtc_webrtciphandlingurl_webrtciphandlingurl",
                    "required": true
                }
            ]
        }
    ]
}