{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrinterTypeDenyList",
        "Disable printer types on the deny list",
        "\\Google\\Google Chrome\\Printing",
        "Administrative Templates\\Google\\Google Chrome\\Printing",
        "Printing"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~Printing/PrinterTypeDenyList",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printertypedenylist",
    "categoryId": "62499519-97eb-43e7-ae96-d7909c5820d3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printertypedenylist",
    "description": "The printers of types placed on the deny list will be disabled from being discovered or having their capabilities fetched.\r\n\r\nPlacing all printer types on the deny list effectively disables printing, as there would be no available destinations to send a document for printing.\r\n\r\nIncluding cloud on the deny list has the same effect as setting the CloudPrintSubmitEnabled policy to false. In order to keep Google Cloud Print destinations discoverable, the CloudPrintSubmitEnabled policy must be set to true and cloud must not be on the deny list.\r\n\r\nIf the policy is not set, or is set to an empty list, all printer types will be available for discovery.\r\n\r\nExtension printers are also known as print provider destinations, and include any destination that belongs to a Google Chrome extension.\r\n\r\nLocal printers are also known as native printing destinations, and include destinations available to the local machine and shared network printers.\r\n\r\nExample value:\r\n\r\ncloud\r\nprivet",
    "helpText": "",
    "name": "PrinterTypeDenyList",
    "displayName": "Disable printer types on the deny list",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printertypedenylist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printertypedenylist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printertypedenylist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~printing_printertypedenylist_printertypedenylistdesc",
                    "required": true
                }
            ]
        }
    ]
}