{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IPHTTPS_ClientState",
        "Set IP-HTTPS State",
        "\\Network\\TCPIP Settings\\IPv6 Transition Technologies",
        "Administrative Templates\\Network\\TCPIP Settings\\IPv6 Transition Technologies",
        "IPv6 Transition Technologies"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_tcpip/IPHTTPS_ClientState",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate",
    "categoryId": "f52d9745-eaf4-4e39-84b2-6b32c3b15aa3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_stateselect",
    "description": null,
    "helpText": "",
    "name": "StateSelect",
    "displayName": "Select Interface state from the following options: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_stateselect_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_stateselect_0",
            "description": null,
            "helpText": null,
            "name": "Default State",
            "displayName": "Default State",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_stateselect_2",
            "description": null,
            "helpText": null,
            "name": "Enabled State",
            "displayName": "Enabled State",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_stateselect_3",
            "description": null,
            "helpText": null,
            "name": "Disabled State",
            "displayName": "Disabled State",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_tcpip_iphttps_clientstate"
                }
            ],
            "dependedOnBy": []
        }
    ]
}