{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,execute",
    "keywords": [
        "Install",
        "WindowsDefenderApplicationGuard",
        "Microsoft Defender Application Guard"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/windowsdefenderapplicationguard-csp/"
    ],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/WindowsDefenderApplicationGuard",
    "offsetUri": "/InstallWindowsDefenderApplicationGuard",
    "rootDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard",
    "categoryId": "cd55f347-a417-4fe9-83ee-8f1f40ac5eb0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "device_vendor_msft_windowsdefenderapplicationguard_installwindowsdefenderapplicationguard",
    "description": "Initiates remote installation of Application Guard feature.",
    "helpText": "",
    "name": "InstallWindowsDefenderApplicationGuard",
    "displayName": "Install Windows defender application guard",
    "defaultOptionId": "device_vendor_msft_windowsdefenderapplicationguard_installwindowsdefenderapplicationguard_install",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager",
        "configurationServiceProviderVersion": "1.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "unknown",
            "windowsCloudN"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_windowsdefenderapplicationguard_installwindowsdefenderapplicationguard_install",
            "description": "Will initiate feature install.",
            "helpText": null,
            "name": "Install",
            "displayName": "Install - Will initiate feature install",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Install"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard_1",
                    "parentSettingId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard"
                },
                {
                    "dependentOn": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard_2",
                    "parentSettingId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard"
                },
                {
                    "dependentOn": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard_3",
                    "parentSettingId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard"
                }
            ],
            "dependedOnBy": []
        }
    ]
}