{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DNS_RegistrationTtl",
        "TTL value for A and PTR records",
        "\\Network\\DNS Client",
        "Administrative Templates\\Network\\DNS Client",
        "DNS Client",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\DNSClient"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-dnsclient#admx-dnsclient-dns-registrationttl"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DnsClient/DNS_RegistrationTtl",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_dnsclient_dns_registrationttl",
    "categoryId": "bd8dacbf-ab7b-4a93-8294-7db61b9d49b4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_dnsclient_dns_registrationttl",
    "description": "\r\nSpecifies the value of the time to live (TTL) field in A and PTR resource records that are registered by computers to which this policy setting is applied.\r\n\r\nTo specify the TTL, click Enabled and then enter a value in seconds (for example, 900 is 15 minutes).\r\n\r\nIf you enable this policy setting, the TTL value that you specify will be applied to DNS resource records registered for all network connections used by computers that receive this policy setting.\r\n\r\nIf you disable this policy setting, or if you do not configure this policy setting, computers will use the TTL settings specified in DNS. By default, the TTL is 1200 seconds (20 minutes).\n ",
    "helpText": "",
    "name": "DNS_RegistrationTtl",
    "displayName": "TTL value for A and PTR records",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_dnsclient_dns_registrationttl_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_dnsclient_dns_registrationttl_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_dnsclient_dns_registrationttl_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_dnsclient_dns_registrationttl_dns_registrationttllabel",
                    "required": true
                }
            ]
        }
    ]
}