{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Prevent Users From Turning On Browser Syncing",
        "Experience"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Experience#experience-preventusersfromturningonbrowsersyncing"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Experience/PreventUsersFromTurningOnBrowserSyncing",
    "rootDefinitionId": "device_vendor_msft_policy_config_experience_preventusersfromturningonbrowsersyncing",
    "categoryId": "139974ad-f615-442b-b3dc-84a44e3ec663",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_experience_preventusersfromturningonbrowsersyncing",
    "description": "You can configure Microsoft Edge to allow users to turn on the Sync your Settings option to sync information, such as history and favorites, between user's devices.  When enabled and you enable the Do not sync browser setting policy, browser settings sync automatically. If disabled, users have the option to sync the browser settings.                         Related policy: DoNotSyncBrowserSettings                         1 (default) = Do not allow users to turn on syncing, 0 = Allows users to turn on syncing",
    "helpText": "",
    "name": "PreventUsersFromTurningOnBrowserSyncing",
    "displayName": "Prevent Users From Turning On Browser Syncing",
    "defaultOptionId": "device_vendor_msft_policy_config_experience_preventusersfromturningonbrowsersyncing_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_experience_preventusersfromturningonbrowsersyncing_0",
            "description": "Allowed/turned on. Users can sync the browser settings.",
            "helpText": null,
            "name": "Allowed/turned on. Users can sync the browser settings.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_experience_preventusersfromturningonbrowsersyncing_1",
            "description": "Prevented/turned off.",
            "helpText": null,
            "name": "Prevented/turned off.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}