{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcRoamSearch",
        "Roam Search",
        "\\FSLogix\\ODFC Containers",
        "Administrative Templates\\FSLogix\\ODFC Containers",
        "ODFC Containers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC/OdfcRoamSearch",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch",
    "categoryId": "5c645a3e-bc39-44e9-8786-4c82e0553d22",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_odfcroamsearch",
    "description": "",
    "helpText": "",
    "name": "OdfcRoamSearch",
    "displayName": "",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_odfcroamsearch_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_odfcroamsearch_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_odfcroamsearch_1",
            "description": null,
            "helpText": null,
            "name": "Single-user Search",
            "displayName": "Single-user Search",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_odfcroamsearch_2",
            "description": null,
            "helpText": null,
            "name": "Multi-user Search",
            "displayName": "Multi-user Search",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcroamsearch"
                }
            ],
            "dependedOnBy": []
        }
    ]
}