{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OdfcVHDAccessMode",
        "VHD Access Mode",
        "\\FSLogix\\ODFC Containers",
        "Administrative Templates\\FSLogix\\ODFC Containers",
        "ODFC Containers"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~ODFC/OdfcVHDAccessMode",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode",
    "categoryId": "5c645a3e-bc39-44e9-8786-4c82e0553d22",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_odfcvhdaccessmode",
    "description": "",
    "helpText": "",
    "name": "OdfcVHDAccessMode",
    "displayName": "",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_odfcvhdaccessmode_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_odfcvhdaccessmode_0",
            "description": null,
            "helpText": null,
            "name": "Direct Access",
            "displayName": "Direct Access",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_odfcvhdaccessmode_1",
            "description": null,
            "helpText": null,
            "name": "DiffDisk On Network",
            "displayName": "DiffDisk On Network",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_odfcvhdaccessmode_2",
            "description": null,
            "helpText": null,
            "name": "Local DiffDisk",
            "displayName": "Local DiffDisk",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_odfcvhdaccessmode_3",
            "description": null,
            "helpText": null,
            "name": "Unique Disk per Session",
            "displayName": "Unique Disk per Session",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~odfc_odfcvhdaccessmode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}