{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OnBulkDataEntryEnterpriseConnector",
        "Configuration policy for bulk data entry for Microsoft Edge for Business Data Loss Prevention Connectors",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev137~Policy~microsoft_edge/OnBulkDataEntryEnterpriseConnector",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev137~policy~microsoft_edge_onbulkdataentryenterpriseconnector",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev137~policy~microsoft_edge_onbulkdataentryenterpriseconnector",
    "description": "List of Microsoft Edge for Business Data Loss Prevention Connectors services settings to be applied when data is entered in Microsoft Edge from the clipboard or by drag and dropping web content.\r\n\r\nConnector Fields\r\n\r\n1. url_list,\r\ntags,\r\nenable,\r\ndisable\r\nThese fields determine whether the connector sends data for analysis when content is entered on a specific page, and which tags to include in the analysis request.\r\nA tag associated with an enable pattern is included in the request if the page URL matches the pattern—unless a corresponding disable pattern also matches.\r\nAnalysis is triggered if at least one tag is included in the request.\r\n\r\n2. service_provider\r\nIdentifies the analysis service provider the configuration applies to.\r\n\r\n3. block_until_verdict\r\nIf set to 1, Microsoft Edge waits for a response from the analysis service before giving the page access to the data.\r\nAny other integer value allows the page to access the data immediately.\r\n\r\n4. default_action\r\nIf set to block, Microsoft Edge denies page access to the data if an error occurs while contacting the analysis service.\r\nAny other value permits the page to access the data.\r\n\r\n5. minimum_data_size\r\nSpecifies the minimum size (in bytes) that the entered data must meet or exceed to be scanned.\r\nDefault: 100 bytes if the field is not set.\r\n\r\nThis policy requires additional setup to take effect. For configuration guidance, see https://go.microsoft.com/fwlink/?linkid=2320413.\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"block_until_verdict\": 0,\r\n    \"default_action\": \"allow\",\r\n    \"disable\": [\r\n      {\r\n        \"tags\": [\r\n          \"malware\"\r\n        ],\r\n        \"url_list\": [\r\n          \"*.us.com\"\r\n        ]\r\n      }\r\n    ],\r\n    \"enable\": [\r\n      {\r\n        \"tags\": [\r\n          \"malware\"\r\n        ],\r\n        \"url_list\": [\r\n          \"*\"\r\n        ]\r\n      },\r\n      {\r\n        \"tags\": [\r\n          \"dlp\"\r\n        ],\r\n        \"url_list\": [\r\n          \"*.them.com\",\r\n          \"*.others.com\"\r\n        ]\r\n      }\r\n    ],\r\n    \"minimum_data_size\": 100,\r\n    \"service_provider\": \"local_system_agent\"\r\n  }\r\n]",
    "helpText": "",
    "name": "OnBulkDataEntryEnterpriseConnector",
    "displayName": "Configuration policy for bulk data entry for Microsoft Edge for Business Data Loss Prevention Connectors",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev137~policy~microsoft_edge_onbulkdataentryenterpriseconnector_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev137~policy~microsoft_edge_onbulkdataentryenterpriseconnector_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev137~policy~microsoft_edge_onbulkdataentryenterpriseconnector_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev137~policy~microsoft_edge_onbulkdataentryenterpriseconnector_onbulkdataentryenterpriseconnector",
                    "required": true
                }
            ]
        }
    ]
}