{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Let Apps Access Phone User In Control Of These Apps",
        "Privacy"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Privacy#letappsaccessphone_userincontroloftheseapps"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Privacy/LetAppsAccessPhone_UserInControlOfTheseApps",
    "rootDefinitionId": "device_vendor_msft_policy_config_privacy_letappsaccessphone_userincontroloftheseapps",
    "categoryId": "98e76d3e-9e52-45b3-b0c7-f029023121e9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_privacy_letappsaccessphone_userincontroloftheseapps",
    "description": "List of semi-colon delimited Package Family Names of Microsoft Store Apps. The user is able to control the phone call privacy setting for the listed apps. This setting overrides the default LetAppsAccessPhone policy setting for the specified apps.",
    "helpText": "",
    "name": "LetAppsAccessPhone_UserInControlOfTheseApps",
    "displayName": "Let Apps Access Phone User In Control Of These Apps",
    "maximumCount": 600,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}