{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Configure Microsoft Update Managed Opt In",
        "Secure Boot"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-SecureBoot#configuremicrosoftupdatemanagedoptin"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/SecureBoot/ConfigureMicrosoftUpdateManagedOptIn",
    "rootDefinitionId": "device_vendor_msft_policy_config_secureboot_configuremicrosoftupdatemanagedoptin",
    "categoryId": "a3e48951-624d-4fee-b470-d17ce16e6b0c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_secureboot_configuremicrosoftupdatemanagedoptin",
    "description": "This policy controls provides permission to opt-in to CFR servicing (Microsoft Managed)",
    "helpText": "",
    "name": "ConfigureMicrosoftUpdateManagedOptIn",
    "displayName": "Configure Microsoft Update Managed Opt In",
    "defaultOptionId": "device_vendor_msft_policy_config_secureboot_configuremicrosoftupdatemanagedoptin_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19044",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_secureboot_configuremicrosoftupdatemanagedoptin_0",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_secureboot_configuremicrosoftupdatemanagedoptin_1",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}