{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Streaming_Reestablishment_Retries",
        "Reestablishment Retries",
        "\\System\\App-V\\Streaming",
        "AppVirtualization",
        "App Virtualization",
        "Streaming"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/StreamingAllowReestablishmentRetries",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentretries",
    "categoryId": "3800661e-5841-4499-8d4e-914527435f59",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentretries_streaming_reestablishment_retries_prompt",
    "description": "",
    "helpText": "",
    "name": "Streaming_Reestablishment_Retries_Prompt",
    "displayName": "Reestablishment Retries:",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 99,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 3
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentretries_1",
            "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentretries"
        }
    ],
    "dependedOnBy": []
}