{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Use of Biometrics (Device)",
        "PassportForWork",
        "Windows Hello For Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
    ],
    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
    "offsetUri": "/Biometrics/UseBiometrics",
    "rootDefinitionId": "device_vendor_msft_passportforwork_biometrics_usebiometrics",
    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_passportforwork_biometrics_usebiometrics",
    "description": "Windows Hello for Business enables users to use biometric gestures, such as face and fingerprints, as an alternative to the PIN gesture. However, users must still configure a PIN to use in case of failures.\n\nIf you enable or do not configure this policy setting, Windows Hello for Business allows the use of biometric gestures.\n\nIf you disable this policy setting, Windows Hello for Business prevents the use of biometric gestures.\n\nNOTE: Disabling this policy prevents the use of biometric gestures on the device for all account types.",
    "helpText": "",
    "name": "UseBiometrics",
    "displayName": "Allow Use of Biometrics",
    "defaultOptionId": "device_vendor_msft_passportforwork_biometrics_usebiometrics_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager",
        "configurationServiceProviderVersion": "1.2",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_passportforwork_biometrics_usebiometrics_false",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_passportforwork_biometrics_usebiometrics_true",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}