{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "RestrictHistory",
        "Disable \"Configuring History\"",
        "\\Windows Components\\Internet Explorer\\Delete Browsing History",
        "Delete Browsing History"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/DisableConfiguringHistory",
    "rootDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableconfiguringhistory",
    "categoryId": "dea96bde-003b-46fa-a960-baf62289c57d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_internetexplorer_disableconfiguringhistory_daystokeep_prompt",
    "description": "",
    "helpText": "",
    "name": "DaysToKeep_Prompt",
    "displayName": "Days to keep pages in History",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 999,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 20
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_internetexplorer_disableconfiguringhistory_1",
            "parentSettingId": "device_vendor_msft_policy_config_internetexplorer_disableconfiguringhistory"
        }
    ],
    "dependedOnBy": []
}