{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Auth Rate Limiter Delay In Ms",
        "Lanman Server"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LanmanServer#authratelimiterdelayinms"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/LanmanServer/AuthRateLimiterDelayInMs",
    "rootDefinitionId": "device_vendor_msft_policy_config_lanmanserver_authratelimiterdelayinms",
    "categoryId": "1c3001ea-af28-4291-94b0-7f12ea93d3ca",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_lanmanserver_authratelimiterdelayinms",
    "description": "This policy controls whether the SMB server will use a default value in milliseconds for the invalid authentication delay. If you configure this policy setting, the authentication rate limiter will use the specified value for delaying invalid authentication attempts. If you do not configure this policy setting, the authentication rate limiter will use the default value obtained from either the software licensing service or the local registry.",
    "helpText": "",
    "name": "AuthRateLimiterDelayInMs",
    "displayName": "Auth Rate Limiter Delay In Ms",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100.3613",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 10000,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 2000
    },
    "dependentOn": [],
    "dependedOnBy": []
}