{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_ECSControl",
        "Control updater's communication with the Experimentation and Configuration Service",
        "\\Microsoft Edge Update",
        "Microsoft Edge Update"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev94~Policy~Cat_EdgeUpdate/Pol_ECSControl",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol",
    "categoryId": "d4943981-47b2-4a86-848b-860e8ca47381",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol_part_ecscontrol",
    "description": "",
    "helpText": "",
    "name": "Part_ECSControl",
    "displayName": "Control updater's communication with Experimentation and Configuration Service (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol_part_ecscontrol_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol_part_ecscontrol_0",
            "description": null,
            "helpText": null,
            "name": "Disable communication with the Experimentation and Configuration Service",
            "displayName": "Disable communication with the Experimentation and Configuration Service",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol_part_ecscontrol_1",
            "description": null,
            "helpText": null,
            "name": "Enable communication and download experiments",
            "displayName": "Enable communication and download experiments",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol_1",
                    "parentSettingId": "device_vendor_msft_policy_config_updatev94~policy~cat_edgeupdate_pol_ecscontrol"
                }
            ],
            "dependedOnBy": []
        }
    ]
}