{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableProtectedEventLogging",
        "Enable Protected Event Logging",
        "\\Windows Components\\Event Logging",
        "Administrative Templates\\Windows Components\\Event Logging",
        "Event Logging"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EventLogging/EnableProtectedEventLogging",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_eventlogging_enableprotectedeventlogging",
    "categoryId": "a57f0abc-605b-433e-b7da-45ee127188cd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_eventlogging_enableprotectedeventlogging_encryptioncertificate",
    "description": null,
    "helpText": "",
    "name": "EncryptionCertificate",
    "displayName": "\r\nProvide an encryption certificate to be used by Protected Event Logging. You may provide either:\r\n\r\n    - The content of a base-64 encoded X.509 certificate\r\n    - The thumbprint of a certificate that can be found in the Local Machine certificate store (usually deployed by PKI infrastructure)\r\n    - The full path to a certificate (can be local, or a remote share)\r\n    - The path to a directory containing a certificate or certificates (can be local, or a remote share)\r\n    - The subject name of a certificate that can be found in the Local Machine certificate store (usually deployed by PKI infrastructure)\r\n\r\nThe resulting certificate must have 'Document Encryption' as an enhanced key usage (1.3.6.1.4.1.311.80.1), as well as either Data Encipherment or Key Encipherment key usages enabled.\r\n",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_admx_eventlogging_enableprotectedeventlogging_1",
            "parentSettingId": "device_vendor_msft_policy_config_admx_eventlogging_enableprotectedeventlogging"
        }
    ],
    "dependedOnBy": []
}