{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UpdateConfigurationFile",
        "Custom path to the update configuration file",
        "\\Visual Studio\\Install and Update Settings",
        "Administrative Templates\\Visual Studio\\Install and Update Settings",
        "Install and Update Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov1~Policy~VisualStudio~InstallandUpdateSettings/UpdateConfigurationFile",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_updateconfigurationfile",
    "categoryId": "175ddbac-b0ae-4d9d-b76e-4eb1a487fc93",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_updateconfigurationfile",
    "description": "The custom file path to the update configuration file used for configuring administrator updates. For more information, see https://aka.ms/vs/admin/updates/configurationfile.",
    "helpText": "",
    "name": "UpdateConfigurationFile",
    "displayName": "Custom path to the update configuration file",
    "defaultOptionId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_updateconfigurationfile_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_updateconfigurationfile_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_updateconfigurationfile_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_visualstudiov1~policy~visualstudio~installandupdatesettings_updateconfigurationfile_updateconfigurationfile_textbox",
                    "required": true
                }
            ]
        }
    ]
}