{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MSI_MaxPatchCacheSize",
        "Control maximum size of baseline file cache",
        "\\Windows Components\\Windows Installer",
        "Administrative Templates\\Windows Components\\Windows Installer",
        "Windows Installer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-msi#admx-msi-msi-maxpatchcachesize"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MSI/MSI_MaxPatchCacheSize",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_msi_msi_maxpatchcachesize",
    "categoryId": "ce0b1189-57ea-4444-a93e-e4be17160f18",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_msi_msi_maxpatchcachesize",
    "description": "\r\n        This policy controls the percentage of disk space available to the Windows Installer baseline file cache.\r\n\r\n        The Windows Installer uses the baseline file cache to save baseline files modified by binary delta difference updates. The cache is used to retrieve the baseline file for future updates. The cache eliminates user prompts for source media when new updates are applied.\r\n\r\n        If you enable this policy setting you can modify the maximum size of the Windows Installer baseline file cache.\r\n\r\n        If you set the baseline cache size to 0, the Windows Installer will stop populating the baseline cache for new updates. The existing cached files will remain on disk and will be deleted when the product is removed.\r\n\r\n        If you set the baseline cache to 100, the Windows Installer will use available free space for the baseline file cache.\r\n\r\n        If you disable or do not configure this policy setting, the Windows Installer will uses a default value of 10 percent for the baseline file cache maximum size.\r\n ",
    "helpText": "",
    "name": "MSI_MaxPatchCacheSize",
    "displayName": "Control maximum size of baseline file cache",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_msi_msi_maxpatchcachesize_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_msi_msi_maxpatchcachesize_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_msi_msi_maxpatchcachesize_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_msi_msi_maxpatchcachesize_msi_maxpatchcachesize",
                    "required": true
                }
            ]
        }
    ]
}