{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ScreenCaptureWithoutGestureAllowedForOrigins",
        "Allow screen capture without prior user gesture",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/ScreenCaptureWithoutGestureAllowedForOrigins",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_screencapturewithoutgestureallowedfororigins",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_screencapturewithoutgestureallowedfororigins",
    "description": "For security reasons, the\r\ngetDisplayMedia() web API requires\r\na prior user gesture (\"transient activation\") to be called or will otherwise\r\nfail.\r\n\r\nWith this policy set, admins can specify origins on which this API can be\r\ncalled without prior user gesture.\r\n\r\nFor detailed information on valid url patterns, please see\r\nhttps://cloud.google.com/docs/chrome-enterprise/policies/url-patterns. * is\r\nnot an accepted value for this policy.\r\n\r\nIf this policy is unset, all origins will require a prior user gesture to call\r\nthis API.\r\n\r\nExample value:\r\n\r\nhttps://www.example.com\r\n[*.]example.edu",
    "helpText": "",
    "name": "ScreenCaptureWithoutGestureAllowedForOrigins",
    "displayName": "Allow screen capture without prior user gesture",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_screencapturewithoutgestureallowedfororigins_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_screencapturewithoutgestureallowedfororigins_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_screencapturewithoutgestureallowedfororigins_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_screencapturewithoutgestureallowedfororigins_screencapturewithoutgestureallowedfororiginsdesc",
                    "required": true
                }
            ]
        }
    ]
}