{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_CreateDesktopShortcutMicrosoftEdgeDev",
        "Prevent Desktop Shortcut creation upon install",
        "\\Microsoft Edge Update\\Applications\\Microsoft Edge Dev",
        "Microsoft Edge Update\\Applications\\Microsoft Edge Dev",
        "Microsoft Edge Dev",
        "Create Desktop Shortcut upon install",
        "Machine",
        "Software\\Policies\\Microsoft\\EdgeUpdate",
        "CreateDesktopShortcut{0D50BFEC-CD6A-4F9A-964C-C7416E3ACB10}"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev83diff~Policy~Cat_EdgeUpdate~Cat_Applications~Cat_MicrosoftEdgeDev/Pol_CreateDesktopShortcutMicrosoftEdgeDev",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev83diff~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_createdesktopshortcutmicrosoftedgedev",
    "categoryId": "13f62499-a266-42c8-a4dc-531efcea55cb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_updatev83diff~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_createdesktopshortcutmicrosoftedgedev",
    "description": "If you enable this policy a desktop shortcut is created when Microsoft Edge is installed.\r\n  If you disable this policy, no desktop shortcut will be created when Microsoft Edge is installed.\r\n  If you don’t configure this policy a desktop shortcut to Microsoft Edge will be created during installation. \r\n  If Microsoft Edge is already installed, this policy will have no effect.\r\n\r\n  If you don't configure this policy for a channel, the 'CreateDesktopShortcut default' policy configuration determines shortcut creation when Microsoft Edge is installed.",
    "helpText": "",
    "name": "Pol_CreateDesktopShortcutMicrosoftEdgeDev",
    "displayName": "Prevent Desktop Shortcut creation upon install",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev83diff~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_createdesktopshortcutmicrosoftedgedev_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev83diff~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_createdesktopshortcutmicrosoftedgedev_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev83diff~policy~cat_edgeupdate~cat_applications~cat_microsoftedgedev_pol_createdesktopshortcutmicrosoftedgedev_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}