{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UpdateNotificationsOptOut",
        "Disable update notifications in Visual Studio",
        "\\Visual Studio\\Install and Update Settings",
        "Visual Studio\\Install and Update Settings",
        "Install and Update Settings",
        "Machine",
        "SOFTWARE\\Policies\\Microsoft\\VisualStudio\\Setup"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov5~Policy~VisualStudio~InstallandUpdateSettings/UpdateNotificationsOptOut",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov5~policy~visualstudio~installandupdatesettings_updatenotificationsoptout",
    "categoryId": "175ddbac-b0ae-4d9d-b76e-4eb1a487fc93",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_visualstudiov5~policy~visualstudio~installandupdatesettings_updatenotificationsoptout",
    "description": "Allows an administrator to control the update notification in the Visual Studio IDE in specific situations.\r\n\r\nIf set to 0 (blocked) or missing entirely, update notifications will appear in the Visual Studio IDE whenever an update is detected.\r\n\r\nIf set to a 1, the update notification in the Visual Studio IDE will be suppressed for the Enterprise and Professional editions on the Release or LTSC channels, only if they are either receiving updates from a layout or if they are enrolled to receive Visual Studio Administrator Updates.\r\n\r\nFor more information, see https://aka.ms/vs/setup/policies.",
    "helpText": "",
    "name": "UpdateNotificationsOptOut",
    "displayName": "Disable update notifications in Visual Studio",
    "defaultOptionId": "device_vendor_msft_policy_config_visualstudiov5~policy~visualstudio~installandupdatesettings_updatenotificationsoptout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov5~policy~visualstudio~installandupdatesettings_updatenotificationsoptout_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov5~policy~visualstudio~installandupdatesettings_updatenotificationsoptout_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}