{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "InboxActiveSchemeOverride_2",
        "Select an active power plan",
        "\\System\\Power Management",
        "Administrative Templates\\System\\Power Management",
        "Power Management"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Power/InboxActiveSchemeOverride_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2",
    "categoryId": "62b373da-c112-40f4-9047-9cc3e8d8ab13",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_inboxactiveschemeoverrideenter",
    "description": null,
    "helpText": "",
    "name": "InboxActiveSchemeOverrideEnter",
    "displayName": "Active Power Plan: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_inboxactiveschemeoverrideenter_381b4222-f694-41f0-9685-ff5bb260df2e",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_inboxactiveschemeoverrideenter_381b4222-f694-41f0-9685-ff5bb260df2e",
            "description": null,
            "helpText": null,
            "name": "Automatic (recommended)",
            "displayName": "Automatic (recommended)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "381b4222-f694-41f0-9685-ff5bb260df2e"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_inboxactiveschemeoverrideenter_a1841308-3541-4fab-bc81-f71556f20b4a",
            "description": null,
            "helpText": null,
            "name": "Power Saver",
            "displayName": "Power Saver",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "a1841308-3541-4fab-bc81-f71556f20b4a"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_inboxactiveschemeoverrideenter_8c5e7fda-e8bf-4a96-9a85-a6e23a8c635c",
            "description": null,
            "helpText": null,
            "name": "High Performance",
            "displayName": "High Performance",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8c5e7fda-e8bf-4a96-9a85-a6e23a8c635c"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_power_inboxactiveschemeoverride_2"
                }
            ],
            "dependedOnBy": []
        }
    ]
}