{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableSetupFirstUseConfiguration",
        "Do Not Show First Use Dialog Boxes",
        "\\Windows Components\\Windows Media Player",
        "Administrative Templates\\Windows Components\\Windows Media Player",
        "Windows Media Player"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsmediaplayer#admx-windowsmediaplayer-disablesetupfirstuseconfiguration"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsMediaPlayer/DisableSetupFirstUseConfiguration",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_disablesetupfirstuseconfiguration",
    "categoryId": "22ebd92b-80b6-493d-99d8-3c72f1a0827e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsmediaplayer_disablesetupfirstuseconfiguration",
    "description": "This policy setting allows you to prevent the anchor window from being displayed when Windows Media Player is in skin mode.\r\n\r\nIf you enable this policy setting, the anchor window is hidden when the Player is in skin mode. In addition, the option on the Player tab in the Player that enables users to choose whether the anchor window displays is not available.\r\n\r\nIf you disable or do not configure this policy setting, users can show or hide the anchor window when the Player is in skin mode by using the Player tab in the Player.\r\n\r\nIf you do not configure this policy setting, and the \"Set and lock skin\" policy setting is enabled, some options in the anchor window are not available.\r\n ",
    "helpText": "",
    "name": "DisableSetupFirstUseConfiguration",
    "displayName": "Do Not Show First Use Dialog Boxes",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_disablesetupfirstuseconfiguration_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_disablesetupfirstuseconfiguration_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsmediaplayer_disablesetupfirstuseconfiguration_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}