{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UiAutomationProviderEnabled",
        "Enable the browser's UI Automation accessibility framework provider on Windows",
        "\\Google\\Google Chrome\\Accessibility settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Accessibility settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~Accessibility/UiAutomationProviderEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~accessibility_uiautomationproviderenabled",
    "categoryId": "d9432f48-3072-4171-9031-4ebead394151",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~accessibility_uiautomationproviderenabled",
    "description": "Enables the UI Automation accessibility framework\r\nprovider in Google Chrome for use by\r\naccessibility tools.\r\n\r\nThis policy is supported in\r\nGoogle Chrome for a one-year\r\ntransition period to allow enterprise administrators to control the deployment\r\nof the browser's UI Automation accessibility\r\nframework provider. Accessibility and other tools that use the\r\nUI Automation accessibility framework to interoperate\r\nwith the browser may require updates to function properly with the browser's\r\nUI Automation provider. Administrators can use this\r\npolicy to temporarily disable the browser's\r\nUI Automation provider (thereby reverting to the old\r\nbehavior) while they work with vendors to provide updates to impacted tools.\r\n\r\nWhen set to false, Google Chrome only\r\nenables its Microsoft Active Accessibility\r\nprovider. Accessibility and other tools that use the newer\r\nUI Automation accessibility framework to interoperate\r\nwith the browser will communicate with it by way of a compatibility shim in\r\nMicrosoft® Windows®.\r\n\r\nWhen set to true, Google Chrome\r\nenables its UI Automation provider in addition to its\r\nMicrosoft Active Accessibility provider.\r\nAccessibility and other tools that use the newer\r\nUI Automation accessibility framework to interoperate\r\nwith the browser will communicate directly with it.\r\n\r\nWhen left unset, the variations framework in Google Chrome is used to enable or disable\r\nthe provider.\r\n\r\nSupport for this policy setting will end in Google Chrome 146.",
    "helpText": "",
    "name": "UiAutomationProviderEnabled",
    "displayName": "Enable the browser's UI Automation accessibility framework provider on Windows",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~accessibility_uiautomationproviderenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~accessibility_uiautomationproviderenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~accessibility_uiautomationproviderenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}