{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "DO Min Disk Size Allowed To Peer",
        "Delivery Optimization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-DeliveryOptimization#domindisksizeallowedtopeer"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeliveryOptimization/DOMinDiskSizeAllowedToPeer",
    "rootDefinitionId": "device_vendor_msft_policy_config_deliveryoptimization_domindisksizeallowedtopeer",
    "categoryId": "e2ec9af6-6143-4cd8-952c-1b3e849ee0dc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_deliveryoptimization_domindisksizeallowedtopeer",
    "description": "Specifies the required minimum disk size (capacity in GB) for the device to use Peer Caching. Recommended values: 64 GB to 256 GB. NoteIf the DOMofidyCacheDrive policy is set, the disk size check will apply to the new working directory specified by this policy. The default value is 32 GB.",
    "helpText": "",
    "name": "DOMinDiskSizeAllowedToPeer",
    "displayName": "DO Min Disk Size Allowed To Peer",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 100000,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}