{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableDeviceControl",
        "Enable Device Control Printing Restrictions",
        "\\Printers",
        "Administrative Templates\\Printers",
        "Printers",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows NT\\Printers"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-printers#printers-enabledevicecontrol"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Printers/EnableDeviceControl",
    "rootDefinitionId": "device_vendor_msft_policy_config_printers_enabledevicecontrol",
    "categoryId": "2becddf1-d8ea-49ec-8560-c8c401faa9bb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_printers_enabledevicecontrol",
    "description": "\r\n          Determines whether Device Control Printing Restrictions are enforced for printing on this computer.\r\n\r\n          By default, there are no restrictions to printing based on connection type or printer Make/Model.\r\n\r\n          If you enable this setting, the computer will restrict printing to printer connections on the corporate network or approved USB-connected printers.\r\n\r\n          If you disable this setting or do not configure it, there are no restrictions to printing based on connection type or printer Make/Model.\r\n ",
    "helpText": "",
    "name": "EnableDeviceControl",
    "displayName": "Enable Device Control Printing Restrictions",
    "defaultOptionId": "device_vendor_msft_policy_config_printers_enabledevicecontrol_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_printers_enabledevicecontrol_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_printers_enabledevicecontrol_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}