{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ProfilesCCDLocations",
        "CCD Locations",
        "\\FSLogix\\Profile Containers\\Cloud Cache",
        "Administrative Templates\\FSLogix\\Profile Containers\\Cloud Cache",
        "Cloud Cache"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~Profiles~Profiles_CCD/ProfilesCCDLocations",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~profiles~profiles_ccd_profilesccdlocations",
    "categoryId": "719595d8-ab5d-4418-88aa-8cd55c2964ba",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~profiles~profiles_ccd_profilesccdlocations",
    "description": "NOTE:  Once this policy is Enabled, only Disable will remove the registry value. Enabled to Not Configured will have NO EFFECT.\r\n\r\nCCDLocations are formatted using a type, name and a connectionString separated using a ; as the delimiter. The type will accept either smb or azure. The name is a free-form field used to describe the location. The connectionString for smb type must include the full UNC path to the file share. The connectionString for azure type should be secured as per the documentation (https://aka.ms/fslogix). The strings are case sensitive.\r\n\r\n- CCDLocations using SMB:  type=smb,name=\"SMB Share 1\",connectionString=\\\\<server 1 fqdn>\\<share name>;type=smb,name=\"SMB Share 2\"connectionString=\\\\<server 2 fqdn>\\<share name>\r\n\r\n- CCDLocations using Azure (secure):  type=smb,name=\"SMB Share 1\",connectionString=\\\\<server 1 fqdn>\\<share name>;type=azure,name=\"Azure Blob 1\",connectionString=\"|fslogix/stgacct1-connectionstring|\"\r\n\r\nRegistry Entry:  HKLM\\SOFTWARE\\FSLogix\\Profiles\\CCDLocations\r\nType:  REG_SZ",
    "helpText": "",
    "name": "ProfilesCCDLocations",
    "displayName": "CCD Locations",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~profiles~profiles_ccd_profilesccdlocations_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~profiles~profiles_ccd_profilesccdlocations_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~profiles~profiles_ccd_profilesccdlocations_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~profiles~profiles_ccd_profilesccdlocations_profilesccdlocations",
                    "required": true
                }
            ]
        }
    ]
}