{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "RDVDenyWriteAccess_Name",
        "Deny write access to removable drives not protected by BitLocker",
        "\\Windows Components\\BitLocker Drive Encryption\\Removable Data Drives",
        "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Removable Data Drives",
        "Removable Data Drives"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
    ],
    "baseUri": "./Device/Vendor/MSFT/BitLocker",
    "offsetUri": "/RemovableDrivesRequireEncryption",
    "rootDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
    "categoryId": "949a5b32-bbe6-40f6-9d73-99cf9fafe75f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
    "description": "",
    "helpText": "",
    "name": "RDVCrossOrg",
    "displayName": "Do not allow write access to devices configured in another organization",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
                    "parentSettingId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption"
                }
            ],
            "dependedOnBy": []
        }
    ]
}