{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableAutoConfig",
        "Disable silently sign in users to the OneDrive sync app with an existing credential that is made available to Microsoft applications",
        "\\OneDrive",
        "OneDrive"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv6~Policy~OneDriveNGSC/DisableAutoConfig",
    "rootDefinitionId": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disableautoconfig",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disableautoconfig",
    "description": "This setting determines whether or not the Sync client can automatically sign in.\r\n\r\nIf admins enable this setting (value 1), it prevents Sync from automatically signing with an existing AAD credential that is made available to Microsoft applications.\r\n\r\nIf admins disable (value 0) or do not configure this setting, Sync will automatically sign in.\r\n      ",
    "helpText": "",
    "name": "DisableAutoConfig",
    "displayName": "Disable silently sign in users to the OneDrive sync app with an existing credential that is made available to Microsoft applications",
    "defaultOptionId": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disableautoconfig_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disableautoconfig_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disableautoconfig_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disableautoconfig_disableautoconfigtypes",
                    "required": true
                }
            ]
        }
    ]
}