{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_DoNotShowLocalOnlyIcon",
        "Do not show the \"local access only\" network icon",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections",
        "Machine",
        "Software\\Policies\\Microsoft\\Windows\\Network Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-networkconnections#admx-networkconnections-nc-donotshowlocalonlyicon"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_DoNotShowLocalOnlyIcon",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_donotshowlocalonlyicon",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_networkconnections_nc_donotshowlocalonlyicon",
    "description": "Specifies whether or not the \"local access only\" network icon will be shown.\r\n\r\nWhen enabled, the icon for Internet access will be shown in the system tray even when a user is connected to a network with local access only.\r\n\r\nIf you disable this setting or do not configure it, the \"local access only\" icon will be used when a user is connected to a network with local access only.\r\n ",
    "helpText": "",
    "name": "NC_DoNotShowLocalOnlyIcon",
    "displayName": "Do not show the \"local access only\" network icon",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_donotshowlocalonlyicon_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_networkconnections_nc_donotshowlocalonlyicon_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_networkconnections_nc_donotshowlocalonlyicon_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}