{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Enable App Install Control",
        "Smart Screen"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-smartscreen#enableappinstallcontrol"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/SmartScreen/EnableAppInstallControl",
    "rootDefinitionId": "device_vendor_msft_policy_config_smartscreen_enableappinstallcontrol",
    "categoryId": "3f61a5fe-8508-44dd-bcf0-83273643026a",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_smartscreen_enableappinstallcontrol",
    "description": "This policy setting is intended to prevent malicious content from affecting your user's devices when downloading executable content from the internet.",
    "helpText": "",
    "name": "EnableAppInstallControl",
    "displayName": "Enable App Install Control",
    "defaultOptionId": "device_vendor_msft_policy_config_smartscreen_enableappinstallcontrol_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_smartscreen_enableappinstallcontrol_0",
            "description": "Turns off Application Installation Control, allowing users to download and install files from anywhere on the web.",
            "helpText": null,
            "name": "Turns off Application Installation Control, allowing users to download and install files from anywhere on the web.",
            "displayName": "Disable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_smartscreen_enableappinstallcontrol_1",
            "description": "Turns on Application Installation Control, allowing users to only install apps from the Store.",
            "helpText": null,
            "name": "Turns on Application Installation Control, allowing users to only install apps from the Store.",
            "displayName": "Enable",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_smartscreen_enableappinstallcontrol_2",
            "description": "Turns on Application Installation Control, letting users know that there's a comparable app in the Store",
            "helpText": null,
            "name": "Turns on Application Installation Control, letting users know that there's a comparable app in the Store",
            "displayName": "Turns on Application Installation Control, letting users know that there's a comparable app in the Store",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_smartscreen_enableappinstallcontrol_3",
            "description": "Turns on Application Installation Control, warning users before installing apps from outside the Store",
            "helpText": null,
            "name": "Turns on Application Installation Control, warning users before installing apps from outside the Store",
            "displayName": "Turns on Application Installation Control, warning users before installing apps from outside the Store",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 3
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}