{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Schedule Restart Warning",
        "Update",
        "Windows Update For Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Update#schedulerestartwarning"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Update/ScheduleRestartWarning",
    "rootDefinitionId": "device_vendor_msft_policy_config_update_schedulerestartwarning",
    "categoryId": "0e6c9053-73d6-4c56-9147-53513f6eefd8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_update_schedulerestartwarning",
    "description": "NoteÂ This policy is available on WindowsÂ 10 Pro, WindowsÂ 10 Enterprise, WindowsÂ 10 Education, and WindowsÂ 10 Mobile Enterprise Allows the IT Admin to specify the period for auto-restart warning reminder notifications. The default value is 4 (hours).",
    "helpText": "",
    "name": "ScheduleRestartWarning",
    "displayName": "Schedule Restart Warning",
    "defaultOptionId": "device_vendor_msft_policy_config_update_schedulerestartwarning_4",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "holographicForBusiness",
            "surfaceHub",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_update_schedulerestartwarning_2",
            "description": "2 Hours",
            "helpText": null,
            "name": "2 Hours",
            "displayName": "2 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update_schedulerestartwarning_4",
            "description": "4 Hours",
            "helpText": null,
            "name": "4 Hours",
            "displayName": "4 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 4
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update_schedulerestartwarning_8",
            "description": "8 Hours",
            "helpText": null,
            "name": "8 Hours",
            "displayName": "8 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 8
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update_schedulerestartwarning_12",
            "description": "12 Hours",
            "helpText": null,
            "name": "12 Hours",
            "displayName": "12 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 12
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_update_schedulerestartwarning_24",
            "description": "24 Hours",
            "helpText": null,
            "name": "24 Hours",
            "displayName": "24 Hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 24
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}