{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SpellcheckLanguage",
        "Enable specific spellcheck languages",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/SpellcheckLanguage",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_spellchecklanguage",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_spellchecklanguage",
    "description": "Enables different languages for spellcheck. Any language that you specify that isn't recognized is ignored.\r\n\r\nIf you enable this policy, spellcheck is enabled for the languages specified, as well as any languages the user has enabled.\r\n\r\nIf you don't configure or disable this policy, there's no change to the user's spellcheck preferences.\r\n\r\nIf the 'SpellcheckEnabled' (Enable spellcheck) policy is disabled, this policy will have no effect.\r\n\r\nIf a language is included in both the 'SpellcheckLanguage' and the 'SpellcheckLanguageBlocklist' (Force disable spellcheck languages) policy, the spellcheck language is enabled.\r\n\r\nThe supported languages are: af, bg, ca, cs, cy, da, de, el, en-AU, en-CA, en-GB, en-US, es, es-419, es-AR, es-ES, es-MX, es-US, et, fa, fo, fr, he, hi, hr, hu, id, it, ko, lt, lv, nb, nl, pl, pt-BR, pt-PT, ro, ru, sh, sk, sl, sq, sr, sv, ta, tg, tr, uk, vi.\r\n\r\nExample value:\r\n\r\nfr\r\nes",
    "helpText": "",
    "name": "SpellcheckLanguage",
    "displayName": "Enable specific spellcheck languages",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_spellchecklanguage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_spellchecklanguage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_spellchecklanguage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_spellchecklanguage_spellchecklanguagedesc",
                    "required": true
                }
            ]
        }
    ]
}