{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "PlatformStatus",
        "WindowsDefenderApplicationGuard",
        "Microsoft Defender Application Guard"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/windowsdefenderapplicationguard-csp/"
    ],
    "occurrence": null,
    "baseUri": "./Device/Vendor/MSFT/WindowsDefenderApplicationGuard",
    "offsetUri": "/PlatformStatus",
    "rootDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_platformstatus",
    "categoryId": "cd55f347-a417-4fe9-83ee-8f1f40ac5eb0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_windowsdefenderapplicationguard_platformstatus",
    "description": "Applies to Microsoft Office/Generic platform. Returns bitmask that indicates status of Application Guard platform installation and prerequisites on the device.  Bit 0 - Set to 1 when Application Guard is enabled into enterprise manage mode. Bit 1 - Set to 1 when the client machine is Hyper-V capable. Bit 2 - Reserved for Microsoft. Bit 3 - Set to 1 when Application Guard is installed on the client machine. Bit 4 - Reserved for Microsoft. Bit 5 - Set to 1 when the client machine meets minimum hardware requirements.",
    "helpText": "",
    "name": "PlatformStatus",
    "displayName": "Platform status",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager",
        "configurationServiceProviderVersion": "1.4",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsHome",
            "surfaceHub",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "unknown",
            "windowsCloudN"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}