{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ScheduledDiagnosticsExecutionPolicy",
        "Configure Scheduled Maintenance Behavior",
        "\\System\\Troubleshooting and Diagnostics\\Scheduled Maintenance",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\Scheduled Maintenance",
        "Scheduled Maintenance"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_sdiagschd/ScheduledDiagnosticsExecutionPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy",
    "categoryId": "1f31ae2d-4867-4733-b52c-cecc0128e10c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_scheduleddiagnosticsexecutionpolicylevel",
    "description": null,
    "helpText": "",
    "name": "ScheduledDiagnosticsExecutionPolicyLevel",
    "displayName": "Execution Level (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_scheduleddiagnosticsexecutionpolicylevel_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_scheduleddiagnosticsexecutionpolicylevel_1",
            "description": null,
            "helpText": null,
            "name": "Troubleshooting Only",
            "displayName": "Troubleshooting Only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_scheduleddiagnosticsexecutionpolicylevel_2",
            "description": null,
            "helpText": null,
            "name": "Regular",
            "displayName": "Regular",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_sdiagschd_scheduleddiagnosticsexecutionpolicy"
                }
            ],
            "dependedOnBy": []
        }
    ]
}