{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PreventTokenActivationDialogFromClosing",
        "Prevent Token Activation dialog from closing",
        "\\Microsoft Office 2016 (Machine)\\Volume Activation",
        "Microsoft Office 2016 (Machine)\\Volume Activation",
        "Volume Activation"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_VolumeActivation/L_PreventTokenActivationDialogFromClosing",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_preventtokenactivationdialogfromclosing",
    "categoryId": "712d184f-d9ac-45fc-9eea-aade3a22b55e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_preventtokenactivationdialogfromclosing",
    "description": "This policy setting allows you to prevent the Token Activation prompt for activation dialog from closing.\r\n\r\nIf you enable this policy setting, the \"Close\" button and the \"X\" button at the upper right of the dialog are suppressed.  If the user proceeds with activation and fails, the buttons will be enabled the next time the dialog appears.\r\n\r\nIf you disable or do not configure this policy setting, the user may close the dialog when prompted for activation.",
    "helpText": "",
    "name": "L_PreventTokenActivationDialogFromClosing",
    "displayName": "Prevent Token Activation dialog from closing",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_preventtokenactivationdialogfromclosing_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_preventtokenactivationdialogfromclosing_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_preventtokenactivationdialogfromclosing_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}