{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LoggingEnabled",
        "Enabled",
        "\\FSLogix\\Logging",
        "Administrative Templates\\FSLogix\\Logging",
        "Logging"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FSLogixv1~Policy~FSLogix~Logging/LoggingEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled",
    "categoryId": "ab2be8b5-5912-4909-8d8b-e66edf4ab097",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_loggingenabled",
    "description": "",
    "helpText": "",
    "name": "LoggingEnabled",
    "displayName": "",
    "defaultOptionId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_loggingenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_loggingenabled_0",
            "description": null,
            "helpText": null,
            "name": "Logging Disabled",
            "displayName": "Logging Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_loggingenabled_1",
            "description": null,
            "helpText": null,
            "name": "Specific Logs Only",
            "displayName": "Specific Logs Only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_loggingenabled_2",
            "description": null,
            "helpText": null,
            "name": "Enable All Logs",
            "displayName": "Enable All Logs",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled_1",
                    "parentSettingId": "device_vendor_msft_policy_config_fslogixv1~policy~fslogix~logging_loggingenabled"
                }
            ],
            "dependedOnBy": []
        }
    ]
}