{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Streaming_Reestablishment_Interval",
        "Reestablishment Interval",
        "\\System\\App-V\\Streaming",
        "AppVirtualization",
        "App Virtualization",
        "Streaming"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/AppVirtualization/StreamingAllowReestablishmentInterval",
    "rootDefinitionId": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentinterval",
    "categoryId": "3800661e-5841-4499-8d4e-914527435f59",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentinterval_streaming_reestablishment_interval_prompt",
    "description": "",
    "helpText": "",
    "name": "Streaming_Reestablishment_Interval_Prompt",
    "displayName": "Reestablishment Interval:",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 3600,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 15
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentinterval_1",
            "parentSettingId": "device_vendor_msft_policy_config_appvirtualization_streamingallowreestablishmentinterval"
        }
    ],
    "dependedOnBy": []
}