{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Disable Share App Promotions",
        "Experience"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Experience#disableshareapppromotions"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Experience/DisableShareAppPromotions",
    "rootDefinitionId": "device_vendor_msft_policy_config_experience_disableshareapppromotions",
    "categoryId": "139974ad-f615-442b-b3dc-84a44e3ec663",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_experience_disableshareapppromotions",
    "description": "This policy setting allow IT admins to control whether promotional apps are displayed in the Share sheet. If you enable this policy, Windows will not show  promotional apps in the Share sheet. If you disable or do not configure this policy, Share sheet may show app suggestions and promotions when the Share sheet is opened.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "DisableShareAppPromotions",
    "displayName": "Disable Share App Promotions (Windows Insiders only)",
    "defaultOptionId": "device_vendor_msft_policy_config_experience_disableshareapppromotions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.25272",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_experience_disableshareapppromotions_0",
            "description": "Promotional Apps on ShareSheet are Enabled.",
            "helpText": null,
            "name": "Promotional Apps on ShareSheet are Enabled.",
            "displayName": "Promotional Apps on ShareSheet are Enabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_experience_disableshareapppromotions_1",
            "description": "Promotional Apps on ShareSheet are Disabled.",
            "helpText": null,
            "name": "Promotional Apps on ShareSheet are Disabled.",
            "displayName": "Promotional Apps on ShareSheet are Disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}