{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DetectDeprecatedCOMComponentFailuresPolicy",
        "Detect application failures caused by deprecated COM objects",
        "\\System\\Troubleshooting and Diagnostics\\Application Compatibility Diagnostics",
        "Administrative Templates\\System\\Troubleshooting and Diagnostics\\Application Compatibility Diagnostics",
        "Application Compatibility Diagnostics",
        "Machine",
        "SOFTWARE\\Policies\\Microsoft\\Windows\\WDI\\{88D69CE1-577A-4dd9-87AE-AD36D3CD9643}",
        "ScenarioExecutionEnabled"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-pca#admx-pca-detectdeprecatedcomcomponentfailurespolicy"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_pca/DetectDeprecatedCOMComponentFailuresPolicy",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_pca_detectdeprecatedcomcomponentfailurespolicy",
    "categoryId": "439f1603-5241-40c7-a5fe-44ae6744543f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_pca_detectdeprecatedcomcomponentfailurespolicy",
    "description": "This setting exists only for backward compatibility, and is not valid for this version of Windows. To configure the Program Compatibility Assistant, use the 'Turn off Program Compatibility Assistant' setting under Computer Configuration\\Administrative Templates\\Windows Components\\Application Compatibility.\r\n ",
    "helpText": "",
    "name": "DetectDeprecatedCOMComponentFailuresPolicy",
    "displayName": "Detect application failures caused by deprecated COM objects",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_pca_detectdeprecatedcomcomponentfailurespolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_pca_detectdeprecatedcomcomponentfailurespolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_pca_detectdeprecatedcomcomponentfailurespolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_pca_detectdeprecatedcomcomponentfailurespolicy_detectdeprecatedcomcomponentfailureslevel",
                    "required": true
                }
            ]
        }
    ]
}