{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Prevent Automatic Device Encryption For Azure AD Joined Devices",
        "Security"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Security#preventautomaticdeviceencryptionforazureadjoineddevices"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Security/PreventAutomaticDeviceEncryptionForAzureADJoinedDevices",
    "rootDefinitionId": "device_vendor_msft_policy_config_security_preventautomaticdeviceencryptionforazureadjoineddevices",
    "categoryId": "62cb63bd-d3ef-4cff-9b4a-e7bbf4657173",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_security_preventautomaticdeviceencryptionforazureadjoineddevices",
    "description": "Specifies whether to allow automatic device encryption during OOBE when the device is Azure AD joined.",
    "helpText": "",
    "name": "PreventAutomaticDeviceEncryptionForAzureADJoinedDevices",
    "displayName": "Prevent Automatic Device Encryption For Azure AD Joined Devices",
    "defaultOptionId": "device_vendor_msft_policy_config_security_preventautomaticdeviceencryptionforazureadjoineddevices_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "4.1",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.14393",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_security_preventautomaticdeviceencryptionforazureadjoineddevices_0",
            "description": "Encryption enabled.",
            "helpText": null,
            "name": "Encryption enabled.",
            "displayName": "Encryption enabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_security_preventautomaticdeviceencryptionforazureadjoineddevices_1",
            "description": "Encryption disabled.",
            "helpText": null,
            "name": "Encryption disabled.",
            "displayName": "Encryption disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}