{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TS_FALLBACKPRINTDRIVERTYPE",
        "Specify RD Session Host server fallback printer driver behavior",
        "\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Printer Redirection",
        "Administrative Templates\\Windows Components\\Remote Desktop Services\\Remote Desktop Session Host\\Printer Redirection",
        "Printer Redirection",
        "Machine",
        "SOFTWARE\\Policies\\Microsoft\\Windows NT\\Terminal Services",
        "fPolicyFallbackPrintDriver"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-terminalserver#admx-terminalserver-ts-fallbackprintdrivertype"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TerminalServer/TS_FALLBACKPRINTDRIVERTYPE",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_fallbackprintdrivertype",
    "categoryId": "f3264346-fdc4-4e23-9a2a-dcfc34022e59",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_terminalserver_ts_fallbackprintdrivertype",
    "description": "This policy setting allows you to specify the RD Session Host server fallback printer driver behavior.\r\n\r\nBy default, the RD Session Host server fallback printer driver is disabled. If the RD Session Host server does not have a printer driver that matches the client's printer, no printer will be available for the Remote Desktop Services session.\r\n\r\nIf you enable this policy setting, the fallback printer driver is enabled, and the default behavior is for the RD Session Host server to find a suitable printer driver. If one is not found, the client's printer is not available. You can choose to change this default behavior. The available options are:\r\n\r\n\"Do nothing if one is not found\" - If there is a printer driver mismatch, the server will attempt to find a suitable driver. If one is not found, the client's printer is not available. This is the default behavior.\r\n\r\n\"Default to PCL if one is not found\" - If no suitable printer driver can be found, default to the Printer Control Language (PCL) fallback printer driver.\r\n\r\n\"Default to PS if one is not found\" - If no suitable printer driver can be found, default to the PostScript (PS) fallback printer driver.\r\n\r\n\"Show both PCL and PS if one is not found\" - If no suitable driver can be found, show both PS and PCL-based fallback printer drivers.\r\n\r\nIf you disable this policy setting, the RD Session Host server fallback driver is disabled and the RD Session Host server will not attempt to use the fallback printer driver.\r\n\r\nIf you do not configure this policy setting, the fallback printer driver behavior is off by default.\r\n\r\nNote: If the \"Do not allow client printer redirection\" setting is enabled, this policy setting is ignored and the fallback printer driver is disabled.\r\n This setting is only available to Windows Insiders.\r\n ",
    "helpText": "",
    "name": "TS_FALLBACKPRINTDRIVERTYPE",
    "displayName": "Specify RD Session Host server fallback printer driver behavior",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_fallbackprintdrivertype_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_fallbackprintdrivertype_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_terminalserver_ts_fallbackprintdrivertype_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_terminalserver_ts_fallbackprintdrivertype_ts_fallback_options",
                    "required": true
                }
            ]
        }
    ]
}