{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ExtendedOfflineSubscription",
        "Allow extended offline use for Office 365 ProPlus",
        "\\Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Microsoft Office 2016 (Machine)\\Licensing Settings",
        "Licensing Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v4~Policy~L_MicrosoftOfficemachine~L_LicensingSettings/L_ExtendedOfflineSubscription",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v4~policy~l_microsoftofficemachine~l_licensingsettings_l_extendedofflinesubscription",
    "categoryId": "2e3f0407-6387-41b4-b6c2-ada4354be759",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v4~policy~l_microsoftofficemachine~l_licensingsettings_l_extendedofflinesubscription",
    "description": "This policy setting allows Office 365 ProPlus to remain activated for more than 31 days in locations without regular internet connectivity.\r\n\r\nUsually Office 365 ProPlus needs to contact the Office Licensing Service on the internet at least once every 31 days to verify the status of the Office 365 subscription and renew its license to remain activated. Otherwise, Office 365 ProPlus will go into reduced functionality mode.\r\n\r\nIMPORTANT: This policy setting requires special permission from Microsoft and additional configuration by Microsoft before you can start using it.\r\n\r\nIf you enable this policy setting, Office 365 ProPlus will receive a license that’s valid for more than 31 days. Your organization’s agreement with Microsoft to use this policy setting will determine how long the license is valid for.\r\n\r\nIf you disable or don’t configure this policy setting, Office 365 ProPlus will receive a license that’s valid for only 31 days.\r\n\r\nNote: This policy setting also applies to subscription versions of Project and Visio.\r\n      ",
    "helpText": "",
    "name": "L_ExtendedOfflineSubscription",
    "displayName": "Allow extended offline use for Office 365 ProPlus",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v4~policy~l_microsoftofficemachine~l_licensingsettings_l_extendedofflinesubscription_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v4~policy~l_microsoftofficemachine~l_licensingsettings_l_extendedofflinesubscription_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v4~policy~l_microsoftofficemachine~l_licensingsettings_l_extendedofflinesubscription_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}