{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WCN_EnableRegistrar",
        "Configuration of wireless settings using Windows Connect Now",
        "\\Network\\Windows Connect Now",
        "Administrative Templates\\Network\\Windows Connect Now",
        "Windows Connect Now"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsConnectNow/WCN_EnableRegistrar",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar",
    "categoryId": "bd7d2b68-118d-40ee-9dfd-39b2a22a2082",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_wcn_higher_precedence_registrar",
    "description": null,
    "helpText": "",
    "name": "WCN_Higher_Precedence_Registrar",
    "displayName": "Higher precedence medium for devices discovered by multiple media: (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_wcn_higher_precedence_registrar_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_wcn_higher_precedence_registrar_1",
            "description": null,
            "helpText": null,
            "name": "WCN over Ethernet (UPnP)",
            "displayName": "WCN over Ethernet (UPnP)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_wcn_higher_precedence_registrar_2",
            "description": null,
            "helpText": null,
            "name": "WCN over In-band 802.11 WLAN",
            "displayName": "WCN over In-band 802.11 WLAN",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar_1",
                    "parentSettingId": "device_vendor_msft_policy_config_admx_windowsconnectnow_wcn_enableregistrar"
                }
            ],
            "dependedOnBy": []
        }
    ]
}