{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow Device Health Monitoring",
        "Device Health Monitoring"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-DeviceHealthMonitoring#allowdevicehealthmonitoring"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DeviceHealthMonitoring/AllowDeviceHealthMonitoring",
    "rootDefinitionId": "device_vendor_msft_policy_config_devicehealthmonitoring_allowdevicehealthmonitoring",
    "categoryId": "55c888df-44ff-49d1-808e-ad9cb8429aff",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_devicehealthmonitoring_allowdevicehealthmonitoring",
    "description": "Enable/disable 4Nines device health monitoring on devices.",
    "helpText": "",
    "name": "AllowDeviceHealthMonitoring",
    "displayName": "Allow Device Health Monitoring",
    "defaultOptionId": "device_vendor_msft_policy_config_devicehealthmonitoring_allowdevicehealthmonitoring_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_devicehealthmonitoring_allowdevicehealthmonitoring_1",
            "description": "The DeviceHealthMonitoring connection is enabled.",
            "helpText": null,
            "name": "The DeviceHealthMonitoring connection is enabled.",
            "displayName": "The DeviceHealthMonitoring connection is enabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_devicehealthmonitoring_configdevicehealthmonitoringscope",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_devicehealthmonitoring_configdevicehealthmonitoringuploaddestination",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_devicehealthmonitoring_configdevicehealthmonitoringserviceinstance",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_devicehealthmonitoring_configdevicehealthmonitoringscope_v2",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_devicehealthmonitoring_configdevicehealthmonitoringuploaddestination_v2",
                    "required": false
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_devicehealthmonitoring_configdevicehealthmonitoringscope_v2_epm",
                    "required": false
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_devicehealthmonitoring_allowdevicehealthmonitoring_0",
            "description": "The DeviceHealthMonitoring connection is disabled.",
            "helpText": null,
            "name": "The DeviceHealthMonitoring connection is disabled.",
            "displayName": "The DeviceHealthMonitoring connection is disabled.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}