{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "PreciseGeolocationAllowedForUrls",
        "Allow precise geolocation on these sites",
        "\\Microsoft Edge\\Content settings",
        "Microsoft Edge\\Content settings",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev144~Policy~microsoft_edge~ContentSettings/PreciseGeolocationAllowedForUrls",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev144~policy~microsoft_edge~contentsettings_precisegeolocationallowedforurls",
    "categoryId": "92d69c43-75ac-49b1-a3ef-9350079eef86",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_microsoft_edgev144~policy~microsoft_edge~contentsettings_precisegeolocationallowedforurls_precisegeolocationallowedforurlsdesc",
    "description": "",
    "helpText": "",
    "name": "PreciseGeolocationAllowedForUrlsDesc",
    "displayName": "Allow precise geolocation on these sites (Device)",
    "defaultValue": null,
    "maximumCount": 1000,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev144~policy~microsoft_edge~contentsettings_precisegeolocationallowedforurls_1",
            "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev144~policy~microsoft_edge~contentsettings_precisegeolocationallowedforurls"
        }
    ],
    "dependedOnBy": []
}