{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "WerDoNotShowUI",
        "Prevent display of the user interface for critical errors",
        "\\Windows Components\\Windows Error Reporting",
        "Administrative Templates\\Windows Components\\Windows Error Reporting",
        "Windows Error Reporting"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-errorreporting#errorreporting-preventcriticalerrordisplay"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ErrorReporting/PreventCriticalErrorDisplay",
    "rootDefinitionId": "device_vendor_msft_policy_config_errorreporting_preventcriticalerrordisplay",
    "categoryId": "d9b7efad-fe18-4c98-925b-c4a5db0f2815",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_errorreporting_preventcriticalerrordisplay",
    "description": "This policy setting prevents the display of the user interface for critical errors.\r\n\r\nIf you enable or do not configure this policy setting, Windows Error Reporting does not display any GUI-based error messages or dialog boxes for critical errors.\r\n\r\nIf you disable this policy setting, Windows Error Reporting displays the GUI-based error messages or dialog boxes for critical errors.",
    "helpText": "",
    "name": "WerDoNotShowUI",
    "displayName": "Prevent display of the user interface for critical errors",
    "defaultOptionId": "device_vendor_msft_policy_config_errorreporting_preventcriticalerrordisplay_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_errorreporting_preventcriticalerrordisplay_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_errorreporting_preventcriticalerrordisplay_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}