{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DeviceInstall_BalloonTips",
        "Turn off \"Found New Hardware\" balloons during device installation",
        "\\System\\Device Installation",
        "Administrative Templates\\System\\Device Installation",
        "Device Installation"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-devicesetup#admx-devicesetup-deviceinstall-balloontips"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DeviceSetup/DeviceInstall_BalloonTips",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_devicesetup_deviceinstall_balloontips",
    "categoryId": "486dc66e-960c-4622-b3cb-3ff9a2d434eb",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_devicesetup_deviceinstall_balloontips",
    "description": "This policy setting allows you to turn off \"Found New Hardware\" balloons during device installation.\r\n\r\nIf you enable this policy setting, \"Found New Hardware\" balloons do not appear while a device is being installed.\r\n\r\nIf you disable or do not configure this policy setting, \"Found New Hardware\" balloons appear while a device is being installed, unless the driver for the device suppresses the balloons.\r\n ",
    "helpText": "",
    "name": "DeviceInstall_BalloonTips",
    "displayName": "Turn off \"Found New Hardware\" balloons during device installation",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_devicesetup_deviceinstall_balloontips_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_devicesetup_deviceinstall_balloontips_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_devicesetup_deviceinstall_balloontips_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}