{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableAccessibilitySettingSync",
        "Do not sync accessibility settings",
        "\\Windows Components\\Sync your settings",
        "Administrative Templates\\Windows Components\\Sync your settings",
        "Sync your settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/SettingsSync/DisableAccessibilitySettingSync",
    "rootDefinitionId": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync",
    "categoryId": "7574a907-5608-491f-8011-c57d487457f4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync_checkbox_useroverride",
    "description": "",
    "helpText": "",
    "name": "CheckBox_UserOverride",
    "displayName": "Allow users to turn \"accessibility\" syncing on. (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync_checkbox_useroverride_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.6141",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync_checkbox_useroverride_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync_1",
                    "parentSettingId": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync_checkbox_useroverride_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync_1",
                    "parentSettingId": "device_vendor_msft_policy_config_settingssync_disableaccessibilitysettingsync"
                }
            ],
            "dependedOnBy": []
        }
    ]
}