{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Allow WUfB Cloud Processing",
        "System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-System#system-allowwufbcloudprocessing"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/System/AllowWUfBCloudProcessing",
    "rootDefinitionId": "device_vendor_msft_policy_config_system_allowwufbcloudprocessing",
    "categoryId": "f62e0f2a-4363-4246-8057-1dc811fe4360",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_system_allowwufbcloudprocessing",
    "description": "Allows IT admins to enable diagnostic data from this device to be processed by Windows Update for Business cloud.                                             The following list shows the supported values:                                                  0 (default)– Diagnostic data is not processed by Windows Update for Business cloud..                                                 8 – Diagnostic data is allowed to be processed by Windows Update for Business cloud..                                             If you disable or do not configure this policy setting, diagnostic data from this device will not be processed by Windows Update for Business cloud.",
    "helpText": "",
    "name": "AllowWUfBCloudProcessing",
    "displayName": "Allow WUfB Cloud Processing",
    "defaultOptionId": "device_vendor_msft_policy_config_system_allowwufbcloudprocessing_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "8.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.17763.1217",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "unknown",
            "windowsCloudN"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_system_allowwufbcloudprocessing_0",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_system_allowwufbcloudprocessing_8",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 8
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}