{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Application Control",
        "App Control for Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/applicationcontrol-csp"
    ],
    "baseUri": "./Vendor/MSFT/ApplicationControl/Policies",
    "offsetUri": "/{0}/Policy",
    "rootDefinitionId": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions",
    "categoryId": "56b82fc9-c632-4c76-bb4f-dcf8757f003e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions",
    "description": "Select Enter XML data to type or paste an XML property list that contains your App Control for Business policy. Select Use built-in controls to choose from toggles exposed in this App Control for Business policy. Setting this to Not Configured will result in default behaviour on the device with no added options from the ApplicationControl CSP on the device.",
    "helpText": "",
    "name": "ConfigureApplicationControlOptions",
    "displayName": "Configuration settings format",
    "defaultOptionId": "device_vendor_msft_policy_config_applicationcontrol_configure_xml_selected",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrol_configure_xml_selected",
            "description": "Enter xml data",
            "helpText": null,
            "name": "Enter xml data",
            "displayName": "Enter xml data",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_xml",
                    "required": true
                }
            ]
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_selected",
            "description": "Use built-in controls",
            "helpText": null,
            "name": "Use built-in controls",
            "displayName": "Use built-in controls",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls",
                    "required": true
                }
            ]
        }
    ]
}