{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_AllowSideBySideExperience",
        "Allow Microsoft Edge Side by Side browser experience",
        "\\Microsoft Edge Update\\Applications",
        "Microsoft Edge Update\\Applications",
        "Applications",
        "Machine",
        "Software\\Policies\\Microsoft\\EdgeUpdate",
        "Allowsxs"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/updatev78diff~Policy~Cat_Google~Cat_GoogleUpdate~Cat_Applications/Pol_AllowSideBySideExperience",
    "rootDefinitionId": "device_vendor_msft_policy_config_updatev78diff~policy~cat_google~cat_googleupdate~cat_applications_pol_allowsidebysideexperience",
    "categoryId": "2c7e8e8e-47fe-48ba-8cb4-55ce296edced",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_updatev78diff~policy~cat_google~cat_googleupdate~cat_applications_pol_allowsidebysideexperience",
    "description": "This policy lets a user run Microsoft Edge (Edge HTML) and Microsoft Edge (Chromium-based) side-by-side.\r\n\r\nIf this policy is set to “Not configured”, Microsoft Edge (Chromium-based) will replace Microsoft Edge (Edge HTML) after the Microsoft Edge (Chromium-based) stable channel and the November 2019 security updates are installed.  This is the same behavior as the “Disabled” setting.\r\n\r\nThe “Disabled” setting blocks a side-by-side experience and Microsoft Edge (Chromium-based) will replace Microsoft Edge (Edge HTML) after the Microsoft Edge (Chromium-based) stable channel and the November 2019 security updates are installed.  This is the same behavior as the “Not Configured” setting.\r\n\r\nWhen this policy is “Enabled”, Microsoft Edge (Chromium-based) and Microsoft Edge (Edge HTML) can run side-by-side after Microsoft Edge (Chromium-based) is installed.\r\n\r\nFor this group policy to take affect, it must be configured before the automatic install of Microsoft Edge (Chromium-based) by Windows Update. Note: ​A user can block the automatic update of Microsoft Edge (Chromium-based) by using the Microsoft Edge (Chromium-based) Blocker Toolkit.",
    "helpText": "",
    "name": "Pol_AllowSideBySideExperience",
    "displayName": "Allow Microsoft Edge Side by Side browser experience",
    "defaultOptionId": "device_vendor_msft_policy_config_updatev78diff~policy~cat_google~cat_googleupdate~cat_applications_pol_allowsidebysideexperience_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_updatev78diff~policy~cat_google~cat_googleupdate~cat_applications_pol_allowsidebysideexperience_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_updatev78diff~policy~cat_google~cat_googleupdate~cat_applications_pol_allowsidebysideexperience_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}