{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RemoteAccessHostAllowUrlForwarding",
        "Allow remote access users to open host-side URLs in their local client browser",
        "\\Google\\Google Chrome\\Remote access",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Remote access"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~RemoteAccess/RemoteAccessHostAllowUrlForwarding",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~remoteaccess_remoteaccesshostallowurlforwarding",
    "categoryId": "098942c3-afe3-40c8-823f-37f0b5b13ad4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~remoteaccess_remoteaccesshostallowurlforwarding",
    "description": "Setting the policy to Enabled or leaving it unset may allow users connected to a remote access host to open host-side URLs in their local client browser.\r\n\r\nSetting the policy to Disabled will prevent the remote access host from sending URLs to the client.\r\n\r\nThis setting doesn't apply to remote assistance connections as the feature is not supported for that connection mode.\r\n\r\nNote: This feature is not yet generally available so enabling it does not mean that the feature will be visible in the client UI.",
    "helpText": "",
    "name": "RemoteAccessHostAllowUrlForwarding",
    "displayName": "Allow remote access users to open host-side URLs in their local client browser",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~remoteaccess_remoteaccesshostallowurlforwarding_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~remoteaccess_remoteaccesshostallowurlforwarding_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~remoteaccess_remoteaccesshostallowurlforwarding_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}