{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableLocalArchiveMalwareScanOverride",
        "Enable App Installer Local Archive Malware Scan Override",
        "\\Windows Components\\Desktop App Installer",
        "Administrative Templates\\Windows Components\\Desktop App Installer",
        "Desktop App Installer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-desktopappinstaller#desktopappinstaller-enablelocalarchivemalwarescanoverride"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/DesktopAppInstaller/EnableLocalArchiveMalwareScanOverride",
    "rootDefinitionId": "device_vendor_msft_policy_config_desktopappinstaller_enablelocalarchivemalwarescanoverride",
    "categoryId": "70063d93-03f0-462e-9943-b0241b88d54d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_desktopappinstaller_enablelocalarchivemalwarescanoverride",
    "description": "This policy controls the ability to override malware vulnerability scans when installing an archive file using a local manifest using the command line arguments.\r\n\r\nIf you enable this policy, users can override the malware scan when performing a local manifest install of an archive file.\r\n\r\nIf you disable this policy, users will be unable to override the malware scan of an archive file when installing using a local manifest.\r\n\r\nIf you do not configure this policy, the Windows Package Manager administrator settings will be adhered to.",
    "helpText": "",
    "name": "EnableLocalArchiveMalwareScanOverride",
    "displayName": "Enable App Installer Local Archive Malware Scan Override",
    "defaultOptionId": "device_vendor_msft_policy_config_desktopappinstaller_enablelocalarchivemalwarescanoverride_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_desktopappinstaller_enablelocalarchivemalwarescanoverride_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_desktopappinstaller_enablelocalarchivemalwarescanoverride_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}