{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SuperDragDropEnabled",
        "Super Drag Drop Enabled",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev122~Policy~microsoft_edge/SuperDragDropEnabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev122~policy~microsoft_edge_superdragdropenabled",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_microsoft_edgev122~policy~microsoft_edge_superdragdropenabled",
    "description": "This policy lets you configure the Super Drag Drop feature in Microsoft Edge.\r\n\r\nIn this feature, users can drag a link, or text on a webpage. And drop it on the same page, then make the url opened in a new tab or search the text by default search engine.\r\n\r\nIf you enable or don't configure this policy, you can use the Super Drag Drop feature on Microsoft Edge.\r\n\r\nIf you disable this policy, you can't use the Super Drag Drop feature in Microsoft Edge.",
    "helpText": "",
    "name": "SuperDragDropEnabled",
    "displayName": "Super Drag Drop Enabled",
    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev122~policy~microsoft_edge_superdragdropenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev122~policy~microsoft_edge_superdragdropenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_microsoft_edgev122~policy~microsoft_edge_superdragdropenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}