{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DwmDefaultColorizationColor_2",
        "Specify a default color",
        "\\Windows Components\\Desktop Window Manager\\Window Frame Coloring",
        "Administrative Templates\\Windows Components\\Desktop Window Manager\\Window Frame Coloring",
        "Window Frame Coloring",
        "Machine",
        "SOFTWARE\\Policies\\Microsoft\\Windows\\DWM",
        "DefaultColorizationColorState"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-dwm#admx-dwm-dwmdefaultcolorizationcolor-2"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DWM/DwmDefaultColorizationColor_2",
    "rootDefinitionId": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2",
    "categoryId": "b5234c18-e555-409e-9550-59b89d1672f1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2",
    "description": "This policy setting controls the default color for window frames when the user does not specify a color. \r\n\r\nIf you enable this policy setting and specify a default color, this color is used in glass window frames, if the user does not specify a color. \r\n\r\nIf you disable or do not configure this policy setting, the default internal color is used, if the user does not specify a color. \r\n\r\nNote: This policy setting can be used in conjunction with the \"Prevent color changes of window frames\" setting, to enforce a specific color for window frames that cannot be changed by users.\r\n ",
    "helpText": "",
    "name": "DwmDefaultColorizationColor_2",
    "displayName": "Specify a default color",
    "defaultOptionId": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_dwmdefaultcolorizationcoloralpha",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_dwmdefaultcolorizationcolorred",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_dwmdefaultcolorizationcolorgreen",
                    "required": true
                },
                {
                    "dependedOnBy": "device_vendor_msft_policy_config_admx_dwm_dwmdefaultcolorizationcolor_2_dwmdefaultcolorizationcolorblue",
                    "required": true
                }
            ]
        }
    ]
}