{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Application Control",
        "App Control for Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/applicationcontrol-csp"
    ],
    "baseUri": "./Vendor/MSFT/ApplicationControl/Policies",
    "offsetUri": "/{0}/Policy",
    "rootDefinitionId": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions",
    "categoryId": "56b82fc9-c632-4c76-bb4f-dcf8757f003e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control",
    "description": "Select Audit only to log all events in local client logs but not block any apps from running or select Enforce to actively block apps from running in a deployed App Control for Business base policy. App Control for Business policies created in either Audit only or Enforce mode will be deployed as rebootless base policies to all devices targeted./nBy default, any devices targeted with this App Control for Business policy will have the setting to Trust Windows components and Store apps enabled, in either audit or enforce mode based on your selection.",
    "helpText": "",
    "name": "ConfigureApplicationControlEnableAppControlPolicy",
    "displayName": "Enable App Control for Business policy to trust Windows components and Store apps",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": null,
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control_0",
            "description": "Enforce",
            "helpText": null,
            "name": "Enforce",
            "displayName": "Enforce",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control_1",
            "description": "Audit only",
            "helpText": null,
            "name": "Audit only",
            "displayName": "Audit only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls",
                    "parentSettingId": "device_vendor_msft_policy_config_applicationcontrol_built_in_controls"
                }
            ],
            "dependedOnBy": []
        }
    ]
}