{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Schedule Imminent Restart Warning",
        "Update",
        "Windows Update For Business"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Update#update-scheduleimminentrestartwarning"
    ],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Update/ScheduleImminentRestartWarning",
    "rootDefinitionId": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning",
    "categoryId": "0e6c9053-73d6-4c56-9147-53513f6eefd8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning",
    "description": "Allows the IT Admin to specify the period for auto-restart imminent warning notifications. The default value is 15 (minutes).",
    "helpText": "",
    "name": "ScheduleImminentRestartWarning",
    "displayName": "[Deprecated] Schedule Imminent Restart Warning",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "88.8.88888",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "surfaceHub",
            "windowsEducation",
            "holographicForBusiness",
            "iotEnterprise",
            "windowsCloudN"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 4294967295,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 15
    },
    "dependentOn": [],
    "dependedOnBy": []
}