{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PartitionedBlobUrlUsage",
        "Choose whether Blob URLs are partitioned during fetching and navigations",
        "\\Google\\Google Chrome\\Content settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~ContentSettings/PartitionedBlobUrlUsage",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_partitionedbloburlusage",
    "categoryId": "59d29716-55b0-4014-a458-38b408ff9530",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_partitionedbloburlusage",
    "description": "This policy controls whether Blob URLs are partitioned during fetching and navigation.\r\nIf this policy is set to Enabled or not set, Blob URLs will be partitioned.\r\nIf this policy is set to Disabled, Blob URLs won't be partitioned.\r\n\r\nIf storage partitioning is disabled for a given top-level origin by either\r\nThirdPartyStoragePartitioningBlockedForOrigins\r\nor DefaultThirdPartyStoragePartitioningSetting,\r\nthen Blob URLs will also not be partitioned.\r\n\r\nIf you must use the policy, please file a bug at\r\nGoogle Chrome\r\nexplaining your use case. The policy is scheduled to be offered through\r\nGoogle Chrome version 143, after which\r\nthe old implementation will be removed.\r\n\r\nNOTE: Only newly-started renderer processes will reflect changes to this\r\npolicy while the browser is running.\r\n\r\nFor detailed information on third-party storage partitioning, please see\r\nhttps://developers.google.com/privacy-sandbox/cookies/storage-partitioning.",
    "helpText": "",
    "name": "PartitionedBlobUrlUsage",
    "displayName": "Choose whether Blob URLs are partitioned during fetching and navigations",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_partitionedbloburlusage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_partitionedbloburlusage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_partitionedbloburlusage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}