{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_UseOnlyTokenActivation",
        "Use only Token Activation",
        "\\Microsoft Office 2016 (Machine)\\Volume Activation",
        "Microsoft Office 2016 (Machine)\\Volume Activation",
        "Volume Activation"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficemachine~L_VolumeActivation/L_UseOnlyTokenActivation",
    "rootDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_useonlytokenactivation",
    "categoryId": "712d184f-d9ac-45fc-9eea-aade3a22b55e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_useonlytokenactivation",
    "description": "This policy setting allows you to specify Token Activation as the only volume activation method for volume editions of Office.  This policy setting only applies if a Token Activation Issuance License has been installed on the computer.\r\n\r\nIf you enable this policy setting, Token Activation is the only method that may be used to activate Office.\r\n\r\nIf you disable or do not configure this policy setting, Key Management Service (KMS) or Token Activation may be used as methods to activate Office.",
    "helpText": "",
    "name": "L_UseOnlyTokenActivation",
    "displayName": "Use only Token Activation",
    "defaultOptionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_useonlytokenactivation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_useonlytokenactivation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_volumeactivation_l_useonlytokenactivation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}