{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NTPMiddleSlotAnnouncementVisible",
        "Show the middle slot announcement on the New Tab Page",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/NTPMiddleSlotAnnouncementVisible",
    "rootDefinitionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpmiddleslotannouncementvisible",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpmiddleslotannouncementvisible",
    "description": "This policy controls the visibility of the middle slot announcement on the New Tab Page.\r\n\r\nIf the policy is set to Enabled, the New Tab Page will show the middle slot announcement if it is available.\r\n\r\nIf the policy is set to Disabled, the New Tab Page will not show the middle slot announcement even if it is available.\r\n",
    "helpText": "",
    "name": "NTPMiddleSlotAnnouncementVisible",
    "displayName": "Show the middle slot announcement on the New Tab Page",
    "defaultOptionId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpmiddleslotannouncementvisible_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpmiddleslotannouncementvisible_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpmiddleslotannouncementvisible_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}