{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IntelliCodeRemoteAnalysisDisabled",
        "Disable IntelliCode custom model training",
        "\\Visual Studio\\Privacy Settings",
        "Visual Studio\\Privacy Settings",
        "Privacy Settings"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/VisualStudiov1.Updates~Policy~VisualStudio~PrivacySettings/IntelliCodeRemoteAnalysisDisabled",
    "rootDefinitionId": "device_vendor_msft_policy_config_visualstudiov1.updates~policy~visualstudio~privacysettings_intellicoderemoteanalysisdisabled",
    "categoryId": "96277512-3d35-4876-ad74-2d849348799e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_visualstudiov1.updates~policy~visualstudio~privacysettings_intellicoderemoteanalysisdisabled",
    "description": "This policy disables the ability to train custom IntelliCode models for IntelliSense completions.",
    "helpText": "",
    "name": "IntelliCodeRemoteAnalysisDisabled",
    "displayName": "Disable IntelliCode custom model training",
    "defaultOptionId": "device_vendor_msft_policy_config_visualstudiov1.updates~policy~visualstudio~privacysettings_intellicoderemoteanalysisdisabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1.updates~policy~visualstudio~privacysettings_intellicoderemoteanalysisdisabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_visualstudiov1.updates~policy~visualstudio~privacysettings_intellicoderemoteanalysisdisabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}