{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "ConfigAutomaticRestartSignOn",
        "Configure the mode of automatically signing in and locking last interactive user after a restart or cold boot",
        "\\Windows Components\\Windows Logon Options",
        "Administrative Templates\\Windows Components\\Windows Logon Options",
        "Windows Logon Options"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/WindowsLogon/ConfigAutomaticRestartSignOn",
    "rootDefinitionId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon",
    "categoryId": "e9aff162-feb0-400a-aa68-8dd8deb93275",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription",
    "description": "",
    "helpText": "",
    "name": "ConfigAutomaticRestartSignOnDescription",
    "displayName": "Configure the mode of automatically signing in and locking last interactive user after a restart or cold boot (Device)",
    "defaultOptionId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "9.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.18362",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription_0",
            "description": null,
            "helpText": null,
            "name": "Enabled if BitLocker is on and not suspended",
            "displayName": "Enabled if BitLocker is on and not suspended",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_1",
                    "parentSettingId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription_1",
            "description": null,
            "helpText": null,
            "name": "Always Enabled",
            "displayName": "Always Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_1",
                    "parentSettingId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon"
                }
            ],
            "dependedOnBy": []
        }
    ]
}