{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update",
        "Declarative Device Management (DDM)\\Software Update"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "DetailsURL",
    "rootDefinitionId": "enforcement_enforcement",
    "categoryId": "42a6198f-bdec-402e-b619-315400b65488",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "enforcement_detailsurl",
    "description": "The URL of a web page that shows details that the organization provides about the enforced update.",
    "helpText": null,
    "name": "DetailsURL",
    "displayName": "Details URL",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "enforcement_enforcement",
            "parentSettingId": "enforcement_enforcement"
        }
    ],
    "dependedOnBy": []
}