{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "TargetLocalDateTime",
    "rootDefinitionId": "enforcement_enforcement",
    "categoryId": "42a6198f-bdec-402e-b619-315400b65488",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "enforcement_targetlocaldatetime",
    "description": "The date time value that specifies when to force install the software update. If the user doesn’t trigger the software update before this time, the device force installs it. The time specified in the console will be converted to UTC based on the tenant location. For example, if the desired install time is 5:00 PM and the person configuring the policy is based in the eastern US, specify 12:00 PM as the install time to configure a 5:00 PM policy.",
    "helpText": null,
    "name": "TargetLocalDateTime",
    "displayName": "Target Date Time (UTC)",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "dateTime",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "enforcement_enforcement",
            "parentSettingId": "enforcement_enforcement"
        }
    ],
    "dependedOnBy": []
}