{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "TargetOSVersion",
    "rootDefinitionId": "enforcement_enforcement",
    "categoryId": "42a6198f-bdec-402e-b619-315400b65488",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "enforcement_targetosversion",
    "description": "The target OS version to update the device to by the appropriate time. This is the OS version number, for example, '16.1'. It may also include a supplemental version identifier, for example, '16.1.1'.",
    "helpText": null,
    "name": "TargetOSVersion",
    "displayName": "Target OS Version",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "enforcement_enforcement",
            "parentSettingId": "enforcement_enforcement"
        }
    ],
    "dependedOnBy": []
}