{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Autopilot",
        "Device Preparation",
        "Language (Region)",
        "Out-of-box experience settings"
    ],
    "infoUrls": [],
    "baseUri": "./enrollment/autopilot/DevicePreparation",
    "offsetUri": "/OobeSettings/Language",
    "rootDefinitionId": "enrollment_autopilot_dpp_language",
    "categoryId": "72e4d72b-e01e-427c-a3b6-05bdcf04ef8d",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "template",
    "riskLevel": "low",
    "id": "enrollment_autopilot_dpp_language",
    "description": "Specify the language and region that will be used.",
    "helpText": "",
    "name": "Language",
    "displayName": "Language (Region)",
    "defaultOptionId": "enrollment_autopilot_dpp_language_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "enrollment",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "enrollment_autopilot_dpp_language_0",
            "description": null,
            "helpText": null,
            "name": "Operating system default",
            "displayName": "Operating system default",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "os-default"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_1",
            "description": null,
            "helpText": null,
            "name": "User select",
            "displayName": "User select",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": ""
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_2",
            "description": null,
            "helpText": null,
            "name": "Arabic (U.A.E.)",
            "displayName": "Arabic (U.A.E.)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-AE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_3",
            "description": null,
            "helpText": null,
            "name": "Arabic (Bahrain)",
            "displayName": "Arabic (Bahrain)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-BH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_4",
            "description": null,
            "helpText": null,
            "name": "Arabic (Algeria)",
            "displayName": "Arabic (Algeria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-DZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_5",
            "description": null,
            "helpText": null,
            "name": "Arabic (Egypt)",
            "displayName": "Arabic (Egypt)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-EG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_6",
            "description": null,
            "helpText": null,
            "name": "Arabic (Iraq)",
            "displayName": "Arabic (Iraq)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-IQ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_7",
            "description": null,
            "helpText": null,
            "name": "Arabic (Jordan)",
            "displayName": "Arabic (Jordan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-JO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_8",
            "description": null,
            "helpText": null,
            "name": "Arabic (Kuwait)",
            "displayName": "Arabic (Kuwait)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-KW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_9",
            "description": null,
            "helpText": null,
            "name": "Arabic (Lebanon)",
            "displayName": "Arabic (Lebanon)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-LB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_10",
            "description": null,
            "helpText": null,
            "name": "Arabic (Libya)",
            "displayName": "Arabic (Libya)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-LY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_11",
            "description": null,
            "helpText": null,
            "name": "Arabic (Morocco)",
            "displayName": "Arabic (Morocco)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-MA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_12",
            "description": null,
            "helpText": null,
            "name": "Arabic (Oman)",
            "displayName": "Arabic (Oman)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-OM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_13",
            "description": null,
            "helpText": null,
            "name": "Arabic (Qatar)",
            "displayName": "Arabic (Qatar)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-QA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_14",
            "description": null,
            "helpText": null,
            "name": "Arabic (Saudi Arabia)",
            "displayName": "Arabic (Saudi Arabia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-SA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_15",
            "description": null,
            "helpText": null,
            "name": "Arabic (Syria)",
            "displayName": "Arabic (Syria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-SY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_16",
            "description": null,
            "helpText": null,
            "name": "Arabic (Tunisia)",
            "displayName": "Arabic (Tunisia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-TN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_17",
            "description": null,
            "helpText": null,
            "name": "Arabic (Yemen)",
            "displayName": "Arabic (Yemen)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-YE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_18",
            "description": null,
            "helpText": null,
            "name": "Azerbaijani (Cyrillic, Azerbaijan)",
            "displayName": "Azerbaijani (Cyrillic, Azerbaijan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "az-Cyrl-AZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_19",
            "description": null,
            "helpText": null,
            "name": "Azerbaijani (Latin, Azerbaijan)",
            "displayName": "Azerbaijani (Latin, Azerbaijan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "az-Latn-AZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_20",
            "description": null,
            "helpText": null,
            "name": "Bangla (Bangladesh)",
            "displayName": "Bangla (Bangladesh)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bn-BD"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_21",
            "description": null,
            "helpText": null,
            "name": "Bangla (India)",
            "displayName": "Bangla (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bn-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_22",
            "description": null,
            "helpText": null,
            "name": "Bosnian (Cyrillic)",
            "displayName": "Bosnian (Cyrillic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bs-Cyrl-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_23",
            "description": null,
            "helpText": null,
            "name": "Bosnian (Latin)",
            "displayName": "Bosnian (Latin)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bs-Latn-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_24",
            "description": null,
            "helpText": null,
            "name": "Chinese (PRC)",
            "displayName": "Chinese (PRC)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_25",
            "description": null,
            "helpText": null,
            "name": "Chinese (Hong Kong S.A.R.)",
            "displayName": "Chinese (Hong Kong S.A.R.)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-HK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_26",
            "description": null,
            "helpText": null,
            "name": "Chinese (Macao S.A.R.)",
            "displayName": "Chinese (Macao S.A.R.)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-MO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_27",
            "description": null,
            "helpText": null,
            "name": "Chinese (Singapore)",
            "displayName": "Chinese (Singapore)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-SG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_28",
            "description": null,
            "helpText": null,
            "name": "Chinese (Taiwan)",
            "displayName": "Chinese (Taiwan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-TW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_29",
            "description": null,
            "helpText": null,
            "name": "Croatian (Latin)",
            "displayName": "Croatian (Latin)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hr-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_30",
            "description": null,
            "helpText": null,
            "name": "Croatian (Croatia)",
            "displayName": "Croatian (Croatia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hr-HR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_31",
            "description": null,
            "helpText": null,
            "name": "Dutch (Belgium)",
            "displayName": "Dutch (Belgium)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nl-BE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_32",
            "description": null,
            "helpText": null,
            "name": "Dutch (Netherlands)",
            "displayName": "Dutch (Netherlands)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nl-NL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_33",
            "description": null,
            "helpText": null,
            "name": "English (Australia)",
            "displayName": "English (Australia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-AU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_34",
            "description": null,
            "helpText": null,
            "name": "English (Belize)",
            "displayName": "English (Belize)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-BZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_35",
            "description": null,
            "helpText": null,
            "name": "English (Canada)",
            "displayName": "English (Canada)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_36",
            "description": null,
            "helpText": null,
            "name": "English (Caribbean)",
            "displayName": "English (Caribbean)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-029"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_37",
            "description": null,
            "helpText": null,
            "name": "English (Ireland)",
            "displayName": "English (Ireland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-IE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_38",
            "description": null,
            "helpText": null,
            "name": "English (India)",
            "displayName": "English (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_39",
            "description": null,
            "helpText": null,
            "name": "English (Jamaica)",
            "displayName": "English (Jamaica)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-JM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_40",
            "description": null,
            "helpText": null,
            "name": "English (Malaysia)",
            "displayName": "English (Malaysia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-MY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_41",
            "description": null,
            "helpText": null,
            "name": "English (New Zealand)",
            "displayName": "English (New Zealand)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-NZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_42",
            "description": null,
            "helpText": null,
            "name": "English (Republic of the Philippines)",
            "displayName": "English (Republic of the Philippines)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-PH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_43",
            "description": null,
            "helpText": null,
            "name": "English (Singapore)",
            "displayName": "English (Singapore)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-SG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_44",
            "description": null,
            "helpText": null,
            "name": "English (Trinidad and Tobago)",
            "displayName": "English (Trinidad and Tobago)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-TT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_45",
            "description": null,
            "helpText": null,
            "name": "English (United Kingdom)",
            "displayName": "English (United Kingdom)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_46",
            "description": null,
            "helpText": null,
            "name": "English (United States)",
            "displayName": "English (United States)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_47",
            "description": null,
            "helpText": null,
            "name": "English (South Africa)",
            "displayName": "English (South Africa)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_48",
            "description": null,
            "helpText": null,
            "name": "English (Zimbabwe)",
            "displayName": "English (Zimbabwe)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-ZW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_49",
            "description": null,
            "helpText": null,
            "name": "French (Belgium)",
            "displayName": "French (Belgium)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-BE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_50",
            "description": null,
            "helpText": null,
            "name": "French (Canada)",
            "displayName": "French (Canada)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_51",
            "description": null,
            "helpText": null,
            "name": "French (Switzerland)",
            "displayName": "French (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_52",
            "description": null,
            "helpText": null,
            "name": "French (France)",
            "displayName": "French (France)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_53",
            "description": null,
            "helpText": null,
            "name": "French (Luxembourg)",
            "displayName": "French (Luxembourg)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-LU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_54",
            "description": null,
            "helpText": null,
            "name": "French (Monaco)",
            "displayName": "French (Monaco)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-MC"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_55",
            "description": null,
            "helpText": null,
            "name": "German (Austria)",
            "displayName": "German (Austria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-AT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_56",
            "description": null,
            "helpText": null,
            "name": "German (Switzerland)",
            "displayName": "German (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_57",
            "description": null,
            "helpText": null,
            "name": "German (Germany)",
            "displayName": "German (Germany)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_58",
            "description": null,
            "helpText": null,
            "name": "German (Liechtenstein)",
            "displayName": "German (Liechtenstein)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-LI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_59",
            "description": null,
            "helpText": null,
            "name": "German (Luxembourg)",
            "displayName": "German (Luxembourg)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-LU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_60",
            "description": null,
            "helpText": null,
            "name": "Inuktitut (Syllabics, Canada)",
            "displayName": "Inuktitut (Syllabics, Canada)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "iu-Cans-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_61",
            "description": null,
            "helpText": null,
            "name": "Inuktitut (Latin, Canada)",
            "displayName": "Inuktitut (Latin, Canada)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "iu-Latn-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_62",
            "description": null,
            "helpText": null,
            "name": "Italian (Switzerland)",
            "displayName": "Italian (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_63",
            "description": null,
            "helpText": null,
            "name": "Italian (Italy)",
            "displayName": "Italian (Italy)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-IT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_64",
            "description": null,
            "helpText": null,
            "name": "Malay (Brunei Darussalam)",
            "displayName": "Malay (Brunei Darussalam)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ms-BN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_65",
            "description": null,
            "helpText": null,
            "name": "Malay (Malaysia)",
            "displayName": "Malay (Malaysia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ms-MY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_66",
            "description": null,
            "helpText": null,
            "name": "Mongolian (Traditional Mongolian, PRC)",
            "displayName": "Mongolian (Traditional Mongolian, PRC)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mn-Mong-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_67",
            "description": null,
            "helpText": null,
            "name": "Mongolian (Cyrillic, Mongolia)",
            "displayName": "Mongolian (Cyrillic, Mongolia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mn-MN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_68",
            "description": null,
            "helpText": null,
            "name": "Norwegian (Bokmål)",
            "displayName": "Norwegian (Bokmål)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nb-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_69",
            "description": null,
            "helpText": null,
            "name": "Norwegian (Nynorsk)",
            "displayName": "Norwegian (Nynorsk)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nn-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_70",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Brazil)",
            "displayName": "Portuguese (Brazil)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-BR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_71",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Portugal)",
            "displayName": "Portuguese (Portugal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_72",
            "description": null,
            "helpText": null,
            "name": "Quechua (Bolivia)",
            "displayName": "Quechua (Bolivia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "quz-BO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_73",
            "description": null,
            "helpText": null,
            "name": "Quechua (Ecuador)",
            "displayName": "Quechua (Ecuador)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "quz-EC"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_74",
            "description": null,
            "helpText": null,
            "name": "Quechua (Peru)",
            "displayName": "Quechua (Peru)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "quz-PE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_75",
            "description": null,
            "helpText": null,
            "name": "Sami, Lule (Norway)",
            "displayName": "Sami, Lule (Norway)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "smj-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_76",
            "description": null,
            "helpText": null,
            "name": "Sami, Lule (Sweden)",
            "displayName": "Sami, Lule (Sweden)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "smj-SE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_77",
            "description": null,
            "helpText": null,
            "name": "Sami, Northern (Finland)",
            "displayName": "Sami, Northern (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "se-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_78",
            "description": null,
            "helpText": null,
            "name": "Sami, Northern (Norway)",
            "displayName": "Sami, Northern (Norway)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "se-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_79",
            "description": null,
            "helpText": null,
            "name": "Sami, Northern (Sweden)",
            "displayName": "Sami, Northern (Sweden)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "se-SE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_80",
            "description": null,
            "helpText": null,
            "name": "Sami, Southern (Norway)",
            "displayName": "Sami, Southern (Norway)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sma-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_81",
            "description": null,
            "helpText": null,
            "name": "Sami, Southern (Sweden)",
            "displayName": "Sami, Southern (Sweden)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sma-SE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_82",
            "description": null,
            "helpText": null,
            "name": "Sami, Inari (Finland)",
            "displayName": "Sami, Inari (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "smn-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_83",
            "description": null,
            "helpText": null,
            "name": "Sami, Skolt (Finland)",
            "displayName": "Sami, Skolt (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sms-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_84",
            "description": null,
            "helpText": null,
            "name": "Afrikaans (South Africa)",
            "displayName": "Afrikaans (South Africa)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "af-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_85",
            "description": null,
            "helpText": null,
            "name": "Albanian (Albania)",
            "displayName": "Albanian (Albania)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sq-AL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_86",
            "description": null,
            "helpText": null,
            "name": "Alsatian (France)",
            "displayName": "Alsatian (France)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gsw-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_87",
            "description": null,
            "helpText": null,
            "name": "Amharic (Ethiopia)",
            "displayName": "Amharic (Ethiopia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "am-ET"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_88",
            "description": null,
            "helpText": null,
            "name": "Armenian (Armenia)",
            "displayName": "Armenian (Armenia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hy-AM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_89",
            "description": null,
            "helpText": null,
            "name": "Assamese (India)",
            "displayName": "Assamese (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "as-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_90",
            "description": null,
            "helpText": null,
            "name": "Bashkir (Russia)",
            "displayName": "Bashkir (Russia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ba-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_91",
            "description": null,
            "helpText": null,
            "name": "Basque (Basque)",
            "displayName": "Basque (Basque)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "eu-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_92",
            "description": null,
            "helpText": null,
            "name": "Belarusian (Belarus)",
            "displayName": "Belarusian (Belarus)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "be-BY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_93",
            "description": null,
            "helpText": null,
            "name": "Breton (France)",
            "displayName": "Breton (France)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "br-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_94",
            "description": null,
            "helpText": null,
            "name": "Bulgarian (Bulgaria)",
            "displayName": "Bulgarian (Bulgaria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bg-BG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_95",
            "description": null,
            "helpText": null,
            "name": "Catalan (Catalan)",
            "displayName": "Catalan (Catalan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ca-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_96",
            "description": null,
            "helpText": null,
            "name": "Corsican (France)",
            "displayName": "Corsican (France)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "co-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_97",
            "description": null,
            "helpText": null,
            "name": "Czech (Czech Republic)",
            "displayName": "Czech (Czech Republic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "cs-CZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_98",
            "description": null,
            "helpText": null,
            "name": "Danish (Denmark)",
            "displayName": "Danish (Denmark)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "da-DK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_99",
            "description": null,
            "helpText": null,
            "name": "Dari (Afghanistan)",
            "displayName": "Dari (Afghanistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "prs-AF"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_100",
            "description": null,
            "helpText": null,
            "name": "Divehi (Maldives)",
            "displayName": "Divehi (Maldives)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "dv-MV"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_101",
            "description": null,
            "helpText": null,
            "name": "Estonian (Estonia)",
            "displayName": "Estonian (Estonia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "et-EE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_102",
            "description": null,
            "helpText": null,
            "name": "Faroese (Faroe Islands)",
            "displayName": "Faroese (Faroe Islands)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fo-FO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_103",
            "description": null,
            "helpText": null,
            "name": "Filipino (Philippines)",
            "displayName": "Filipino (Philippines)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fil-PH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_104",
            "description": null,
            "helpText": null,
            "name": "Finnish (Finland)",
            "displayName": "Finnish (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fi-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_105",
            "description": null,
            "helpText": null,
            "name": "Frisian (Netherlands)",
            "displayName": "Frisian (Netherlands)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fy-NL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_106",
            "description": null,
            "helpText": null,
            "name": "Galician (Galician)",
            "displayName": "Galician (Galician)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gl-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_107",
            "description": null,
            "helpText": null,
            "name": "Georgian (Georgia)",
            "displayName": "Georgian (Georgia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ka-GE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_108",
            "description": null,
            "helpText": null,
            "name": "Greek (Greece)",
            "displayName": "Greek (Greece)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "el-GR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_109",
            "description": null,
            "helpText": null,
            "name": "Greenlandic (Greenland)",
            "displayName": "Greenlandic (Greenland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kl-GL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_110",
            "description": null,
            "helpText": null,
            "name": "Gujarati (India)",
            "displayName": "Gujarati (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "gu-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_111",
            "description": null,
            "helpText": null,
            "name": "Hausa (Latin, Nigeria)",
            "displayName": "Hausa (Latin, Nigeria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ha-Latn-NG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_112",
            "description": null,
            "helpText": null,
            "name": "Hebrew (Israel)",
            "displayName": "Hebrew (Israel)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "he-IL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_113",
            "description": null,
            "helpText": null,
            "name": "Hindi (India)",
            "displayName": "Hindi (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hi-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_114",
            "description": null,
            "helpText": null,
            "name": "Hungarian (Hungary)",
            "displayName": "Hungarian (Hungary)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hu-HU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_115",
            "description": null,
            "helpText": null,
            "name": "Icelandic (Iceland)",
            "displayName": "Icelandic (Iceland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "is-IS"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_116",
            "description": null,
            "helpText": null,
            "name": "Igbo (Nigeria)",
            "displayName": "Igbo (Nigeria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ig-NG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_117",
            "description": null,
            "helpText": null,
            "name": "Indonesian (Indonesia)",
            "displayName": "Indonesian (Indonesia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "id-ID"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_118",
            "description": null,
            "helpText": null,
            "name": "Irish (Ireland)",
            "displayName": "Irish (Ireland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ga-IE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_119",
            "description": null,
            "helpText": null,
            "name": "isiXhosa (South Africa)",
            "displayName": "isiXhosa (South Africa)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "xh-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_120",
            "description": null,
            "helpText": null,
            "name": "isiZulu (South Africa)",
            "displayName": "isiZulu (South Africa)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zu-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_121",
            "description": null,
            "helpText": null,
            "name": "Japanese (Japan)",
            "displayName": "Japanese (Japan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ja-JP"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_122",
            "description": null,
            "helpText": null,
            "name": "Kannada (India)",
            "displayName": "Kannada (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kn-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_123",
            "description": null,
            "helpText": null,
            "name": "Kazakh (Kazakhstan)",
            "displayName": "Kazakh (Kazakhstan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kk-KZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_124",
            "description": null,
            "helpText": null,
            "name": "Khmer (Cambodia)",
            "displayName": "Khmer (Cambodia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "km-KH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_125",
            "description": null,
            "helpText": null,
            "name": "K'iche (Guatemala)",
            "displayName": "K'iche (Guatemala)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "qut-GT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_126",
            "description": null,
            "helpText": null,
            "name": "Kinyarwanda (Rwanda)",
            "displayName": "Kinyarwanda (Rwanda)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "rw-RW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_127",
            "description": null,
            "helpText": null,
            "name": "Kiswahili (Kenya)",
            "displayName": "Kiswahili (Kenya)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sw-KE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_128",
            "description": null,
            "helpText": null,
            "name": "Konkani (India)",
            "displayName": "Konkani (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "kok-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_129",
            "description": null,
            "helpText": null,
            "name": "Korean (Korea)",
            "displayName": "Korean (Korea)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ko-KR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_130",
            "description": null,
            "helpText": null,
            "name": "Kyrgyz (Kyrgyzstan)",
            "displayName": "Kyrgyz (Kyrgyzstan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ky-KG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_131",
            "description": null,
            "helpText": null,
            "name": "Lao (Lao P.D.R.)",
            "displayName": "Lao (Lao P.D.R.)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lo-LA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_132",
            "description": null,
            "helpText": null,
            "name": "Latvian (Latvia)",
            "displayName": "Latvian (Latvia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lv-LV"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_133",
            "description": null,
            "helpText": null,
            "name": "Lithuanian (Lithuania)",
            "displayName": "Lithuanian (Lithuania)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lt-LT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_134",
            "description": null,
            "helpText": null,
            "name": "Lower Sorbian (Germany)",
            "displayName": "Lower Sorbian (Germany)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "dsb-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_135",
            "description": null,
            "helpText": null,
            "name": "Luxembourgish (Luxembourg)",
            "displayName": "Luxembourgish (Luxembourg)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lb-LU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_136",
            "description": null,
            "helpText": null,
            "name": "Macedonian (Macedonia, FYRO)",
            "displayName": "Macedonian (Macedonia, FYRO)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mk-MK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_137",
            "description": null,
            "helpText": null,
            "name": "Malayalam (India)",
            "displayName": "Malayalam (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ml-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_138",
            "description": null,
            "helpText": null,
            "name": "Maltese (Malta)",
            "displayName": "Maltese (Malta)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mt-MT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_139",
            "description": null,
            "helpText": null,
            "name": "Maori (New Zealand)",
            "displayName": "Maori (New Zealand)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mi-NZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_140",
            "description": null,
            "helpText": null,
            "name": "Mapudungun (Chile)",
            "displayName": "Mapudungun (Chile)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "arn-CL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_141",
            "description": null,
            "helpText": null,
            "name": "Marathi (India)",
            "displayName": "Marathi (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "mr-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_142",
            "description": null,
            "helpText": null,
            "name": "Mohawk (Mohawk)",
            "displayName": "Mohawk (Mohawk)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "moh-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_143",
            "description": null,
            "helpText": null,
            "name": "Nepali (Nepal)",
            "displayName": "Nepali (Nepal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ne-NP"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_144",
            "description": null,
            "helpText": null,
            "name": "Occitan (France)",
            "displayName": "Occitan (France)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "oc-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_145",
            "description": null,
            "helpText": null,
            "name": "Odia (India)",
            "displayName": "Odia (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "or-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_146",
            "description": null,
            "helpText": null,
            "name": "Pashto (Afghanistan)",
            "displayName": "Pashto (Afghanistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ps-AF"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_147",
            "description": null,
            "helpText": null,
            "name": "Persian",
            "displayName": "Persian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fa-IR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_148",
            "description": null,
            "helpText": null,
            "name": "Polish (Poland)",
            "displayName": "Polish (Poland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pl-PL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_149",
            "description": null,
            "helpText": null,
            "name": "Punjabi (India)",
            "displayName": "Punjabi (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pa-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_150",
            "description": null,
            "helpText": null,
            "name": "Romanian (Romania)",
            "displayName": "Romanian (Romania)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ro-RO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_151",
            "description": null,
            "helpText": null,
            "name": "Romansh (Switzerland)",
            "displayName": "Romansh (Switzerland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "rm-CH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_152",
            "description": null,
            "helpText": null,
            "name": "Russian (Russia)",
            "displayName": "Russian (Russia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ru-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_153",
            "description": null,
            "helpText": null,
            "name": "Sanskrit (India)",
            "displayName": "Sanskrit (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sa-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_154",
            "description": null,
            "helpText": null,
            "name": "Sesotho sa Leboa (South Africa)",
            "displayName": "Sesotho sa Leboa (South Africa)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nso-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_156",
            "description": null,
            "helpText": null,
            "name": "Setswana (South Africa)",
            "displayName": "Setswana (South Africa)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tn-ZA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_157",
            "description": null,
            "helpText": null,
            "name": "Sinhala (Sri Lanka)",
            "displayName": "Sinhala (Sri Lanka)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "si-LK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_158",
            "description": null,
            "helpText": null,
            "name": "Slovak (Slovakia)",
            "displayName": "Slovak (Slovakia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sk-SK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_159",
            "description": null,
            "helpText": null,
            "name": "Slovenian (Slovenia)",
            "displayName": "Slovenian (Slovenia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sl-SI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_160",
            "description": null,
            "helpText": null,
            "name": "Swedish (Sweden)",
            "displayName": "Swedish (Sweden)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sv-SE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_161",
            "description": null,
            "helpText": null,
            "name": "Syriac (Syria)",
            "displayName": "Syriac (Syria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "syr-SY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_162",
            "description": null,
            "helpText": null,
            "name": "Tajik (Cyrillic, Tajikistan)",
            "displayName": "Tajik (Cyrillic, Tajikistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tg-Cyrl-TJ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_163",
            "description": null,
            "helpText": null,
            "name": "Tamazight (Latin, Algeria)",
            "displayName": "Tamazight (Latin, Algeria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tzm-Latn-DZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_164",
            "description": null,
            "helpText": null,
            "name": "Tamil (India)",
            "displayName": "Tamil (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ta-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_165",
            "description": null,
            "helpText": null,
            "name": "Tatar (Russia)",
            "displayName": "Tatar (Russia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tt-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_166",
            "description": null,
            "helpText": null,
            "name": "Telugu (India)",
            "displayName": "Telugu (India)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "te-IN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_167",
            "description": null,
            "helpText": null,
            "name": "Thai (Thailand)",
            "displayName": "Thai (Thailand)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "th-TH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_168",
            "description": null,
            "helpText": null,
            "name": "Tibetan",
            "displayName": "Tibetan",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bo-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_169",
            "description": null,
            "helpText": null,
            "name": "Turkish (Turkey)",
            "displayName": "Turkish (Turkey)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tr-TR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_170",
            "description": null,
            "helpText": null,
            "name": "Turkmen (Turkmenistan)",
            "displayName": "Turkmen (Turkmenistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tk-TM"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_171",
            "description": null,
            "helpText": null,
            "name": "Uighur (PRC)",
            "displayName": "Uighur (PRC)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ug-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_172",
            "description": null,
            "helpText": null,
            "name": "Ukrainian (Ukraine)",
            "displayName": "Ukrainian (Ukraine)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uk-UA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_173",
            "description": null,
            "helpText": null,
            "name": "Urdu (Islamic Republic of Pakistan)",
            "displayName": "Urdu (Islamic Republic of Pakistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ur-PK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_174",
            "description": null,
            "helpText": null,
            "name": "Vietnamese (Vietnam)",
            "displayName": "Vietnamese (Vietnam)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "vi-VN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_175",
            "description": null,
            "helpText": null,
            "name": "Welsh (United Kingdom)",
            "displayName": "Welsh (United Kingdom)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "cy-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_176",
            "description": null,
            "helpText": null,
            "name": "Wolof (Senegal)",
            "displayName": "Wolof (Senegal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sah-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_177",
            "description": null,
            "helpText": null,
            "name": "Yakut (Russia)",
            "displayName": "Yakut (Russia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sah-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_178",
            "description": null,
            "helpText": null,
            "name": "Yi (PRC)",
            "displayName": "Yi (PRC)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ii-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_179",
            "description": null,
            "helpText": null,
            "name": "Yoruba (Nigeria)",
            "displayName": "Yoruba (Nigeria)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "yo-NG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_180",
            "description": null,
            "helpText": null,
            "name": "Serbian (Cyrillic)",
            "displayName": "Serbian (Cyrillic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Cyrl-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_181",
            "description": null,
            "helpText": null,
            "name": "Serbian (Cyrillic, Serbia and Montenegro)",
            "displayName": "Serbian (Cyrillic, Serbia and Montenegro)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Cyrl-RS"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_182",
            "description": null,
            "helpText": null,
            "name": "Serbian (Latin)",
            "displayName": "Serbian (Latin)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Latn-BA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_183",
            "description": null,
            "helpText": null,
            "name": "Serbian (Latin, Serbia)",
            "displayName": "Serbian (Latin, Serbia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Latn-RS"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_184",
            "description": null,
            "helpText": null,
            "name": "Lower Sorbian (Germany)",
            "displayName": "Lower Sorbian (Germany)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "dsb-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_185",
            "description": null,
            "helpText": null,
            "name": "Upper Sorbian (Germany)",
            "displayName": "Upper Sorbian (Germany)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "wen-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_186",
            "description": null,
            "helpText": null,
            "name": "Spanish (Spain, Traditional Sort)",
            "displayName": "Spanish (Spain, Traditional Sort)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_187",
            "description": null,
            "helpText": null,
            "name": "Spanish (Argentina)",
            "displayName": "Spanish (Argentina)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-AR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_188",
            "description": null,
            "helpText": null,
            "name": "Spanish (Bolivia)",
            "displayName": "Spanish (Bolivia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-BO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_189",
            "description": null,
            "helpText": null,
            "name": "Spanish (Chile)",
            "displayName": "Spanish (Chile)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-CL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_190",
            "description": null,
            "helpText": null,
            "name": "Spanish (Colombia)",
            "displayName": "Spanish (Colombia)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-CO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_191",
            "description": null,
            "helpText": null,
            "name": "Spanish (Costa Rica)",
            "displayName": "Spanish (Costa Rica)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-CR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_192",
            "description": null,
            "helpText": null,
            "name": "Spanish (Dominican Republic)",
            "displayName": "Spanish (Dominican Republic)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-DO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_193",
            "description": null,
            "helpText": null,
            "name": "Spanish (Ecuador)",
            "displayName": "Spanish (Ecuador)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-EC"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_194",
            "description": null,
            "helpText": null,
            "name": "Spanish (Guatemala)",
            "displayName": "Spanish (Guatemala)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-GT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_195",
            "description": null,
            "helpText": null,
            "name": "Spanish (Honduras)",
            "displayName": "Spanish (Honduras)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-HN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_196",
            "description": null,
            "helpText": null,
            "name": "Spanish (Mexico)",
            "displayName": "Spanish (Mexico)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-MX"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_197",
            "description": null,
            "helpText": null,
            "name": "Spanish (Nicaragua)",
            "displayName": "Spanish (Nicaragua)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-NI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_198",
            "description": null,
            "helpText": null,
            "name": "Spanish (Panama)",
            "displayName": "Spanish (Panama)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_199",
            "description": null,
            "helpText": null,
            "name": "Spanish (Peru)",
            "displayName": "Spanish (Peru)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_200",
            "description": null,
            "helpText": null,
            "name": "Spanish (Puerto Rico)",
            "displayName": "Spanish (Puerto Rico)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_201",
            "description": null,
            "helpText": null,
            "name": "Spanish (Paraguay)",
            "displayName": "Spanish (Paraguay)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-PY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_202",
            "description": null,
            "helpText": null,
            "name": "Spanish (El Salvador)",
            "displayName": "Spanish (El Salvador)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-SV"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_203",
            "description": null,
            "helpText": null,
            "name": "Spanish (United States)",
            "displayName": "Spanish (United States)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_204",
            "description": null,
            "helpText": null,
            "name": "Spanish (Uruguay)",
            "displayName": "Spanish (Uruguay)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-UY"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_205",
            "description": null,
            "helpText": null,
            "name": "Spanish (Venezuela)",
            "displayName": "Spanish (Venezuela)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-VE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_206",
            "description": null,
            "helpText": null,
            "name": "Swedish (Finland)",
            "displayName": "Swedish (Finland)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sv-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_207",
            "description": null,
            "helpText": null,
            "name": "Uzbek (Cyrillic, Uzbekistan)",
            "displayName": "Uzbek (Cyrillic, Uzbekistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uz-Cyrl-UZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_language_208",
            "description": null,
            "helpText": null,
            "name": "Uzbek (Latin, Uzbekistan)",
            "displayName": "Uzbek (Latin, Uzbekistan)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uz-Latn-UZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}