{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Autopilot",
        "Device Preparation",
        "AllowedScriptIds",
        "Scripts"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/autopilot/DevicePreparation",
    "offsetUri": "/AllowedScriptIds",
    "rootDefinitionId": "enrollment_autopilot_dpp_allowedscriptids",
    "categoryId": "db9fc5b8-fb50-437b-aceb-87d9d380def0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "enrollment_autopilot_dpp_allowedscriptids",
    "description": "Select up to 10 PowerShell scripts to install during this deployment. These scripts should be already assigned to the Device group selected earlier. You can check the installation status for these scripts in the device details for devices in this deployment.",
    "helpText": "",
    "name": "AllowedScriptIds",
    "displayName": "Allowed Scripts",
    "maximumCount": 10,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "enrollment",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1000,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}