{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Autopilot",
        "Device Preparation",
        "Device security group"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/autopilot/DevicePreparation",
    "offsetUri": "/DeviceSecurityGroupIds",
    "rootDefinitionId": "enrollment_autopilot_dpp_devicesecuritygroupids",
    "categoryId": "264202da-475b-476e-bbc7-3c252f777145",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "id": "enrollment_autopilot_dpp_devicesecuritygroupids",
    "description": "Choose a set of security groups to join the device to upon enrollment.",
    "helpText": "",
    "name": "DeviceSecurityGroupIds",
    "displayName": "Device security group",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "enrollment",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1000,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [],
    "dependedOnBy": []
}