{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Autopilot",
        "Device Preparation",
        "SkipEula",
        "Out-of-box experience settings"
    ],
    "infoUrls": [],
    "baseUri": "./enrollment/autopilot/DevicePreparation",
    "offsetUri": "/OobeSettings/SkipEula",
    "rootDefinitionId": "enrollment_autopilot_dpp_skipeula",
    "categoryId": "72e4d72b-e01e-427c-a3b6-05bdcf04ef8d",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "template",
    "riskLevel": "low",
    "id": "enrollment_autopilot_dpp_skipeula",
    "description": "Specify whether to show the end-user license agreement to users.",
    "helpText": "",
    "name": "SkipEula",
    "displayName": "Hide Microsoft Software License Terms",
    "defaultOptionId": "enrollment_autopilot_dpp_skipeula_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "enrollment",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "enrollment_autopilot_dpp_skipeula_0",
            "description": null,
            "helpText": null,
            "name": "No",
            "displayName": "No",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_autopilot_dpp_skipeula_1",
            "description": null,
            "helpText": null,
            "name": "Yes",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}