{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Block MDM enrollment",
        "enrollment"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "./enrollment/restriction",
    "offsetUri": "/Block_MDM_Enrollment",
    "rootDefinitionId": "enrollment_restriction_blockmdmenrollment",
    "categoryId": "a93cb07c-fa96-42af-8987-40f78eae10bd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "enrollment_restriction_blockmdmenrollment",
    "description": "Choose to block enrollment based on filters. Add a filter in the Assignments tab. To create a new filter, go to Filters section under Tenant admin.",
    "helpText": "",
    "name": "BlockMDMEnrollment",
    "displayName": "Block MDM enrollment",
    "defaultOptionId": "enrollment_restriction_blockmdmenrollment_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "enrollment",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "enrollment_restriction_blockmdmenrollment_0",
            "description": null,
            "helpText": null,
            "name": "No",
            "displayName": "No",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "enrollment_restriction_blockmdmenrollment_1",
            "description": null,
            "helpText": null,
            "name": "Yes",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}