{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extension Settings",
        "Safari Extension Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ManagedExtensions",
    "rootDefinitionId": "extensionsettings_extensionsettings",
    "categoryId": "7d9e5b9b-84e7-473c-b6ca-a1629448df55",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "extensionsettings_managedextensions_generickey_keytobereplaced",
    "description": "Extensions being managed",
    "helpText": null,
    "name": "ManagedExtensions",
    "displayName": "Managed Extensions",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "regEx",
        "inputValidationSchema": "^.*",
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "extensionsettings_managedextensions",
            "parentSettingId": "extensionsettings_managedextensions"
        }
    ],
    "dependedOnBy": []
}