{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Extension Settings",
        "Safari Extension Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "ManagedExtensions/{0}",
    "rootDefinitionId": "extensionsettings_extensionsettings",
    "categoryId": "7d9e5b9b-84e7-473c-b6ca-a1629448df55",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "extensionsettings_managedextensions_generickey",
    "description": "The composed identifier of the managed extension, or \"*\" for all extensions. In order for the extension to be managed, its host app must be present on the device.",
    "helpText": null,
    "name": "ManagedExtensions_genericKey",
    "displayName": "ANY",
    "childIds": [
        "extensionsettings_managedextensions_generickey_state",
        "extensionsettings_managedextensions_generickey_privatebrowsing",
        "extensionsettings_managedextensions_generickey_alloweddomains",
        "extensionsettings_managedextensions_generickey_denieddomains"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "extensionsettings_managedextensions",
            "parentSettingId": "extensionsettings_managedextensions"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "extensionsettings_managedextensions_generickey_state",
            "required": false
        },
        {
            "dependedOnBy": "extensionsettings_managedextensions_generickey_privatebrowsing",
            "required": false
        },
        {
            "dependedOnBy": "extensionsettings_managedextensions_generickey_alloweddomains",
            "required": false
        },
        {
            "dependedOnBy": "extensionsettings_managedextensions_generickey_denieddomains",
            "required": false
        }
    ]
}