{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Antivirus engine",
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#scan-exclusions"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "exclusions",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_antivirusengine_exclusions",
    "description": "Entities that have been excluded from the scan. Exclusions can be specified by full paths, extensions, or file names.",
    "helpText": null,
    "name": "exclusions",
    "displayName": "Scan exclusions",
    "childIds": [
        "linux_mdatp_managed_antivirusengine_exclusions_item_$type",
        "linux_mdatp_managed_antivirusengine_exclusions_item_extension",
        "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory",
        "linux_mdatp_managed_antivirusengine_exclusions_item_name",
        "linux_mdatp_managed_antivirusengine_exclusions_item_path"
    ],
    "maximumCount": 600,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_$type",
            "required": true
        },
        {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_extension",
            "required": false
        },
        {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_isdirectory",
            "required": false
        },
        {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_name",
            "required": false
        },
        {
            "dependedOnBy": "linux_mdatp_managed_antivirusengine_exclusions_item_path",
            "required": false
        }
    ]
}