{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Cloud delivered protection preferences",
        "Cloud delivered protection preferences"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/microsoft-365/security/defender-endpoint/linux-preferences#enable--disable-automatic-sample-submissions"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/cloudService",
    "offsetUri": "automaticSampleSubmissionConsent",
    "rootDefinitionId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent",
    "categoryId": "93099bd4-c685-434b-9d72-f0cb6db5e753",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent",
    "description": "Sends sample files to Microsoft to help protect device users and your organization from potential threats",
    "helpText": null,
    "name": "automaticSampleSubmissionConsent",
    "displayName": "Enable automatic sample submissions",
    "defaultOptionId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_safe",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_none",
            "description": null,
            "helpText": null,
            "name": "None",
            "displayName": "None",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "none"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_safe",
            "description": null,
            "helpText": null,
            "name": "Safe",
            "displayName": "Safe",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "safe"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_all",
            "description": null,
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "all"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}