{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Block Linux Enrollment",
        "Linux Enrollment",
        "Enrollment"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "/BlockEnrollment/Required",
    "rootDefinitionId": "linux_enrollment_blockenrollment",
    "categoryId": "a93cb07c-fa96-42af-8987-40f78eae10bd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "linux_enrollment_blockenrollment",
    "description": "Specifies whether to block Linux enrollments",
    "helpText": null,
    "name": "BlockLinuxEnrollment",
    "displayName": "Block Linux Enrollment",
    "defaultOptionId": "linux_blockenrollment_required_1",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_blockenrollment_required_0",
            "description": null,
            "helpText": null,
            "name": "No",
            "displayName": "No",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_blockenrollment_required_1",
            "description": null,
            "helpText": null,
            "name": "Yes",
            "displayName": "Yes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}