{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        " EDR preferences"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/edr",
    "offsetUri": "tags/[{0}]/value",
    "rootDefinitionId": "linux_mdatp_managed_edr_tags",
    "categoryId": "22a2a407-0f28-481d-bdbe-1f9cb6d589c3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "linux_mdatp_managed_edr_tags_item_value",
    "description": "Only one value per tag type can be set. Type of tags are unique, and should not be repeated in the same configuration profile.",
    "helpText": null,
    "name": "tags_item_value",
    "displayName": "Value of tag",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "linux_mdatp_managed_edr_tags",
            "parentSettingId": "linux_mdatp_managed_edr_tags"
        }
    ],
    "dependedOnBy": []
}