{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Antivirus engine"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/linux-preferences?view=o365-worldwide#enabledisable-behavior-monitoring"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "behaviorMonitoring",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_behaviormonitoring",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_mdatp_managed_antivirusengine_behaviormonitoring",
    "description": "Whether the antivirus engine runs behavior monitoring and blocking or not.",
    "helpText": null,
    "name": "behaviorMonitoring",
    "displayName": "Enable behavior monitoring",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_0",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_antivirusengine_behaviormonitoring_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "enabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}