{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Network protection"
    ],
    "infoUrls": [
        "https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/network-protection-linux?view=o365-worldwide"
    ],
    "occurrence": null,
    "baseUri": "PayloadContent/networkProtection",
    "offsetUri": "enforcementLevel",
    "rootDefinitionId": "linux_mdatp_managed_networkprotection_enforcementlevel",
    "categoryId": "269c487f-8902-486a-88dd-db9b9b4454b8",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_mdatp_managed_networkprotection_enforcementlevel",
    "description": "Specifies if network protection is disabled, in audit mode, or enforced",
    "helpText": null,
    "name": "enforcementLevel",
    "displayName": "Enforcement Level",
    "defaultOptionId": "linux_mdatp_managed_networkprotection_enforcementlevel_0",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_0",
            "description": null,
            "helpText": null,
            "name": "disabled",
            "displayName": "disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_1",
            "description": null,
            "helpText": null,
            "name": "audit",
            "displayName": "audit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "audit"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_networkprotection_enforcementlevel_2",
            "description": null,
            "helpText": null,
            "name": "block",
            "displayName": "block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "block"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}