{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Execution context",
        "root",
        "user",
        "Linux Custom Configuration"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2218882"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "CustomConfig/ExecutionContext",
    "rootDefinitionId": "linux_customconfig_executioncontext",
    "categoryId": "36716a4c-cedb-47bb-8f4b-5783fedc7c47",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "linux_customconfig_executioncontext",
    "description": "Specifies in which context to execute the script.",
    "helpText": null,
    "name": "CustomConfigExecutionContext",
    "displayName": "Execution context",
    "defaultOptionId": "linux_customconfig_executioncontext_user",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_customconfig_executioncontext_root",
            "description": null,
            "helpText": null,
            "name": "Root",
            "displayName": "Root",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "root"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executioncontext_user",
            "description": null,
            "helpText": null,
            "name": "User",
            "displayName": "User",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "user"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}