{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Exclusion Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/exclusionSettings",
    "offsetUri": "exclusions/[{0}]/name",
    "rootDefinitionId": "linux_mdatp_managed_exclusionsettings_exclusions",
    "categoryId": "d2191717-e304-46f7-bcc0-55e6477026c9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_mdatp_managed_exclusionsettings_exclusions_item_name",
    "description": "Process name, either or full path or file name, wildcards NOT supported",
    "helpText": null,
    "name": "exclusions_item_name",
    "displayName": "Process name",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 0,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type_1",
            "parentSettingId": "linux_mdatp_managed_exclusionsettings_exclusions_item_$type"
        }
    ],
    "dependedOnBy": []
}