{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Execution frequency",
        "frequency",
        "Linux Custom Configuration"
    ],
    "infoUrls": [
        "https://go.microsoft.com/fwlink/?linkid=2218882"
    ],
    "occurrence": null,
    "baseUri": "com.microsoft.manage.LinuxMdm",
    "offsetUri": "CustomConfig/ExecutionFrequency",
    "rootDefinitionId": "linux_customconfig_executionfrequency",
    "categoryId": "36716a4c-cedb-47bb-8f4b-5783fedc7c47",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "linux_customconfig_executionfrequency",
    "description": "Specifies how frequently to execute the script.",
    "helpText": null,
    "name": "CustomConfigExecutionFrequency",
    "displayName": "Execution frequency",
    "defaultOptionId": null,
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "linuxMdm"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_customconfig_executionfrequency_15minutes",
            "description": null,
            "helpText": null,
            "name": "Every 15 minutes",
            "displayName": "Every 15 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 15
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_30minutes",
            "description": null,
            "helpText": null,
            "name": "Every 30 minutes",
            "displayName": "Every 30 minutes",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 30
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_1hour",
            "description": null,
            "helpText": null,
            "name": "Every 1 hour",
            "displayName": "Every 1 hour",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 60
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_2hours",
            "description": null,
            "helpText": null,
            "name": "Every 2 hours",
            "displayName": "Every 2 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 120
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_3hours",
            "description": null,
            "helpText": null,
            "name": "Every 3 hours",
            "displayName": "Every 3 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 180
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_6hours",
            "description": null,
            "helpText": null,
            "name": "Every 6 hours",
            "displayName": "Every 6 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 360
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_12hours",
            "description": null,
            "helpText": null,
            "name": "Every 12 hours",
            "displayName": "Every 12 hours",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 720
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_1day",
            "description": null,
            "helpText": null,
            "name": "Every 1 day",
            "displayName": "Every 1 day",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1440
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_customconfig_executionfrequency_1week",
            "description": null,
            "helpText": null,
            "name": "Every 1 week",
            "displayName": "Every 1 week",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 10080
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}