{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Microsoft Defender - Antivirus engine",
        "Antivirus engine"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "PayloadContent/antivirusEngine",
    "offsetUri": "threatTypeSettings/[{0}]/value",
    "rootDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings",
    "categoryId": "13467142-14e7-4380-8573-4866e842c7f6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value",
    "description": "Action to take when coming across a threat of the type specified in the preceding section.",
    "helpText": null,
    "name": "threatTypeSettings_item_value",
    "displayName": "Action to take",
    "defaultOptionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_0",
    "applicability": {
        "description": null,
        "platform": "linux",
        "deviceMode": "none",
        "technologies": "microsoftSense"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_0",
            "description": null,
            "helpText": null,
            "name": "audit",
            "displayName": "audit",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "audit"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
                    "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_1",
            "description": null,
            "helpText": null,
            "name": "block",
            "displayName": "block",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "block"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
                    "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value_2",
            "description": null,
            "helpText": null,
            "name": "off",
            "displayName": "off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "off"
            },
            "dependentOn": [
                {
                    "dependentOn": "linux_mdatp_managed_antivirusengine_threattypesettings",
                    "parentSettingId": "linux_mdatp_managed_antivirusengine_threattypesettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}