{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Os recovery settings",
        "Base language",
        "Operating system settings"
    ],
    "infoUrls": [],
    "baseUri": "./osrecoverysettings",
    "offsetUri": "/baselanguage",
    "rootDefinitionId": "osrecoverysettings_baselanguage",
    "categoryId": "71f79fa3-14c0-4df8-bf9c-8476e36ea755",
    "settingUsage": "configuration",
    "uxBehavior": "dropdown",
    "visibility": "settingsCatalog,template",
    "id": "osrecoverysettings_baselanguage",
    "description": "Specify the base language that will be used",
    "helpText": "",
    "name": "BaseLanguage",
    "displayName": "Base language",
    "defaultOptionId": "osrecoverysettings_baselanguage_english",
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "windowsOsRecovery",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "osrecoverysettings_baselanguage_arabic",
            "description": null,
            "helpText": null,
            "name": "Arabic",
            "displayName": "Arabic",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ar-SA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_bulgarian",
            "description": null,
            "helpText": null,
            "name": "Bulgarian",
            "displayName": "Bulgarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "bg-BG"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_chinese_simplified",
            "description": null,
            "helpText": null,
            "name": "Chinese (Simplified)",
            "displayName": "Chinese (Simplified)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-CN"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_chinese_traditional",
            "description": null,
            "helpText": null,
            "name": "Chinese (Traditional)",
            "displayName": "Chinese (Traditional)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "zh-TW"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_croatian",
            "description": null,
            "helpText": null,
            "name": "Croatian",
            "displayName": "Croatian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hr-HR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_czech",
            "description": null,
            "helpText": null,
            "name": "Czech",
            "displayName": "Czech",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "cs-CZ"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_danish",
            "description": null,
            "helpText": null,
            "name": "Danish",
            "displayName": "Danish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "da-DK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_dutch",
            "description": null,
            "helpText": null,
            "name": "Dutch",
            "displayName": "Dutch",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nl-NL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_english",
            "description": null,
            "helpText": null,
            "name": "English (United States)",
            "displayName": "English (United States)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-US"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_english_uk",
            "description": null,
            "helpText": null,
            "name": "English (United Kingdom)",
            "displayName": "English (United Kingdom)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "en-GB"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_estonian",
            "description": null,
            "helpText": null,
            "name": "Estonian",
            "displayName": "Estonian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "et-EE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_finnish",
            "description": null,
            "helpText": null,
            "name": "Finnish",
            "displayName": "Finnish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fi-FI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_french",
            "description": null,
            "helpText": null,
            "name": "French",
            "displayName": "French",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-FR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_french_canada",
            "description": null,
            "helpText": null,
            "name": "French (Canada)",
            "displayName": "French (Canada)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "fr-CA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_german",
            "description": null,
            "helpText": null,
            "name": "German",
            "displayName": "German",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "de-DE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_greek",
            "description": null,
            "helpText": null,
            "name": "Greek",
            "displayName": "Greek",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "el-GR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_hebrew",
            "description": null,
            "helpText": null,
            "name": "Hebrew",
            "displayName": "Hebrew",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "he-IL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_hungarian",
            "description": null,
            "helpText": null,
            "name": "Hungarian",
            "displayName": "Hungarian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "hu-HU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_italian",
            "description": null,
            "helpText": null,
            "name": "Italian",
            "displayName": "Italian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "it-IT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_japanese",
            "description": null,
            "helpText": null,
            "name": "Japanese",
            "displayName": "Japanese",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ja-JP"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_korean",
            "description": null,
            "helpText": null,
            "name": "Korean",
            "displayName": "Korean",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ko-KR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_latvian",
            "description": null,
            "helpText": null,
            "name": "Latvian",
            "displayName": "Latvian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lv-LV"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_lithuanian",
            "description": null,
            "helpText": null,
            "name": "Lithuanian",
            "displayName": "Lithuanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "lt-LT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_norwegian",
            "description": null,
            "helpText": null,
            "name": "Norwegian",
            "displayName": "Norwegian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "nb-NO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_polish",
            "description": null,
            "helpText": null,
            "name": "Polish",
            "displayName": "Polish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pl-PL"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_portuguese",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Portugal)",
            "displayName": "Portuguese  (Portugal)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-PT"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_portuguesebrazil",
            "description": null,
            "helpText": null,
            "name": "Portuguese (Brazil)",
            "displayName": "Portuguese(Brazil)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "pt-BR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_romanian",
            "description": null,
            "helpText": null,
            "name": "Romanian",
            "displayName": "Romanian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ro-RO"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_russian",
            "description": null,
            "helpText": null,
            "name": "Russian",
            "displayName": "Russian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ro-RU"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_serbian_latin ",
            "description": null,
            "helpText": null,
            "name": "Serbian Latin",
            "displayName": "Serbian Latin",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sr-Latn-RS"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_slovak",
            "description": null,
            "helpText": null,
            "name": "Slovak",
            "displayName": "Slovak",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sk-SK"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_slovenian",
            "description": null,
            "helpText": null,
            "name": "Slovenian",
            "displayName": "Slovenian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sl-SI"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_spanish",
            "description": null,
            "helpText": null,
            "name": "Spanish",
            "displayName": "Spanish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-ES"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_spanishmexico",
            "description": null,
            "helpText": null,
            "name": "Spanish (Mexico)",
            "displayName": "Spanish (Mexico)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "es-MX"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_swedish",
            "description": null,
            "helpText": null,
            "name": "Swedish",
            "displayName": "Swedish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "sv-SE"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_thai",
            "description": null,
            "helpText": null,
            "name": "Thai",
            "displayName": "Thai",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "th-TH"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_turkish",
            "description": null,
            "helpText": null,
            "name": "Turkish",
            "displayName": "Turkish",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "tr-TR"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "osrecoverysettings_baselanguage_ukrainian",
            "description": null,
            "helpText": null,
            "name": "Ukrainian",
            "displayName": "Ukrainian",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "uk-UA"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}