{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Settings",
        "Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "MaximumInactivityInMinutes",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "passcode_maximuminactivityinminutes",
    "description": "Specifies the maximum period that a user can select, during which the device can be idle before it is automatically locked by the system. Once this limit is reached, the device is locked and the passcode must be entered. In the absence of this key, the user can select any period.\nIn macOS, this will be translated to screensaver settings.",
    "helpText": null,
    "name": "MaximumInactivityInMinutes",
    "displayName": "Automatic Device Lock",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 15,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "passcode_passcode",
            "parentSettingId": "passcode_passcode"
        }
    ],
    "dependedOnBy": []
}