{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode",
        "Declarative Device Management (DDM)\\Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RequireAlphanumericPasscode",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "passcode_requirealphanumericpasscode",
    "description": "If 'true', the passcode needs to consist of at least one alphabetic character and at least one number.",
    "helpText": null,
    "name": "RequireAlphanumericPasscode",
    "displayName": "Require Alphanumeric Passcode",
    "defaultOptionId": "passcode_requirealphanumericpasscode_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "passcode_requirealphanumericpasscode_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "passcode_requirealphanumericpasscode_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}