{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode",
        "Declarative Device Management (DDM)\\Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CustomRegex/Description",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "contextPane",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "passcode_customregex_description",
    "description": "A dictionary with supported OS language IDs for the keys (such as `en-US`), and values that represent a localized description of the policy that the regular expression enforces. Use the special `default` key for languages that the dictionary doesn't contain.",
    "helpText": null,
    "name": "CustomRegex_Description",
    "displayName": "Description",
    "childIds": [
        "passcode_customregex_description_generickey",
        "passcode_customregex_description_generickey_keytobereplaced"
    ],
    "maximumCount": 2147483647,
    "minimumCount": 1,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "passcode_customregex",
            "parentSettingId": "passcode_customregex"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "passcode_customregex_description_generickey",
            "required": false
        },
        {
            "dependedOnBy": "passcode_customregex_description_generickey_keytobereplaced",
            "required": true
        }
    ]
}