{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Settings",
        "Passcode",
        "Declarative Device Management (DDM)\\Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RequireComplexPasscode",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "passcode_requirecomplexpasscode",
    "description": "If set to true, a complex passcode is required. A complex passcode is one that does not contain repeated characters, or increasing/decreasing characters (such as 123 or CBA), but must contain at least one non-number/non-letter character.",
    "helpText": null,
    "name": "RequireComplexPasscode",
    "displayName": "Require Complex Passcode",
    "defaultOptionId": "passcode_requirecomplexpasscode_false",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "passcode_requirecomplexpasscode_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "passcode_requirecomplexpasscode_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "passcode_passcode",
                    "parentSettingId": "passcode_passcode"
                }
            ],
            "dependedOnBy": []
        }
    ]
}