{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Passcode",
        "Declarative Device Management (DDM)\\Passcode"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "CustomRegex/Description/{0}",
    "rootDefinitionId": "passcode_passcode",
    "categoryId": "2cdd4a96-23c1-4419-b88c-41bbaa119e68",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "passcode_customregex_description_generickey",
    "description": "A localized description.",
    "helpText": null,
    "name": "CustomRegex_Description_genericKey",
    "displayName": "ANY",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "passcode_customregex_description",
            "parentSettingId": "passcode_customregex_description"
        }
    ],
    "dependedOnBy": []
}