{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_UpdateBranch",
        "Update Channel",
        "\\Microsoft Office 2016 (Machine)\\Updates",
        "Microsoft Office 2016 (Machine)\\Updates",
        "Updates"
    ],
    "infoUrls": [],
    "baseUri": "./Device/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2.Updates~Policy~L_MicrosoftOfficemachine~L_Updates/L_UpdateBranch",
    "rootDefinitionId": "pdates~policy~l_microsoftofficemachine~l_updates_l_updatebranch",
    "categoryId": "86dae9f9-7eb1-4566-8558-b63fa2e20fee",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "pdates~policy~l_microsoftofficemachine~l_updates_l_updatebranch",
    "description": "This policy setting controls which update channel Office gets updates from.\r\n\r\nIf you enable this policy setting, Office gets updates from the update channel that you select.\r\n\r\nIf you disable or don't configure this policy setting, Office gets updates from its default channel, or by the update channel specified by the Office Deployment Tool. The default channel is determined by which Office product that is installed.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise, and to subscription versions of Project and Visio.​",
    "helpText": "",
    "name": "L_UpdateBranch",
    "displayName": "Update Channel",
    "defaultOptionId": "pdates~policy~l_microsoftofficemachine~l_updates_l_updatebranch_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "pdates~policy~l_microsoftofficemachine~l_updates_l_updatebranch_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "pdates~policy~l_microsoftofficemachine~l_updates_l_updatebranch_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "pdates~policy~l_microsoftofficemachine~l_updates_l_updatebranch_l_updatebranchid",
                    "required": true
                }
            ]
        }
    ]
}