{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Safari Browser"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "NewTabStartPage",
    "rootDefinitionId": "safari_safari",
    "categoryId": "e0ab6868-4b53-4310-b665-f7c979941db7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "safari_newtabstartpage",
    "description": "Sets the start page for new tabs in Safari.",
    "helpText": null,
    "name": "NewTabStartPage",
    "displayName": "New Tab Start Page",
    "childIds": [
        "safari_newtabstartpage_pagetype",
        "safari_newtabstartpage_homepageurl",
        "safari_newtabstartpage_extensionidentifier"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "safari_safari",
            "parentSettingId": "safari_safari"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "safari_newtabstartpage_pagetype",
            "required": true
        },
        {
            "dependedOnBy": "safari_newtabstartpage_homepageurl",
            "required": false
        },
        {
            "dependedOnBy": "safari_newtabstartpage_extensionidentifier",
            "required": false
        }
    ]
}