{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Safari Browser"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "com.apple.configuration.safari.settings",
    "rootDefinitionId": "safari_safari",
    "categoryId": "e0ab6868-4b53-4310-b665-f7c979941db7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "safari_safari",
    "description": "Synthetic Top Level Setting Group Collection",
    "helpText": null,
    "name": "com.apple.configuration.safari.settings",
    "displayName": "com.apple.configuration.safari.settings",
    "childIds": [
        "safari_acceptcookies",
        "safari_allowdisablingfraudwarning",
        "safari_allowhistoryclearing",
        "safari_allowjavascript",
        "safari_allowprivatebrowsing",
        "safari_allowpopups",
        "safari_allowsummary",
        "safari_newtabstartpage"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "safari_acceptcookies",
            "required": false
        },
        {
            "dependedOnBy": "safari_allowdisablingfraudwarning",
            "required": false
        },
        {
            "dependedOnBy": "safari_allowhistoryclearing",
            "required": false
        },
        {
            "dependedOnBy": "safari_allowjavascript",
            "required": false
        },
        {
            "dependedOnBy": "safari_allowprivatebrowsing",
            "required": false
        },
        {
            "dependedOnBy": "safari_allowpopups",
            "required": false
        },
        {
            "dependedOnBy": "safari_allowsummary",
            "required": false
        },
        {
            "dependedOnBy": "safari_newtabstartpage",
            "required": false
        }
    ]
}