{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Safari Browser"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "NewTabStartPage/ExtensionIdentifier",
    "rootDefinitionId": "safari_safari",
    "categoryId": "e0ab6868-4b53-4310-b665-f7c979941db7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "safari_newtabstartpage_extensionidentifier",
    "description": "The composed identifier of the extension that provides the start page. The required format is \"Identifier (TeamIdentifier)\", for example \"com.example.app (ABCD1234)\". Required when setting `PageType` to `Extension`.",
    "helpText": null,
    "name": "NewTabStartPage_ExtensionIdentifier",
    "displayName": "Extension Identifier",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "safari_newtabstartpage",
            "parentSettingId": "safari_newtabstartpage"
        }
    ],
    "dependedOnBy": []
}