{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Diagnostic Submission"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/DiagnosticSubmission",
    "rootDefinitionId": "settings_item_diagnosticsubmission",
    "categoryId": "99d68d97-63b7-4f49-83dd-1ad3b3281d0d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_diagnosticsubmission",
    "description": "A dictionary that contains diagnostic submission settings. This setting doesn't support User Enrollment, and is only available for Shared iPad. Available in iOS 9.3 and later.",
    "helpText": null,
    "name": "Settings_item_DiagnosticSubmission",
    "displayName": "Diagnostic Submission",
    "childIds": [
        "settings_item_diagnosticsubmission_enabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_diagnosticsubmission_enabled",
            "required": true
        }
    ]
}