{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Wallpaper"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/Wallpaper/Image",
    "rootDefinitionId": "settings_item_wallpaper",
    "categoryId": "ef7328b1-c666-40fe-a933-57b14bc77dd3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_wallpaper_image",
    "description": "A Base64-encoded image in either PNG or JPG format to use for wallpaper.",
    "helpText": null,
    "name": "Settings_item_Wallpaper_Image",
    "displayName": "Image",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [
        {
            "settingDefinitionId": "settings_item_wallpaper_image_referred_setting"
        }
    ],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "base64",
        "inputValidationSchema": null,
        "maximumLength": 2147483647,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": [
            "png",
            "jpg"
        ]
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "settings_item_wallpaper",
            "parentSettingId": "settings_item_wallpaper"
        }
    ],
    "dependedOnBy": []
}