{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Accessibility Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/AccessibilitySettings/ReduceMotionEnabled",
    "rootDefinitionId": "settings_item_accessibilitysettings",
    "categoryId": "e7dccaa6-2b16-4dd3-b835-83ca641d0c80",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_accessibilitysettings_reducemotionenabled",
    "description": "If 'true', enables reduced motion.",
    "helpText": null,
    "name": "Settings_item_AccessibilitySettings_ReduceMotionEnabled",
    "displayName": "Reduce Motion Enabled",
    "defaultOptionId": "settings_item_accessibilitysettings_reducemotionenabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_accessibilitysettings_reducemotionenabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_accessibilitysettings_reducemotionenabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_accessibilitysettings",
                    "parentSettingId": "settings_item_accessibilitysettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}