{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Analytics"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/AppAnalytics",
    "rootDefinitionId": "settings_item_appanalytics",
    "categoryId": "5f71c40e-01aa-42d2-9c8c-7d560126cd4b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_appanalytics",
    "description": "A dictionary that contains settings for sharing app analytics. This setting doesn't support User Enrollment, and is only available for Shared iPad. Available in iOS 9.3.2 and later.",
    "helpText": null,
    "name": "Settings_item_AppAnalytics",
    "displayName": "App Analytics",
    "childIds": [
        "settings_item_appanalytics_enabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_appanalytics_enabled",
            "required": true
        }
    ]
}