{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Personal Hotspot"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/PersonalHotspot",
    "rootDefinitionId": "settings_item_personalhotspot",
    "categoryId": "1a056b49-3fb9-4097-b286-c5f493208578",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_personalhotspot",
    "description": "A dictionary that contains Personal Hotspot settings. This setting requires the Network Information access right, and doesn't support user enrollment. Available in iOS 5 and later.",
    "helpText": null,
    "name": "Settings_item_PersonalHotspot",
    "displayName": "Personal Hotspot",
    "childIds": [
        "settings_item_personalhotspot_enabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_personalhotspot_enabled",
            "required": true
        }
    ]
}