{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Data Roaming"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/DataRoaming/Enabled",
    "rootDefinitionId": "settings_item_dataroaming",
    "categoryId": "0be23ead-c5f7-4ea5-9ec5-64c05d19cf5d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_dataroaming_enabled",
    "description": "If `true`, enable data roaming, which also enables voice roaming. If `false`, disable data roaming.",
    "helpText": null,
    "name": "Settings_item_DataRoaming_Enabled",
    "displayName": "Enabled",
    "defaultOptionId": "settings_item_dataroaming_enabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_dataroaming_enabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_dataroaming",
                    "parentSettingId": "settings_item_dataroaming"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_dataroaming_enabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_dataroaming",
                    "parentSettingId": "settings_item_dataroaming"
                }
            ],
            "dependedOnBy": []
        }
    ]
}