{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Default Applications"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/DefaultApplications/Calling",
    "rootDefinitionId": "settings_item_defaultapplications",
    "categoryId": "b32726b3-b0e9-465b-86f8-b61ad8af52f0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_defaultapplications_calling",
    "description": "The bundle identifier of the app that the system sets as the default calling app. This app must be an eligible calling app.",
    "helpText": null,
    "name": "Settings_item_DefaultApplications_Calling",
    "displayName": "Calling",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1032,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": ""
    },
    "dependentOn": [
        {
            "dependentOn": "settings_item_defaultapplications",
            "parentSettingId": "settings_item_defaultapplications"
        }
    ],
    "dependedOnBy": []
}