{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "App Analytics"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/AppAnalytics/Enabled",
    "rootDefinitionId": "settings_item_appanalytics",
    "categoryId": "5f71c40e-01aa-42d2-9c8c-7d560126cd4b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_appanalytics_enabled",
    "description": "If `true`, enable sharing app analytics with app developers. If `false`, disable sharing app analytics.",
    "helpText": null,
    "name": "Settings_item_AppAnalytics_Enabled",
    "displayName": "Enabled",
    "defaultOptionId": "settings_item_appanalytics_enabled_false",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_appanalytics_enabled_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_appanalytics",
                    "parentSettingId": "settings_item_appanalytics"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_appanalytics_enabled_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_appanalytics",
                    "parentSettingId": "settings_item_appanalytics"
                }
            ],
            "dependedOnBy": []
        }
    ]
}