{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Time Zone"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/TimeZone",
    "rootDefinitionId": "settings_item_timezone",
    "categoryId": "2c156b7e-99c8-4a21-a828-4f9b94479b0d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_timezone",
    "description": "A dictionary that contains time zone settings. This setting is available only on supervised devices and doesn't support user enrollment. Available in iOS 14 and later, tvOS 14 and later, and visionOS 2 and later.",
    "helpText": null,
    "name": "Settings_item_TimeZone",
    "displayName": "Time Zone",
    "childIds": [
        "settings_item_timezone_timezone"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_timezone_timezone",
            "required": true
        }
    ]
}