{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/SoftwareUpdateSettings",
    "rootDefinitionId": "settings_item_softwareupdatesettings",
    "categoryId": "724d930a-7a3c-4171-a17c-431cee336518",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_softwareupdatesettings",
    "description": "A dictionary that contains software update settings. This setting doesn't support user enrollment. Available in iOS 14.5 and later.",
    "helpText": null,
    "name": "Settings_item_SoftwareUpdateSettings",
    "displayName": "Software Update Settings (Deprecated)",
    "childIds": [
        "settings_item_softwareupdatesettings_recommendationcadence"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_softwareupdatesettings_recommendationcadence",
            "required": true
        }
    ]
}