{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "MDM Options"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/MDMOptions",
    "rootDefinitionId": "settings_item_mdmoptions",
    "categoryId": "dd68a290-1ba7-470f-afca-339f443a767c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_mdmoptions",
    "description": "A dictionary that contains settings related to the MDM protocol. This setting doesn't support User Enrollment, and is available in iOS 7 and later, and macOS 10.15 and later.",
    "helpText": null,
    "name": "Settings_item_MDMOptions",
    "displayName": "MDM Options",
    "childIds": [
        "settings_item_mdmoptions_mdmoptions"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_mdmoptions_mdmoptions",
            "required": true
        }
    ]
}