{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/SoftwareUpdateSettings/RecommendationCadence",
    "rootDefinitionId": "settings_item_softwareupdatesettings",
    "categoryId": "724d930a-7a3c-4171-a17c-431cee336518",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_softwareupdatesettings_recommendationcadence",
    "description": "This value defines how the system presents software updates to the user. When there's more than one available update for the user, the system behaves as follows:\n* '0': Presents both options to the user.\n* '1': Presents the lower numbered (oldest) software update version.\n* '2': Presents only the highest numbered (most recent) release available for the device.\nThis value has no effect when there's only one available update; the system shows the single available update to the user regardless of the value of this setting.\nAvailable in iOS 14.5 and later.",
    "helpText": null,
    "name": "Settings_item_SoftwareUpdateSettings_RecommendationCadence",
    "displayName": "Recommendation Cadence",
    "defaultOptionId": "settings_item_softwareupdatesettings_recommendationcadence_0",
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_softwareupdatesettings_recommendationcadence_0",
            "description": null,
            "helpText": null,
            "name": "0",
            "displayName": "Presents both options to the user.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_softwareupdatesettings",
                    "parentSettingId": "settings_item_softwareupdatesettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_softwareupdatesettings_recommendationcadence_1",
            "description": null,
            "helpText": null,
            "name": "1",
            "displayName": "Presents the lower numbered (oldest) software update version.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_softwareupdatesettings",
                    "parentSettingId": "settings_item_softwareupdatesettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_softwareupdatesettings_recommendationcadence_2",
            "description": null,
            "helpText": null,
            "name": "2",
            "displayName": "Presents only the highest numbered (most recent) release available for the device.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_softwareupdatesettings",
                    "parentSettingId": "settings_item_softwareupdatesettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}