{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "MDM Options"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/MDMOptions/MDMOptions",
    "rootDefinitionId": "settings_item_mdmoptions",
    "categoryId": "dd68a290-1ba7-470f-afca-339f443a767c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_mdmoptions_mdmoptions",
    "description": "A dictionary of MDM options.",
    "helpText": null,
    "name": "Settings_item_MDMOptions_MDMOptions",
    "displayName": "MDM Options",
    "childIds": [
        "settings_item_mdmoptions_mdmoptions_activationlockallowedwhilesupervised",
        "settings_item_mdmoptions_mdmoptions_bootstraptokenallowed",
        "settings_item_mdmoptions_mdmoptions_promptusertoallowbootstraptokenforauthentication"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "settings_item_mdmoptions",
            "parentSettingId": "settings_item_mdmoptions"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_mdmoptions_mdmoptions_activationlockallowedwhilesupervised",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_mdmoptions_mdmoptions_bootstraptokenallowed",
            "required": false
        },
        {
            "dependedOnBy": "settings_item_mdmoptions_mdmoptions_promptusertoallowbootstraptokenforauthentication",
            "required": false
        }
    ]
}