{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MDM Options"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/MDMOptions/MDMOptions/PromptUserToAllowBootstrapTokenForAuthentication",
    "rootDefinitionId": "settings_item_mdmoptions",
    "categoryId": "dd68a290-1ba7-470f-afca-339f443a767c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "settings_item_mdmoptions_mdmoptions_promptusertoallowbootstraptokenforauthentication",
    "description": "If 'true', warn the user that they need to reboot into RecoveryOS and allow the MDM server to use the Bootstrap Token for authentication for certain sensitive operations; for example, enabling kernel extensions or installing certain types of software updates. Set this value to 'false' if your MDM server doesn't need to perform these operations. The value provided here overrides the value specified in MDM, and only applies when 'BootstrapTokenAllowedForAuthentication' is 'true' in the SecurityInfoResponse.SecurityInfo response. This value is available for Apple silicon in macOS 11 and later.",
    "helpText": null,
    "name": "Settings_item_MDMOptions_MDMOptions_PromptUserToAllowBootstrapTokenForAuthentication",
    "displayName": "Prompt User To Allow Bootstrap Token For Authentication",
    "defaultOptionId": "settings_item_mdmoptions_mdmoptions_promptusertoallowbootstraptokenforauthentication_false",
    "applicability": {
        "description": null,
        "platform": "macOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "settings_item_mdmoptions_mdmoptions_promptusertoallowbootstraptokenforauthentication_false",
            "description": null,
            "helpText": null,
            "name": "Blocked",
            "displayName": "Blocked",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_mdmoptions_mdmoptions",
                    "parentSettingId": "settings_item_mdmoptions_mdmoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "settings_item_mdmoptions_mdmoptions_promptusertoallowbootstraptokenforauthentication_true",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "settings_item_mdmoptions_mdmoptions",
                    "parentSettingId": "settings_item_mdmoptions_mdmoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}