{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Data Roaming"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/DataRoaming",
    "rootDefinitionId": "settings_item_dataroaming",
    "categoryId": "0be23ead-c5f7-4ea5-9ec5-64c05d19cf5d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_dataroaming",
    "description": "A dictionary that contains data roaming settings. This setting requires the Network Information access right, and doesn't support user enrollment. Available in iOS 5 and later.",
    "helpText": null,
    "name": "Settings_item_DataRoaming",
    "displayName": "Data Roaming",
    "childIds": [
        "settings_item_dataroaming_enabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_dataroaming_enabled",
            "required": true
        }
    ]
}