{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Voice Roaming"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Settings/[{0}]/VoiceRoaming",
    "rootDefinitionId": "settings_item_voiceroaming",
    "categoryId": "1fbc29d7-0530-4208-b506-9df648a402e9",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "settings_item_voiceroaming",
    "description": "A dictionary that contains voice roaming settings. This setting requires the Network Information access right, and doesn't support user enrollment. Available in iOS 5 and later.",
    "helpText": null,
    "name": "Settings_item_VoiceRoaming",
    "displayName": "Voice Roaming",
    "childIds": [
        "settings_item_voiceroaming_enabled"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS",
        "deviceMode": "none",
        "technologies": "mdm,appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "settings_item_voiceroaming_enabled",
            "required": true
        }
    ]
}