{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutomaticActions",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_automaticactions",
    "description": "Specifies various automatic Software Update functionality. Only applicable on Supervised devices with iOS 18+ and MacOS 15+",
    "helpText": null,
    "name": "AutomaticActions",
    "displayName": "Automatic Actions",
    "childIds": [
        "softwareupdate_automaticactions_download",
        "softwareupdate_automaticactions_installosupdates",
        "softwareupdate_automaticactions_installsecurityupdate"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "softwareupdate_softwareupdate",
            "parentSettingId": "softwareupdate_softwareupdate"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "softwareupdate_automaticactions_download",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_automaticactions_installosupdates",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_automaticactions_installsecurityupdate",
            "required": false
        }
    ]
}