{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Beta/ProgramEnrollment",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "softwareupdate_beta_programenrollment",
    "description": "Specifies whether beta program enrollment can be controlled by the user in software update settings UI:\n* \"Allowed\" - the user can enroll in any applicable beta programs associated with their\n  logged in Apple ID. If the `OfferPrograms` key is present, then the programs listed in\n  that key are also presented to the user.\n* \"AlwaysOn\" - the beta programs specified by the organization are used, and the user\n  is not be able to enroll in a beta program using their logged in Apple ID. The device\n  is automatically enrolled into the beta program specified by the `RequireProgram` key if\n  it is present. Otherwise, the programs listed in the `OfferPrograms` key are\n  presented to the user to choose which to enroll with.\n* \"AlwaysOff\" - The device is not allowed to enroll in any beta programs. The device is\n  removed from any beta programs, if already enrolled.",
    "helpText": null,
    "name": "Beta_ProgramEnrollment",
    "displayName": "Program Enrollment (Unsupported)",
    "defaultOptionId": "softwareupdate_beta_programenrollment_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "softwareupdate_beta_programenrollment_0",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Allowed"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_beta",
                    "parentSettingId": "softwareupdate_beta"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_beta_programenrollment_1",
            "description": null,
            "helpText": null,
            "name": "AlwaysOn",
            "displayName": "AlwaysOn",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AlwaysOn"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_beta",
                    "parentSettingId": "softwareupdate_beta"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_beta_programenrollment_2",
            "description": null,
            "helpText": null,
            "name": "AlwaysOff",
            "displayName": "AlwaysOff",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AlwaysOff"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_beta",
                    "parentSettingId": "softwareupdate_beta"
                }
            ],
            "dependedOnBy": []
        }
    ]
}