{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "RapidSecurityResponse/Enable",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "softwareupdate_rapidsecurityresponse_enable",
    "description": "If set to 'false', Background Security Improvements aren't offered for user installation. The system can still install Background Security Improvements with Software Update and Enforce Latest configurations. If set to 'true', the system offers Background Security Improvements to the user.",
    "helpText": null,
    "name": "RapidSecurityResponse_Enable",
    "displayName": "Enable",
    "defaultOptionId": "softwareupdate_rapidsecurityresponse_enable_true",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "softwareupdate_rapidsecurityresponse_enable_false",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_rapidsecurityresponse",
                    "parentSettingId": "softwareupdate_rapidsecurityresponse"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_rapidsecurityresponse_enable_true",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_rapidsecurityresponse",
                    "parentSettingId": "softwareupdate_rapidsecurityresponse"
                }
            ],
            "dependedOnBy": []
        }
    ]
}