{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "Deferrals",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "softwareupdate_deferrals",
    "description": "Controls the deferral of software updates. Rapid Security Responses are not considered within 'Major', 'Minor', or 'System' deferral mechanism. Only applicable on Supervised devices with iOS 18+ and MacOS 15++",
    "helpText": null,
    "name": "Deferrals",
    "displayName": "Deferrals",
    "childIds": [
        "softwareupdate_deferrals_combinedperiodindays",
        "softwareupdate_deferrals_majorperiodindays",
        "softwareupdate_deferrals_minorperiodindays",
        "softwareupdate_deferrals_systemperiodindays"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "softwareupdate_softwareupdate",
            "parentSettingId": "softwareupdate_softwareupdate"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "softwareupdate_deferrals_combinedperiodindays",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_deferrals_majorperiodindays",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_deferrals_minorperiodindays",
            "required": false
        },
        {
            "dependedOnBy": "softwareupdate_deferrals_systemperiodindays",
            "required": false
        }
    ]
}