{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Software Update Settings"
    ],
    "infoUrls": [],
    "occurrence": null,
    "baseUri": "",
    "offsetUri": "AutomaticActions/InstallSecurityUpdate",
    "rootDefinitionId": "softwareupdate_softwareupdate",
    "categoryId": "b382d980-7459-4850-a45e-75dd99488972",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "softwareupdate_automaticactions_installsecurityupdate",
    "description": "Specifies whether automatic install of available security updates can be controlled by the user:\n* \"Allowed\" - the user can enable or disable automatic installs.\n* \"AlwaysOn\" - automatic installs are always enabled.\n* \"AlwaysOff\" - automatic installs are always disabled.",
    "helpText": null,
    "name": "AutomaticActions_InstallSecurityUpdate",
    "displayName": "Install Security Update",
    "defaultOptionId": "softwareupdate_automaticactions_installsecurityupdate_0",
    "applicability": {
        "description": null,
        "platform": "iOS,macOS",
        "deviceMode": "none",
        "technologies": "appleRemoteManagement"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "softwareupdate_automaticactions_installsecurityupdate_0",
            "description": null,
            "helpText": null,
            "name": "Allowed",
            "displayName": "Allowed",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Allowed"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_automaticactions",
                    "parentSettingId": "softwareupdate_automaticactions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_automaticactions_installsecurityupdate_1",
            "description": null,
            "helpText": null,
            "name": "AlwaysOn",
            "displayName": "AlwaysOn",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AlwaysOn"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_automaticactions",
                    "parentSettingId": "softwareupdate_automaticactions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "softwareupdate_automaticactions_installsecurityupdate_2",
            "description": null,
            "helpText": null,
            "name": "AlwaysOff",
            "displayName": "AlwaysOff",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "AlwaysOff"
            },
            "dependentOn": [
                {
                    "dependentOn": "softwareupdate_automaticactions",
                    "parentSettingId": "softwareupdate_automaticactions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}