{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_EnableAdminProhibits",
        "Enable Windows 2000 Network Connections settings for Administrators",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-networkconnections#admx-networkconnections-nc-enableadminprohibits"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_EnableAdminProhibits",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_enableadminprohibits",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_networkconnections_nc_enableadminprohibits",
    "description": "Determines whether settings that existed in Windows 2000 Server family will apply to Administrators.\r\n\r\nThe set of Network Connections group settings that existed in Windows 2000 Professional also exists in Windows XP Professional. In Windows 2000 Professional, all of these settings had the ability to prohibit the use of certain features from Administrators.\r\n\r\nBy default, Network Connections group settings in Windows XP Professional do not have the ability to prohibit the use of features from Administrators.\r\n\r\nIf you enable this setting, the Windows XP settings that existed in Windows 2000 Professional will have the ability to prohibit Administrators from using certain features. These settings are \"Ability to rename LAN connections or remote access connections available to all users\", \"Prohibit access to properties of components of a LAN connection\", \"Prohibit access to properties of components of a remote access connection\", \"Ability to access TCP/IP advanced configuration\", \"Prohibit access to the Advanced Settings Item on the Advanced Menu\", \"Prohibit adding and removing components for a LAN or remote access connection\", \"Prohibit access to properties of a LAN connection\", \"Prohibit Enabling/Disabling components of a LAN connection\", \"Ability to change properties of an all user remote access connection\", \"Prohibit changing properties of a private remote access connection\", \"Prohibit deletion of remote access connections\", \"Ability to delete all user remote access connections\", \"Prohibit connecting and disconnecting a remote access connection\", \"Ability to Enable/Disable a LAN connection\", \"Prohibit access to the New Connection Wizard\", \"Prohibit renaming private remote access connections\", \"Prohibit access to the Remote Access Preferences item on the Advanced menu\", \"Prohibit viewing of status for an active connection\". When this setting is enabled, settings that exist in both Windows 2000 Professional and Windows XP Professional behave the same for administrators.\r\n\r\nIf you disable this setting or do not configure it, Windows XP settings that existed in Windows 2000 will not apply to administrators.\r\n\r\nNote: This setting is intended to be used in a situation in which the Group Policy object that these settings are being applied to contains both Windows 2000 Professional and Windows XP Professional computers, and identical Network Connections policy behavior is required between all Windows 2000 Professional and Windows XP Professional computers.\r\n ",
    "helpText": "",
    "name": "NC_EnableAdminProhibits",
    "displayName": "Enable Windows 2000 Network Connections settings for Administrators (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_enableadminprohibits_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_enableadminprohibits_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_enableadminprohibits_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}