{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CACertificatesWithConstraints",
        "TLS certificates that should be trusted by Google Chrome for server authentication with constraints",
        "\\Google\\Google Chrome\\Certificate management settings",
        "Google\\Google Chrome\\Certificate management settings",
        "Certificate management settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~CertificateManagement/CACertificatesWithConstraints",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~certificatemanagement_cacertificateswithconstraints",
    "categoryId": "1d6d392c-8b32-459b-b114-af964a4bbbc5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~certificatemanagement_cacertificateswithconstraints_cacertificateswithconstraints",
    "description": "",
    "helpText": "",
    "name": "CACertificatesWithConstraints",
    "displayName": "TLS certificates that should be trusted by Google Chrome for server authentication with constraints (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1000000,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~certificatemanagement_cacertificateswithconstraints_1",
            "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~certificatemanagement_cacertificateswithconstraints"
        }
    ],
    "dependedOnBy": []
}