{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_BlockXLLFromInternet",
        "Block Excel XLL Add-ins that come from an untrusted source",
        "\\Microsoft Excel 2016\\Excel Options\\Security\\Trust Center",
        "Microsoft Excel 2016\\Excel Options\\Security\\Trust Center",
        "Trust Center",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\excel\\security"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/excel16v8~Policy~L_MicrosoftOfficeExcel~L_ExcelOptions~L_Security~L_TrustCenter/L_BlockXLLFromInternet",
    "rootDefinitionId": "user_vendor_msft_policy_config_excel16v8~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockxllfrominternet",
    "categoryId": "7490c4fd-c326-42f7-9908-006504616d4c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_excel16v8~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockxllfrominternet",
    "description": "\r\n        This policy setting allows you to block Excel XLL Add-ins that come from an untrusted source.\r\n\r\n        If you enable this policy setting, you can set one of these options:\r\n        - Block: XLL add-ins from untrusted sources are blocked. Users will receive a notification that the add-in was blocked.\r\n        - Show Additional Warning: Show an additional warning prompt after the user chooses to enable an XLL add-in from an untrusted source.\r\n        - Allow: XLL add-ins from an untrusted source are allowed.\r\n\r\n        The exceptions when Excel XLL Add-ins will be allowed to run are:\r\n        - The XLL is stored in a Trusted Location.\r\n        - The XLL is digitally signed and the matching Trusted Publisher certificate is installed on the device.\r\n\r\n        If you disable this policy setting, the settings configured in the Macro and Add-in Settings sections of the Trust Center determine whether Excel XLL Add-ins that come from an untrusted source will be allowed.\r\n\r\n        If you disable or do not configure this policy setting, users will be able to override default behavior by modifying the registry.\r\n\r\n        For more information, see https://support.microsoft.com/topic/1e3752e2-1177-4444-a807-7b700266a6fb.\r\n      ",
    "helpText": "",
    "name": "L_BlockXLLFromInternet",
    "displayName": "Block Excel XLL Add-ins that come from an untrusted source (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_excel16v8~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockxllfrominternet_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_excel16v8~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockxllfrominternet_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_excel16v8~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockxllfrominternet_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_excel16v8~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockxllfrominternet_l_blockxllfrominternetenum",
                    "required": true
                }
            ]
        }
    ]
}