{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ApplicationGuardContainerProxy",
        "Application Guard Container Proxy",
        "\\Microsoft Edge\\Application Guard settings",
        "Microsoft Edge\\Application Guard settings",
        "Application Guard settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev84diff~Policy~microsoft_edge~ApplicationGuard/ApplicationGuardContainerProxy",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev84diff~policy~microsoft_edge~applicationguard_applicationguardcontainerproxy",
    "categoryId": "5bd0eaf1-1818-44e8-9168-fc75c5739cc8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev84diff~policy~microsoft_edge~applicationguard_applicationguardcontainerproxy",
    "description": "Configures the proxy settings for Microsoft Edge Application Guard.\r\nIf you enable this policy, Microsoft Edge Application Guard ignores other sources of proxy configurations.\r\n\r\nIf you don't configure this policy, Microsoft Edge Application Guard uses the proxy configuration of the host.\r\n\r\nThis policy does not affect the proxy configuration of Microsoft Edge outside of Application Guard (on the host).\r\n\r\nThe ProxyMode field lets you specify the proxy server used by Microsoft Edge Application Guard.\r\n\r\nThe ProxyPacUrl field is a URL to a proxy .pac file.\r\n\r\nThe ProxyServer field is a URL for the proxy server.\r\n\r\nIf you choose the 'direct' value as 'ProxyMode', all other fields are ignored.\r\n\r\nIf you choose the 'auto_detect' value as 'ProxyMode', all other fields are ignored.\r\n\r\nIf you choose the 'fixed_servers' value as 'ProxyMode', the 'ProxyServer' field is used.\r\n\r\nIf you choose the 'pac_script' value as 'ProxyMode', the 'ProxyPacUrl' field is used.\r\n\r\nExample value:\r\n\r\n{\r\n  \"ProxyMode\": \"direct\", \r\n  \"ProxyPacUrl\": \"https://internal.site/example.pac\", \r\n  \"ProxyServer\": \"123.123.123.123:8080\"\r\n}",
    "helpText": "",
    "name": "ApplicationGuardContainerProxy",
    "displayName": "Application Guard Container Proxy (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev84diff~policy~microsoft_edge~applicationguard_applicationguardcontainerproxy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev84diff~policy~microsoft_edge~applicationguard_applicationguardcontainerproxy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev84diff~policy~microsoft_edge~applicationguard_applicationguardcontainerproxy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev84diff~policy~microsoft_edge~applicationguard_applicationguardcontainerproxy_applicationguardcontainerproxy",
                    "required": true
                }
            ]
        }
    ]
}