{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Set Allowed Folder Locations",
        "File Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-FileExplorer#setallowedfolderlocations"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/FileExplorer/SetAllowedFolderLocations",
    "rootDefinitionId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations",
    "categoryId": "63b9904f-bbdf-4461-954a-c1d67fa8b357",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations",
    "description": "A value that can represent one or more folder locations in File Explorer. If not specified, the default is access to all folder locations.",
    "helpText": "",
    "name": "SetAllowedFolderLocations",
    "displayName": "Set Allowed Folder Locations (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations_0",
            "description": "Access to all folder locations.",
            "helpText": null,
            "name": "Access to all folder locations.",
            "displayName": "Access to all folder locations.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations_13",
            "description": "Documents, Pictures, Downloads",
            "helpText": null,
            "name": "Documents, Pictures, Downloads",
            "displayName": "Documents, Pictures, Downloads",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 13
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations_15",
            "description": "Desktop, Documents, Pictures, Downloads",
            "helpText": null,
            "name": "Desktop, Documents, Pictures, Downloads",
            "displayName": "Desktop, Documents, Pictures, Downloads",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 15
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations_31",
            "description": "Desktop, Documents, Pictures, Downloads, Network",
            "helpText": null,
            "name": "Desktop, Documents, Pictures, Downloads, Network",
            "displayName": "Desktop, Documents, Pictures, Downloads, Network",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 31
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations_47",
            "description": "This PC, Desktop, Documents, Pictures, Downloads",
            "helpText": null,
            "name": "This PC, Desktop, Documents, Pictures, Downloads",
            "displayName": "This PC, Desktop, Documents, Pictures, Downloads",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 47
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_fileexplorer_setallowedfolderlocations_63",
            "description": "This PC, Desktop, Documents, Pictures, Downloads, Network",
            "helpText": null,
            "name": "This PC, Desktop, Documents, Pictures, Downloads, Network",
            "displayName": "This PC, Desktop, Documents, Pictures, Downloads, Network",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 63
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}