{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SetMaximumNumberOfExchangeAccounts",
        "Set maximum number of Exchange accounts per profile",
        "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
        "Microsoft Outlook 2016\\Account Settings\\Exchange",
        "Exchange"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_ToolsAccounts~L_Exchangesettings/L_SetMaximumNumberOfExchangeAccounts",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_setmaximumnumberofexchangeaccounts",
    "categoryId": "c4dbc05f-da1e-440d-8beb-91bf9dad1875",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_setmaximumnumberofexchangeaccounts",
    "description": "This policy setting allows you to set the maximum number of Exchange accounts allowed per Outlook profile.\r\n\r\nIf you enable this policy setting, you will be able to set the maximum number of Exchange accounts allowed per Outlook profile.\r\n\r\nIf you disable or do not configure this policy setting, the default maximum number of Exchange accounts allowed per Outlook profile is 10.",
    "helpText": "",
    "name": "L_SetMaximumNumberOfExchangeAccounts",
    "displayName": "Set maximum number of Exchange accounts per profile (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_setmaximumnumberofexchangeaccounts_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_setmaximumnumberofexchangeaccounts_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_setmaximumnumberofexchangeaccounts_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_setmaximumnumberofexchangeaccounts_l_setmaximumnumberofexchangeaccountsspinid",
                    "required": true
                }
            ]
        }
    ]
}