{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DefaultBuiltInTab",
        "Default tab to show in Visio on the Office Start screen and in File | New",
        "\\Microsoft Visio 2016\\Miscellaneous",
        "Microsoft Visio 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/visio16v2~Policy~L_MicrosoftVisio~L_Miscellaneous/L_DefaultBuiltInTab",
    "rootDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_miscellaneous_l_defaultbuiltintab",
    "categoryId": "e6f727b7-f474-4010-b214-83149ffdac2b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_miscellaneous_l_defaultbuiltintab",
    "description": "This policy setting controls what displays as the default tab in Visio on the Office Start screen and in File | New. \r\n\r\nIf you enable this policy setting, you can choose one of two options to become the default tab on the Office Start screen and in File | New:\r\n\r\n* Built-in – Users will the see built-in templates tab as the default tab in Visio on the Office Start screen and in File | New.\r\n\r\n* Custom – Users will the see custom templates tab as the default tab in Visio on the Office Start screen and in File | New when templates exist (this can include Custom XML programmed templates, templates in the Workgroup templates path, templates in the Personal templates path, or SharePoint templates).\r\n\r\nIf you disable or do not configure this policy setting, users will see the Featured templates tab as the default tab in Visio on the Office Start screen and in File | New",
    "helpText": "",
    "name": "L_DefaultBuiltInTab",
    "displayName": "Default tab to show in Visio on the Office Start screen and in File | New (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_miscellaneous_l_defaultbuiltintab_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_miscellaneous_l_defaultbuiltintab_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_miscellaneous_l_defaultbuiltintab_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_miscellaneous_l_defaultbuiltintab_l_defaultbuiltintab",
                    "required": true
                }
            ]
        }
    ]
}