{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SafeBrowsingProxiedRealTimeChecksAllowed",
        "Allow Safe Browsing Proxied Real Time Checks",
        "\\Google\\Google Chrome\\Safe Browsing settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Safe Browsing settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~SafeBrowsing/SafeBrowsingProxiedRealTimeChecksAllowed",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~safebrowsing_safebrowsingproxiedrealtimechecksallowed",
    "categoryId": "b485695b-0fae-41ae-861c-3030769b28df",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~safebrowsing_safebrowsingproxiedrealtimechecksallowed",
    "description": "This controls whether Safe Browsing's standard protection mode is allowed to\r\nsend partial hashes of URLs to Google through a proxy via Oblivious HTTP\r\nin order to determine whether they are safe to visit.\r\n\r\nThe proxy allows browsers to upload partial hashes of URLs to Google\r\nwithout them being linked to the user's IP address. The policy also allows\r\nbrowsers to upload the partial hashes of URLs with higher frequency for\r\nbetter Safe Browsing protection quality.\r\n\r\nThis policy will be ignored if Safe Browsing is disabled or set to enhanced\r\nprotection mode.\r\n\r\nSetting the policy to Enabled or leaving it unset allows the\r\nhigher-protection proxied lookups.\r\n\r\nSetting the policy to Disabled disallows the higher-protection proxied\r\nlookups. Partial hashes of URLs will be uploaded to Google directly with much\r\nlower frequency, which will degrade protection.",
    "helpText": "",
    "name": "SafeBrowsingProxiedRealTimeChecksAllowed",
    "displayName": "Allow Safe Browsing Proxied Real Time Checks (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~safebrowsing_safebrowsingproxiedrealtimechecksallowed_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~safebrowsing_safebrowsingproxiedrealtimechecksallowed_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~safebrowsing_safebrowsingproxiedrealtimechecksallowed_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}