{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableSetTopology",
        "Do not allow PowerPoint to automatically extend the display when presenting on a laptop or tablet",
        "\\Microsoft PowerPoint 2016\\PowerPoint Options\\Advanced",
        "Microsoft PowerPoint 2016\\PowerPoint Options\\Advanced",
        "Advanced"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ppt16v2~Policy~L_MicrosoftOfficePowerPoint~L_PowerPointOptions~L_Advanced/L_DisableSetTopology",
    "rootDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_advanced_l_disablesettopology",
    "categoryId": "76b233cc-f977-4305-b02f-deef6667251d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_advanced_l_disablesettopology",
    "description": "This policy setting specifies whether PowerPoint automatically extends the display when users present on a laptop or tablet computer.\r\n\r\nIf you enable this policy setting, PowerPoint does not automatically extend the display when users present on a laptop or tablet computer. In addition, the \"Automatically extend display when presenting on a laptop or tablet\" checkbox on the user interface (UI) under File | Options | Advanced | Display  is unchecked.\r\n\r\nIf you disable or do not configure this policy setting, PowerPoint automatically extends the display when users present on a laptop or tablet computer. Users can change this behavior by unchecking the \"Automatically extend display when presenting on a laptop or tablet\" checkbox on the UI under File | Options | Advanced | Display",
    "helpText": "",
    "name": "L_DisableSetTopology",
    "displayName": "Do not allow PowerPoint to automatically extend the display when presenting on a laptop or tablet (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_advanced_l_disablesettopology_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_advanced_l_disablesettopology_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_advanced_l_disablesettopology_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}