{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_CompletelydisabletheSmartDocumentsfeatureinWordandExcel",
        "Completely disable the Smart Documents feature in Word and Excel",
        "\\Microsoft Office 2016\\Smart Documents (Word, Excel)",
        "Microsoft Office 2016\\Smart Documents (Word, Excel)",
        "Smart Documents (Word, Excel)"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_SmartDocumentsWordExcel/L_CompletelydisabletheSmartDocumentsfeatureinWordandExcel",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_smartdocumentswordexcel_l_completelydisablethesmartdocumentsfeatureinwordandexcel",
    "categoryId": "449201b6-5002-42d1-85ed-d288fb6552da",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_smartdocumentswordexcel_l_completelydisablethesmartdocumentsfeatureinwordandexcel",
    "description": "This policy setting allows you to configure the ability to run smart documents in Word or Excel. However, since XML expansion packs can include many types of solutions in addition to smart document solutions, this policy setting cannot be used to disable the ability to run XML expansion packs.\r\n\r\nIf you enable this policy setting, smart document solutions will not run.  To fully manage the Smart Documents feature, this policy and the \"Disable Smart Document's use of manifests\" policy should both be configured.\r\n\r\nIf you disable or do not configure this policy setting, smart document solutions will run.",
    "helpText": "",
    "name": "L_CompletelydisabletheSmartDocumentsfeatureinWordandExcel",
    "displayName": "Completely disable the Smart Documents feature in Word and Excel (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_smartdocumentswordexcel_l_completelydisablethesmartdocumentsfeatureinwordandexcel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_smartdocumentswordexcel_l_completelydisablethesmartdocumentsfeatureinwordandexcel_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_smartdocumentswordexcel_l_completelydisablethesmartdocumentsfeatureinwordandexcel_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}