{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrivacySandboxFingerprintingProtectionEnabled",
        "Choose whether the Privacy Sandbox Fingerprinting Protection feature is to be enabled in Incognito mode.",
        "\\Google\\Google Chrome\\Privacy Sandbox policies",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Privacy Sandbox policies"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~PrivacySandbox/PrivacySandboxFingerprintingProtectionEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxfingerprintingprotectionenabled",
    "categoryId": "d4ad9168-8c49-45d6-a7e5-86ba990fff3e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxfingerprintingprotectionenabled",
    "description": "A policy to control whether the Privacy Sandbox Fingerprinting Protection setting is to be enabled in Incognito mode or disabled for your users.\r\n\r\nIf you set this policy to Disabled, then the Fingerprinting Protection feature setting will be turned off for your users.\r\nIf you set this policy to Enabled, your users will have the Fingerprinting Protection feature setting turned on in Incognito mode.\r\nIf the policy is not set, users will be able to turn on or off the Fingerprinting Protection feature for Incognito mode in their UI settings. The default state will be false or disabled, meaning the Fingerprinting Protection feature will be turned off.",
    "helpText": "",
    "name": "PrivacySandboxFingerprintingProtectionEnabled",
    "displayName": "Choose whether the Privacy Sandbox Fingerprinting Protection feature is to be enabled in Incognito mode. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxfingerprintingprotectionenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxfingerprintingprotectionenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxfingerprintingprotectionenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}