{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_UseLegacyTranslationFeatures",
        "Use legacy translation features",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_UseLegacyTranslationFeatures",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_miscellaneous437_l_uselegacytranslationfeatures",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_miscellaneous437_l_uselegacytranslationfeatures",
    "description": "\r\nThis policy setting allows you to use legacy translation features in Office apps, such as Word, instead of the Translator feature, which uses the cloud-based Microsoft Translator service.\r\n\r\nLegacy translation features include the following:\r\n- Translation of the entire document, by using the browser-based Bilingual Viewer.\r\n- Translation of selected text, by using the Research pane.\r\n- Translation of an individual word when hovering over the word, by using the Mini Translator.\r\n\r\nYou may need to use legacy translation features in special cases that require extra configurability, such as when using customer translation providers.\r\n\r\nIf you enable this policy setting, translation commands, such as those on the ribbon or in shortcut menus, will use the legacy translation features instead of the Translator feature.\r\n\r\nIf you disable or don’t configure this policy setting, translation commands, such as those on the ribbon or in shortcut menus, will use the Translator feature instead of the legacy translation features.\r\n\r\nNote: This policy setting only applies to apps and subscription versions of Office, such as Office 365 ProPlus, that support the Translator feature.\r\n      ",
    "helpText": "",
    "name": "L_UseLegacyTranslationFeatures",
    "displayName": "Use legacy translation features (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_miscellaneous437_l_uselegacytranslationfeatures_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_miscellaneous437_l_uselegacytranslationfeatures_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_miscellaneous437_l_uselegacytranslationfeatures_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}