{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_WorkOfflineDisabled_1",
        "Remove \"Work offline\" command",
        "\\Network\\Offline Files",
        "Administrative Templates\\Network\\Offline Files",
        "Offline Files",
        "User",
        "Software\\Policies\\Microsoft\\Windows\\NetCache",
        "WorkOfflineDisabled"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-offlinefiles#admx-offlinefiles-pol-workofflinedisabled-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_OfflineFiles/Pol_WorkOfflineDisabled_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_workofflinedisabled_1",
    "categoryId": "82a9c23f-2c09-4479-9cd3-e7f185d7676f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_offlinefiles_pol_workofflinedisabled_1",
    "description": "This policy setting removes the \"Work offline\" command from Explorer, preventing users from manually changing whether Offline Files is in online mode or offline mode.\r\n\r\nIf you enable this policy setting, the \"Work offline\" command is not displayed in File Explorer.\r\n\r\nIf you disable or do not configure this policy setting, the \"Work offline\" command is displayed in File Explorer.\r\n      \r\n ",
    "helpText": "",
    "name": "Pol_WorkOfflineDisabled_1",
    "displayName": "Remove \"Work offline\" command (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_workofflinedisabled_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_workofflinedisabled_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_offlinefiles_pol_workofflinedisabled_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}