{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TaskbarNoNotification",
        "Turn off all balloon notifications",
        "\\Start Menu and Taskbar",
        "Administrative Templates\\Start Menu and Taskbar",
        "Start Menu and Taskbar"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-taskbar#admx-taskbar-taskbarnonotification"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Taskbar/TaskbarNoNotification",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_taskbar_taskbarnonotification",
    "categoryId": "5161db41-7947-49ea-b9b3-dd92539e6783",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_taskbar_taskbarnonotification",
    "description": "This policy setting allows you to turn off all notification balloons.\r\n\r\nIf you enable this policy setting, no notification balloons are shown to the user.\r\n\r\nIf you disable or do not configure this policy setting, notification balloons are shown to the user.\r\n ",
    "helpText": "",
    "name": "TaskbarNoNotification",
    "displayName": "Turn off all balloon notifications (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_taskbar_taskbarnonotification_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_taskbar_taskbarnonotification_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_taskbar_taskbarnonotification_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}