{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffSavingAutoTuningDataToFile",
        "Turn off saving auto-tuning data to file",
        "\\Windows Components\\IME",
        "Administrative Templates\\Windows Components\\IME",
        "IME"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eaime#admx-eaime-l-turnoffsavingautotuningdatatofile"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EAIME/L_TurnOffSavingAutoTuningDataToFile",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffsavingautotuningdatatofile",
    "categoryId": "ba1d333c-e19b-4470-bbab-d040a633c3a3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_eaime_l_turnoffsavingautotuningdatatofile",
    "description": "This policy setting allows you to turn off saving the auto-tuning result to file.\r\n\r\nIf you enable this policy setting, the auto-tuning data is not saved to file.\r\n\r\nIf you disable or do not configure this policy setting, auto-tuning data is saved to file by default.\r\n\r\nThis policy setting applies to Japanese Microsoft IME only.\r\n ",
    "helpText": "",
    "name": "L_TurnOffSavingAutoTuningDataToFile",
    "displayName": "Turn off saving auto-tuning data to file (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffsavingautotuningdatatofile_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffsavingautotuningdatatofile_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffsavingautotuningdatatofile_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}