{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_NewOutlookAutomaticSetupUserSetting",
        "Manage automatic setup of classic Outlook accounts in new Outlook",
        "\\Microsoft Outlook 2016\\Outlook Options\\Other",
        "Microsoft Outlook 2016\\Outlook Options\\Other",
        "Other"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v17~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Other/L_NewOutlookAutomaticSetupUserSetting",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v17~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomaticsetupusersetting",
    "categoryId": "5e3f61b6-52b7-4c74-a101-33c1cf34a749",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v17~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomaticsetupusersetting",
    "description": "\r\nThis policy setting allows you to manage whether classic Outlook automatically sets up user accounts and settings in new Outlook.\r\n\r\nIf you enable this policy setting, automatic setup of user accounts and settings in new Outlook is allowed and cannot be changed by the user.\r\n\r\nIf you disable this policy setting, automatic setup of user accounts and settings in new Outlook is not allowed and cannot be changed by the user.\r\n\r\nIf you don't configure this policy setting, users can manage the setting themselves. Automatic setup is enabled by default.\r\n      ",
    "helpText": "",
    "name": "L_NewOutlookAutomaticSetupUserSetting",
    "displayName": "Manage automatic setup of classic Outlook accounts in new Outlook (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v17~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomaticsetupusersetting_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v17~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomaticsetupusersetting_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v17~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomaticsetupusersetting_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}