{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LiveCaptionEnabled_recommended",
        "Enable Live Caption",
        "\\Google\\Google Chrome - Default Settings (users can override)\\Accessibility settings",
        "Both",
        "Software\\Policies\\Google\\Chrome\\Recommended",
        "LiveCaptionEnabled",
        "Accessibility settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome_recommended~Accessibility_recommended/LiveCaptionEnabled_recommended",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended~accessibility_recommended_livecaptionenabled_recommended",
    "categoryId": "12142994-4b30-486c-bab1-9206528b2b96",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended~accessibility_recommended_livecaptionenabled_recommended",
    "description": "Enable the Live Caption feature.\r\n\r\nIf this policy is set to Enabled, Live Caption will always be turned on.\r\n\r\nIf this policy is set to Disabled, Live Caption will always be turned off.\r\n\r\nIf you set this policy as mandatory, users cannot change or override it.\r\n\r\nIf this policy is left unset, Live Caption is disabled initially but can be enabled by the user anytime.",
    "helpText": "",
    "name": "LiveCaptionEnabled_recommended",
    "displayName": "Enable Live Caption (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended~accessibility_recommended_livecaptionenabled_recommended_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended~accessibility_recommended_livecaptionenabled_recommended_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_recommended~accessibility_recommended_livecaptionenabled_recommended_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}