{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ControlDefaultStateOfAllowExtensionFromOtherStoresSettingEnabled_recommended",
        "Configure default state of Allow extensions from other stores setting",
        "\\Microsoft Edge - Default Settings (users can override)\\Extensions",
        "Microsoft Edge - Default Settings (users can override)\\Extensions",
        "Extensions"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev101~Policy~microsoft_edge_recommended~Extensions_recommended/ControlDefaultStateOfAllowExtensionFromOtherStoresSettingEnabled_recommended",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge_recommended~extensions_recommended_controldefaultstateofallowextensionfromotherstoressettingenabled_recommended",
    "categoryId": "b96b63eb-0292-4a73-85d7-c68d330c109e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge_recommended~extensions_recommended_controldefaultstateofallowextensionfromotherstoressettingenabled_recommended",
    "description": "This policy allows you to control the default state of the Allow extensions from other stores setting.\r\nThis policy can't be used to stop installation of extensions from other stores such as Chrome Web Store.\r\nTo stop installation of extensions from other stores, use the Extension Settings policy: https://go.microsoft.com/fwlink/?linkid=2187098.\r\n\r\nWhen enabled, Allow extensions from other stores will be turned on. So, users won't have to turn on the flag manually\r\nwhile installing extensions from other supported stores such as Chrome Web Store. However a user can override this setting.\r\nIf the user has already turned on the setting and then turned it off, this setting may not work.\r\nIf the Admin first sets the policy as Enabled, but then changes it to not configured or disabled, it will have no impact on\r\nuser settings and the setting will remain as it is.\r\n\r\nWhen disabled or not configured, the user can manage the Allow extensions from other store setting.\r\n",
    "helpText": "",
    "name": "ControlDefaultStateOfAllowExtensionFromOtherStoresSettingEnabled_recommended",
    "displayName": "Configure default state of Allow extensions from other stores setting (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge_recommended~extensions_recommended_controldefaultstateofallowextensionfromotherstoressettingenabled_recommended_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge_recommended~extensions_recommended_controldefaultstateofallowextensionfromotherstoressettingenabled_recommended_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge_recommended~extensions_recommended_controldefaultstateofallowextensionfromotherstoressettingenabled_recommended_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}