{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_AllowPrivateKeyCheck",
        "Check for the user's private key when the user sends an encrypted email that includes the user as a recipient",
        "\\Microsoft Outlook 2016\\Security\\Cryptography",
        "Microsoft Outlook 2016\\Security\\Cryptography",
        "Cryptography"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v5~Policy~L_MicrosoftOfficeOutlook~L_Security~L_Cryptography/L_AllowPrivateKeyCheck",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v5~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_allowprivatekeycheck",
    "categoryId": "1720d60f-40a6-471c-8e4c-efbacaf46997",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v5~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_allowprivatekeycheck",
    "description": "This policy setting controls whether Outlook checks for the user's private key when the user sends an encrypted email and the user is included as a recipient of the email. The user can be included as recipient either directly or as a member of a distribution list.\r\n\r\nIf you enable this policy setting, Outlook checks for the user's private key.\r\n\r\nIf you disable this policy setting, Outlook doesn't check for the user's private key.\r\n\r\nIf you don't configure this policy setting, Outlook checks for the user's private key.\r\n      ",
    "helpText": "",
    "name": "L_AllowPrivateKeyCheck",
    "displayName": "Check for the user's private key when the user sends an encrypted email that includes the user as a recipient (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v5~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_allowprivatekeycheck_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v5~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_allowprivatekeycheck_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v5~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_allowprivatekeycheck_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}