{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Set Clone Preferred Resolution Source",
        "Display"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Display#setclonepreferredresolutionsource"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Display/SetClonePreferredResolutionSource",
    "rootDefinitionId": "user_vendor_msft_policy_config_display_setclonepreferredresolutionsource",
    "categoryId": "7f22e772-942b-4eeb-82b9-eac9265a3d6e",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_display_setclonepreferredresolutionsource",
    "description": "Set the cloned monitor preferred resolution source as internal or external monitor or set to default.",
    "helpText": "",
    "name": "SetClonePreferredResolutionSource",
    "displayName": "Set Clone Preferred Resolution Source (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_display_setclonepreferredresolutionsource_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26200.6584",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_display_setclonepreferredresolutionsource_0",
            "description": "Default.",
            "helpText": null,
            "name": "Default.",
            "displayName": "Default.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_display_setclonepreferredresolutionsource_1",
            "description": "Internal.",
            "helpText": null,
            "name": "Internal.",
            "displayName": "Internal.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_display_setclonepreferredresolutionsource_2",
            "description": "External.",
            "helpText": null,
            "name": "External.",
            "displayName": "External.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}