{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Digitalx_DiableApplication_TitleText_1",
        "Do not allow Digital Locker to run",
        "\\Windows Components\\Digital Locker",
        "Administrative Templates\\Windows Components\\Digital Locker",
        "Digital Locker"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-digitallocker#admx-digitallocker-digitalx-diableapplication-titletext-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_DigitalLocker/Digitalx_DiableApplication_TitleText_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_digitallocker_digitalx_diableapplication_titletext_1",
    "categoryId": "1fa3b0c3-e453-4ef3-80aa-a7474d8eb354",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_digitallocker_digitalx_diableapplication_titletext_1",
    "description": "Specifies whether Digital Locker can run.\r\n\r\nDigital Locker is a dedicated download manager associated with Windows Marketplace and a feature of Windows that can be used to manage and download products acquired and stored in the user's Windows Marketplace Digital Locker.\r\n\r\nIf you enable this setting, Digital Locker will not run.\r\n\r\nIf you disable or do not configure this setting, Digital Locker can be run.\r\n ",
    "helpText": "",
    "name": "Digitalx_DiableApplication_TitleText_1",
    "displayName": "Do not allow Digital Locker to run (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_digitallocker_digitalx_diableapplication_titletext_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_digitallocker_digitalx_diableapplication_titletext_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_digitallocker_digitalx_diableapplication_titletext_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}