{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_BlockMacroExecutionFromInternet",
        "Block macros from running in Office files from the internet",
        "\\Microsoft Project 2016\\Project Options\\Security\\Trust Center",
        "Microsoft Project 2016\\Project Options\\Security\\Trust Center",
        "Trust Center"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/proj16v3~Policy~L_Proj~L_ProjectOptions~L_Security~L_TrustCenter/L_BlockMacroExecutionFromInternet",
    "rootDefinitionId": "user_vendor_msft_policy_config_proj16v3~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
    "categoryId": "cc50f179-0c39-4486-a555-de5a6e6ed365",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_proj16v3~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
    "description": "\r\nThis policy setting allows you to block macros from running in Office files that come from the internet.\r\n\r\nIf you enable this policy setting, macros are blocked from running, even if \"Enable all macros\" is selected in the Macro Settings section of the Trust Center. Users will receive a notification that macros are blocked from running.\r\n\r\nThe exceptions when macros will be allowed to run are:\r\n- The Office file is saved to a Trusted Location.\r\n- The Office file was previously trusted by the user.\r\n- Macros are digitally signed and the matching Trusted Publisher certificate is installed on the device.\r\n\r\nIf you disable this policy setting, the settings configured in the Macro Settings section of the Trust Center determine whether macros run in Office files that come from the internet.\r\n\r\nIf you don’t configure this policy setting, macros will be blocked from running. Users will receive a notification telling them of the security risks of macros from the internet along with a link to learn more.\r\n\r\nFor more information, see https://go.microsoft.com/fwlink/p/?linkid=2185771.",
    "helpText": "",
    "name": "L_BlockMacroExecutionFromInternet",
    "displayName": "Block macros from running in Office files from the internet (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_proj16v3~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_proj16v3~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v3~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}