{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RequestanSMIMEreceiptforallSMIMEsignedmessages",
        "Request an S/MIME receipt for all S/MIME signed messages",
        "\\Microsoft Outlook 2016\\Security\\Cryptography",
        "Microsoft Outlook 2016\\Security\\Cryptography",
        "Cryptography"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_Security~L_Cryptography/L_RequestanSMIMEreceiptforallSMIMEsignedmessages",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_requestansmimereceiptforallsmimesignedmessages",
    "categoryId": "1720d60f-40a6-471c-8e4c-efbacaf46997",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_requestansmimereceiptforallsmimesignedmessages",
    "description": "This policy setting controls whether Outlook sends S/MIME receipt requests with S/MIME signed messages.\r\n\r\nIf you enable this policy setting, Outlook requests S/MIME receipts whenever it sends S/MIME signed messages and users cannot change this setting.\r\n\r\nIf you disable or do not configure this policy setting, Outlook does not send S/MIME receipt requests with signed messages, but users can still include receipt requests with individual messages. If you disable this policy setting, users cannot change this functionality, but if you do not configure this policy setting, users can enable the option in the \"E-mail Security\" section of the Trust Center or the \"Security Properties\" dialog for individual messages.\r\n\r\nImportant: When the \"Sign all e-mail messages\" policy setting is enabled, enabling this policy setting can place significant stress on the e-mail infrastructure. Consider your needs and capabilities before enabling both settings.",
    "helpText": "",
    "name": "L_RequestanSMIMEreceiptforallSMIMEsignedmessages",
    "displayName": "Request an S/MIME receipt for all S/MIME signed messages (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_requestansmimereceiptforallsmimesignedmessages_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_requestansmimereceiptforallsmimesignedmessages_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_cryptography_l_requestansmimereceiptforallsmimesignedmessages_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}