{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IdleTimeout",
        "Delay before running idle actions",
        "\\Google\\Google Chrome\\Idle Browser Actions",
        "Google\\Google Chrome\\Idle Browser Actions",
        "Idle Browser Actions"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~BrowserIdle/IdleTimeout",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~browseridle_idletimeout",
    "categoryId": "8c35f124-e249-43e3-9044-ecc0b0a5855a",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~browseridle_idletimeout_idletimeout",
    "description": "",
    "helpText": "",
    "name": "IdleTimeout",
    "displayName": "Delay before running idle actions: (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2000000000,
        "minimumValue": 1
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 1
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~browseridle_idletimeout_1",
            "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~browseridle_idletimeout"
        }
    ],
    "dependedOnBy": []
}