{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PathtosharedWorkgroupinformationfileforsecuredMDBfiles",
        "Path to shared Workgroup information file for secured MDB files",
        "\\Microsoft Access 2016\\Tools | Security\\Workgroup Administrator...",
        "Microsoft Access 2016\\Tools | Security\\Workgroup Administrator...",
        "Workgroup Administrator..."
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_ToolsSecurity~L_WorkgroupAdministrator/L_PathtosharedWorkgroupinformationfileforsecuredMDBfiles",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles",
    "categoryId": "a788a6e5-ab3f-41e5-96c8-ee59627dcb4d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles83",
    "description": "",
    "helpText": "",
    "name": "L_pathtosharedworkgroupinformationfileforsecuredmdbfiles83",
    "displayName": "Path to shared Workgroup information file for secured MDB files (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles_1",
            "parentSettingId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles"
        }
    ],
    "dependedOnBy": []
}