{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OpenDirectlyInApp",
        "Open Directly in Office Client Application",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\common\\internet",
        "opendirectlyinapp"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_OpenDirectlyInApp",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16~policy~l_microsoftofficesystem~l_miscellaneous437_l_opendirectlyinapp",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16~policy~l_microsoftofficesystem~l_miscellaneous437_l_opendirectlyinapp",
    "description": "This policy allows the admin to choose whether Office documents located on web servers open up directly in the App or go via the web browser",
    "helpText": "",
    "name": "L_OpenDirectlyInApp",
    "displayName": "Open Directly in Office Client Application (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16~policy~l_microsoftofficesystem~l_miscellaneous437_l_opendirectlyinapp_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16~policy~l_microsoftofficesystem~l_miscellaneous437_l_opendirectlyinapp_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16~policy~l_microsoftofficesystem~l_miscellaneous437_l_opendirectlyinapp_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}