{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PathtosharedWorkgroupinformationfileforsecuredMDBfiles",
        "Path to shared Workgroup information file for secured MDB files",
        "\\Microsoft Access 2016\\Tools | Security\\Workgroup Administrator...",
        "Microsoft Access 2016\\Tools | Security\\Workgroup Administrator...",
        "Workgroup Administrator..."
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_ToolsSecurity~L_WorkgroupAdministrator/L_PathtosharedWorkgroupinformationfileforsecuredMDBfiles",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles",
    "categoryId": "a788a6e5-ab3f-41e5-96c8-ee59627dcb4d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles",
    "description": "Specifies the default path and filename for the workgroup information file.",
    "helpText": "",
    "name": "L_PathtosharedWorkgroupinformationfileforsecuredMDBfiles",
    "displayName": "Path to shared Workgroup information file for secured MDB files (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_toolssecurity~l_workgroupadministrator_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles_l_pathtosharedworkgroupinformationfileforsecuredmdbfiles83",
                    "required": true
                }
            ]
        }
    ]
}