{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PowerButtonAction",
        "Change Start Menu power button",
        "\\Start Menu and Taskbar",
        "Administrative Templates\\Start Menu and Taskbar",
        "Start Menu and Taskbar"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_StartMenu/PowerButtonAction",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction",
    "categoryId": "5161db41-7947-49ea-b9b3-dd92539e6783",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown",
    "description": null,
    "helpText": "",
    "name": "PowerButtonActionDropdown",
    "displayName": "Choose one of the following actions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_2",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_2",
            "description": null,
            "helpText": null,
            "name": "Shut Down",
            "displayName": "Shut Down",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_16",
            "description": null,
            "helpText": null,
            "name": "Sleep",
            "displayName": "Sleep",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "16"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_1",
            "description": null,
            "helpText": null,
            "name": "Log off",
            "displayName": "Log off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_512",
            "description": null,
            "helpText": null,
            "name": "Lock",
            "displayName": "Lock",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "512"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_4",
            "description": null,
            "helpText": null,
            "name": "Restart",
            "displayName": "Restart",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_256",
            "description": null,
            "helpText": null,
            "name": "Switch User",
            "displayName": "Switch User",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "256"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_powerbuttonactiondropdown_64",
            "description": null,
            "helpText": null,
            "name": "Hibernate",
            "displayName": "Hibernate",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "64"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_startmenu_powerbuttonaction"
                }
            ],
            "dependedOnBy": []
        }
    ]
}