{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableFRAdminPinByFolder",
        "Do not automatically make specific redirected folders available offline",
        "\\System\\Folder Redirection",
        "Administrative Templates\\System\\Folder Redirection",
        "Folder Redirection"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FolderRedirection/DisableFRAdminPinByFolder",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder",
    "categoryId": "41081a6b-ec9f-4b4f-b6ae-1d4dda162654",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinappdataroaming",
    "description": null,
    "helpText": "",
    "name": "DisablePinAppDataRoaming",
    "displayName": "AppData(Roaming) (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinappdataroaming_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinappdataroaming_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_disablepinappdataroaming_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_folderredirection_disablefradminpinbyfolder"
                }
            ],
            "dependedOnBy": []
        }
    ]
}