{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "GroupPolicyRefreshRateUser",
        "Set Group Policy refresh interval for users",
        "\\System\\Group Policy",
        "Administrative Templates\\System\\Group Policy",
        "Group Policy",
        "User",
        "Software\\Policies\\Microsoft\\Windows\\System"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-grouppolicy#admx-grouppolicy-grouppolicyrefreshrateuser"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/GroupPolicyRefreshRateUser",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_grouppolicy_grouppolicyrefreshrateuser",
    "categoryId": "deadde1d-7e7f-4577-bd6e-fc237c3854c5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_grouppolicy_grouppolicyrefreshrateuser",
    "description": "This policy setting specifies how often Group Policy for users is updated while the computer is in use (in the background). This setting specifies a background update rate only for the Group Policies in the User Configuration folder.\r\n\r\nIn addition to background updates, Group Policy for users is always updated when users log on.\r\n\r\nBy default, user Group Policy is updated in the background every 90 minutes, with a random offset of 0 to 30 minutes.\r\n\r\nIf you enable this setting, you can specify an update rate from 0 to 64,800 minutes (45 days). If you select 0 minutes, the computer tries to update user Group Policy every 7 seconds. However, because updates might interfere with users' work and increase network traffic, very short update intervals are not appropriate for most installations.\r\n\r\nIf you disable this setting, user Group Policy is updated every 90 minutes (the default). To specify that Group Policy for users should never be updated while the computer is in use, select the \"Turn off background refresh of Group Policy\" setting.\r\n\r\nThis setting also lets you specify how much the actual update interval varies. To prevent clients with the same update interval from requesting updates simultaneously, the system varies the update interval for each client by a random number of minutes. The number you type in the random time box sets the upper limit for the range of variance. For example, if you type 30 minutes, the system selects a variance of 0 to 30 minutes. Typing a large number establishes a broad range and makes it less likely that client requests overlap. However, updates might be delayed significantly.\r\n\r\nImportant: If the \"Turn off background refresh of Group Policy\" setting is enabled, this setting is ignored.\r\n\r\nNote: This setting establishes the update rate for user Group Policies. To set an update rate for computer Group Policies, use the \"Group Policy refresh interval for computers\" setting (located in Computer Configuration\\Administrative Templates\\System\\Group Policy).\r\n\r\nTip: Consider notifying users that their policy is updated periodically so that they recognize the signs of a policy update. When Group Policy is updated, the Windows desktop is refreshed; it flickers briefly and closes open menus. Also, restrictions imposed by Group Policies, such as those that limit the programs a user can run, might interfere with tasks in progress.\r\n ",
    "helpText": "",
    "name": "GroupPolicyRefreshRateUser",
    "displayName": "Set Group Policy refresh interval for users (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_grouppolicy_grouppolicyrefreshrateuser_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_grouppolicyrefreshrateuser_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_grouppolicyrefreshrateuser_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_grouppolicy_grouppolicyrefreshrateuser_gprefreshrate3",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_grouppolicy_grouppolicyrefreshrateuser_gprefreshrateoffset3",
                    "required": true
                }
            ]
        }
    ]
}