{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "HideFirstRunExperience",
        "Hide the First-run experience and splash screen",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev80diff~Policy~microsoft_edge/HideFirstRunExperience",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge_hidefirstrunexperience",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge_hidefirstrunexperience",
    "description": "If you enable this policy, the First-run experience and the splash screen will not be shown to users when they run Microsoft Edge for the first time.\r\n\r\nFor the configuration options shown in the First Run Experience, the browser will default to the following:\r\n\r\n-On the New Tab Page, the feed type will be set to MSN News and the layout to Inspirational.\r\n\r\n-The user will still be automatically signed into Microsoft Edge if the Windows account is of Azure AD or MSA type.\r\n\r\n-Sync will not be enabled by default and users will be able to turn on sync from the sync settings.\r\n\r\nIf you disable or don't configure this policy, the First-run experience and the Splash screen will be shown.\r\n\r\nNote: The specific configuration options shown to the user in the First Run Experience, can also be managed by using other specific policies. You can use the HideFirstRunExperience policy in combination with these policies to configure a specific browser experience on your managed devices. Some of these other policies are:\r\n\r\n-'AutoImportAtFirstRun' (Automatically import another browser's data and settings at first run)\r\n\r\n-'NewTabPageLocation' (Configure the new tab page URL)\r\n\r\n-'NewTabPageSetFeedType' (Configure the Microsoft Edge new tab page experience)\r\n\r\n-'SyncDisabled' (Disable synchronization of data using Microsoft sync services)\r\n\r\n-'BrowserSignin' (Browser sign-in settings)\r\n\r\n-'NonRemovableProfileEnabled' (Configure whether a user always has a default profile automatically signed in with their work or school account)",
    "helpText": "",
    "name": "HideFirstRunExperience",
    "displayName": "Hide the First-run experience and splash screen (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge_hidefirstrunexperience_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge_hidefirstrunexperience_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge_hidefirstrunexperience_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}