{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ProjectSummaryTask",
        "Project Summary Task",
        "\\Microsoft Project 2016\\Project Options\\View",
        "Microsoft Project 2016\\Project Options\\View",
        "View",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\ms project\\options\\view",
        "show project summary"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/proj16v2~Policy~L_Proj~L_ProjectOptions~L_PjView/L_ProjectSummaryTask",
    "rootDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview_l_projectsummarytask",
    "categoryId": "28c4859e-1faa-4b51-96cf-068cb4354093",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview_l_projectsummarytask",
    "description": "Allows you to manage whether the project summary task is displayed. If you enable this setting, the project summary task is displayed. If this setting is disabled or not configured, the user's default setting is used.",
    "helpText": "",
    "name": "L_ProjectSummaryTask",
    "displayName": "Project Summary Task (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview_l_projectsummarytask_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview_l_projectsummarytask_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview_l_projectsummarytask_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}