{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LimitSize",
        "Limit profile size",
        "\\System\\User Profiles",
        "Administrative Templates\\System\\User Profiles",
        "User Profiles"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserProfiles/LimitSize",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_userprofiles_limitsize",
    "categoryId": "b49cb414-bdfb-49d4-af5d-176ded4f9591",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_userprofiles_limitsize_warnuser",
    "description": null,
    "helpText": "",
    "name": "WarnUser",
    "displayName": "Notify user when profile storage space is exceeded. (User)",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_userprofiles_limitsize_warnuser_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_userprofiles_limitsize_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_userprofiles_limitsize"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_userprofiles_limitsize_warnuser_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_userprofiles_limitsize_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_userprofiles_limitsize"
                }
            ],
            "dependedOnBy": []
        }
    ]
}