{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OptionalConnectedExperiences",
        "Allow the use of additional optional connected experiences in Office",
        "\\Microsoft Office 2016\\Privacy\\Trust Center",
        "Microsoft Office 2016\\Privacy\\Trust Center",
        "Trust Center",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\common\\privacy",
        "controllerconnectedservicesenabled"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2.Updates.3~Policy~L_MicrosoftOfficeSystem~L_Privacy~L_TrustCenter/L_OptionalConnectedExperiences",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2.updates.3~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_optionalconnectedexperiences",
    "categoryId": "59c9b1c4-1757-4cf3-9b27-954dafe016d5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2.updates.3~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_optionalconnectedexperiences",
    "description": "This policy setting allows you to control whether additional optional connected experiences are available to your users when they’re using Office.\r\n\r\nAdditional optional connected experiences are offered by Microsoft directly to your users and are governed by terms other than your organization’s commercial agreement with Microsoft.\r\n\r\nInserting an online video into a PowerPoint presentation or the 3D Maps feature in Excel, which uses Bing, are examples of additional optional connected experiences.\r\n\r\nNote: Even if you choose to make these additional optional connected experiences available to your users, your users will have the option to turn these additional optional connected experiences off as a group by going to File > Account > Account Privacy > Manage Settings.\r\n\r\nIf you enable this policy setting, additional optional connected experiences will be available to your users.\r\n\r\nIf you disable this policy setting, additional optional connected experiences won’t be available to your users.\r\n\r\nNote: Some additional optional connected experiences may be controlled by other policy settings instead of this policy setting. For more information, see the link below.\r\n\r\nIf you don’t configure this policy setting, additional optional connected experiences will be available to your users.\r\n\r\nNote: If you disable the “Allow the use of connected experiences in Office” policy setting, additional optional connected experiences won’t be available to your users.\r\n\r\nFor more information, see https://go.microsoft.com/fwlink/p/?linkid=2085690\r\n\r\nNote: For information about how this policy setting affects Microsoft 365 Copilot, see https://go.microsoft.com/fwlink/p/?linkid=2248196.",
    "helpText": "",
    "name": "L_OptionalConnectedExperiences",
    "displayName": "Allow the use of additional optional connected experiences in Office (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2.updates.3~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_optionalconnectedexperiences_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2.updates.3~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_optionalconnectedexperiences_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2.updates.3~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_optionalconnectedexperiences_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}