{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "GPDCOptions",
        "Configure Group Policy domain controller selection",
        "\\System\\Group Policy",
        "Administrative Templates\\System\\Group Policy",
        "Group Policy"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/GPDCOptions",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions",
    "categoryId": "deadde1d-7e7f-4577-bd6e-fc237c3854c5",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_gpdcoptionsdesc",
    "description": null,
    "helpText": "",
    "name": "GPDCOptionsDesc",
    "displayName": "When Group Policy Object Editor is selecting a domain controller to use, it should: (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_gpdcoptionsdesc_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_gpdcoptionsdesc_1",
            "description": null,
            "helpText": null,
            "name": "Use the Primary Domain Controller",
            "displayName": "Use the Primary Domain Controller",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_gpdcoptionsdesc_2",
            "description": null,
            "helpText": null,
            "name": "Inherit from Active Directory Snap-ins",
            "displayName": "Inherit from Active Directory Snap-ins",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_gpdcoptionsdesc_3",
            "description": null,
            "helpText": null,
            "name": "Use any available domain controller",
            "displayName": "Use any available domain controller",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}