{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "get",
    "keywords": [
        "Error code",
        "Printer Provisioning"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/PrinterProvisioning-csp/"
    ],
    "occurrence": null,
    "baseUri": "./User/Vendor/MSFT/PrinterProvisioning",
    "offsetUri": "/UPPrinterInstalls/{0}/ErrorCode",
    "rootDefinitionId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
    "categoryId": "56c54112-2991-4bda-9e01-e6868bd07726",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "none",
    "id": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_errorcode",
    "description": "Univeral Print printer installation error code.",
    "helpText": "",
    "name": "ErrorCode",
    "displayName": "Error code (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19044.1790",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 2147483647,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
            "parentSettingId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}"
        }
    ],
    "dependedOnBy": []
}