{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DelegateSentItemsStyle",
        "Saving messages sent from a shared mailbox to the Sent Items folder",
        "\\Microsoft Outlook 2016\\Outlook Options\\Delegates",
        "Microsoft Outlook 2016\\Outlook Options\\Delegates",
        "Delegates"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v7~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Delegates/L_DelegateSentItemsStyle",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_outlookoptions~l_delegates_l_delegatesentitemsstyle",
    "categoryId": "fcc8ad48-a1e7-4cba-adae-7c916cbbc897",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_outlookoptions~l_delegates_l_delegatesentitemsstyle",
    "description": "This policy setting controls whether messages sent from a shared mailbox are saved to the Sent Items folder of the shared mailbox.\r\n\r\nBy default, messages sent from a shared mailbox aren't saved to the Sent Items folder of the shared mailbox.\r\n\r\nIf you enable this policy setting, messages sent from a shared mailbox will be saved to the Sent Items folder of the shared mailbox.\r\n\r\nIf you disable or don’t configure this policy setting, messages sent from a shared mailbox won’t be saved to the Sent Items folder of the shared mailbox.",
    "helpText": "",
    "name": "L_DelegateSentItemsStyle",
    "displayName": "Saving messages sent from a shared mailbox to the Sent Items folder (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_outlookoptions~l_delegates_l_delegatesentitemsstyle_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_outlookoptions~l_delegates_l_delegatesentitemsstyle_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_outlookoptions~l_delegates_l_delegatesentitemsstyle_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}