{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "JScriptReplacement",
        "Replace JScript by loading JScript9Legacy in place of JScript via MSHTML/WebOC.",
        "\\Windows Components\\Internet Explorer",
        "Administrative Templates\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-jscriptreplacement"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/JScriptReplacement",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_jscriptreplacement",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_internetexplorer_jscriptreplacement",
    "description": "This policy setting specifies whether JScript or JScript9Legacy is loaded.\r\n      \r\nIf you enable this policy setting or not configured, JScript9Legacy will be loaded in situations where JScript is instantiated.\r\n\r\nIf you disable this policy, then JScript will be utilized.",
    "helpText": "",
    "name": "JScriptReplacement",
    "displayName": "Replace JScript by loading JScript9Legacy in place of JScript. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_jscriptreplacement_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22000",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_jscriptreplacement_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_jscriptreplacement_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}