{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_M365LinksBrowserChoice",
        "Choose which browser opens web links",
        "\\Microsoft Office 2016\\Links",
        "Microsoft Office 2016\\Links",
        "Links",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\common\\links"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v14~Policy~L_MicrosoftOfficeSystem~L_M365LinksHandling/L_M365LinksBrowserChoice",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_m365linkshandling_l_m365linksbrowserchoice",
    "categoryId": "94ce8206-be22-496c-aa72-f3560e2a5c8d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_m365linkshandling_l_m365linksbrowserchoice",
    "description": "This policy controls which browser will open web links from within supported Microsoft 365 apps. By default, web links will open in Microsoft Edge.\r\n\r\nNote: This policy doesn’t override any user settings or policies that specify that document links should open in the desktop apps instead of their web app counterparts.\r\n\r\nIf you enable this policy, you can choose either “System default browser” or a specific browser, such as “Microsoft Edge.” “System default browser” refers to the browser setting specified on the user’s Windows device.\r\n\r\nIf you disable or don’t configure this policy, web links will open in Microsoft Edge. The user can set their preferred browser from the settings for the specific Microsoft 365 app.\r\n\r\nFor more information, see https://go.microsoft.com/fwlink/p/?linkid=2224834.",
    "helpText": "",
    "name": "L_M365LinksBrowserChoice",
    "displayName": "Choose which browser opens web links (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_m365linkshandling_l_m365linksbrowserchoice_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_m365linkshandling_l_m365linksbrowserchoice_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_m365linkshandling_l_m365linksbrowserchoice_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v14~policy~l_microsoftofficesystem~l_m365linkshandling_l_m365linksbrowserchoice_l_browserchoiceenum",
                    "required": true
                }
            ]
        }
    ]
}