{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DoNotCompressInlinedImagesInOutlook",
        "Do not compress the inlined images inserted in Outlook",
        "\\Microsoft Word 2016\\Word Options\\Advanced\\E-mail Options",
        "Microsoft Word 2016\\Word Options\\Advanced\\E-mail Options",
        "E-mail Options",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\common\\mailsettings",
        "outlookdonotcompressimages"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v4~Policy~L_MicrosoftOfficeWord~L_WordOptions~L_Advanced~L_EmailOptions/L_DoNotCompressInlinedImagesInOutlook",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v4~policy~l_microsoftofficeword~l_wordoptions~l_advanced~l_emailoptions_l_donotcompressinlinedimagesinoutlook",
    "categoryId": "61ecc5ec-c494-420b-a27b-a8d2fbdd7df1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v4~policy~l_microsoftofficeword~l_wordoptions~l_advanced~l_emailoptions_l_donotcompressinlinedimagesinoutlook",
    "description": "This policy setting allows you to disable compression on inlined images in Outlook.\r\n\r\nIf you enable this policy setting, Outlook won't compress inlined images in the message.\r\n\r\nIf you disable or don't configure this policy setting, inlined images would be compressed.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise.\r\n      ",
    "helpText": "",
    "name": "L_DoNotCompressInlinedImagesInOutlook",
    "displayName": "Do not compress the inlined images inserted in Outlook (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v4~policy~l_microsoftofficeword~l_wordoptions~l_advanced~l_emailoptions_l_donotcompressinlinedimagesinoutlook_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v4~policy~l_microsoftofficeword~l_wordoptions~l_advanced~l_emailoptions_l_donotcompressinlinedimagesinoutlook_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v4~policy~l_microsoftofficeword~l_wordoptions~l_advanced~l_emailoptions_l_donotcompressinlinedimagesinoutlook_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}