{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnableTranscripting",
        "Turn on PowerShell Transcription",
        "\\Windows Components\\Windows PowerShell",
        "Administrative Templates\\Windows Components\\Windows PowerShell",
        "Windows PowerShell"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PowerShellExecutionPolicy/EnableTranscripting",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_powershellexecutionpolicy_enabletranscripting",
    "categoryId": "5a92aaed-3c64-4074-bacf-91dc1896d6f1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_powershellexecutionpolicy_enabletranscripting_outputdirectory",
    "description": null,
    "helpText": "",
    "name": "OutputDirectory",
    "displayName": "Transcript output directory (User)",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
        "settingValueTemplateReference": null,
        "value": null
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_powershellexecutionpolicy_enabletranscripting_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_powershellexecutionpolicy_enabletranscripting"
        }
    ],
    "dependedOnBy": []
}