{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PreventCopyingOrMovingItemsBetweenAccounts",
        "Prevent copying or moving items between accounts",
        "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
        "Microsoft Outlook 2016\\Account Settings\\Exchange",
        "Exchange",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\outlook"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2.Updates.4~Policy~L_MicrosoftOfficeOutlook~L_ToolsAccounts~L_Exchangesettings/L_PreventCopyingOrMovingItemsBetweenAccounts",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2.updates.4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_preventcopyingormovingitemsbetweenaccounts",
    "categoryId": "c4dbc05f-da1e-440d-8beb-91bf9dad1875",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v2.updates.4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_preventcopyingormovingitemsbetweenaccounts",
    "description": "This policy setting allows you to prevent items from being copied or moved to other accounts or PSTs.\r\n\r\nIf you enable this policy setting, items will be prevented from being moved or copied to other accounts or PSTs.  Enter one of the following details:\r\n\r\n- \"Contoso.com\": prevents copying or moving from the account corresponding to the listed domain\r\n- \"*\":  prevents copying from all accounts and PST's\r\n- \"SharePoint\": prevents copies or moves from the SharePoint PST\r\n\r\nIf you disable or do not configure this policy setting, copying or moving items between accounts or PSTs is allowed.",
    "helpText": "",
    "name": "L_PreventCopyingOrMovingItemsBetweenAccounts",
    "displayName": "Prevent copying or moving items between accounts (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2.updates.4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_preventcopyingormovingitemsbetweenaccounts_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2.updates.4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_preventcopyingormovingitemsbetweenaccounts_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2.updates.4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_preventcopyingormovingitemsbetweenaccounts_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v2.updates.4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_preventcopyingormovingitemsbetweenaccounts_l_preventcopyingormovingitemsbetweenaccountsid",
                    "required": true
                }
            ]
        }
    ]
}