{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DynamicCodeSettings",
        "Dynamic Code Settings",
        "\\Google\\Google Chrome",
        "Google\\Google Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/DynamicCodeSettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings_dynamiccodesettings",
    "description": "",
    "helpText": "",
    "name": "DynamicCodeSettings",
    "displayName": "Dynamic Code Settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings_dynamiccodesettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings_dynamiccodesettings_0",
            "description": null,
            "helpText": null,
            "name": "Default dynamic code settings",
            "displayName": "Default dynamic code settings",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings_dynamiccodesettings_1",
            "description": null,
            "helpText": null,
            "name": "Prevent the browser process from creating dynamic code",
            "displayName": "Prevent the browser process from creating dynamic code",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_dynamiccodesettings"
                }
            ],
            "dependedOnBy": []
        }
    ]
}