{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SendSurvey",
        "Allow users to receive and respond to in-product surveys from Microsoft",
        "\\Microsoft Office 2016\\Privacy\\Trust Center",
        "Microsoft Office 2016\\Privacy\\Trust Center",
        "Trust Center"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v7.Updates~Policy~L_MicrosoftOfficeSystem~L_Privacy~L_TrustCenter/L_SendSurvey",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v7.updates~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_sendsurvey",
    "categoryId": "59c9b1c4-1757-4cf3-9b27-954dafe016d5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v7.updates~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_sendsurvey",
    "description": "This policy setting allows you to control whether your users can receive and respond to in-product surveys in Microsoft 365 products. Microsoft will use this feedback to improve the product experience for users. The ability to receive and respond to in-product surveys is enabled by default.\r\n\r\nIf you enable this policy setting, your users will be able to receive and respond to in-product surveys about their experience using Microsoft 365 products.\r\n\r\nIf you disable this policy setting, Microsoft will not survey your users while they are using Microsoft 365 products.\r\n\r\nIf you don't configure this policy setting, your users will be able to receive and respond to in-product surveys about their experience using Microsoft 365 products.\r\n\r\nComing soon, you will be able to view and manage feedback from your org in the Microsoft 365 admin center.\r\n\r\nNote: This data will be considered \"Feedback\" under your Microsoft 365 agreement, including information that would otherwise be considered \"Customer Data\" or \"Personal Data\".\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise, and to subscription versions of Project and Visio.\r\n\r\nFor more information, see https://go.microsoft.com/fwlink/?linkid=2142253",
    "helpText": "",
    "name": "L_SendSurvey",
    "displayName": "Allow users to receive and respond to in-product surveys from Microsoft (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v7.updates~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_sendsurvey_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v7.updates~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_sendsurvey_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v7.updates~policy~l_microsoftofficesystem~l_privacy~l_trustcenter_l_sendsurvey_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}