{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_SMimeDisableDataUpload",
        "Block processing of S/MIME encrypted messages by certain connected experiences",
        "\\Microsoft Outlook 2016\\Security\\Trust Center",
        "Microsoft Outlook 2016\\Security\\Trust Center",
        "Trust Center",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\common\\privacy",
        "smimedisabledataupload"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v15~Policy~L_MicrosoftOfficeOutlook~L_Security~L_TrustCenter/L_SMimeDisableDataUpload",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v15~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_smimedisabledataupload",
    "categoryId": "c3db5686-3bb2-437c-8906-60da1a1fa844",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v15~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_smimedisabledataupload",
    "description": "\r\nThis policy controls whether certain connected experiences that analyze your content can process email messages with S/MIME encryption.\r\n\r\nIf you enable this policy setting, certain connected experiences that analyze your content can’t process email messages with S/MIME encryption. This means connected experiences such as the following won’t be available:\r\n\r\n-\tSpelling and grammar check (Editor)\r\n-\tSuggested replies\r\n-\tAutomatically apply or recommend sensitivity labels\r\n-\tMicrosoft Purview Data Loss Prevention policy tips\r\n\r\nFor more information about which connected experiences are affected, see https://go.microsoft.com/fwlink/p/?linkid=2268773.\r\n\r\nIf you disable or don’t configure this policy setting, all connected experiences that analyze your content can process email messages with S/MIME encryption.\r\n\r\nNote: This policy setting only applies to Microsoft 365 Apps for enterprise.\r\n      ",
    "helpText": "",
    "name": "L_SMimeDisableDataUpload",
    "displayName": "Block processing of S/MIME encrypted messages by certain connected experiences (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v15~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_smimedisabledataupload_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v15~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_smimedisabledataupload_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v15~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_smimedisabledataupload_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}