{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AD_HideDirectoryFolder",
        "Hide Active Directory folder",
        "\\Desktop\\Active Directory",
        "Administrative Templates\\Desktop\\Active Directory",
        "Active Directory"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-desktop#admx-desktop-ad-hidedirectoryfolder"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/AD_HideDirectoryFolder",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_ad_hidedirectoryfolder",
    "categoryId": "f4f0dfd7-4638-4173-8b3b-0f08608bf330",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_desktop_ad_hidedirectoryfolder",
    "description": "Hides the Active Directory folder in Network Locations.\r\n\r\nThe Active Directory folder displays Active Directory objects in a browse window.\r\n\r\nIf you enable this setting, the Active Directory folder does not appear in the Network Locations folder.\r\n\r\nIf you disable this setting or do not configure it, the Active Directory folder appears in the Network Locations folder.\r\n\r\nThis setting is designed to let users search Active Directory but not tempt them to casually browse Active Directory.\r\n\n ",
    "helpText": "",
    "name": "AD_HideDirectoryFolder",
    "displayName": "Hide Active Directory folder (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_desktop_ad_hidedirectoryfolder_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_ad_hidedirectoryfolder_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_ad_hidedirectoryfolder_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}