{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ClearCacheOnClosePolicy",
        "Clear cache on close",
        "\\Microsoft Access 2016\\Miscellaneous",
        "Microsoft Access 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_Miscellaneous/L_ClearCacheOnClosePolicy",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_clearcacheonclosepolicy",
    "categoryId": "c3ab8d44-b353-4a8a-a526-ffd743fb7ff8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_clearcacheonclosepolicy",
    "description": "This policy setting allows you to force the cache to be cleared for databases that are not compatible with Access 2016 when the database is closed.\r\n\r\nIf you enable this policy setting, then any cached Microsoft SharePoint or Business Data Catalog (BDC) links will be cleared on close for databases that do not use Access 2016 compatible caching.  If the database uses Access 2016 compatible caching, then this policy setting will have no effect when enabled.\r\n\r\nIf you disable or do not configure this policy setting, then any cached Microsoft SharePoint or Business Data Catalog (BDC) links will be not cleared on close for databases that do not use Access 2016 compatible caching.  If the database uses Access 2016 compatible caching, then this policy setting will have no effect when disabled or not configured.",
    "helpText": "",
    "name": "L_ClearCacheOnClosePolicy",
    "displayName": "Clear cache on close (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_clearcacheonclosepolicy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_clearcacheonclosepolicy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_clearcacheonclosepolicy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}