{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableAutoSaveWhenCoauthoring",
        "Don’t automatically save changes when working in the same PowerPoint presentation as others",
        "\\Microsoft PowerPoint 2016\\Collaboration Settings\\Co-authoring",
        "Microsoft PowerPoint 2016\\Collaboration Settings\\Co-authoring",
        "Co-authoring"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ppt16v2~Policy~L_MicrosoftOfficePowerPoint~L_CollaborationSettings~L_Coauthoring/L_DisableAutoSaveWhenCoauthoring",
    "rootDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_collaborationsettings~l_coauthoring_l_disableautosavewhencoauthoring",
    "categoryId": "ceacf7fa-fa6e-434d-a381-e20e5245d180",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_collaborationsettings~l_coauthoring_l_disableautosavewhencoauthoring",
    "description": "This policy setting controls whether changes are saved automatically when users are working together in the same presentation.\r\n\r\nBy default, when users are working together in the same presentation, changes are automatically saved. This allows users to see the edits made by others in real time. But, some add-ins or solutions might not be compatible with PowerPoint saving so frequently.\r\n\r\nIf you enable this policy setting, changes aren’t saved automatically and users won’t see real-time edits.\r\n\r\nIf you disable or don't configure this policy setting, changes are saved automatically and users will see real-time edits.\r\n\r\nNote: this policy setting doesn’t affect the AutoRecover settings configured under File > Options > Save.\r\n    ",
    "helpText": "",
    "name": "L_DisableAutoSaveWhenCoauthoring",
    "displayName": "Don’t automatically save changes when working in the same PowerPoint presentation as others (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_collaborationsettings~l_coauthoring_l_disableautosavewhencoauthoring_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_collaborationsettings~l_coauthoring_l_disableautosavewhencoauthoring_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_collaborationsettings~l_coauthoring_l_disableautosavewhencoauthoring_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}