{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PjDefaultTaskTypes",
        "Default task type",
        "\\Microsoft Project 2016\\Project Options\\Schedule\\Scheduling options for 'Project1'",
        "Microsoft Project 2016\\Project Options\\Schedule\\Scheduling options for 'Project1'",
        "Scheduling options for 'Project1'"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/proj16v2~Policy~L_Proj~L_ProjectOptions~L_PjSchedule~L_PjSchedDoc/L_PjDefaultTaskTypes",
    "rootDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes",
    "categoryId": "3b2806c8-bd29-44b5-b3e0-b2c54a6008f3",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_l_pjdefaulttasktypes25",
    "description": "",
    "helpText": "",
    "name": "L_pjdefaulttasktypes25",
    "displayName": "Default task type (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_l_pjdefaulttasktypes25_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_l_pjdefaulttasktypes25_1",
            "description": null,
            "helpText": null,
            "name": "Fixed Duration",
            "displayName": "Fixed Duration",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_l_pjdefaulttasktypes25_0",
            "description": null,
            "helpText": null,
            "name": "Fixed Units",
            "displayName": "Fixed Units",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_l_pjdefaulttasktypes25_2",
            "description": null,
            "helpText": null,
            "name": "Fixed Work",
            "displayName": "Fixed Work",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjschedule~l_pjscheddoc_l_pjdefaulttasktypes"
                }
            ],
            "dependedOnBy": []
        }
    ]
}