{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TurnOffButtons_1",
        "Turn off hardware buttons",
        "\\Windows Components\\Tablet PC\\Hardware Buttons",
        "Administrative Templates\\Windows Components\\Tablet PC\\Hardware Buttons",
        "Hardware Buttons",
        "User",
        "SOFTWARE\\Policies\\Microsoft\\TabletPC",
        "TurnOffButtons"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-tabletshell#admx-tabletshell-turnoffbuttons-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TabletShell/TurnOffButtons_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_tabletshell_turnoffbuttons_1",
    "categoryId": "aa67f0c0-4eb0-492f-a528-decd3e256a22",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_tabletshell_turnoffbuttons_1",
    "description": "Turns off Tablet PC hardware buttons.\r\n\r\nIf you enable this policy, no actions will occur when the buttons are pressed, and the buttons tab in Tablet PC Control Panel will be removed.\r\n\r\nIf you disable this policy, user and OEM defined button actions will occur when the buttons are pressed.\r\n\r\nIf you do not configure this policy, user and OEM defined button actions will occur when the buttons are pressed.\r\n ",
    "helpText": "",
    "name": "TurnOffButtons_1",
    "displayName": "Turn off hardware buttons (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_tabletshell_turnoffbuttons_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletshell_turnoffbuttons_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_tabletshell_turnoffbuttons_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}