{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoWindowsSetupPage",
        "Hide Add/Remove Windows Components page",
        "\\Control Panel\\Add or Remove Programs",
        "Administrative Templates\\Control Panel\\Add or Remove Programs",
        "Add or Remove Programs",
        "User",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Uninstall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-addremoveprograms#admx-addremoveprograms-nowindowssetuppage"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AddRemovePrograms/NoWindowsSetupPage",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_addremoveprograms_nowindowssetuppage",
    "categoryId": "a809df26-b5db-4af9-b247-a539ada4e869",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_addremoveprograms_nowindowssetuppage",
    "description": "Removes the Add/Remove Windows Components button from the Add or Remove Programs bar. As a result, users cannot view or change the associated page.\r\n\r\nThe Add/Remove Windows Components button lets users configure installed services and use the Windows Component Wizard to add, remove, and configure components of Windows from the installation files.\r\n\r\nIf you disable this setting or do not configure it, the Add/Remove Windows Components button is available to all users.\r\n\r\nThis setting does not prevent users from using other tools and methods to configure services or add or remove program components. However, this setting blocks user access to the Windows Component Wizard.\r\n ",
    "helpText": "",
    "name": "NoWindowsSetupPage",
    "displayName": "Hide Add/Remove Windows Components page (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_addremoveprograms_nowindowssetuppage_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_nowindowssetuppage_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_addremoveprograms_nowindowssetuppage_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}