{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffNewStickyNotesInOneNote",
        "Disable the new Sticky Notes experience",
        "\\Microsoft OneNote 2016\\OneNote Options\\Other",
        "Microsoft OneNote 2016\\OneNote Options\\Other",
        "Other"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/onent16v6.1~Policy~L_MicrosoftOfficeOneNote~L_OneNoteOptions~L_Other/L_TurnOffNewStickyNotesInOneNote",
    "rootDefinitionId": "user_vendor_msft_policy_config_onent16v6.1~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffnewstickynotesinonenote",
    "categoryId": "ab8301d6-b122-4d40-868a-d00d3c0f1916",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_onent16v6.1~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffnewstickynotesinonenote",
    "description": "This policy controls the ability of users to access the new Sticky Notes experiences from OneNote.\r\n\r\nIf you enable this policy setting, users will be unable to access the new Sticky Notes experiences from OneNote.\r\n\r\nIf you disable this policy setting, users can access the new Sticky Notes experiences from OneNote.\r\n\r\nIf you do not set this policy setting, users can access the new Sticky Notes experiences from OneNote.\r\n\r\nNote: This policy does not affect the classic Microsoft Sticky Notes app available on the Microsoft Store. Additionally, disabling or not setting this policy does not guarantee access to the new Sticky Notes experiences from OneNote.",
    "helpText": "",
    "name": "L_TurnOffNewStickyNotesInOneNote",
    "displayName": "Disable the new Sticky Notes experience (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_onent16v6.1~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffnewstickynotesinonenote_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_onent16v6.1~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffnewstickynotesinonenote_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_onent16v6.1~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffnewstickynotesinonenote_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}