{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RemoveOrganizationTab",
        "Remove Organization tab",
        "\\Microsoft Office 2016\\Contact Card",
        "Microsoft Office 2016\\Contact Card",
        "Contact Card"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ContactCard/L_RemoveOrganizationTab",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard_l_removeorganizationtab",
    "categoryId": "5cd6dc4f-b231-449f-bc10-16041b73356a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard_l_removeorganizationtab",
    "description": "This policy setting allows you to remove the Organization tab from the Contact Card.\r\n\r\nIf you enable this policy setting, the Organization tab is removed from the Contact Card.\r\n\r\nIf you disable or do not configure this policy setting, the Organization tab appears on the Contact Card.",
    "helpText": "",
    "name": "L_RemoveOrganizationTab",
    "displayName": "Remove Organization tab (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard_l_removeorganizationtab_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard_l_removeorganizationtab_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard_l_removeorganizationtab_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}