{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NTPShortcuts",
        "Setting shortcuts on the New Tab Page (Beta)",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/NTPShortcuts",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpshortcuts",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpshortcuts",
    "description": "In development: for early preview only.\r\n\r\nSetting the policy pre-configures up to 10 custom shortcuts on the Google Chrome New Tab page.\r\n\r\nIf set, users will see these shortcuts by default and users can toggle between “My shortcuts,\" \"Most visited sites\" or \"My organization's shortcuts\" on the \"Customize Chrome\" panel. If empty or unset, the user will only be able to toggle between “My shortcuts\" or \"Most visited sites\" on the \"Customize Chrome\" panel.\r\n\r\nShortcut URLs must be unique.\r\n\r\nIf allow_user_edit is set to true, users can change the name of the shortcut. If set to false or unset, users cannot edit the name.\r\n\r\nIf allow_user_delete is set to true, users can remove the shortcut. If set to false or unset, users cannot remove the shortcut.\r\nSee https://cloud.google.com/docs/chrome-enterprise/policies/?policy=NTPShortcuts for more information about schema and formatting.\r\n\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"name\": \"Google\",\r\n    \"url\": \"https://www.google.com\"\r\n  },\r\n  {\r\n    \"name\": \"YouTube\",\r\n    \"url\": \"https://www.youtube.com\"\r\n  },\r\n  {\r\n    \"name\": \"Google Drive\",\r\n    \"url\": \"https://www.drive.google.com\",\r\n    \"allow_user_edit\": true,\r\n    \"allow_user_delete\": true\r\n  }\r\n]",
    "helpText": "",
    "name": "NTPShortcuts",
    "displayName": "Setting shortcuts on the New Tab Page (Beta) (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpshortcuts_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpshortcuts_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpshortcuts_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_ntpshortcuts_ntpshortcuts",
                    "required": true
                }
            ]
        }
    ]
}