{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_UserEnableWorkFolders",
        "Specify Work Folders settings",
        "\\Windows Components\\Work Folders",
        "Administrative Templates\\Windows Components\\Work Folders",
        "Work Folders"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-workfoldersclient#admx-workfoldersclient-pol-userenableworkfolders"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WorkFoldersClient/Pol_UserEnableWorkFolders",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders",
    "categoryId": "a53581a1-e9d7-4ba4-9dea-cea90d40cca1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders",
    "description": "This policy setting specifies the Work Folders server for affected users, as well as whether or not users are allowed to change settings when setting up Work Folders on a domain-joined computer.\r\n\r\nIf you enable this policy setting, affected users receive Work Folders settings when they sign in to a domain-joined PC. If this policy setting is disabled or not configured, no Work Folders settings are specified for the affected users, though users can manually set up Work Folders by using the Work Folders Control Panel item.\r\n\r\nThe \"Work Folders URL\" can specify either the URL used by the organization for Work Folders discovery, or the specific URL of the file server that stores the affected users' data.\r\n\r\nThe \"Work Folders Local Path\" specifies the local folder used on the client machine to sync files. This path may contain environment variables. Note: In order for this configuration to take effect, a valid 'Work Folders URL' must also be specified.\r\n  \r\nThe “On-demand file access preference” option controls whether to enable on-demand file access. When enabled, the user controls which files in Work Folders are available offline on a given PC. The rest of the files in Work Folders are always visible and don’t take up any space on the PC, but the user must be connected to the Internet to access them.\r\n\r\nIf you enable this policy setting, on-demand file access is enabled.\r\nIf you disable this policy setting, on-demand file access is disabled, and enough storage space to store all the user’s files is required on each of their PCs.\r\nIf you specify User choice or do not configure this policy setting, the user decides whether to enable on-demand file access. However, if the Force automatic setup policy setting is enabled, Work Folders is set up automatically with on-demand file access enabled.\r\n\r\nThe \"Force automatic setup\" option specifies that Work Folders should be set up automatically without prompting users. This prevents users from choosing not to use Work Folders on the computer; it also prevents them from manually specifying the local folder in which Work Folders stores files. By default, Work Folders is stored in the \"%USERPROFILE%\\Work Folders\" folder. If this option is not specified, users must use the Work Folders Control Panel item on their computers to set up Work Folders.\r\n      \r\n ",
    "helpText": "",
    "name": "Pol_UserEnableWorkFolders",
    "displayName": "Specify Work Folders settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_serverurl_edit",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_localfolderpath_edit",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_ghostingpreference_enum",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_autoprovision_chk",
                    "required": true
                }
            ]
        }
    ]
}