{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "SerialAskForUrls",
        "Allow the Serial API on these sites",
        "\\Google\\Google Chrome\\Content settings",
        "Administrative Templates\\Google\\Google Chrome\\Content settings",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~ContentSettings/SerialAskForUrls",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~contentsettings_serialaskforurls",
    "categoryId": "59d29716-55b0-4014-a458-38b408ff9530",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~contentsettings_serialaskforurls_serialaskforurlsdesc",
    "description": "",
    "helpText": "",
    "name": "SerialAskForUrlsDesc",
    "displayName": "Allow the Serial API on these sites (User)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~contentsettings_serialaskforurls_1",
            "parentSettingId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~contentsettings_serialaskforurls"
        }
    ],
    "dependedOnBy": []
}