{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AD_EnableFilter",
        "Enable filter in Find dialog box",
        "\\Desktop\\Active Directory",
        "Administrative Templates\\Desktop\\Active Directory",
        "Active Directory"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-desktop#admx-desktop-ad-enablefilter"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/AD_EnableFilter",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_ad_enablefilter",
    "categoryId": "f4f0dfd7-4638-4173-8b3b-0f08608bf330",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_desktop_ad_enablefilter",
    "description": "Displays the filter bar above the results of an Active Directory search. The filter bar consists of buttons for applying additional filters to search results.\r\n\r\nIf you enable this setting, the filter bar appears when the Active Directory Find dialog box opens, but users can hide it.\r\n\r\nIf you disable this setting or do not configure it, the filter bar does not appear, but users can display it by selecting \"Filter\" on the \"View\" menu.\r\n\r\nTo see the filter bar, open Network Locations, click Entire Network, and then click Directory. Right-click the name of a Windows domain, and click Find. Type the name of an object in the directory, such as  \"Administrator.\" If the filter bar does not appear above the resulting display, on the View menu, click Filter.\n ",
    "helpText": "",
    "name": "AD_EnableFilter",
    "displayName": "Enable filter in Find dialog box (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_desktop_ad_enablefilter_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_ad_enablefilter_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_ad_enablefilter_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}