{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "GPDCOptions",
        "Configure Group Policy domain controller selection",
        "\\System\\Group Policy",
        "Administrative Templates\\System\\Group Policy",
        "Group Policy",
        "User",
        "Software\\Policies\\Microsoft\\Windows\\Group Policy Editor"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-grouppolicy#admx-grouppolicy-gpdcoptions"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/GPDCOptions",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions",
    "categoryId": "deadde1d-7e7f-4577-bd6e-fc237c3854c5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions",
    "description": "This policy setting determines which domain controller the Group Policy Object Editor snap-in uses.\r\n\r\nIf you enable this setting, you can which domain controller is used according to these options:\r\n\r\n\"Use the Primary Domain Controller\" indicates that the Group Policy Object Editor snap-in reads and writes changes to the domain controller designated as the PDC Operations Master for the domain.\r\n\r\n\"Inherit from Active Directory Snap-ins\" indicates that the Group Policy Object Editor snap-in reads and writes changes to the domain controller that Active Directory Users and Computers or Active Directory Sites and Services snap-ins use.\r\n\r\n\"Use any available domain controller\" indicates that the Group Policy Object Editor snap-in can read and write changes to any available domain controller.\r\n\r\nIf you disable this setting or do not configure it, the Group Policy Object Editor snap-in uses the domain controller designated as the PDC Operations Master for the domain.\r\n\r\nNote: To change the PDC Operations Master for a domain, in Active Directory Users and Computers, right-click a domain, and then click \"Operations Masters.\"\r\n ",
    "helpText": "",
    "name": "GPDCOptions",
    "displayName": "Configure Group Policy domain controller selection (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_grouppolicy_gpdcoptions_gpdcoptionsdesc",
                    "required": true
                }
            ]
        }
    ]
}