{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_calendartype0",
        "Calendar Type",
        "\\Microsoft Project 2016\\Project Options\\View\\Calendar Type",
        "Microsoft Project 2016\\Project Options\\View\\Calendar Type"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/proj16v2~Policy~L_Proj~L_ProjectOptions~L_PjView~L_CalendarType/L_calendartype0",
    "rootDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0",
    "categoryId": "70b0e7ef-ceac-4c25-8f9f-5a6bf07163b6",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_l_calendartype1",
    "description": "",
    "helpText": "",
    "name": "L_calendartype1",
    "displayName": "Calendar Type (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_l_calendartype1_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_l_calendartype1_1",
            "description": null,
            "helpText": null,
            "name": "Gregorian Calendar",
            "displayName": "Gregorian Calendar",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_l_calendartype1_6",
            "description": null,
            "helpText": null,
            "name": "Hijri Calendar",
            "displayName": "Hijri Calendar",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "6"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_l_calendartype1_7",
            "description": null,
            "helpText": null,
            "name": "Thai Buddhist",
            "displayName": "Thai Buddhist",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "7"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_pjview~l_calendartype_l_calendartype0"
                }
            ],
            "dependedOnBy": []
        }
    ]
}