{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_Listoferrormessagestocustomize",
        "List of error messages to customize",
        "\\Microsoft Visio 2016\\Customizable Error Messages",
        "Microsoft Visio 2016\\Customizable Error Messages",
        "Customizable Error Messages"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/visio16v2~Policy~L_MicrosoftVisio~L_Customizableerrormessages/L_Listoferrormessagestocustomize",
    "rootDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize",
    "categoryId": "d5b3cab7-d486-4f74-8525-6bd740b950bc",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize_l_listoferrormessagestocustomize98",
    "description": "",
    "helpText": "",
    "name": "L_listoferrormessagestocustomize98",
    "displayName": "List of error messages to customize (User)",
    "childIds": [
        "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize_l_listoferrormessagestocustomize98_key",
        "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize_l_listoferrormessagestocustomize98_value"
    ],
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize_1",
            "parentSettingId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize"
        }
    ],
    "dependedOnBy": [
        {
            "dependedOnBy": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize_l_listoferrormessagestocustomize98_key",
            "required": true
        },
        {
            "dependedOnBy": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_customizableerrormessages_l_listoferrormessagestocustomize_l_listoferrormessagestocustomize98_value",
            "required": true
        }
    ]
}