{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "IZ_PolicyLogon_5",
        "Logon options",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Trusted Sites Zone",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Internet Control Panel\\Security Page\\Trusted Sites Zone",
        "Trusted Sites Zone"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/TrustedSitesZoneLogonOptions",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions",
    "categoryId": "cd16477e-7cff-4c24-ba7a-cc4342779f4b",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_iz_partname1a00",
    "description": "",
    "helpText": "",
    "name": "IZ_Partname1A00",
    "displayName": "Logon options (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_iz_partname1a00_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.3758",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_iz_partname1a00_196608",
            "description": null,
            "helpText": null,
            "name": "Anonymous logon",
            "displayName": "Anonymous logon",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "196608"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_iz_partname1a00_131072",
            "description": null,
            "helpText": null,
            "name": "Automatic logon only in Intranet zone",
            "displayName": "Automatic logon only in Intranet zone",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "131072"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_iz_partname1a00_0",
            "description": null,
            "helpText": null,
            "name": "Automatic logon with current username and password",
            "displayName": "Automatic logon with current username and password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_iz_partname1a00_65536",
            "description": null,
            "helpText": null,
            "name": "Prompt for user name and password",
            "displayName": "Prompt for user name and password",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "65536"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_trustedsiteszonelogonoptions"
                }
            ],
            "dependedOnBy": []
        }
    ]
}