{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoShellSearchButton",
        "Remove Search button from File Explorer",
        "\\Windows Components\\File Explorer",
        "Administrative Templates\\Windows Components\\File Explorer",
        "File Explorer",
        "User",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowsexplorer#admx-windowsexplorer-noshellsearchbutton"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsExplorer/NoShellSearchButton",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowsexplorer_noshellsearchbutton",
    "categoryId": "35525ba9-da99-460e-afd3-ba86506b0ba3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_windowsexplorer_noshellsearchbutton",
    "description": "This policy setting allows you to remove the Search button from the File Explorer toolbar.\r\n\r\nIf you enable this policy setting, the Search button is removed from the Standard Buttons toolbar that appears in File Explorer and other programs that use the File Explorer window, such as My Computer and Network Locations.\r\n\r\nEnabling this policy setting does not remove the Search button or affect any search features of Internet browser windows, such as the Internet Explorer window.\r\n\r\nIf you disable or do not configure this policy setting, the Search button is available from the File Explorer toolbar.\r\n\r\nThis policy setting does not affect the Search items on the File Explorer context menu or on the Start menu. To remove Search from the Start menu, use the \"Remove Search menu from Start menu\" policy setting (in User Configuration\\Administrative Templates\\Start Menu and Taskbar). To hide all context menus, use the \"Remove File Explorer's default context menu\" policy setting.\r\n ",
    "helpText": "",
    "name": "NoShellSearchButton",
    "displayName": "Remove Search button from File Explorer (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowsexplorer_noshellsearchbutton_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noshellsearchbutton_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowsexplorer_noshellsearchbutton_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}