{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableInternetExplorerLaunchViaCOM",
        "Disable Internet Explorer 11 Launch Via COM Automation",
        "\\Windows Components\\Internet Explorer",
        "Both",
        "Software\\Policies\\Microsoft\\Internet Explorer\\Main",
        "Internet Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-disableinternetexplorerlaunchviacom"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/DisableInternetExplorerLaunchViaCOM",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_disableinternetexplorerlaunchviacom",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_internetexplorer_disableinternetexplorerlaunchviacom",
    "description": "This policy lets you restrict launching of Internet Explorer using COM automation.\r\n\r\nIf you enable this policy, it prevents Internet Explorer 11 from being launched using COM automation.\r\n\r\nIf you disable, or don’t configure this policy, Internet Explorer 11 COM automation launches are allowed.",
    "helpText": "",
    "name": "DisableInternetExplorerLaunchViaCOM",
    "displayName": "Disable Internet Explorer 11 Launch Via COM Automation (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_disableinternetexplorerlaunchviacom_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26100.5074",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableinternetexplorerlaunchviacom_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableinternetexplorerlaunchviacom_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}