{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_UseTaiwanHongKongSARandMacaoSARcharactervariants",
        "Use Taiwan, Hong Kong SAR and Macao SAR character variants",
        "\\Microsoft Word 2016\\Review Tab\\Chinese Conversion | Convert with Options",
        "Microsoft Word 2016\\Review Tab\\Chinese Conversion | Convert with Options",
        "Chinese Conversion | Convert with Options"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v2~Policy~L_MicrosoftOfficeWord~L_ReviewTab~L_ReviewChineseTranslation/L_UseTaiwanHongKongSARandMacaoSARcharactervariants",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_usetaiwanhongkongsarandmacaosarcharactervariants",
    "categoryId": "7bee4dea-82a4-4a03-b903-654b374819b1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_usetaiwanhongkongsarandmacaosarcharactervariants",
    "description": "This policy setting allows you to configure the \"Chinese Conversion\" dialog, which is accessed by the \"Convert with Options\" button in the Review tab. This may only be visible when Chinese is enabled as an editing language.\r\n\r\nIf you enable this policy setting, the option is selected.\r\n\r\nIf you disable or do not configure this policy setting, the option is not selected.",
    "helpText": "",
    "name": "L_UseTaiwanHongKongSARandMacaoSARcharactervariants",
    "displayName": "Use Taiwan, Hong Kong SAR and Macao SAR character variants (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_usetaiwanhongkongsarandmacaosarcharactervariants_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_usetaiwanhongkongsarandmacaosarcharactervariants_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_reviewtab~l_reviewchinesetranslation_l_usetaiwanhongkongsarandmacaosarcharactervariants_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}