{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UserAgentReduction",
        "Enable or disable the User-Agent Reduction",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev99~Policy~microsoft_edge/UserAgentReduction",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction",
    "description": "The User-Agent HTTP request header is scheduled to be reduced. To facilitate testing and compatibility, this policy can enable the reduction feature for all websites, or disable the ability for origin trials, or field trials to enable the feature.\r\n\r\nIf you don't configure this policy or set it to Default, User-Agent will be controlled by experimentation.\r\n\r\nSet this policy to 'ForceEnabled' to force the reduced version of the  User-Agent request header.\r\n\r\nSet this policy to 'ForceDisabled' to force the full version of the  User-Agent request header.\r\n\r\nTo learn more about the User-Agent string, read here:\r\n\r\nhttps://docs.microsoft.com/en-us/microsoft-edge/web-platform/user-agent-guidance.\r\n\r\n\r\nPolicy options mapping:\r\n\r\n* Default (0) = User-Agent reduction will be controllable via Experimentation\r\n\r\n* ForceDisabled (1) = User-Agent reduction diabled, and not enabled by Experimentation\r\n\r\n* ForceEnabled (2) = User-Agent reduction will be enabled for all origins\r\n\r\nUse the preceding information when configuring this policy.",
    "helpText": "",
    "name": "UserAgentReduction",
    "displayName": "Enable or disable the User-Agent Reduction (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev99~policy~microsoft_edge_useragentreduction_useragentreduction",
                    "required": true
                }
            ]
        }
    ]
}