{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "TouchInputOff_1",
        "Turn off Tablet PC touch input",
        "\\Windows Components\\Tablet PC\\Touch Input",
        "Administrative Templates\\Windows Components\\Tablet PC\\Touch Input",
        "Touch Input",
        "User",
        "SOFTWARE\\Policies\\Microsoft\\TabletPC",
        "TurnOffTouchInput"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-touchinput#admx-touchinput-touchinputoff-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_TouchInput/TouchInputOff_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_touchinput_touchinputoff_1",
    "categoryId": "90bbab80-ecf0-47c6-bf01-76b26a3dc503",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_touchinput_touchinputoff_1",
    "description": "Turn off Tablet PC touch input\r\n\r\nTurns off touch input, which allows the user to interact with their computer using their finger.\r\n\r\nIf you enable this setting, the user will not be able to produce input with touch. They will not be able to use touch input or touch gestures such as tap and double tap, the touch pointer, and other touch-specific features.\r\n\r\nIf you disable this setting, the user can produce input with touch, by using gestures, the touch pointer, and other-touch specific features.\r\n\r\nIf you do not configure this setting, touch input is on by default.\r\n\r\nNote: Changes to this setting will not take effect until the user logs off.\r\n ",
    "helpText": "",
    "name": "TouchInputOff_1",
    "displayName": "Turn off Tablet PC touch input (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_touchinput_touchinputoff_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_touchinput_touchinputoff_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_touchinput_touchinputoff_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}