{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffOneNoteAutoLinkedNoteTaking",
        "Turn off OneNote auto-linked note taking",
        "\\Microsoft OneNote 2016\\OneNote Options\\Other",
        "Microsoft OneNote 2016\\OneNote Options\\Other",
        "Other",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\onenote\\options\\linkednotes",
        "autolink"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/onent16v2~Policy~L_MicrosoftOfficeOneNote~L_OneNoteOptions~L_Other/L_TurnOffOneNoteAutoLinkedNoteTaking",
    "rootDefinitionId": "user_vendor_msft_policy_config_onent16v2~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffonenoteautolinkednotetaking",
    "categoryId": "ab8301d6-b122-4d40-868a-d00d3c0f1916",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_onent16v2~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffonenoteautolinkednotetaking",
    "description": "This policy setting turns off the OneNote auto note taking feature which allows you to take notes on items such as webpages, Word documents, etc.  OneNote will automatically record what pages or document you were viewing when you took this note.\r\n\r\nIf you enable this policy setting, OneNote will not automatically link notes when the user tries to turn on this feature.\r\n\r\nIf you disable or do not enable this policy, OneNote will automatically link notes when the user tries to turn on this feature.",
    "helpText": "",
    "name": "L_TurnOffOneNoteAutoLinkedNoteTaking",
    "displayName": "Turn off OneNote auto-linked note taking (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_onent16v2~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffonenoteautolinkednotetaking_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_onent16v2~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffonenoteautolinkednotetaking_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_onent16v2~policy~l_microsoftofficeonenote~l_onenoteoptions~l_other_l_turnoffonenoteautolinkednotetaking_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}