{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "FirstPartySetsEnabled",
        "Enable First-Party Sets.",
        "\\Google\\Google Chrome\\First-Party Sets Settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "First- Party Sets Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~FirstPartySets/FirstPartySetsEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsenabled",
    "categoryId": "da78ddbc-fc94-48f9-8808-4b160d6f1d50",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsenabled",
    "description": "This policy is provided as a way to opt-out of the First-Party Sets feature.\r\n\r\nWhen this policy is unset or set to Enabled, the First-Party Sets feature is enabled.\r\n\r\nWhen this policy is set to Disabled, the First-Party Sets feature is disabled.\r\n\r\nIt controls whether Chrome supports First-Party Sets related integrations.\r\n\r\nThis is the equivalent of the RelatedWebsiteSetsEnabled policy.\r\nEither policy may be used, but this one will be deprecated soon so the RelatedWebsiteSetsEnabled policy is preferred.\r\nThey both have the same effect on the browser's behavior.",
    "helpText": "",
    "name": "FirstPartySetsEnabled",
    "displayName": "Enable First-Party Sets. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}