{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ProhibitChangingInstalledProfileList_1",
        "Prohibit installing or uninstalling color profiles",
        "\\Windows Components\\Windows Color System",
        "Administrative Templates\\Windows Components\\Windows Color System",
        "Windows Color System",
        "User",
        "Software\\Policies\\Microsoft\\Windows\\WindowsColorSystem",
        "ProhibitInstallUninstall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-windowscolorsystem#admx-windowscolorsystem-prohibitchanginginstalledprofilelist-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WindowsColorSystem/ProhibitChangingInstalledProfileList_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_windowscolorsystem_prohibitchanginginstalledprofilelist_1",
    "categoryId": "2e57e23c-4847-4864-8e8e-5f6add1f7a84",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_windowscolorsystem_prohibitchanginginstalledprofilelist_1",
    "description": "This policy setting affects the ability of users to install or uninstall color profiles.\r\n\r\nIf you enable this policy setting, users cannot install new color profiles or uninstall previously installed color profiles.\r\n\r\nIf you disable or do not configure this policy setting, all users can install new color profiles. Standard users can uninstall color profiles that they previously installed. Administrators will be able to uninstall all color profiles.\r\n ",
    "helpText": "",
    "name": "ProhibitChangingInstalledProfileList_1",
    "displayName": "Prohibit installing or uninstalling color profiles (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_windowscolorsystem_prohibitchanginginstalledprofilelist_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowscolorsystem_prohibitchanginginstalledprofilelist_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_windowscolorsystem_prohibitchanginginstalledprofilelist_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}