{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PasswordDismissCompromisedAlertEnabled",
        "Enable dismissing compromised password alerts for entered credentials",
        "\\Google\\Google Chrome\\Password manager",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Password manager"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~PasswordManager/PasswordDismissCompromisedAlertEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passworddismisscompromisedalertenabled",
    "categoryId": "a5a38799-7bf1-4b83-86fe-62729cd9ed9d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passworddismisscompromisedalertenabled",
    "description": "Setting the policy to Enabled or leaving it unset gives the user the option to dismiss/restore compromised password alerts.\r\n\r\nIf you disable this setting, users will not be able to dismiss alerts about compromised passwords. If enabled, users will be able to dismiss alerts about compromised passwords.",
    "helpText": "",
    "name": "PasswordDismissCompromisedAlertEnabled",
    "displayName": "Enable dismissing compromised password alerts for entered credentials (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passworddismisscompromisedalertenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passworddismisscompromisedalertenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passworddismisscompromisedalertenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}