{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CustomSearch",
        "Custom Instant Search Internet search provider",
        "\\Windows Components\\Instant Search",
        "Administrative Templates\\Windows Components\\Instant Search",
        "Instant Search"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-wordwheel#admx-wordwheel-customsearch"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WordWheel/CustomSearch",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_wordwheel_customsearch",
    "categoryId": "a2230bb9-81a5-4e95-bc7f-0fbc9ecb5de4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_wordwheel_customsearch",
    "description": "Set up the menu name and URL for the custom Internet search provider.\r\n\r\nIf you enable this setting, the specified menu name and URL will be used for Internet searches.\r\n\r\nIf you disable or not configure this setting, the default Internet search provider will be used.\r\n ",
    "helpText": "",
    "name": "CustomSearch",
    "displayName": "Custom Instant Search Internet search provider (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_wordwheel_customsearch_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_wordwheel_customsearch_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_wordwheel_customsearch_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_wordwheel_customsearch_customsearch_nameprompt",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_wordwheel_customsearch_customsearch_urlprompt",
                    "required": true
                }
            ]
        }
    ]
}