{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AlternateErrorPagesEnabled",
        "Enable alternate error pages",
        "\\Google\\Google Chrome",
        "Administrative Templates\\Google\\Google Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome/AlternateErrorPagesEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_alternateerrorpagesenabled",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_alternateerrorpagesenabled",
    "description": "Setting the policy to True means Google Chrome uses alternate error pages built into (such as \"page not found\"). Setting the policy to False means Google Chrome never uses alternate error pages.\r\n\r\nIf you set the policy, users can't change it. If not set, the policy is on, but users can change this setting.",
    "helpText": "",
    "name": "AlternateErrorPagesEnabled",
    "displayName": "Enable alternate error pages (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_alternateerrorpagesenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_alternateerrorpagesenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_alternateerrorpagesenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}