{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffScreenClipping",
        "Turn off screen clipping",
        "\\Microsoft Office 2016\\Disable Items in User Interface",
        "Microsoft Office 2016\\Disable Items in User Interface",
        "Disable Items in User Interface"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_Disableitemsinuserinterface/L_TurnOffScreenClipping",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_disableitemsinuserinterface_l_turnoffscreenclipping",
    "categoryId": "866eedbc-ffd9-457d-b02b-7b163d55c4bd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_disableitemsinuserinterface_l_turnoffscreenclipping",
    "description": "This policy setting allows you to turn off the Insert Screenshot feature.\r\n\r\nIf you enable this policy setting, you will turn off the Insert Screenshot feature found in Microsoft Excel, PowerPoint, Outlook, and Word. This setting does not affect the screen clipping feature found in Microsoft OneNote or the Print Screen key on your keyboard.\r\n\r\nIf you disable or do not configure this policy setting, the Insert Screenshot feature in Microsoft Excel, PowerPoint, Outlook, and Word will be available. This feature allows users to insert both screen clippings and the contents of an entire active window. ",
    "helpText": "",
    "name": "L_TurnOffScreenClipping",
    "displayName": "Turn off screen clipping (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_disableitemsinuserinterface_l_turnoffscreenclipping_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_disableitemsinuserinterface_l_turnoffscreenclipping_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_disableitemsinuserinterface_l_turnoffscreenclipping_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}