{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_EnableAdditionalActionsInExcel",
        "Enable additional actions in Excel",
        "\\Microsoft Office 2016\\Tools | AutoCorrect Options... (Excel, PowerPoint and Access)\\Additional Actions",
        "Microsoft Office 2016\\Tools | AutoCorrect Options... (Excel, PowerPoint and Access)\\Additional Actions",
        "Additional Actions"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ToolsAutoCorrectOptionsExcelPowerPointandAccess~L_AdditionalActions/L_EnableAdditionalActionsInExcel",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsautocorrectoptionsexcelpowerpointandaccess~l_additionalactions_l_enableadditionalactionsinexcel",
    "categoryId": "69931627-230d-4df9-bbef-e3eac64ea8ef",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsautocorrectoptionsexcelpowerpointandaccess~l_additionalactions_l_enableadditionalactionsinexcel",
    "description": "This policy setting controls whether Excel can provide additional actions for certain words and phrases in a workbook through the right-click menu, and whether users can configure this behavior by checking or unchecking the \"Enable additional actions in the right-click menu\" option under the File tab | Options | Proofing | AutoCorrect Options | Actions tab. If additional actions functionality is turned on, Excel can recognize dates and financial symbols and provide additional actions for them.\r\n\r\nIf you enable or do not configure this policy setting, users can configure Excel to provide additional actions. Note: Excel does not provide additional actions until users check the \"Enable additional actions in the right-click menu\" option in the UI.\r\n\r\nIf you disable this policy setting, users cannot configure Excel to provide additional actions.",
    "helpText": "",
    "name": "L_EnableAdditionalActionsInExcel",
    "displayName": "Enable additional actions in Excel (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsautocorrectoptionsexcelpowerpointandaccess~l_additionalactions_l_enableadditionalactionsinexcel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsautocorrectoptionsexcelpowerpointandaccess~l_additionalactions_l_enableadditionalactionsinexcel_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_toolsautocorrectoptionsexcelpowerpointandaccess~l_additionalactions_l_enableadditionalactionsinexcel_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}