{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOnContactTabADReplaceOtherAdd",
        "Replace AD - Other Address",
        "\\Microsoft Office 2016\\Contact Card\\Contact Tab",
        "Microsoft Office 2016\\Contact Card\\Contact Tab",
        "Contact Tab"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_ContactCard~L_ContactTab/L_TurnOnContactTabADReplaceOtherAdd",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabadreplaceotheradd",
    "categoryId": "20bacabf-cd07-48be-a184-f0ae76d31e4a",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabadreplaceotheradd",
    "description": "This policy setting allows you to customize the 15th value of the Contact Tab.\r\n\r\nIf you enable this policy setting, you can change or remove the default value - \"other address\" of line 15.\r\n\r\nIf you disable or do not configure this policy setting, the default value for line 15 is displayed.\r\n\r\nImportant:\r\nIt is recommended that you specify a Messaging Application Programming Interface (MAPI) property and a corresponding Active Directory attribute (AD attribute).  The MAPI property should always be specified, unless Outlook is not installed, in which case only the AD attribute needs to be specified.  It must be entered in this format: ADAttribute.  Any properties entered which are binary or list box, cannot be displayed and are ignored.\r\n\r\nExample:\r\nTo display the Assistant on the Contact Card, enter the AD attribute: Ms-exch-assistant-name.\r\n\r\nTo remove the value, enter: null.\r\n\r\nNote: \r\nThe Location and Calendar values for a default Contact Card are not MAPI Properties or AD Attributes.  \r\n\r\nRelated policy settings:  \r\nReplace MAPI property n, Turn On Contact Tab Calendar Line Move, Turn On Contact Tab Location Line Move.",
    "helpText": "",
    "name": "L_TurnOnContactTabADReplaceOtherAdd",
    "displayName": "Replace AD - Other Address (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabadreplaceotheradd_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabadreplaceotheradd_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabadreplaceotheradd_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_contactcard~l_contacttab_l_turnoncontacttabadreplaceotheradd_l_otheraddadreplace",
                    "required": true
                }
            ]
        }
    ]
}