{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExtensionManifestV2Availability",
        "Control Manifest v2 extension availability",
        "\\Google\\Google Chrome\\Removed policies",
        "Google\\Google Chrome\\Removed policies",
        "Removed policies"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~RemovedPolicies/ExtensionManifestV2Availability",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability",
    "categoryId": "3634c01b-1a85-4f50-9f52-63bc10bf0e39",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_extensionmanifestv2availability",
    "description": "",
    "helpText": "",
    "name": "ExtensionManifestV2Availability",
    "displayName": "Control Manifest v2 extension availability (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_extensionmanifestv2availability_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_extensionmanifestv2availability_0",
            "description": null,
            "helpText": null,
            "name": "Default browser behavior",
            "displayName": "Default browser behavior",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_extensionmanifestv2availability_1",
            "description": null,
            "helpText": null,
            "name": "Manifest v2 is disabled",
            "displayName": "Manifest v2 is disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_extensionmanifestv2availability_2",
            "description": null,
            "helpText": null,
            "name": "Manifest v2 is enabled",
            "displayName": "Manifest v2 is enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_extensionmanifestv2availability_3",
            "description": null,
            "helpText": null,
            "name": "Manifest v2 is enabled for forced extensions only",
            "displayName": "Manifest v2 is enabled for forced extensions only",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_extensionmanifestv2availability"
                }
            ],
            "dependedOnBy": []
        }
    ]
}