{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PresentationSettingsEnable_1",
        "Turn off Windows presentation settings",
        "\\Windows Components\\Presentation Settings",
        "Administrative Templates\\Windows Components\\Presentation Settings",
        "Presentation Settings"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-mobilepcpresentationsettings#admx-mobilepcpresentationsettings-presentationsettingsenable-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_MobilePCPresentationSettings/PresentationSettingsEnable_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_mobilepcpresentationsettings_presentationsettingsenable_1",
    "categoryId": "ab754829-54a1-4082-abfa-56bae0b07ff3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_mobilepcpresentationsettings_presentationsettingsenable_1",
    "description": "This policy setting turns off Windows presentation settings.\r\n\r\nIf you enable this policy setting, Windows presentation settings cannot be invoked.\r\n\r\nIf you disable this policy setting, Windows presentation settings can be invoked. The presentation settings icon will be displayed in the notification area. This will give users a quick and easy way to configure their system settings before a presentation to block system notifications and screen blanking, adjust speaker volume, and apply a custom background image.\r\n\r\nNote: Users will be able to customize their system settings for presentations in Windows Mobility Center.\r\n\r\nIf you do not configure this policy setting, Windows presentation settings can be invoked.\r\n ",
    "helpText": "",
    "name": "PresentationSettingsEnable_1",
    "displayName": "Turn off Windows presentation settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_mobilepcpresentationsettings_presentationsettingsenable_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_mobilepcpresentationsettings_presentationsettingsenable_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_mobilepcpresentationsettings_presentationsettingsenable_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}