{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get",
    "keywords": [
        "Tenant Id (User)",
        "PassportForWork",
        "Windows Hello For Business"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/PassportForWork",
    "offsetUri": "/{0}",
    "rootDefinitionId": "user_vendor_msft_passportforwork_{tenantid}",
    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_passportforwork_{tenantid}",
    "description": "This policy specifies the Tenant ID in the format of a Globally Unique Identifier (GUID) without curly braces ( { , } ), which will be used as part of Windows Hello for Business provisioning and management.",
    "helpText": "",
    "name": "{TenantId}",
    "displayName": "User-scoped settings",
    "childIds": [
        "user_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
        "user_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
        "user_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_maximumpinlength",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_history",
        "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_expiration"
    ],
    "maximumCount": 1,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager",
        "configurationServiceProviderVersion": "1.2",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_maximumpinlength",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_history",
            "required": false
        },
        {
            "dependedOnBy": "user_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_expiration",
            "required": false
        }
    ]
}