{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "sz_DWP_NoHTMLPaper",
        "Allow only bitmapped wallpaper",
        "\\Desktop\\Desktop",
        "Administrative Templates\\Desktop\\Desktop",
        "Desktop",
        "User",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\ActiveDesktop",
        "NoHTMLWallPaper"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-desktop#admx-desktop-sz-dwp-nohtmlpaper"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/sz_DWP_NoHTMLPaper",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_sz_dwp_nohtmlpaper",
    "categoryId": "a69e7a98-5af7-4834-bae1-2a1047663a71",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_desktop_sz_dwp_nohtmlpaper",
    "description": "Permits only bitmap images for wallpaper. This setting limits the desktop background (\"wallpaper\") to bitmap (.bmp) files. If users select files with other image formats, such as JPEG, GIF, PNG, or HTML, through the Browse button on the Desktop tab, the wallpaper does not load. Files that are autoconverted to a .bmp format, such as JPEG, GIF, and PNG, can be set as Wallpaper by right-clicking the image and selecting \"Set as Wallpaper\".\r\n\r\nAlso, see the \"Desktop Wallpaper\" and the \"Prevent changing wallpaper\" (in User Configuration\\Administrative Templates\\Control Panel\\Display) settings.\n ",
    "helpText": "",
    "name": "sz_DWP_NoHTMLPaper",
    "displayName": "Allow only bitmapped wallpaper (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_desktop_sz_dwp_nohtmlpaper_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_sz_dwp_nohtmlpaper_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_sz_dwp_nohtmlpaper_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}