{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoToastNotification",
        "Turn off toast notifications",
        "\\Start Menu and Taskbar\\Notifications",
        "Administrative Templates\\Start Menu and Taskbar\\Notifications",
        "Notifications"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-wpn#admx-wpn-notoastnotification"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WPN/NoToastNotification",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_wpn_notoastnotification",
    "categoryId": "cb98f9d4-d921-4a8b-a763-cf69ce2ada62",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_wpn_notoastnotification",
    "description": "\r\n          This policy setting turns off toast notifications for applications.\r\n\r\n          If you enable this policy setting, applications will not be able to raise toast notifications.\r\n\r\n          Note that this policy does not affect taskbar notification balloons.\r\n\r\n          Note that Windows system features are not affected by this policy.  You must enable/disable system features individually to stop their ability to raise toast notifications.\r\n\r\n          If you disable or do not configure this policy setting, toast notifications are enabled and can be turned off by the administrator or user.\r\n\r\n          No reboots or service restarts are required for this policy setting to take effect.\r\n      \r\n ",
    "helpText": "",
    "name": "NoToastNotification",
    "displayName": "Turn off toast notifications (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_wpn_notoastnotification_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_wpn_notoastnotification_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_wpn_notoastnotification_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}