{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultRootDir",
        "Set the default location for the OneDrive folder",
        "\\OneDrive",
        "OneDrive",
        "One Drive",
        "User",
        "SOFTWARE\\Policies\\Microsoft\\OneDrive"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/OneDriveNGSCv2~Policy~OneDriveNGSC/DefaultRootDir",
    "rootDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_defaultrootdir",
    "categoryId": "5ee629c1-94da-49b3-b7a1-a24b279f36d4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_defaultrootdir",
    "description": "This setting lets you set a specific path as the default location of the OneDrive folder on users' computers. By default, the path is under %userprofile%.\r\n\r\nIf you enable this setting, the default location of the OneDrive - {organization name} folder will be the path that you specify in the OneDrive.admx file. To prevent users from changing the location you specify, enable the \"Prevent users from changing the location of their OneDrive folder\" setting.\r\n\r\nIf you disable or do not configure this setting, the default location of the OneDrive - {organization name} folder will be in %userprofile%.",
    "helpText": "",
    "name": "DefaultRootDir",
    "displayName": "Set the default location for the OneDrive folder (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_defaultrootdir_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_defaultrootdir_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_defaultrootdir_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_defaultrootdir_defaultrootdirlist",
                    "required": true
                }
            ]
        }
    ]
}