{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOffInternetSearchIntegration",
        "Turn off Internet search integration",
        "\\Windows Components\\IME",
        "Administrative Templates\\Windows Components\\IME",
        "IME"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-eaime#admx-eaime-l-turnoffinternetsearchintegration"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_EAIME/L_TurnOffInternetSearchIntegration",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffinternetsearchintegration",
    "categoryId": "ba1d333c-e19b-4470-bbab-d040a633c3a3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_eaime_l_turnoffinternetsearchintegration",
    "description": "This policy setting allows you to turn off Internet search integration.\r\n\r\nSearch integration includes both using Search Provider (Japanese Microsoft IME) and performing bing search from predictive input for Japanese Microsoft IME.\r\n\r\nIf you enable this policy setting, you cannot use search integration.\r\n\r\nIf you disable or do not configure this policy setting, the search integration function can be used by default.\r\n\r\nThis policy setting applies to Japanese Microsoft IME.\r\n\r\nNote: Changes to this setting will not take effect until the user logs off.\r\n ",
    "helpText": "",
    "name": "L_TurnOffInternetSearchIntegration",
    "displayName": "Turn off Internet search integration (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffinternetsearchintegration_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffinternetsearchintegration_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_eaime_l_turnoffinternetsearchintegration_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}