{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "none",
    "keywords": [
        "DelegatedPackageFamilyNames",
        "Allow Windows Runtime apps to revoke enterprise data",
        "\\Windows Components\\File Revocation",
        "Administrative Templates\\Windows Components\\File Revocation",
        "File Revocation"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_FileRevocation/DelegatedPackageFamilyNames",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_filerevocation_delegatedpackagefamilynames",
    "categoryId": "67b48a23-9bc3-48f5-bf6e-c9b3cd7000e4",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_filerevocation_delegatedpackagefamilynames_delegatedpackagefamilynames_eids",
    "description": null,
    "helpText": "",
    "name": "DelegatedPackageFamilyNames_EIDs",
    "displayName": "\r\nApps permitted to revoke all protected data from the device for the specified enterprise identifier:\r\n",
    "defaultValue": null,
    "maximumCount": 1000,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 1023,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_admx_filerevocation_delegatedpackagefamilynames_1",
            "parentSettingId": "user_vendor_msft_policy_config_admx_filerevocation_delegatedpackagefamilynames"
        }
    ],
    "dependedOnBy": []
}