{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableOffice365SimplifiedAccountCreation",
        "Prevent Office 365 E-mail accounts from being configured within a simplified Interface",
        "\\Microsoft Outlook 2016\\Account Settings\\E-mail",
        "Microsoft Outlook 2016\\Account Settings\\E-mail",
        "E-mail"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v4~Policy~L_MicrosoftOfficeOutlook~L_ToolsAccounts~L_AccountSettingsEmail/L_DisableOffice365SimplifiedAccountCreation",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_accountsettingsemail_l_disableoffice365simplifiedaccountcreation",
    "categoryId": "ff87ffcb-a827-4d2b-90fc-e5789ef6d3e0",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_accountsettingsemail_l_disableoffice365simplifiedaccountcreation",
    "description": "This policy setting determines whether an Office 365 E-mail account when being configured in Outlook, can use a simplified dialog that can greatly accelerate the initial account creation.\r\n\r\nIf you enable this policy setting, users will configure their Office 365 accounts using the Account Wizard, as they do, for all other account types.",
    "helpText": "",
    "name": "L_DisableOffice365SimplifiedAccountCreation",
    "displayName": "Prevent Office 365 E-mail accounts from being configured within a simplified Interface (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_accountsettingsemail_l_disableoffice365simplifiedaccountcreation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_accountsettingsemail_l_disableoffice365simplifiedaccountcreation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v4~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_accountsettingsemail_l_disableoffice365simplifiedaccountcreation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}