{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OnlineStorageFilter",
        "Hide Microsoft cloud-based file locations in the Backstage view",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2.Updates.2~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_OnlineStorageFilter",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2.updates.2~policy~l_microsoftofficesystem~l_miscellaneous437_l_onlinestoragefilter",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2.updates.2~policy~l_microsoftofficesystem~l_miscellaneous437_l_onlinestoragefilter",
    "description": "This policy setting allows you to hide Microsoft cloud-based file locations in the Backstage view in Office. This helps prevent users from opening, saving, or sharing cloud-based files to locations such as: OneDrive, SharePoint, or Third Party Services.\r\n\r\nThis policy setting only applies to Word, PowerPoint, and Excel.\r\n\r\nTo filter specific services, add the values for all services to be disabled:\r\n    1 - OneDrive Personal\r\n    4 - ThisPC\r\n    8 - SharePoint OnPrem\r\n    16 - Recent Places\r\n    32 - SharePoint\r\n    64 - OneDrive for Business\r\n    128 - Third Party Services\r\n\r\nSpecial Values:\r\n    0 - (Default) All services enabled.\r\n    2 - (Legacy Value) Disable SharePoint and OneDrive for Business.\r\n\t4294967295 - All optional services disabled.\r\n\r\nFor example, OneDrive Personal (1), This PC (4) and Third Party Services (128) can all be disabled with a value of 133.\r\n\r\nThis value is calculated as follows: 1 + 4 + 128 = 133\r\n\r\nCommon Setting Values:\r\n 1 - Disable OneDrive Personal\r\n 2 - Disable SharePoint Online and OneDrive for Business\r\n 3 - Disable SharePoint Online, OneDrive for Business, and OneDrive Personal\r\n\r\nIf you disable or don’t configure this policy setting, users can use any configured Microsoft cloud-based file location to open, save, and share files.",
    "helpText": "",
    "name": "L_OnlineStorageFilter",
    "displayName": "Hide Microsoft cloud-based file locations in the Backstage view (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2.updates.2~policy~l_microsoftofficesystem~l_miscellaneous437_l_onlinestoragefilter_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2.updates.2~policy~l_microsoftofficesystem~l_miscellaneous437_l_onlinestoragefilter_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2.updates.2~policy~l_microsoftofficesystem~l_miscellaneous437_l_onlinestoragefilter_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2.updates.2~policy~l_microsoftofficesystem~l_miscellaneous437_l_onlinestoragefilter_l_onlinestoragefilterid",
                    "required": true
                }
            ]
        }
    ]
}