{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DefaultThirdPartyStoragePartitioningSetting",
        "Default third-party storage partitioning setting",
        "\\Google\\Google Chrome\\Deprecated policies",
        "Google\\Google Chrome\\Deprecated policies",
        "Deprecated policies"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~DeprecatedPolicies/DefaultThirdPartyStoragePartitioningSetting",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting",
    "categoryId": "5900ac65-f656-459c-bd82-1329a862544d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting_defaultthirdpartystoragepartitioningsetting",
    "description": "",
    "helpText": "",
    "name": "DefaultThirdPartyStoragePartitioningSetting",
    "displayName": "Default third-party storage partitioning setting (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting_defaultthirdpartystoragepartitioningsetting_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting_defaultthirdpartystoragepartitioningsetting_1",
            "description": null,
            "helpText": null,
            "name": "Allow third-party storage partitioning by default.",
            "displayName": "Allow third-party storage partitioning by default.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting_defaultthirdpartystoragepartitioningsetting_2",
            "description": null,
            "helpText": null,
            "name": "Disable third-party storage partitioning.",
            "displayName": "Disable third-party storage partitioning.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_defaultthirdpartystoragepartitioningsetting"
                }
            ],
            "dependedOnBy": []
        }
    ]
}