{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ForceMajorVersionToMinorPositionInUserAgent",
        "Freeze User-Agent string major version at 99",
        "\\Google\\Google Chrome\\Removed policies",
        "Google\\Google Chrome\\Removed policies",
        "Removed policies"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~RemovedPolicies/ForceMajorVersionToMinorPositionInUserAgent",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent",
    "categoryId": "3634c01b-1a85-4f50-9f52-63bc10bf0e39",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_forcemajorversiontominorpositioninuseragent",
    "description": "",
    "helpText": "",
    "name": "ForceMajorVersionToMinorPositionInUserAgent",
    "displayName": "Freeze User-Agent string major version at 99 (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_forcemajorversiontominorpositioninuseragent_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_forcemajorversiontominorpositioninuseragent_0",
            "description": null,
            "helpText": null,
            "name": "Default to browser settings for User-Agent string version.",
            "displayName": "Default to browser settings for User-Agent string version.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_forcemajorversiontominorpositioninuseragent_1",
            "description": null,
            "helpText": null,
            "name": "The User-Agent string will not freeze the major version.",
            "displayName": "The User-Agent string will not freeze the major version.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_forcemajorversiontominorpositioninuseragent_2",
            "description": null,
            "helpText": null,
            "name": "The User-Agent string will freeze the major version as 99 and include the browser's major version in the minor position.",
            "displayName": "The User-Agent string will freeze the major version as 99 and include the browser's major version in the minor position.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_forcemajorversiontominorpositioninuseragent"
                }
            ],
            "dependedOnBy": []
        }
    ]
}