{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EdgeDefaultProfileEnabled",
        "Default Profile Setting Enabled",
        "\\Microsoft Edge\\Identity and sign-in",
        "Microsoft Edge\\Identity and sign-in",
        "Identity and sign-in",
        "Both",
        "Software\\Policies\\Microsoft\\Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev101~Policy~microsoft_edge~Identity/EdgeDefaultProfileEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge~identity_edgedefaultprofileenabled",
    "categoryId": "45a89c1f-0a34-4f78-b28f-d30b623fa423",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge~identity_edgedefaultprofileenabled",
    "description": "Configuring this policy will let you set a default profile in Microsoft Edge to be used when opening the browser rather than the last profile used. This policy won't affect when \"--profile-directory\" parameter has been specified. Set the value to \"Default\" to refer to the default profile. The value is case sensitive.\r\nThe value of the policy is the name of the profile (case sensitive) and can be configured with string that is the name of a specific profile.\r\nThe value \"Edge Kids Mode\" and \"Guest Profile\" are considered not useful values because they not supposed to be a default profile.\r\nThis policy won't impact the following scenarios:\r\n  1) Settings specified in \"Profile preferences for sites\" in \"Profile preferences\"\r\n  2) Links opening from Outlook and Teams.\r\n\r\nThe following statements are under the condition of not specify the \"--profile-directory\" and configured value is not \"Edge Kids Mode\" or \"Guest Profile\":\r\nIf you enable this policy and configure it with a specific profile name and the specified profile can be found, Microsoft Edge will use the specified profile when launching and the setting of \"Default profile for external link\" is changed to the specified profile name and greyed out.\r\nIf you enable this policy and configure it with a specific profile name but it can't be found, the policy will behave like it's never been set before.\r\nIf you enable this policy, but don't configure or disable it, the policy will behave like it's never been set before.\r\n\r\nExample value: Default",
    "helpText": "",
    "name": "EdgeDefaultProfileEnabled",
    "displayName": "Default Profile Setting Enabled (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge~identity_edgedefaultprofileenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge~identity_edgedefaultprofileenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge~identity_edgedefaultprofileenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edgev101~policy~microsoft_edge~identity_edgedefaultprofileenabled_edgedefaultprofileenabled",
                    "required": true
                }
            ]
        }
    ]
}