{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "FirstPartySetsOverrides",
        "Override First-Party Sets.",
        "\\Google\\Google Chrome\\First-Party Sets Settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "First- Party Sets Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~FirstPartySets/FirstPartySetsOverrides",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsoverrides",
    "categoryId": "da78ddbc-fc94-48f9-8808-4b160d6f1d50",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsoverrides",
    "description": "This policy provides a way to override the list of sets the browser uses for First-Party Sets features.\r\n\r\nEach set in the browser's list of First-Party Sets must meet the requirements of a First-Party Set.\r\nA First-Party Set must contain a primary site and one or more member sites.\r\nA set can also contain a list of service sites that it owns, as well as a map from a site to all of its ccTLD variants.\r\nSee https://github.com/WICG/first-party-sets for more information on First-Party Sets are used by Google Chrome.\r\n\r\nAll sites in a First-Party Set must be a registrable domain served over HTTPS. Each site in a First-Party Set must also be unique,\r\nmeaning a site cannot be listed more than once in a First-Party Set.\r\n\r\nWhen this policy is given an empty dictionary, the browser uses the public list of First-Party Sets.\r\n\r\nFor all sites in a First-Party Set from the replacements list, if a site is also present\r\non a First-Party Set in the browser's list, then that site will be removed from the browser's First-Party Set.\r\nAfter this, the policy's First-Party Set will be added to the browser's list of First-Party Sets.\r\n\r\nFor all sites in a First-Party Set from the additions list, if a site is also present\r\non a First-Party Set in the browser's list, then the browser's First-Party Set will be updated so that the\r\nnew First-Party Set can be added to the browser's list. After the browser's list has been updated,\r\nthe policy's First-Party Set will be added to the browser's list of First-Party Sets.\r\n\r\nThe browser's list of First-Party Sets requires that for all sites in its list, no site is in\r\nmore than one set. This is also required for both the replacements list\r\nand the additions list. Similarly, a site cannot be in both the\r\nreplacements list and the additions list.\r\n\r\nWildcards (*) are not supported as a policy value, nor within any First-Party Set in these lists.\r\n\r\nAll sets provided by the policy must be valid First-Party Sets, if they aren't then an\r\nappropriate error will be outputted.\r\n\r\nOn Microsoft® Windows®, this policy is only available on instances that are joined to a Microsoft® Active Directory® domain, joined to Microsoft® Azure® Active Directory® or enrolled in Chrome Enterprise Core.\r\n\r\nOn macOS, this policy is only available on instances that are managed via MDM, joined to a domain via MCX or enrolled in Chrome Enterprise Core.\r\n\r\nThis is the equivalent of the RelatedWebsiteSetsOverrides policy.\r\nEither policy may be used, but this one will be deprecated soon so the RelatedWebsiteSetsOverrides policy is preferred.\r\nThey both have the same effect on the browser's behavior.\r\nSee https://cloud.google.com/docs/chrome-enterprise/policies/?policy=FirstPartySetsOverrides for more information about schema and formatting.\r\n\r\n\r\nExample value:\r\n\r\n{\r\n  \"additions\": [\r\n    {\r\n      \"associatedSites\": [\r\n        \"https://associate2.test\"\r\n      ],\r\n      \"ccTLDs\": {\r\n        \"https://associate2.test\": [\r\n          \"https://associate2.com\"\r\n        ]\r\n      },\r\n      \"primary\": \"https://primary2.test\",\r\n      \"serviceSites\": [\r\n        \"https://associate2-content.test\"\r\n      ]\r\n    }\r\n  ],\r\n  \"replacements\": [\r\n    {\r\n      \"associatedSites\": [\r\n        \"https://associate1.test\"\r\n      ],\r\n      \"ccTLDs\": {\r\n        \"https://associate1.test\": [\r\n          \"https://associate1.co.uk\"\r\n        ]\r\n      },\r\n      \"primary\": \"https://primary1.test\",\r\n      \"serviceSites\": [\r\n        \"https://associate1-content.test\"\r\n      ]\r\n    }\r\n  ]\r\n}",
    "helpText": "",
    "name": "FirstPartySetsOverrides",
    "displayName": "Override First-Party Sets. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsoverrides_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsoverrides_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsoverrides_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~firstpartysets_firstpartysetsoverrides_firstpartysetsoverrides",
                    "required": true
                }
            ]
        }
    ]
}