{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DisableBackupRestore_1",
        "Prevent restoring previous versions from backups",
        "\\Windows Components\\File Explorer\\Previous Versions",
        "Administrative Templates\\Windows Components\\File Explorer\\Previous Versions",
        "Previous Versions"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-previousversions#admx-previousversions-disablebackuprestore-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_PreviousVersions/DisableBackupRestore_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_previousversions_disablebackuprestore_1",
    "categoryId": "7c34b514-0fb4-4868-8418-cb9b28f9f6e3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_previousversions_disablebackuprestore_1",
    "description": "This policy setting lets you suppress the Restore button in the previous versions property page when the user has selected a previous version of a local file, in which the previous version is stored on a backup.\r\n\r\nIf you enable this policy setting, the Restore button is disabled when the user selects a previous version corresponding to a backup.\r\n\r\nIf you disable this policy setting, the Restore button remains active for a previous version corresponding to a backup. If the Restore button is clicked, Windows attempts to restore the file from the backup media.\r\n\r\nIf you do not configure this policy setting, it is disabled by default. The Restore button is active when the previous version is of a local file and stored on the backup.\r\n ",
    "helpText": "",
    "name": "DisableBackupRestore_1",
    "displayName": "Prevent restoring previous versions from backups (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_previousversions_disablebackuprestore_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_previousversions_disablebackuprestore_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_previousversions_disablebackuprestore_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}