{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "VerMgmtDisable",
        "Turn off blocking of outdated ActiveX controls for Internet Explorer",
        "\\Windows Components\\Internet Explorer\\Security Features\\Add-on Management",
        "Add-on Management"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-donotblockoutdatedactivexcontrols"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/DoNotBlockOutdatedActiveXControls",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_donotblockoutdatedactivexcontrols",
    "categoryId": "89c0381d-3b9b-4be5-8077-ffb18d47e910",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_internetexplorer_donotblockoutdatedactivexcontrols",
    "description": "This policy setting determines whether Internet Explorer blocks specific outdated ActiveX controls. Outdated ActiveX controls are never blocked in the Intranet Zone.\r\n\r\nIf you enable this policy setting, Internet Explorer stops blocking outdated ActiveX controls.\r\n\r\nIf you disable or don't configure this policy setting, Internet Explorer continues to block specific outdated ActiveX controls.\r\n\r\nFor more information, see \"Outdated ActiveX Controls\" in the Internet Explorer TechNet library.",
    "helpText": "",
    "name": "VerMgmtDisable",
    "displayName": "Turn off blocking of outdated ActiveX controls for Internet Explorer (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_donotblockoutdatedactivexcontrols_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_donotblockoutdatedactivexcontrols_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_donotblockoutdatedactivexcontrols_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}