{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EdgeOpenExternalLinksWithPrimaryWorkProfileEnabled_recommended",
        "Use Primary Work Profile as default to open external links",
        "\\Microsoft Edge - Default Settings (users can override)\\Identity and sign-in",
        "Microsoft Edge - Default Settings (users can override)\\Identity and sign-in",
        "Identity and sign-in"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev138~Policy~microsoft_edge_recommended~Identity_recommended/EdgeOpenExternalLinksWithPrimaryWorkProfileEnabled_recommended",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev138~policy~microsoft_edge_recommended~identity_recommended_edgeopenexternallinkswithprimaryworkprofileenabled_recommended",
    "categoryId": "04b46099-4ee5-4def-8e04-569c988057a9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev138~policy~microsoft_edge_recommended~identity_recommended_edgeopenexternallinkswithprimaryworkprofileenabled_recommended",
    "description": "This policy controls whether Microsoft Edge uses the Primary Work Profile as the default profile when opening external links.\r\n1. On Windows, the Primary Work Profile refers to the profile signed in with the Entra ID account used to enroll the device.\r\n2. On macOS and Linux, the Primary Work Profile is the only profile signed in with an Entra ID account. If multiple profiles are signed in with Entra ID accounts, the Primary Work Profile setting does not apply.\r\n\r\nPolicy behavior:\r\n1. If enabled or not configured, Microsoft Edge will use the Primary Work Profile as the default for opening external links.\r\n2. If disabled, the last used profile becomes the default for opening external links.\r\n\r\nNote: This policy does not override the following scenarios:\r\n1. If the EdgeDefaultProfileEnabled policy is set, it takes precedence over this policy.\r\n2. External links opened from Outlook or Microsoft Teams may be configured to launch in a specific profile, which can override the Primary Work Profile setting.\r\n3. If the user sets a preference for \"Default profile for external links\" in Profile preferences, that setting will take effect.",
    "helpText": "",
    "name": "EdgeOpenExternalLinksWithPrimaryWorkProfileEnabled_recommended",
    "displayName": "Use Primary Work Profile as default to open external links (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev138~policy~microsoft_edge_recommended~identity_recommended_edgeopenexternallinkswithprimaryworkprofileenabled_recommended_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev138~policy~microsoft_edge_recommended~identity_recommended_edgeopenexternallinkswithprimaryworkprofileenabled_recommended_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev138~policy~microsoft_edge_recommended~identity_recommended_edgeopenexternallinkswithprimaryworkprofileenabled_recommended_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}