{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RelatedWebsiteSetsOverrides",
        "Override Related Website Sets.",
        "\\Google\\Google Chrome\\Related Website Sets Settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Related Website Sets Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~RelatedWebsiteSets/RelatedWebsiteSetsOverrides",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~relatedwebsitesets_relatedwebsitesetsoverrides",
    "categoryId": "ac821e49-1996-4d6c-99d4-9c3c3e4737b6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~relatedwebsitesets_relatedwebsitesetsoverrides",
    "description": "This policy provides a way to override the list of sets the browser uses for Related Website Sets features.\r\n\r\nThis policy overrides the FirstPartySetsOverrides policy.\r\n\r\nEach set in the browser's list of Related Website Sets must meet the requirements of a Related Website Set.\r\nA Related Website Set must contain a primary site and one or more member sites.\r\nA set can also contain a list of service sites that it owns, as well as a map from a site to all of its ccTLD variants.\r\nSee https://github.com/WICG/first-party-sets for more information on how Google Chrome uses Related Website Sets.\r\n\r\n\r\nAll sites in a Related Website Set must be a registrable domain served over HTTPS. Each site in a Related Website Set must also be unique,\r\nmeaning a site cannot be listed more than once in a Related Website Set.\r\n\r\nWhen this policy is given an empty dictionary, the browser uses the public list of Related Website Sets.\r\n\r\nFor all sites in a Related Website Set from the replacements list, if a site is also present\r\non a Related Website Set in the browser's list, then that site will be removed from the browser's Related Website Set.\r\nAfter this, the policy's Related Website Set will be added to the browser's list of Related Website Sets.\r\n\r\nFor all sites in a Related Website Set from the additions list, if a site is also present\r\non a Related Website Set in the browser's list, then the browser's Related Website Set will be updated so that the\r\nnew Related Website Set can be added to the browser's list. After the browser's list has been updated,\r\nthe policy's Related Website Set will be added to the browser's list of Related Website Sets.\r\n\r\nThe browser's list of Related Website Sets requires that for all sites in its list, no site is in\r\nmore than one set. This is also required for both the replacements list\r\nand the additions list. Similarly, a site cannot be in both the\r\nreplacements list and the additions list.\r\n\r\nWildcards (*) are not supported as a policy value, nor within any Related Website Set in these lists.\r\n\r\nAll sets provided by the policy must be valid Related Website Sets, if they aren't then an\r\nappropriate error will be outputted.\r\n\r\nOn Microsoft® Windows®, this policy is only available on instances that are joined to a Microsoft® Active Directory® domain, joined to Microsoft® Azure® Active Directory® or enrolled in Chrome Enterprise Core.\r\n\r\nOn macOS, this policy is only available on instances that are managed via MDM, joined to a domain via MCX or enrolled in Chrome Enterprise Core.\r\nSee https://cloud.google.com/docs/chrome-enterprise/policies/?policy=RelatedWebsiteSetsOverrides for more information about schema and formatting.\r\n\r\n\r\nExample value:\r\n\r\n{\r\n  \"additions\": [\r\n    {\r\n      \"associatedSites\": [\r\n        \"https://associate2.test\"\r\n      ],\r\n      \"ccTLDs\": {\r\n        \"https://associate2.test\": [\r\n          \"https://associate2.com\"\r\n        ]\r\n      },\r\n      \"primary\": \"https://primary2.test\",\r\n      \"serviceSites\": [\r\n        \"https://associate2-content.test\"\r\n      ]\r\n    }\r\n  ],\r\n  \"replacements\": [\r\n    {\r\n      \"associatedSites\": [\r\n        \"https://associate1.test\"\r\n      ],\r\n      \"ccTLDs\": {\r\n        \"https://associate1.test\": [\r\n          \"https://associate1.co.uk\"\r\n        ]\r\n      },\r\n      \"primary\": \"https://primary1.test\",\r\n      \"serviceSites\": [\r\n        \"https://associate1-content.test\"\r\n      ]\r\n    }\r\n  ]\r\n}",
    "helpText": "",
    "name": "RelatedWebsiteSetsOverrides",
    "displayName": "Override Related Website Sets. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~relatedwebsitesets_relatedwebsitesetsoverrides_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~relatedwebsitesets_relatedwebsitesetsoverrides_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~relatedwebsitesets_relatedwebsitesetsoverrides_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~relatedwebsitesets_relatedwebsitesetsoverrides_relatedwebsitesetsoverrides",
                    "required": true
                }
            ]
        }
    ]
}