{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OriginAgentClusterDefaultEnabled",
        "Allows origin-keyed agent clustering by default.",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/OriginAgentClusterDefaultEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_originagentclusterdefaultenabled",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_originagentclusterdefaultenabled",
    "description": "This policy allows origin-keyed agent clustering by default.\r\n\r\nThe Origin-Agent-Cluster HTTP header controls whether a document is\r\nisolated in an origin-keyed agent cluster, or in a site-keyed agent\r\ncluster. This has security implications since an origin-keyed agent\r\ncluster allows isolating documents by origin. The developer-visible\r\nconsequence of this is that the document.domain accessor can no longer\r\nbe set.\r\n\r\nThe default behaviour - when no Origin-Agent-Cluster header has been set -\r\nchanges in M111 from site-keyed to origin-keyed.\r\n\r\nIf this policy is enabled or not set, the browser will follow this\r\nnew default from that version on.\r\n\r\nIf this policy is disabled this change is reversed and\r\ndocuments without Origin-Agent-Cluster headers will be assigned to\r\nsite-keyed agent clusters. As a consequence, the document.domain accessor\r\nremains settable by default. This matches the legacy behaviour.\r\n\r\nSee https://developer.chrome.com/blog/immutable-document-domain/ for\r\nadditional details.",
    "helpText": "",
    "name": "OriginAgentClusterDefaultEnabled",
    "displayName": "Allows origin-keyed agent clustering by default. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_originagentclusterdefaultenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_originagentclusterdefaultenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_originagentclusterdefaultenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}