{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_TurnOnLoggingForAllConflicts",
        "Turn on logging for all conflicts",
        "\\Microsoft Outlook 2016\\Outlook Options\\Other\\Advanced",
        "Microsoft Outlook 2016\\Outlook Options\\Other\\Advanced",
        "Advanced"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Other~L_Advanced/L_TurnOnLoggingForAllConflicts",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_advanced_l_turnonloggingforallconflicts",
    "categoryId": "6535c74f-74ac-4713-9c7a-ae15f62e97aa",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_advanced_l_turnonloggingforallconflicts",
    "description": "This policy setting allows you to create Modification Resolution logs whenever the Outlook conflict resolver runs.  \r\n\r\nIf you enable this policy setting, Outlook will create Modification Resolution logs whenever the Outlook conflict resolver runs.  By default, Modification Resolution logs are written into the Sync Issues folder whenever Outlook's conflict resolver cannot resolve a conflict.\r\n\r\nYou may select one of these options:\r\n- No conflicts are logged: No Modification Resolution logs are written into the Sync Issues folder whenever Outlook's conflict resolver runs. \r\n- All conflicts logged: Modification Resolution logs are written into the Sync Issues folder whenever Outlook's conflict resolver runs.\r\n- Unresolved conflicts logged only: Modification Resolution logs are written into the Sync Issues folder in Outlook when the Outlook conflict resolver cannot resolve a conflict.\r\n\r\nThis applies to all item types.\r\n\r\nIf you disable or do not configure this policy setting, no Modification Resolution logs are written when the Outlook conflict resolver runs.",
    "helpText": "",
    "name": "L_TurnOnLoggingForAllConflicts",
    "displayName": "Turn on logging for all conflicts (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_advanced_l_turnonloggingforallconflicts_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_advanced_l_turnonloggingforallconflicts_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_advanced_l_turnonloggingforallconflicts_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_advanced_l_turnonloggingforallconflicts_l_turnonloggingforallconflictsdropid",
                    "required": true
                }
            ]
        }
    ]
}