{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "CompatView_UsePolicyList",
        "Use Policy List of Internet Explorer 7 sites",
        "\\Windows Components\\Internet Explorer\\Compatibility View",
        "Administrative Templates\\Windows Components\\Internet Explorer\\Compatibility View",
        "Compatibility View"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/AllowInternetExplorer7PolicyList",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_allowinternetexplorer7policylist",
    "categoryId": "c26b2f10-f2c0-45f2-955c-5379dd12f206",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_internetexplorer_allowinternetexplorer7policylist_compatview_sitelist",
    "description": "",
    "helpText": "",
    "name": "CompatView_SiteList",
    "displayName": "List of sites (User)",
    "defaultValue": null,
    "maximumCount": 600,
    "minimumCount": 1,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "6.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "none",
        "inputValidationSchema": null,
        "maximumLength": 2048,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "user_vendor_msft_policy_config_internetexplorer_allowinternetexplorer7policylist_1",
            "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_allowinternetexplorer7policylist"
        }
    ],
    "dependedOnBy": []
}