{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Advanced_SetWinInetProtocols",
        "Turn off encryption support",
        "\\Windows Components\\Internet Explorer\\Internet Control Panel\\Advanced Page",
        "Advanced Page"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/DisableEncryptionSupport",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport",
    "categoryId": "3969f56d-a8b5-4509-86fb-00eb481665fa",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions",
    "description": "",
    "helpText": "",
    "name": "Advanced_WinInetProtocolOptions",
    "displayName": "Secure Protocol combinations (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_160",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_0",
            "description": null,
            "helpText": null,
            "name": "Use no secure protocols",
            "displayName": "Use no secure protocols",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_8",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Only use SSL 2.0",
            "displayName": "[Obsolete] Only use SSL 2.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_32",
            "description": null,
            "helpText": null,
            "name": "Only use SSL 3.0",
            "displayName": "Only use SSL 3.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "32"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_40",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0 and SSL 3.0",
            "displayName": "[Obsolete] Use SSL 2.0 and SSL 3.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "40"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_128",
            "description": null,
            "helpText": null,
            "name": "Only use TLS 1.0",
            "displayName": "Only use TLS 1.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "128"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_136",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0 and TLS 1.0",
            "displayName": "[Obsolete] Use SSL 2.0 and TLS 1.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "136"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_160",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0 and TLS 1.0",
            "displayName": "Use SSL 3.0 and TLS 1.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "160"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_168",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, SSL 3.0, and TLS 1.0",
            "displayName": "[Obsolete] Use SSL 2.0, SSL 3.0, and TLS 1.0",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "168"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_512",
            "description": null,
            "helpText": null,
            "name": "Only use TLS 1.1",
            "displayName": "Only use TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "512"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_520",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0 and TLS 1.1",
            "displayName": "[Obsolete] Use SSL 2.0 and TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "520"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_544",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0 and TLS 1.1",
            "displayName": "Use SSL 3.0 and TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "544"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_552",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, SSL 3.0, and TLS 1.1",
            "displayName": "[Obsolete] Use SSL 2.0, SSL 3.0, and TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "552"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_640",
            "description": null,
            "helpText": null,
            "name": "Use TLS 1.0 and TLS 1.1",
            "displayName": "Use TLS 1.0 and TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "640"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_648",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, TLS 1.0, and TLS 1.1",
            "displayName": "[Obsolete] Use SSL 2.0, TLS 1.0, and TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "648"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_672",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0, TLS 1.0, and TLS 1.1",
            "displayName": "Use SSL 3.0, TLS 1.0, and TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "672"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_680",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.0, and TLS 1.1",
            "displayName": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.0, and TLS 1.1",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "680"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2048",
            "description": null,
            "helpText": null,
            "name": "Only use TLS 1.2",
            "displayName": "Only use TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2048"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2056",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0 and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0 and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2056"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2080",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0 and TLS 1.2",
            "displayName": "Use SSL 3.0 and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2080"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2088",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, SSL 3.0, and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0, SSL 3.0, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2088"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2176",
            "description": null,
            "helpText": null,
            "name": "Use TLS 1.0 and TLS 1.2",
            "displayName": "Use TLS 1.0 and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2176"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2184",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, TLS 1.0, and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0, TLS 1.0, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2184"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2208",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0, TLS 1.0, and TLS 1.2",
            "displayName": "Use SSL 3.0, TLS 1.0, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2208"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2216",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.0, and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.0, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2216"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2560",
            "description": null,
            "helpText": null,
            "name": "Use TLS 1.1 and TLS 1.2",
            "displayName": "Use TLS 1.1 and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2560"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2568",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, TLS 1.1, and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0, TLS 1.1, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2568"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2592",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0, TLS 1.1, and TLS 1.2",
            "displayName": "Use SSL 3.0, TLS 1.1, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2592"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2600",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.1, and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.1, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2600"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2688",
            "description": null,
            "helpText": null,
            "name": "Use TLS 1.0, TLS 1.1, and TLS 1.2",
            "displayName": "Use TLS 1.0, TLS 1.1, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2688"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2696",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, TLS 1.0, TLS 1.1, and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0, TLS 1.0, TLS 1.1, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2696"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2720",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0, TLS 1.0, TLS 1.1, and TLS 1.2",
            "displayName": "Use SSL 3.0, TLS 1.0, TLS 1.1, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2720"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2728",
            "description": null,
            "helpText": null,
            "name": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.0, TLS 1.1, and TLS 1.2",
            "displayName": "[Obsolete] Use SSL 2.0, SSL 3.0, TLS 1.0, TLS 1.1, and TLS 1.2",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2728"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_8192",
            "description": null,
            "helpText": null,
            "name": "Only use TLS 1.3",
            "displayName": "Only use TLS 1.3",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "8192"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_10240",
            "description": null,
            "helpText": null,
            "name": "Use TLS 1.2 and TLS 1.3",
            "displayName": "Use TLS 1.2 and TLS 1.3",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10240"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_10752",
            "description": null,
            "helpText": null,
            "name": "Use TLS 1.1, TLS 1.2, and TLS 1.3",
            "displayName": "Use TLS 1.1, TLS 1.2, and TLS 1.3",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10752"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_10880",
            "description": null,
            "helpText": null,
            "name": "Use TLS 1.0, TLS 1.1, TLS 1.2, and TLS 1.3",
            "displayName": "Use TLS 1.0, TLS 1.1, TLS 1.2, and TLS 1.3",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10880"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_10912",
            "description": null,
            "helpText": null,
            "name": "Use SSL 3.0, TLS 1.0, TLS 1.1, TLS 1.2, and TLS 1.3",
            "displayName": "Use SSL 3.0, TLS 1.0, TLS 1.1, TLS 1.2, and TLS 1.3",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "10912"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                    "parentSettingId": "user_vendor_msft_policy_config_internetexplorer_disableencryptionsupport"
                }
            ],
            "dependedOnBy": []
        }
    ]
}