{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NoDefaultPrograms",
        "Hide \"Set Program Access and Computer Defaults\" page",
        "\\Control Panel\\Programs",
        "Administrative Templates\\Control Panel\\Programs",
        "Programs",
        "User",
        "Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Programs"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-programs#admx-programs-nodefaultprograms"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Programs/NoDefaultPrograms",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_programs_nodefaultprograms",
    "categoryId": "f4eaa5be-1498-482e-abe6-de4fed7e3302",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_programs_nodefaultprograms",
    "description": "This setting removes the Set Program Access and Defaults page from the Programs Control Panel.  As a result, users cannot view or change the associated page.\r\n\r\nThe Set Program Access and Computer Defaults page allows administrators to specify default programs for certain activities, such as Web browsing or sending e-mail, as well as specify the programs that are accessible from the Start menu, desktop, and other locations.\r\n\r\nIf this setting is disabled or not configured, the Set Program Access and Defaults button is available to all users.\r\n\r\nThis setting does not prevent users from using other tools and methods to change program access or defaults.\r\n\r\nThis setting does not prevent the Default Programs icon from appearing on the Start menu.\n ",
    "helpText": "",
    "name": "NoDefaultPrograms",
    "displayName": "Hide \"Set Program Access and Computer Defaults\" page (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_programs_nodefaultprograms_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_programs_nodefaultprograms_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_programs_nodefaultprograms_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}