{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DefaultVideoOffInRecordingPresenterView",
        "Turn off camera recording by default when recording a slide show",
        "\\Microsoft PowerPoint 2016\\Disable Items in User Interface\\Predefined",
        "Microsoft PowerPoint 2016\\Disable Items in User Interface\\Predefined",
        "Predefined"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ppt16v2~Policy~L_MicrosoftOfficePowerPoint~L_Disableitemsinuserinterface~L_Predefined/L_DefaultVideoOffInRecordingPresenterView",
    "rootDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_predefined_l_defaultvideooffinrecordingpresenterview",
    "categoryId": "7e0626c6-bc98-4f59-a6ee-1560e27bc9bd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_predefined_l_defaultvideooffinrecordingpresenterview",
    "description": "This policy setting allows you to set camera recording off by default when recording a slide show.\r\n\r\nBy default, camera recording is on the first time a user records a slide show. If the user turns off camera recording, then camera recording will be off the next time the slide show recording window is launched, even if PowerPoint is closed and reopened.\r\n\r\nIf you enable this policy setting, camera recording is turned off by default. A user can turn on camera recording when recording a slide show. But, the next time the slide show recording window is launched, camera recording will be off by default.\r\n\r\nIf you disable or don’t configure this policy setting, the default state of camera recording is determined by the user, unless the “Turn off microphone recording by default when recording a slide show” policy setting is enabled. Enabling that policy setting also turns off camera recording by default.\r\n    ",
    "helpText": "",
    "name": "L_DefaultVideoOffInRecordingPresenterView",
    "displayName": "Turn off camera recording by default when recording a slide show (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_predefined_l_defaultvideooffinrecordingpresenterview_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_predefined_l_defaultvideooffinrecordingpresenterview_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_predefined_l_defaultvideooffinrecordingpresenterview_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}