{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrivacySandboxIpProtectionEnabled",
        "Choose whether the Privacy Sandbox IP Protection feature should be enabled.",
        "\\Google\\Google Chrome\\Privacy Sandbox policies",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Privacy Sandbox policies"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~PrivacySandbox/PrivacySandboxIpProtectionEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxipprotectionenabled",
    "categoryId": "d4ad9168-8c49-45d6-a7e5-86ba990fff3e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxipprotectionenabled",
    "description": "A policy to control whether the Privacy Sandbox IP Protection feature should be enabled.\r\n\r\nIP Protection is a feature that limits availability of a user's original IP address for certain third-party network requests made while browsing in Incognito mode, enhancing protections against cross-site tracking during Incognito browsing sessions.\r\n\r\nIf the policy is set to Disabled, then IP Protection will be disabled and users won't be able to enable the feature via UI settings.\r\nIf the policy is set to Enabled, then IP Protection will be enabled and users won't be able to disable the feature via UI settings.\r\nIf the policy is not set, IP Protection will be enabled by default and users will be able to control the feature on their device via UI settings.\r\n\r\nSome considerations regarding whether enterprises should disable IP Protection include:\r\n\r\n- DNS lookups won't be performed for requests that are proxied, which may impact DNS-based monitoring or filtering.\r\n\r\n- Enterprise applications may experience breakage when used in Incognito mode if they rely on requests to domains (or subdomains of those domains) on the Masked Domain List (Google Chrome) and require those requests to come from specific IP address ranges.\r\n\r\n- Traffic might not be proxied in Incognito mode under certain conditions, for example when users launch Incognito mode from a Chrome profile they aren't signed in to. In general the feature requires the user to have been signed in to Chrome with a personal Google account when launching Incognito mode.\r\n\r\n- The list of domains on the Masked Domain List may change over time, with new versions being pushed to users automatically. For more information on the Masked Domain List, see: Google Chrome.\r\n\r\nFor more information on IP Protection, see: Google Chrome.\r\n\r\nIP Protection will be launched no sooner than M139.",
    "helpText": "",
    "name": "PrivacySandboxIpProtectionEnabled",
    "displayName": "Choose whether the Privacy Sandbox IP Protection feature should be enabled. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxipprotectionenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxipprotectionenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~privacysandbox_privacysandboxipprotectionenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}