{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_RecommendOutlookExtension",
        "Recommend the Microsoft Outlook Extension",
        "\\Microsoft Outlook 2016\\Outlook Options\\Other",
        "Microsoft Outlook 2016\\Outlook Options\\Other",
        "Other",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\outlook\\options\\general",
        "recommendoutlookextension"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v8~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Other/L_RecommendOutlookExtension",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v8~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_recommendoutlookextension",
    "categoryId": "5e3f61b6-52b7-4c74-a101-33c1cf34a749",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v8~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_recommendoutlookextension",
    "description": "This policy setting controls whether Windows 10 users of the Outlook app and the Outlook web app will see a recommendation to install the new Microsoft Outlook extension for Microsoft Edge. If a user chooses to click the recommendation, they will be taken to the Microsoft Outlook extension page where they can choose to install this web-based, productivity add on. Your users can dismiss the recommendation and will only see the recommendation twice. If your users choose to install the extension, they will be able to access their mail, calendar, contacts, and tasks from an icon in Microsoft Edge without requiring that they open another browser tab. The extension is a “mini” version of Outlook on the web which operates as a one-click flyout from the browser header.\r\n\r\nIn the future, Microsoft may release a version of this extension for the Chrome browser. Microsoft will respect this policy for future promotions of a Chrome extension, as well.\r\n\r\nIf you enable or do not configure this policy setting, the recommendation will be presented to the user.\r\n\r\nIf you disable this policy setting, the recommendation will not be presented to the user.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise and Outlook web app.\r\n\r\nFor more information, see https://go.microsoft.com/fwlink/?linkid=2165458",
    "helpText": "",
    "name": "L_RecommendOutlookExtension",
    "displayName": "Recommend the Microsoft Outlook Extension (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v8~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_recommendoutlookextension_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v8~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_recommendoutlookextension_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v8~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_recommendoutlookextension_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}