{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebRtcLocalhostIpHandling",
        "Restrict exposure of local IP address by WebRTC",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/WebRtcLocalhostIpHandling",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_webrtclocalhostiphandling",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_webrtclocalhostiphandling",
    "description": "Allows you to set whether or not WebRTC exposes the user's local IP address.\r\n\r\nIf you set this policy to \"AllowAllInterfaces\" ('default') or \"AllowPublicAndPrivateInterfaces\" ('default_public_and_private_interfaces'), WebRTC exposes the local IP address.\r\n\r\nIf you set this policy to \"AllowPublicInterfaceOnly\" ('default_public_interface_only') or \"DisableNonProxiedUdp\" ('disable_non_proxied_udp'), WebRTC doesn't expose the local IP address.\r\n\r\nIf you don't set this policy, or if you disable it, WebRTC exposes the local IP address.\r\n\r\n  * 'default' = Allow all interfaces. This exposes the local IP address.\r\n  * 'default_public_and_private_interfaces' = Allow public and private interfaces over http default route. This exposes the local IP address.\r\n  * 'default_public_interface_only' = Allow public interface over http default route. This doesn't expose the local IP address.\r\n  * 'disable_non_proxied_udp' = Use TCP unless proxy server supports UDP. This doesn't expose the local IP address.\r\n\r\nExample value: default",
    "helpText": "",
    "name": "WebRtcLocalhostIpHandling",
    "displayName": "Restrict exposure of local IP address by WebRTC (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_webrtclocalhostiphandling_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_webrtclocalhostiphandling_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_webrtclocalhostiphandling_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_webrtclocalhostiphandling_webrtclocalhostiphandling",
                    "required": true
                }
            ]
        }
    ]
}