{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "EnterpriseCustomLabelForBrowser",
        "Set a custom enterprise label for a managed browser",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/EnterpriseCustomLabelForBrowser",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_enterprisecustomlabelforbrowser",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_enterprisecustomlabelforbrowser",
    "description": "This policy controls a custom label used to indicate a managed browser. For managed browsers, this label will be shown in a management disclaimer on a footer on the New Tab page. The custom label will not be translated.\r\n\r\nNote that this policy is only applied for managed browsers, so it will have no effect for managed users on unmanaged browsers.\r\n\r\nOn Microsoft® Windows®, this policy is only available on instances that are joined to a Microsoft® Active Directory® domain, joined to Microsoft® Azure® Active Directory® or enrolled in Chrome Enterprise Core.\r\n\r\nOn macOS, this policy is only available on instances that are managed via MDM, joined to a domain via MCX or enrolled in Chrome Enterprise Core.\r\n\r\nExample value: Chromium",
    "helpText": "",
    "name": "EnterpriseCustomLabelForBrowser",
    "displayName": "Set a custom enterprise label for a managed browser (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_enterprisecustomlabelforbrowser_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_enterprisecustomlabelforbrowser_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_enterprisecustomlabelforbrowser_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_enterprisecustomlabelforbrowser_enterprisecustomlabelforbrowser",
                    "required": true
                }
            ]
        }
    ]
}