{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrefixedVideoFullscreenApiAvailability",
        "Manage the deprecated prefixed video fullscreen API's availability",
        "\\Google\\Google Chrome\\Removed policies",
        "Google\\Google Chrome\\Removed policies",
        "Removed policies"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~RemovedPolicies/PrefixedVideoFullscreenApiAvailability",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability",
    "categoryId": "3634c01b-1a85-4f50-9f52-63bc10bf0e39",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_prefixedvideofullscreenapiavailability",
    "description": "",
    "helpText": "",
    "name": "PrefixedVideoFullscreenApiAvailability",
    "displayName": "Manage the deprecated prefixed video fullscreen API's availability (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_prefixedvideofullscreenapiavailability_runtime-enabled",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_prefixedvideofullscreenapiavailability_runtime-enabled",
            "description": null,
            "helpText": null,
            "name": "Follows regular deprecation timelines for the PrefixedVideoFullscreen API",
            "displayName": "Follows regular deprecation timelines for the PrefixedVideoFullscreen API",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "runtime-enabled"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_prefixedvideofullscreenapiavailability_disabled",
            "description": null,
            "helpText": null,
            "name": "Disables prefixed video fullscreen APIs",
            "displayName": "Disables prefixed video fullscreen APIs",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "disabled"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_prefixedvideofullscreenapiavailability_enabled",
            "description": null,
            "helpText": null,
            "name": "Enables prefixed video fullscreen APIs",
            "displayName": "Enables prefixed video fullscreen APIs",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "enabled"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~removedpolicies_prefixedvideofullscreenapiavailability"
                }
            ],
            "dependedOnBy": []
        }
    ]
}