{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,execute",
    "keywords": [
        "Install",
        "Printer Provisioning"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/PrinterProvisioning-csp/"
    ],
    "occurrence": null,
    "baseUri": "./User/Vendor/MSFT/PrinterProvisioning",
    "offsetUri": "/UPPrinterInstalls/{0}/Install",
    "rootDefinitionId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
    "categoryId": "56c54112-2991-4bda-9e01-e6868bd07726",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog",
    "id": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_install",
    "description": "Install Univeral Print printer.",
    "helpText": "",
    "name": "Install",
    "displayName": "Install (User)",
    "defaultOptionId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_install_true",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19044.1790",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "holoLens",
            "holographicForBusiness",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}_install_true",
            "description": "Install this printer",
            "helpText": null,
            "name": "Install",
            "displayName": "Install",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "NoValue_F0560EEE-F106-4D58-9BD0-82AF89C31A2D"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}",
                    "parentSettingId": "user_vendor_msft_printerprovisioning_upprinterinstalls_{printersharedid}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}