{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RepositoryTimeout",
        "Synchronization timeout",
        "\\Windows Components\\Microsoft User Experience Virtualization",
        "Administrative Templates\\Windows Components\\Microsoft User Experience Virtualization",
        "Microsoft User Experience Virtualization"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-userexperiencevirtualization#admx-userexperiencevirtualization-repositorytimeout"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserExperienceVirtualization/RepositoryTimeout",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_repositorytimeout",
    "categoryId": "9e857bed-81f8-4dfc-b049-c93eb68b4064",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_repositorytimeout",
    "description": "This policy setting configures the number of milliseconds that the computer waits when retrieving user settings from the settings storage location. \r\nYou can use this setting to override the default value of 2000 milliseconds. \r\nIf you enable this policy setting, set the number of milliseconds that the system waits to retrieve settings. \r\nIf you disable or do not configure this policy setting, the default value of 2000 milliseconds is used.\r\n      \r\n ",
    "helpText": "",
    "name": "RepositoryTimeout",
    "displayName": "Synchronization timeout (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_repositorytimeout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_repositorytimeout_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_repositorytimeout_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_repositorytimeout_repositorytimeout",
                    "required": true
                }
            ]
        }
    ]
}