{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableTrainingUser",
        "Disable Training of all features for the user",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous",
        "Disable local training of all features for the user.",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\common\\ai",
        "disabletraining"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v16~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_DisableTrainingUser",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletraininguser",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletraininguser",
    "description": "\r\nThis policy setting disables local training of all features for the user.\r\n\r\nFor local training policy, feature-specific settings are prioritized over general settings and computer settings are prioritized over user settings.\r\n\r\nIf a higher priority policy setting is not configured, then:\r\n- If this policy setting is enabled, local training of all features is disabled for the user.\r\n- If this policy setting is disabled, local training of all features is enabled for the user.\r\n- If this policy setting is not configured, local training of all features is enabled for the user.\r\n\r\nFor this policy setting, the order of priority is:\r\n1. Disable local training of [a specific feature] for the computer.\r\n2. Disable local training of all features for the computer.\r\n3. Disable local training of [a specific feature] for the user.\r\n4. Disable local training of all features for the user.",
    "helpText": "",
    "name": "L_DisableTrainingUser",
    "displayName": "Disable local training of all features for the user. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletraininguser_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletraininguser_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v16~policy~l_microsoftofficesystem~l_miscellaneous437_l_disabletraininguser_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}