{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ArchiveIgnoreLastModifiedTime",
        "Change the criteria that Outlook uses to archive different item types",
        "\\Microsoft Outlook 2016\\Outlook Options\\Other\\AutoArchive",
        "Microsoft Outlook 2016\\Outlook Options\\Other\\AutoArchive",
        "AutoArchive"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_OutlookOptions~L_Other~L_AutoArchive/L_ArchiveIgnoreLastModifiedTime",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_autoarchive_l_archiveignorelastmodifiedtime",
    "categoryId": "f29a5e42-24f5-47fb-bdcf-9ed9418035ee",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_autoarchive_l_archiveignorelastmodifiedtime",
    "description": "If you enable this policy setting, Outlook ignores the last modified date and archives items based on a date that is specific for the item type, as follows:\r\n\r\n-Email message: The received date.\r\n-Calendar item: The actual date that an appointment, event, or meeting is scheduled for.\r\n-Task: The completion date. Tasks that are not marked as completed are not archived. Tasks that are assigned to other users are archived only if the status is completed. \r\n-Note: The last modified date and time.\r\n-Journal entry: The date when the journal entry is created.\r\n-Contact: Not archived.\r\n\r\nIf you disable or do not configure this policy setting, Outlook archives different items based on the item type, as follows:\r\n\r\n-Email message: The received date or the last modified date and time, whichever is later. \r\n-Calendar item: The last modified date and time or the actual date that an appointment, event, or meeting is scheduled for, whichever is later. \r\n-Task: The completion date or the last modified date and time, whichever is later. Tasks that are not marked as completed are not archived. Tasks that are assigned to other users are archived only if the status is completed. \r\n-Note: The last modified date and time.\r\n-Journal entry: The date when the journal entry is created or the last modified date and time, whichever is later.\r\n-Contact: Not archived.",
    "helpText": "",
    "name": "L_ArchiveIgnoreLastModifiedTime",
    "displayName": "Change the criteria that Outlook uses to archive different item types (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_autoarchive_l_archiveignorelastmodifiedtime_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_autoarchive_l_archiveignorelastmodifiedtime_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other~l_autoarchive_l_archiveignorelastmodifiedtime_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}