{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_CloudOnlySaving",
        "Restrict saving on non-Cloud locations",
        "\\Microsoft Office 2016\\Miscellaneous",
        "Microsoft Office 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v20~Policy~L_MicrosoftOfficeSystem~L_miscellaneous437/L_CloudOnlySaving",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v20~policy~l_microsoftofficesystem~l_miscellaneous437_l_cloudonlysaving",
    "categoryId": "9b2ad6d8-8837-4c50-89d5-7507b69c7dec",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v20~policy~l_microsoftofficesystem~l_miscellaneous437_l_cloudonlysaving",
    "description": "This policy setting controls whether Word, Excel, and PowerPoint users can use non-cloud locations (local and network) to create new files.\r\n\r\nIf you enable this policy setting, users will only have Cloud Locations available to perform SaveAs and Save new files.\r\n\r\nIf you disable or don’t configure this policy setting, users can use any location (Cloud, Local, and Network) to perform SaveAs and Save new files.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for Enterprise.",
    "helpText": "",
    "name": "L_CloudOnlySaving",
    "displayName": "Restrict saving on non-Cloud locations (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v20~policy~l_microsoftofficesystem~l_miscellaneous437_l_cloudonlysaving_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v20~policy~l_microsoftofficesystem~l_miscellaneous437_l_cloudonlysaving_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v20~policy~l_microsoftofficesystem~l_miscellaneous437_l_cloudonlysaving_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}