{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_ListOfManagedAddins",
        "List of managed add-ins",
        "\\Microsoft Access 2016\\Miscellaneous",
        "Microsoft Access 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_Miscellaneous/L_ListOfManagedAddins",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_listofmanagedaddins",
    "categoryId": "c3ab8d44-b353-4a8a-a526-ffd743fb7ff8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_listofmanagedaddins",
    "description": "This policy setting allows you to specify which add-ins are always enabled, always disabled (blocked), or configurable by the user. To block add-ins that are not managed by this policy setting, you must also configure the \"Block all unmanaged add-ins\" policy setting.\r\n\r\nTo enable this policy setting, provide the following information for each add-in:\r\n\r\nIn \"Value name,\" specify the programmatic identifier (ProgID) for COM add-ins.\r\n\r\nTo obtain the ProgID for an add-in, use Registry Editor on the client computer where the add-in is installed to locate key names under HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Office\\Access\\Addins or HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\Access\\Addins.\r\n\r\nYou can also obtain the ProgID of an add-in by using Office Telemetry Dashboard.\r\n\r\nIn \"Value,\" specify the value as follows:\r\n\r\nTo specify that an add-in is always disabled (blocked), type 0.\r\n\r\nTo specify that an add-in is always enabled, type 1.\r\n\r\nTo specify that an add-in is configurable by the user and not blocked by the \"Block all unmanaged add-ins\" policy setting when enabled, type 2.\r\n\r\nIf you disable or do not enable this policy setting, the list of managed add-ins is deleted. If the \"Block all unmanaged add-ins\" policy setting is enabled, then all add-ins are blocked.",
    "helpText": "",
    "name": "L_ListOfManagedAddins",
    "displayName": "List of managed add-ins (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_listofmanagedaddins_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_listofmanagedaddins_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_listofmanagedaddins_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_listofmanagedaddins_l_listofmanagedaddins2",
                    "required": true
                }
            ]
        }
    ]
}