{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "HideCurrentLocation",
        "Hide the geographic location option",
        "\\Control Panel\\Regional and Language Options",
        "Administrative Templates\\Control Panel\\Regional and Language Options",
        "Regional and Language Options"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-hidecurrentlocation"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/HideCurrentLocation",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_globalization_hidecurrentlocation",
    "categoryId": "18db3d59-661b-47ec-900a-bf75495ca598",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_globalization_hidecurrentlocation",
    "description": "This policy setting removes the option to change the user's geographical location (GeoID) from the Region settings control panel.\r\n\r\nThis policy setting is used only to simplify the Regional Options control panel.\r\n\r\nIf you enable this policy setting, the user does not see the option to change the GeoID. This does not prevent the user or an application from changing the GeoID programmatically.\r\n\r\nIf you disable or do not configure this policy setting, the user sees the option for changing the user location (GeoID).\r\n\r\nNote: Even if a user can see the GeoID option, the \"Disallow changing of geographical location\" option can prevent them from actually changing their current geographical location.\r\n ",
    "helpText": "",
    "name": "HideCurrentLocation",
    "displayName": "Hide the geographic location option (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_globalization_hidecurrentlocation_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_hidecurrentlocation_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_hidecurrentlocation_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}