{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "UserAgentReduction",
        "Enable or disable the User-Agent Reduction.",
        "\\Google\\Google Chrome\\Deprecated policies",
        "Google\\Google Chrome\\Deprecated policies",
        "Deprecated policies"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~DeprecatedPolicies/UserAgentReduction",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction",
    "categoryId": "5900ac65-f656-459c-bd82-1329a862544d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_useragentreduction",
    "description": "",
    "helpText": "",
    "name": "UserAgentReduction",
    "displayName": "Enable or disable the User-Agent Reduction. (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_useragentreduction_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_useragentreduction_0",
            "description": null,
            "helpText": null,
            "name": "Reduced User Agent.",
            "displayName": "Reduced User Agent.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "0"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_useragentreduction_1",
            "description": null,
            "helpText": null,
            "name": "Full (legacy) User Agent.",
            "displayName": "Full (legacy) User Agent.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_useragentreduction_2",
            "description": null,
            "helpText": null,
            "name": "Reduced User Agent.",
            "displayName": "Reduced User Agent.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction_1",
                    "parentSettingId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~deprecatedpolicies_useragentreduction"
                }
            ],
            "dependedOnBy": []
        }
    ]
}