{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_AllowWebArchivestobesavedinanyHTMLencoding",
        "Allow Web Archives to be saved in any HTML encoding",
        "\\Microsoft Office 2016\\Web Archives",
        "Microsoft Office 2016\\Web Archives",
        "Web Archives"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_WebArchives/L_AllowWebArchivestobesavedinanyHTMLencoding",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_webarchives_l_allowwebarchivestobesavedinanyhtmlencoding",
    "categoryId": "2f56761a-8e8b-4788-a589-a73ab91818e6",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_webarchives_l_allowwebarchivestobesavedinanyhtmlencoding",
    "description": "Enabled: Allow the user to save Web Archives in any HTML encoding.\r\n\r\nNot enabled: Always use US-ASCII for Web Archives.\r\n\r\nThis results in smaller files, but is not supported in Windows Internet Explorer 5.0 or earlier.",
    "helpText": "",
    "name": "L_AllowWebArchivestobesavedinanyHTMLencoding",
    "displayName": "Allow Web Archives to be saved in any HTML encoding (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_webarchives_l_allowwebarchivestobesavedinanyhtmlencoding_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_webarchives_l_allowwebarchivestobesavedinanyhtmlencoding_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_webarchives_l_allowwebarchivestobesavedinanyhtmlencoding_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}