{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_autoSaveDefaultOffPowerPoint",
        "Turn off AutoSave by default in PowerPoint",
        "\\Microsoft Office 2016\\AutoSave",
        "Microsoft Office 2016\\AutoSave",
        "AutoSave"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_AutoSave/L_autoSaveDefaultOffPowerPoint",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_autosave_l_autosavedefaultoffpowerpoint",
    "categoryId": "9865907f-b775-4d36-9578-a016c5105dfe",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_autosave_l_autosavedefaultoffpowerpoint",
    "description": "This policy setting allows you to turn off AutoSave by default in PowerPoint. AutoSave automatically saves all changes a user makes to files that are stored in OneDrive, OneDrive for Business, or SharePoint Online.\r\n\r\nIf you enable this policy setting, AutoSave is off by default in PowerPoint. But, the user can enable AutoSave for PowerPoint by going to File > Options > Save. Or, the user can enable AutoSave for a specific PowerPoint file by using the AutoSave toggle in the title bar.\r\n \r\nIf you disable or don’t configure this policy setting, AutoSave is on by default, but the user can disable AutoSave by going to File > Options > Save or by using the AutoSave toggle.\r\n \r\nNote: This policy setting only applies to subscription versions of Office, such as Office 365 ProPlus.\r\n      ",
    "helpText": "",
    "name": "L_autoSaveDefaultOffPowerPoint",
    "displayName": "Turn off AutoSave by default in PowerPoint (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_autosave_l_autosavedefaultoffpowerpoint_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_autosave_l_autosavedefaultoffpowerpoint_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_autosave_l_autosavedefaultoffpowerpoint_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_autosave_l_autosavedefaultoffpowerpoint_l_autosavedefaultsettingenum",
                    "required": true
                }
            ]
        }
    ]
}