{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PrefetchWithServiceWorkerEnabled",
        "Allow SpeculationRules prefetch to ServiceWorker-controlled URLs",
        "\\Google\\Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Google Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome/PrefetchWithServiceWorkerEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_prefetchwithserviceworkerenabled",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_prefetchwithserviceworkerenabled",
    "description": "SpeculationRules prefetch can be issued to URLs that are controlled by\r\nServiceWorker. However, legacy code did not allow it and canceled the prefetch\r\nrequests. This policy enables to control the behavior.\r\n\r\nSetting this policy to Enabled or not set allows SpeculationRules prefetch to\r\nServiceWorker-controlled URLs (if the PrefetchServiceWorker feature flag is\r\nenabled). This is the current default behavior and is aligned with the\r\nspecifications.\r\n\r\nSetting this policy to Disabled disallows SpeculationRules prefetch to\r\nServiceWorker-controlled URLs. This is the legacy behavior.\r\n\r\nThis policy is intended to be temporary and will be removed in the future.",
    "helpText": "",
    "name": "PrefetchWithServiceWorkerEnabled",
    "displayName": "Allow SpeculationRules prefetch to ServiceWorker-controlled URLs (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_prefetchwithserviceworkerenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_prefetchwithserviceworkerenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome_prefetchwithserviceworkerenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}