{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DefaultFileFormat",
        "Default file format",
        "\\Microsoft Access 2016\\Miscellaneous",
        "Microsoft Access 2016\\Miscellaneous",
        "Miscellaneous"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/access16v2~Policy~L_MicrosoftOfficeaccess~L_Miscellaneous/L_DefaultFileFormat",
    "rootDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_defaultfileformat",
    "categoryId": "c3ab8d44-b353-4a8a-a526-ffd743fb7ff8",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_defaultfileformat",
    "description": "This policy setting controls whether new database files are created in the new Access format or in a format used by earlier versions of Access.\r\n      \r\nIf you enable this policy setting, you can specify whether new database files are created in Access 2016 format by default or in Access 2002--2003 format. Users can still override the default and select a specific format when they save the files, but cannot set the default by themselves from the Access Options dialog. \r\n      \r\nIf you disable or do not configure this policy setting, when users create new database files, Access saves them in the new Access 2016 format; however, users can change this functionality by selecting a file format from the Default file format drop down list under Access Options | Popular | Creating databases. Note: If you disable this policy setting, users can choose from three default file formats: Access 2000, Access 2002--2003, and Access 2016. You can use this policy setting to specify either the Access 2002--2003 or Access 2016 format as the default, but not the Access 2000 format.",
    "helpText": "",
    "name": "L_DefaultFileFormat",
    "displayName": "Default file format (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_defaultfileformat_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_defaultfileformat_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_defaultfileformat_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_miscellaneous_l_defaultfileformat_l_empty87",
                    "required": true
                }
            ]
        }
    ]
}