{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebAppInstallForceList",
        "Configure list of force-installed Web Apps",
        "\\Google\\Google Chrome",
        "Administrative Templates\\Google\\Google Chrome",
        "Google Chrome",
        "Both",
        "Software\\Policies\\Google\\Chrome"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome/WebAppInstallForceList",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webappinstallforcelist",
    "categoryId": "36c83fb3-c18c-472b-b39e-617c2f8a7fbd",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webappinstallforcelist",
    "description": "Setting the policy specifies a list of web apps that install silently, without user interaction, and which users can't uninstall or turn off.\r\n\r\nEach list item of the policy is an object with a mandatory member:\r\nurl (the URL of the web app to install)\r\n\r\nand 5 optional members:\r\n- default_launch_container\r\n(for how the web app opens—a new tab is the default)\r\n\r\n- create_desktop_shortcut\r\n(True if you want to create Linux and\r\nMicrosoft® Windows® desktop shortcuts).\r\n\r\n- fallback_app_name\r\n(Starting with Google Chrome version 90,\r\nallows you to override the app name if it is not a\r\nProgressive Web App (PWA), or the app name that is temporarily\r\ninstalled if it is a PWA but authentication is required before the\r\ninstallation can be completed. If both\r\ncustom_name and\r\nfallback_app_name are provided,\r\nthe latter will be ignored.)\r\n\r\n- custom_name\r\n(Starting with Google Chrome\r\nversion 96, allows you to permanently override the app name for all web\r\napps and PWAs. Currently only supported on\r\nGoogle Chrome OS.)\r\n\r\n- custom_icon\r\n(Starting with Google Chrome\r\nversion 96, allows you to override the app icon of installed apps. The\r\nicons have to be square, maximal 1 MB in size, and in one of the following\r\nformats: jpeg, png, gif, webp, ico. The hash value has to be the SHA256\r\nhash of the icon file. Currently only supported on\r\nGoogle Chrome OS.)\r\n\r\nSee PinnedLauncherApps for pinning apps to the Google Chrome OS shelf.\r\nSee https://cloud.google.com/docs/chrome-enterprise/policies/?policy=WebAppInstallForceList for more information about schema and formatting.\r\n\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"url\": \"https://www.google.com/maps\",\r\n    \"default_launch_container\": \"window\",\r\n    \"create_desktop_shortcut\": true\r\n  },\r\n  {\r\n    \"url\": \"https://docs.google.com\",\r\n    \"default_launch_container\": \"tab\"\r\n  },\r\n  {\r\n    \"url\": \"https://docs.google.com/editor\",\r\n    \"default_launch_container\": \"window\",\r\n    \"fallback_app_name\": \"Editor\"\r\n  },\r\n  {\r\n    \"url\": \"https://docs.google.com/sheets\",\r\n    \"default_launch_container\": \"window\",\r\n    \"custom_name\": \"Spreadsheets\"\r\n  },\r\n  {\r\n    \"url\": \"https://weather.example.com\",\r\n    \"custom_icon\": {\r\n      \"url\": \"https://mydomain.example.com/sunny_icon.png\",\r\n      \"hash\": \"c28f469c450e9ab2b86ea47038d2b324c6ad3b1e9a4bd8960da13214afd0ca38\"\r\n    }\r\n  }\r\n]",
    "helpText": "",
    "name": "WebAppInstallForceList",
    "displayName": "Configure list of force-installed Web Apps (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webappinstallforcelist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webappinstallforcelist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webappinstallforcelist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_webappinstallforcelist_webappinstallforcelist",
                    "required": true
                }
            ]
        }
    ]
}