{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Prevent Using Local Host IP Address For Web RTC",
        "Browser"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Browser#preventusinglocalhostipaddressforwebrtc"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Browser/PreventUsingLocalHostIPAddressForWebRTC",
    "rootDefinitionId": "user_vendor_msft_policy_config_browser_preventusinglocalhostipaddressforwebrtc",
    "categoryId": "5d835ac8-2e5e-4887-8e4d-0c3846d0ad9f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_browser_preventusinglocalhostipaddressforwebrtc",
    "description": "Prevent using localhost IP address for WebRTC",
    "helpText": "",
    "name": "PreventUsingLocalHostIPAddressForWebRTC",
    "displayName": "Prevent Using Local Host IP Address For Web RTC (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_browser_preventusinglocalhostipaddressforwebrtc_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "2.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_browser_preventusinglocalhostipaddressforwebrtc_0",
            "description": "Allowed. Show localhost IP addresses.",
            "helpText": null,
            "name": "Allowed. Show localhost IP addresses.",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_browser_preventusinglocalhostipaddressforwebrtc_1",
            "description": "Prevented/Not allowed.",
            "helpText": null,
            "name": "Prevented/Not allowed.",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}