{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "LocalNetworkAccessRestrictionsTemporaryOptOut",
        "Specifies whether to opt out of Local Network Access restrictions",
        "\\Microsoft Edge\\Network settings",
        "Both",
        "Software\\Policies\\Microsoft\\Edge",
        "Network settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev143~Policy~microsoft_edge~Network/LocalNetworkAccessRestrictionsTemporaryOptOut",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~network_localnetworkaccessrestrictionstemporaryoptout",
    "categoryId": "3fbd3b29-bafd-4adf-89e4-3be612dee275",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~network_localnetworkaccessrestrictionstemporaryoptout",
    "description": "This policy allows for opting out of restrictions on requests to local network endpoints.\r\n\r\nIf you enable this policy, Local Network Access requests will only display warnings in Edge DevTools when Local Network Access checks fail.\r\n\r\nIf you disable or don't configure this policy, Local Network Access requests will follow the default handling behavior.\r\n\r\nFor more information about Local Network Access restrictions, see Local Network Access .\r\n\r\nThis enterprise policy is temporary and will be removed after Microsoft Edge version 146.\r\n\r\nTo allow specific URL patterns that should automatically be granted Local Network Access permission, use the LocalNetworkAccessAllowedForUrls policy.\r\n\r\nNote: If the LocalNetworkAccessRestrictionsEnabled policy is enabled, it takes precedence over this policy.",
    "helpText": "",
    "name": "LocalNetworkAccessRestrictionsTemporaryOptOut",
    "displayName": "Specifies whether to opt out of Local Network Access restrictions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~network_localnetworkaccessrestrictionstemporaryoptout_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~network_localnetworkaccessrestrictionstemporaryoptout_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev143~policy~microsoft_edge~network_localnetworkaccessrestrictionstemporaryoptout_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}