{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExtensionSettings",
        "Configure extension management settings",
        "\\Microsoft Edge\\Extensions",
        "Microsoft Edge\\Extensions",
        "Extensions"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~Extensions/ExtensionSettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensionsettings",
    "categoryId": "66615d2a-fec9-47f1-8eaf-9813e30cc023",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensionsettings",
    "description": "Configures extension management settings for Microsoft Edge.\r\n\r\nThis policy controls multiple settings, including settings controlled by any existing extension-related policies. This policy overrides any legacy policies if both are set.\r\n\r\nThis policy maps an extension ID or an update URL to its configuration. With an extension ID, the configuration is applied only to the specified extension. Set a default configuration for the special ID \"*\", to apply to all extensions that aren't specifically listed in this policy. With an update URL, the configuration is applied to all extensions with the exact update URL stated in manifest of this extension, as described at https://go.microsoft.com/fwlink/?linkid=2095043.\r\n\r\nExample value:\r\n\r\n{\r\n  \"abcdefghijklmnopabcdefghijklmnop\": {\r\n    \"blocked_permissions\": [\r\n      \"history\"\r\n    ], \r\n    \"installation_mode\": \"allowed\", \r\n    \"minimum_version_required\": \"1.0.1\"\r\n  }, \r\n  \"bcdefghijklmnopabcdefghijklmnopa\": {\r\n    \"runtime_blocked_hosts\": [\r\n      \"*://*.contoso.com\"\r\n    ], \r\n    \"allowed_permissions\": [\r\n      \"downloads\"\r\n    ], \r\n    \"update_url\": \"https://contoso.com/update_url\", \r\n    \"runtime_allowed_hosts\": [\r\n      \"*://good.contoso.com\"\r\n    ], \r\n    \"installation_mode\": \"force_installed\"\r\n  }, \r\n  \"cdefghijklmnopabcdefghijklmnopab\": {\r\n    \"blocked_install_message\": \"Custom error message.\", \r\n    \"installation_mode\": \"blocked\"\r\n  }, \r\n  \"*\": {\r\n    \"blocked_permissions\": [\r\n      \"downloads\", \r\n      \"bookmarks\"\r\n    ], \r\n    \"installation_mode\": \"blocked\", \r\n    \"runtime_blocked_hosts\": [\r\n      \"*://*.contoso.com\"\r\n    ], \r\n    \"blocked_install_message\": \"Custom error message.\", \r\n    \"allowed_types\": [\r\n      \"hosted_app\"\r\n    ], \r\n    \"runtime_allowed_hosts\": [\r\n      \"*://good.contoso.com\"\r\n    ], \r\n    \"install_sources\": [\r\n      \"https://company-intranet/apps\"\r\n    ]\r\n  }, \r\n  \"defghijklmnopabcdefghijklmnopabc,efghijklmnopabcdefghijklmnopabcd\": {\r\n    \"blocked_install_message\": \"Custom error message.\", \r\n    \"installation_mode\": \"blocked\"\r\n  }, \r\n  \"fghijklmnopabcdefghijklmnopabcde\": {\r\n    \"blocked_install_message\": \"Custom removal message.\", \r\n    \"installation_mode\": \"removed\"\r\n  }, \r\n  \"update_url:https://www.contoso.com/update.xml\": {\r\n    \"blocked_permissions\": [\r\n      \"wallpaper\"\r\n    ], \r\n    \"allowed_permissions\": [\r\n      \"downloads\"\r\n    ], \r\n    \"installation_mode\": \"allowed\"\r\n  }\r\n}",
    "helpText": "",
    "name": "ExtensionSettings",
    "displayName": "Configure extension management settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensionsettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensionsettings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensionsettings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensionsettings_extensionsettings",
                    "required": true
                }
            ]
        }
    ]
}