{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OutlookMemoryAlertThreshold",
        "Specify Outlook memory alert threshold for web extensions",
        "\\Microsoft Outlook 2016\\Security\\Trust Center",
        "Microsoft Outlook 2016\\Security\\Trust Center",
        "Trust Center"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v2~Policy~L_MicrosoftOfficeOutlook~L_Security~L_TrustCenter/L_OutlookMemoryAlertThreshold",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookmemoryalertthreshold",
    "categoryId": "c3db5686-3bb2-437c-8906-60da1a1fa844",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookmemoryalertthreshold",
    "description": "This policy setting allows you to specify the memory usage limit Outlook uses before disabling a web extension during initialization. The memory alert threshold controls the maximum amount of virtual memory that can be used by a running web extension.\r\n\r\nIf you enable this policy setting, you can specify the memory alert threshold for web extensions. If the web extension requires more than the specified memory alert threshold when a memory or CPU check occurs, Outlook disables the web extension.\r\n\r\nIf you disable or do not configure this policy setting, Outlook uses the default memory usage limit of 1500 MB. This memory alert threshold overrides the WEF memory alert threshold. The maximum memory alert threshold is 1500 MB, and the minimum memory alert threshold is 1 MB.",
    "helpText": "",
    "name": "L_OutlookMemoryAlertThreshold",
    "displayName": "Specify Outlook memory alert threshold for web extensions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookmemoryalertthreshold_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookmemoryalertthreshold_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookmemoryalertthreshold_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_trustcenter_l_outlookmemoryalertthreshold_l_outlookmemoryalertthresholdspinid",
                    "required": true
                }
            ]
        }
    ]
}