{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "TurnOnActiveXFiltering",
        "Turn on ActiveX Filtering",
        "\\Windows Components\\Internet Explorer",
        "Internet Explorer"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-internetexplorer#internetexplorer-allowactivexfiltering"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/InternetExplorer/AllowActiveXFiltering",
    "rootDefinitionId": "user_vendor_msft_policy_config_internetexplorer_allowactivexfiltering",
    "categoryId": "f60cd3c8-a91b-4542-b09f-129dfc7e589c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_internetexplorer_allowactivexfiltering",
    "description": "This policy setting controls the ActiveX Filtering feature for websites that are running ActiveX controls. The user can choose to turn off ActiveX Filtering for specific websites so that ActiveX controls can run properly.\r\n\r\nIf you enable this policy setting, ActiveX Filtering is enabled by default for the user. The user cannot turn off ActiveX Filtering, although they may add per-site exceptions.\r\n\r\nIf you disable or do not configure this policy setting, ActiveX Filtering is not enabled by default for the user. The user can turn ActiveX Filtering on or off.",
    "helpText": "",
    "name": "TurnOnActiveXFiltering",
    "displayName": "Turn on ActiveX Filtering (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_internetexplorer_allowactivexfiltering_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.15063",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_allowactivexfiltering_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_internetexplorer_allowactivexfiltering_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}