{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_EnableCheckoutToDrafts",
        "Save checked-out files to a local folder",
        "\\Microsoft Office 2016\\Microsoft Office Document Cache",
        "Microsoft Office 2016\\Microsoft Office Document Cache",
        "Microsoft Office Document Cache"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_MicrosoftOfficeDocumentCache/L_EnableCheckoutToDrafts",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_microsoftofficedocumentcache_l_enablecheckouttodrafts",
    "categoryId": "2d6891a4-ee83-4e55-8e23-09513e1306e4",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_microsoftofficedocumentcache_l_enablecheckouttodrafts",
    "description": "This policy setting allows users to save files checked out from SharePoint, or other document management server products, to a local folder when editing the files.  \r\n\r\nBy default, checked-out files are stored in the Office Document Cache. The Office Document Cache allows the same offline editing capabilities as a local folder, but automatically syncs the files when there is Internet connectivity.\r\n\r\nNote: It’s not recommended to enable this policy setting unless needed to support existing document management processes.\r\n\r\nIf you enable this policy setting, users can specify a local folder to save checked-out files to by going to File > Options > Save > Offline editing options.\r\n\r\nIf you disable or don’t configure this policy setting, checked-out files are stored in the Office Document Cache.\r\n      ",
    "helpText": "",
    "name": "L_EnableCheckoutToDrafts",
    "displayName": "Save checked-out files to a local folder (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_microsoftofficedocumentcache_l_enablecheckouttodrafts_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_microsoftofficedocumentcache_l_enablecheckouttodrafts_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_microsoftofficedocumentcache_l_enablecheckouttodrafts_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}