{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "NC_RasChangeProperties",
        "Prohibit access to properties of components of a remote access connection",
        "\\Network\\Network Connections",
        "Administrative Templates\\Network\\Network Connections",
        "Network Connections",
        "User",
        "Software\\Policies\\Microsoft\\Windows\\Network Connections"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-networkconnections#admx-networkconnections-nc-raschangeproperties"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_NetworkConnections/NC_RasChangeProperties",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_raschangeproperties",
    "categoryId": "76c8131a-62fe-4134-aeac-d999f01911ed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_networkconnections_nc_raschangeproperties",
    "description": "Determines whether users can view and change the properties of components used by a private or all-user remote access connection.\r\n\r\nThis setting determines whether the Properties button for components used by a private or all-user remote access connection is enabled.\r\n\r\nIf you enable this setting (and enable the \"Enable Network Connections settings for Administrators\" setting), the Properties button is disabled for all users (including administrators).\r\n\r\nImportant: If the \"Enable Network Connections settings for Administrators\" is disabled or not configured, this setting does not apply to administrators on post-Windows 2000 computers.\r\n\r\nIf you disable this setting or do not configure it, the Properties button is enabled for all users.\r\n\r\nThe Networking tab of the Remote Access Connection Properties dialog box includes a list of the network components that the connection uses. To view or change the properties of a component, click the name of the component, and then click the Properties button beneath the component list.\r\n\r\nNote: Not all network components have configurable properties. For components that are not configurable, the Properties button is always disabled.\r\n\r\nNote: When the \"Ability to change properties of an all user remote access connection\" or \"Prohibit changing properties of a private remote access connection\" settings are set to deny access to the Remote Access Connection Properties dialog box, the Properties button for remote access connection components is blocked.\r\n\r\nNote: This setting does not prevent users from using other programs, such as Internet Explorer, to bypass this setting.\r\n ",
    "helpText": "",
    "name": "NC_RasChangeProperties",
    "displayName": "Prohibit access to properties of components of a remote access connection (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_networkconnections_nc_raschangeproperties_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_raschangeproperties_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_networkconnections_nc_raschangeproperties_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}