{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableEditDefaultUserPermissions",
        "Limit which permissions can be assigned to Default, Anonymous, or My Organization on mail folders and calendars",
        "\\Microsoft Outlook 2016\\Disable Items in User Interface\\Predefined",
        "Microsoft Outlook 2016\\Disable Items in User Interface\\Predefined",
        "Predefined"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v7~Policy~L_MicrosoftOfficeOutlook~L_Disableitemsinuserinterface~L_Predefined/L_DisableEditDefaultUserPermissions",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_disableitemsinuserinterface~l_predefined_l_disableeditdefaultuserpermissions",
    "categoryId": "d59dfcc1-6c35-41de-bfb6-de94b8120ca5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_disableitemsinuserinterface~l_predefined_l_disableeditdefaultuserpermissions",
    "description": "This policy setting allows you to limit which permissions can be assigned to Default, Anonymous, or My Organization on mail folders and calendars.\r\n\r\nIf you enable this policy setting, users can assign only the following permissions to Default, Anonymous, or My Organization.\r\n\r\n- None on mail folders\r\n- None or basic Free/Busy information on calendars\r\n\r\nUsers won't be able to assign any other permissions to Default, Anonymous, or My Organization. All permissions will still be available to assign to other users on mail folders and calendars.\r\n\r\nIf you disable or don't configure this policy setting, users can assign any permissions to Default, Anonymous, or My Organization on mail folders and calendars.",
    "helpText": "",
    "name": "L_DisableEditDefaultUserPermissions",
    "displayName": "Limit which permissions can be assigned to Default, Anonymous, or My Organization on mail folders and calendars (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_disableitemsinuserinterface~l_predefined_l_disableeditdefaultuserpermissions_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_disableitemsinuserinterface~l_predefined_l_disableeditdefaultuserpermissions_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_disableitemsinuserinterface~l_predefined_l_disableeditdefaultuserpermissions_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}