{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "MicrosoftOffice2013Common",
        "Microsoft Office 2013 Common Settings",
        "\\Windows Components\\Microsoft User Experience Virtualization\\Applications",
        "Administrative Templates\\Windows Components\\Microsoft User Experience Virtualization\\Applications",
        "Applications",
        "Both",
        "Software\\Policies\\Microsoft\\UEV\\Agent\\Configuration\\Applications"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-userexperiencevirtualization#admx-userexperiencevirtualization-microsoftoffice2013common"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_UserExperienceVirtualization/MicrosoftOffice2013Common",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_microsoftoffice2013common",
    "categoryId": "3afbcb74-88c5-4a41-bdc2-82c117b4e82e",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_microsoftoffice2013common",
    "description": "\r\nThis policy setting configures the synchronization of user settings which are common between the Microsoft Office Suite 2013 applications.\r\nBy default, the user settings which are common between the Microsoft Office Suite 2013 applications synchronize between computers. Use the policy setting to prevent the user settings which are common between the Microsoft Office Suite 2013 applications from synchronization between computers.\r\nIf you enable this policy setting, the user settings which are common between the Microsoft Office Suite 2013 applications continue to synchronize.\r\nIf you disable this policy setting, the user settings which are common between the Microsoft Office Suite 2013 applications are excluded from the synchronization settings. If any of the Microsoft Office Suite 2013 applications are enabled, this policy setting should not be disabled.\r\nIf you do not configure this policy setting, any defined values will be deleted.\r\n      \r\n ",
    "helpText": "",
    "name": "MicrosoftOffice2013Common",
    "displayName": "Microsoft Office 2013 Common Settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_microsoftoffice2013common_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_microsoftoffice2013common_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_userexperiencevirtualization_microsoftoffice2013common_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}