{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "InternetManagement_RestrictCommunication_1",
        "Restrict Internet communication",
        "\\System\\Internet Communication Management",
        "Administrative Templates\\System\\Internet Communication Management",
        "Internet Communication Management",
        "User",
        "Software\\Policies\\Microsoft\\InternetManagement",
        "RestrictCommunication"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-icm#admx-icm-internetmanagement-restrictcommunication-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_ICM/InternetManagement_RestrictCommunication_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_icm_internetmanagement_restrictcommunication_1",
    "categoryId": "184aa343-0f0b-4bf5-aeeb-42111fedfbbf",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_icm_internetmanagement_restrictcommunication_1",
    "description": "This policy setting specifies whether Windows can access the Internet to accomplish tasks that require Internet resources.\r\n\r\nIf you enable this setting, all of the the policy settings listed in the \"Internet Communication settings\" section are set such that their respective features cannot access the Internet.\r\n\r\nIf you disable this policy setting, all of the the policy settings listed in the \"Internet Communication settings\" section are set such that their respective features can access the Internet.\r\n\r\nIf you do not configure this policy setting, all of the the policy settings in the \"Internet Communication settings\" section are set to not configured.\r\n ",
    "helpText": "",
    "name": "InternetManagement_RestrictCommunication_1",
    "displayName": "Restrict Internet communication (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_icm_internetmanagement_restrictcommunication_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_icm_internetmanagement_restrictcommunication_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_icm_internetmanagement_restrictcommunication_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}