{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "PasswordManagerBlocklist",
        "Configure the list of domains for which the Password Manager (Save and Fill) will be disabled",
        "\\Google\\Google Chrome\\Password manager",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Password manager"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~PasswordManager/PasswordManagerBlocklist",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passwordmanagerblocklist",
    "categoryId": "a5a38799-7bf1-4b83-86fe-62729cd9ed9d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passwordmanagerblocklist",
    "description": "Configure the list of domains where Google Chrome should disable the Password Manager. This means that Save and Fill workflows will be disabled, ensuring that passwords for those websites can't be saved or auto filled into web forms.\r\n\r\nIf a domain is present in the list, the Password Manager will be disabled for it.\r\n\r\nIf a domain is not present in the list, the Password Manager will be available for it.\r\n\r\nIf the policy is unset, the Password Manager will be available for all domains.\r\n\r\nExample value:\r\n\r\nexample.com\r\nlogin.example.com",
    "helpText": "",
    "name": "PasswordManagerBlocklist",
    "displayName": "Configure the list of domains for which the Password Manager (Save and Fill) will be disabled (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passwordmanagerblocklist_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passwordmanagerblocklist_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passwordmanagerblocklist_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~passwordmanager_passwordmanagerblocklist_passwordmanagerblocklistdesc",
                    "required": true
                }
            ]
        }
    ]
}