{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_EnableModernCommentsCreateNew",
        "Use modern comments in PowerPoint",
        "\\Microsoft PowerPoint 2016\\PowerPoint Options\\General",
        "Microsoft PowerPoint 2016\\PowerPoint Options\\General",
        "General",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\powerpoint",
        "enablemoderncommentscreatenew"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ppt16v4~Policy~L_MicrosoftOfficePowerPoint~L_PowerPointOptions~L_OptionsGeneral/L_EnableModernCommentsCreateNew",
    "rootDefinitionId": "user_vendor_msft_policy_config_ppt16v4~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_optionsgeneral_l_enablemoderncommentscreatenew",
    "categoryId": "f5007db5-6ee6-4bbd-a391-9727902aad6d",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_ppt16v4~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_optionsgeneral_l_enablemoderncommentscreatenew",
    "description": "\r\nThis policy setting controls whether modern comments are used in PowerPoint. For more information about modern comments and when to enable this setting, see https://go.microsoft.com/fwlink/p/?linkid=2116065.\r\n\r\nIf you enable this policy setting, when a user adds comments to a new file or a file without comments, the new comments that are added will be modern comments. If users have a version of PowerPoint that doesn’t support modern comments, a notification appears directing them to use PowerPoint for the web to view modern comments in files that have them.\r\n\r\nIf you disable this policy setting, users will continue to see the previous commenting experience for new files and existing files that do not have any modern comments. Users will still be able to read files that already have modern comments in them if they have a version of PowerPoint that supports modern comments.\r\n\r\nFor information about what happens when you don't configure this policy setting, see https://go.microsoft.com/fwlink/p/?linkid=2116065.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for enterprise.\r\n    ",
    "helpText": "",
    "name": "L_EnableModernCommentsCreateNew",
    "displayName": "Use modern comments in PowerPoint (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_ppt16v4~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_optionsgeneral_l_enablemoderncommentscreatenew_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v4~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_optionsgeneral_l_enablemoderncommentscreatenew_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_ppt16v4~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_optionsgeneral_l_enablemoderncommentscreatenew_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}