{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DocumentChat",
        "Allow co-authors to chat within a document",
        "\\Microsoft Office 2016\\Collaboration Settings",
        "Microsoft Office 2016\\Collaboration Settings",
        "Collaboration Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v3~Policy~L_MicrosoftOfficeSystem~L_CollaborationSettings/L_DocumentChat",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_collaborationsettings_l_documentchat",
    "categoryId": "cc29afc6-309c-4a0d-86f6-60081ae7cd4c",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_collaborationsettings_l_documentchat",
    "description": "This policy setting controls whether co-authors can use the chat functionality within an Office application to collaborate with each other when editing a document.\r\n\r\nIf you enable or don’t configure this policy setting, users can chat with each other when co-authoring a document.\r\n\r\nIf you disable this policy setting, users can’t chat with each other when co-authoring a document.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Office 365 ProPlus.",
    "helpText": "",
    "name": "L_DocumentChat",
    "displayName": "Allow co-authors to chat within a document (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_collaborationsettings_l_documentchat_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_collaborationsettings_l_documentchat_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_collaborationsettings_l_documentchat_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}