{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_OfficeEnableAutoAltText",
        "Automatically generate alternative text (alt text) for pictures",
        "\\Microsoft Office 2016\\Services",
        "Microsoft Office 2016\\Services",
        "Services"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v11~Policy~L_MicrosoftOfficeSystem~L_Services/L_OfficeEnableAutoAltText",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v11~policy~l_microsoftofficesystem~l_services_l_officeenableautoalttext",
    "categoryId": "478ed057-8ee7-4dd2-8276-06dad8f85397",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v11~policy~l_microsoftofficesystem~l_services_l_officeenableautoalttext",
    "description": "This policy setting controls whether alternative text (alt text) is generated automatically for pictures in Word, PowerPoint, and Outlook.\r\n\r\nThis policy setting is related to the \"Automatically generate alt text for me\" check box under File > Options > Ease of Access > Automatic Alt Text.\r\n\r\nIf you enable this policy setting, alt text will be generated automatically for pictures. The \"Automatically generate alt text for me\" check box will be selected and users won't be able to clear the check box.\r\n\r\nIf you disable this policy setting, alt text won't be generated automatically for pictures. The \"Automatically generate alt text for me\" check box won't be selected and users won't be able to select the check box.\r\n\r\nIf you don't configure this policy setting, alt text will be generated automatically for pictures. But, users will be able to clear the \"Automatically generate alt text for me\" check box.\r\n      ",
    "helpText": "",
    "name": "L_OfficeEnableAutoAltText",
    "displayName": "Automatically generate alternative text (alt text) for pictures (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v11~policy~l_microsoftofficesystem~l_services_l_officeenableautoalttext_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v11~policy~l_microsoftofficesystem~l_services_l_officeenableautoalttext_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v11~policy~l_microsoftofficesystem~l_services_l_officeenableautoalttext_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}