{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "WebAudioOutputBufferingEnabled",
        "Enable adaptive buffering for Web Audio",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev134~Policy~microsoft_edge/WebAudioOutputBufferingEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_webaudiooutputbufferingenabled",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_webaudiooutputbufferingenabled",
    "description": "This policy determines whether the browser enables adaptive buffering\r\nfor Web Audio. Adaptive buffering can reduce audio glitches but may\r\nincrease latency to varying degrees.\r\n\r\nEnabled: The browser will always use adaptive buffering.\r\nDisabled or Not Set: The browser will automatically decide during the\r\n  feature launch process whether to use adaptive buffering.",
    "helpText": "",
    "name": "WebAudioOutputBufferingEnabled",
    "displayName": "Enable adaptive buffering for Web Audio (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_webaudiooutputbufferingenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_webaudiooutputbufferingenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_webaudiooutputbufferingenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}