{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "ExtensionSettings",
        "Extension management settings",
        "\\Google\\Google Chrome\\Extensions",
        "Administrative Templates\\Google\\Google Chrome\\Extensions",
        "Extensions"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV1~Policy~googlechrome~Extensions/ExtensionSettings",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensionsettings",
    "categoryId": "216de445-a80d-4981-b151-3b4466edc808",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensionsettings",
    "description": "Setting the policy controls extension management settings for Google Chrome, including any controlled by existing extension-related policies. The policy supersedes any legacy policies that might be set.\r\n\r\nThis policy maps an extension ID or an update URL to its specific setting only. A default configuration can be set for the special ID \"*\", which applies to all extensions without a custom configuration in this policy. With an update URL, configuration applies to extensions with the exact update URL stated in the extension manifest ( http://support.google.com/chrome/a?p=Configure_ExtensionSettings_policy ). If the 'override_update_url' flag is set to true, the extension is installed and updated using the \"update\" URL specified in the ExtensionInstallForcelist policy or in 'update_url' field in this policy. The flag 'override_update_url' is ignored if the 'update_url' is a Chrome Web Store url.\r\n\r\nNote: For Windows® instances not joined to a Microsoft® Active Directory® domain, forced installation is limited to apps and extensions listed in the Chrome Web Store.\r\nSee https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ExtensionSettings for more information about schema and formatting.\r\n\r\n\r\nExample value:\r\n\r\n{\r\n  \"abcdefghijklmnopabcdefghijklmnop\": {\r\n    \"installation_mode\": \"allowed\",\r\n    \"blocked_permissions\": [\r\n      \"history\"\r\n    ],\r\n    \"minimum_version_required\": \"1.0.1\",\r\n    \"toolbar_pin\": \"force_pinned\"\r\n  },\r\n  \"bcdefghijklmnopabcdefghijklmnopa\": {\r\n    \"installation_mode\": \"force_installed\",\r\n    \"update_url\": \"https://example.com/update_url\",\r\n    \"allowed_permissions\": [\r\n      \"downloads\"\r\n    ],\r\n    \"runtime_blocked_hosts\": [\r\n      \"*://*.example.com\"\r\n    ],\r\n    \"runtime_allowed_hosts\": [\r\n      \"*://good.example.com\"\r\n    ]\r\n  },\r\n  \"cdefghijklmnopabcdefghijklmnopab\": {\r\n    \"installation_mode\": \"blocked\",\r\n    \"blocked_install_message\": \"Custom error message.\"\r\n  },\r\n  \"defghijklmnopabcdefghijklmnopabc,efghijklmnopabcdefghijklmnopabcd\": {\r\n    \"installation_mode\": \"blocked\",\r\n    \"blocked_install_message\": \"Custom error message.\"\r\n  },\r\n  \"update_url:https://www.example.com/update.xml\": {\r\n    \"blocked_permissions\": [\r\n      \"wallpaper\"\r\n    ],\r\n    \"allowed_permissions\": [\r\n      \"downloads\"\r\n    ],\r\n    \"installation_mode\": \"allowed\"\r\n  },\r\n  \"fghijklmnopabcdefghijklmnopabcde\": {\r\n    \"installation_mode\": \"removed\",\r\n    \"blocked_install_message\": \"Custom removal message.\"\r\n  },\r\n  \"ghijklmnopabcdefghijklmnopabcdef\": {\r\n    \"installation_mode\": \"force_installed\",\r\n    \"update_url\": \"https://example.com/update_url\",\r\n    \"override_update_url\": true\r\n  },\r\n  \"*\": {\r\n    \"installation_mode\": \"blocked\",\r\n    \"blocked_permissions\": [\r\n      \"downloads\",\r\n      \"bookmarks\"\r\n    ],\r\n    \"install_sources\": [\r\n      \"https://company-intranet/chromeapps\"\r\n    ],\r\n    \"allowed_types\": [\r\n      \"hosted_app\"\r\n    ],\r\n    \"runtime_blocked_hosts\": [\r\n      \"*://*.example.com\"\r\n    ],\r\n    \"runtime_allowed_hosts\": [\r\n      \"*://good.example.com\"\r\n    ],\r\n    \"blocked_install_message\": \"Custom error message.\"\r\n  }\r\n}",
    "helpText": "",
    "name": "ExtensionSettings",
    "displayName": "Extension management settings (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensionsettings_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensionsettings_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensionsettings_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensionsettings_extensionsettings",
                    "required": true
                }
            ]
        }
    ]
}