{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Teams_PreventFirstLaunchAfterInstall_Policy",
        "Prevent Microsoft Teams from starting automatically after installation",
        "\\Microsoft Teams",
        "Administrative Templates\\Microsoft Teams",
        "Microsoft Teams"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Teamsv2~Policy~L_Teams/Teams_PreventFirstLaunchAfterInstall_Policy",
    "rootDefinitionId": "user_vendor_msft_policy_config_teamsv2~policy~l_teams_teams_preventfirstlaunchafterinstall_policy",
    "categoryId": "501b5a30-253c-48b7-ab40-de1d100e4358",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_teamsv2~policy~l_teams_teams_preventfirstlaunchafterinstall_policy",
    "description": "This policy setting controls whether Microsoft Teams starts automatically when the user logs into a device after Teams is installed.\r\n\r\nIf you enable this policy setting, Teams does not start automatically when the user logs in to the device and the user has not started Teams previously.\r\n\r\nNote: If you enable this policy setting, you must do so before Teams is installed.\r\n\r\nOnce a user starts Teams for the first time, Teams is configured to start automatically the next time the user logs into the device.\r\n\r\nIf you disable or don’t configure this policy setting, Teams automatically starts when a user logs in to the device after Teams is installed.\r\n\r\nNote: The user can configure Teams not to start automatically by configuring user settings within Teams.",
    "helpText": "",
    "name": "Teams_PreventFirstLaunchAfterInstall_Policy",
    "displayName": "Prevent Microsoft Teams from starting automatically after installation (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_teamsv2~policy~l_teams_teams_preventfirstlaunchafterinstall_policy_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_teamsv2~policy~l_teams_teams_preventfirstlaunchafterinstall_policy_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_teamsv2~policy~l_teams_teams_preventfirstlaunchafterinstall_policy_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}