{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableVisioRnRPane",
        "Turn off Research and Translation features in Visio",
        "\\Microsoft Visio 2016\\Visio Options\\Proofing",
        "Microsoft Visio 2016\\Visio Options\\Proofing",
        "Proofing"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/visio16v3~Policy~L_MicrosoftVisio~L_VisioOptions~L_Proofing/L_DisableVisioRnRPane",
    "rootDefinitionId": "user_vendor_msft_policy_config_visio16v3~policy~l_microsoftvisio~l_visiooptions~l_proofing_l_disablevisiornrpane",
    "categoryId": "8495c82c-f273-4bcc-8886-6751103a9c7b",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_visio16v3~policy~l_microsoftvisio~l_visiooptions~l_proofing_l_disablevisiornrpane",
    "description": "\r\n        This policy setting controls whether the Research and Translation features appear in Visio.\r\n\r\n        If you enable this policy setting, users won’t see the Research and Translation features in Visio.\r\n\r\n        If you disable or don't configure this policy setting, users will see the Research and Translation features in Visio.\r\n\r\n        Note: This policy setting only applies to subscription versions of Visio and Visio LTSC 2021.\r\n      ",
    "helpText": "",
    "name": "L_DisableVisioRnRPane",
    "displayName": "Turn off Research and Translation features in Visio (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_visio16v3~policy~l_microsoftvisio~l_visiooptions~l_proofing_l_disablevisiornrpane_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_visio16v3~policy~l_microsoftvisio~l_visiooptions~l_proofing_l_disablevisiornrpane_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_visio16v3~policy~l_microsoftvisio~l_visiooptions~l_proofing_l_disablevisiornrpane_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}