{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableOfficeStartProject",
        "Disable the Office Start screen for Project",
        "\\Microsoft Project 2016\\Miscellaneous",
        "Microsoft Project 2016\\Miscellaneous",
        "Miscellaneous",
        "User",
        "software\\policies\\microsoft\\office\\16.0\\ms project\\options\\general",
        "disableboottoofficestart"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/proj16v2~Policy~L_Proj~L_Miscellaneous/L_DisableOfficeStartProject",
    "rootDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_miscellaneous_l_disableofficestartproject",
    "categoryId": "e344b25a-2046-4e70-a3b9-1a418613861f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_miscellaneous_l_disableofficestartproject",
    "description": "This policy setting controls whether the Office Start screen appears on boot for Project.\r\n\r\nIf you enable this policy setting, users will not see the Office Start screen when they boot Project.\r\n\r\nIf you disable or do not configure this policy setting, users will see the Office Start screen when they boot Project.\r\n\r\nNote: This policy setting is overridden by the policy setting \"Microsoft Office 2016 > Miscellaneous > Disable the Office Start screen for all Office applications\" if that policy setting is set.",
    "helpText": "",
    "name": "L_DisableOfficeStartProject",
    "displayName": "Disable the Office Start screen for Project (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_miscellaneous_l_disableofficestartproject_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_miscellaneous_l_disableofficestartproject_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_miscellaneous_l_disableofficestartproject_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}