{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "Pol_UserEnableWorkFolders",
        "Specify Work Folders settings",
        "\\Windows Components\\Work Folders",
        "Administrative Templates\\Windows Components\\Work Folders",
        "Work Folders"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_WorkFoldersClient/Pol_UserEnableWorkFolders",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders",
    "categoryId": "a53581a1-e9d7-4ba4-9dea-cea90d40cca1",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_autoprovision_chk",
    "description": null,
    "helpText": "",
    "name": "Lbl_AutoProvision_Chk",
    "displayName": "Force automatic setup (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_autoprovision_chk_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_autoprovision_chk_0",
            "description": null,
            "helpText": null,
            "name": "False",
            "displayName": "False",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_lbl_autoprovision_chk_1",
            "description": null,
            "helpText": null,
            "name": "True",
            "displayName": "True",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders_1",
                    "parentSettingId": "user_vendor_msft_policy_config_admx_workfoldersclient_pol_userenableworkfolders"
                }
            ],
            "dependedOnBy": []
        }
    ]
}