{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "CustomLocalesNoSelect_1",
        "Disallow selection of Custom Locales",
        "\\System\\Locale Services",
        "Administrative Templates\\System\\Locale Services",
        "Locale Services"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-globalization#admx-globalization-customlocalesnoselect-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Globalization/CustomLocalesNoSelect_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_globalization_customlocalesnoselect_1",
    "categoryId": "2cbf2609-1f6a-4597-84e2-a57da0ad0472",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_admx_globalization_customlocalesnoselect_1",
    "description": "This policy setting prevents a user from selecting a supplemental custom locale as their user locale. The user is restricted to the set of locales that are installed with the operating system.\r\n\r\nThis does not affect the selection of replacement locales. To prevent the selection of replacement locales, adjust the permissions of the %windir%\\Globalization directory to prevent the installation of locales by unauthorized users.\r\n\r\nThe policy setting \"Restrict user locales\" can also be enabled to disallow selection of a custom locale, even if this policy setting is not configured.\r\n\r\nIf you enable this policy setting, the user cannot select a custom locale as their user locale, but they can still select a replacement locale if one is installed.\r\n\r\nIf you disable or do not configure this policy setting, the user can select a custom locale as their user locale.\r\n\r\nIf this policy setting is enabled at the machine level, it cannot be disabled by a per-user policy setting. If this policy setting is disabled at the machine level, the per-user policy setting will be ignored. If this policy setting is not configured at the machine level, restrictions will be based on per-user policy settings.\r\n\r\nTo set this policy setting on a per-user basis, make sure that you do not configure the per-machine policy setting.\r\n\r\n      \r\n ",
    "helpText": "",
    "name": "CustomLocalesNoSelect_1",
    "displayName": "Disallow selection of Custom Locales (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_globalization_customlocalesnoselect_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_customlocalesnoselect_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_globalization_customlocalesnoselect_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}