{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "DenyRsopToInteractiveUser_1",
        "Determine if interactive users can generate Resultant Set of Policy data",
        "\\System\\Group Policy",
        "Administrative Templates\\System\\Group Policy",
        "Group Policy",
        "User",
        "Software\\Policies\\Microsoft\\Windows\\System",
        "DenyRsopToInteractiveUser"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-grouppolicy#admx-grouppolicy-denyrsoptointeractiveuser-1"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_GroupPolicy/DenyRsopToInteractiveUser_1",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_grouppolicy_denyrsoptointeractiveuser_1",
    "categoryId": "deadde1d-7e7f-4577-bd6e-fc237c3854c5",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_grouppolicy_denyrsoptointeractiveuser_1",
    "description": "This policy setting controls the ability of users to view their Resultant Set of Policy (RSoP) data.\r\n\r\nBy default, interactively logged on users can view their own Resultant Set of Policy (RSoP) data.\r\n\r\nIf you enable this policy setting, interactive users cannot generate RSoP data.\r\n\r\nIf you disable or do not configure this policy setting, interactive users can generate RSoP.\r\n\r\nNote: This policy setting does not affect administrators. If you enable or disable this policy setting, by default administrators can view RSoP data.\r\n\r\nNote: To view RSoP data on a client computer, use the RSoP snap-in for the Microsoft Management Console. You can launch the RSoP snap-in from the command line by typing RSOP.msc\r\n\r\nNote: This policy setting exists as both a User Configuration and Computer Configuration setting.\r\n\r\nAlso, see the \"Turn off Resultant set of Policy logging\" policy setting in Computer Configuration\\Administrative Templates\\System\\GroupPolicy.\r\n ",
    "helpText": "",
    "name": "DenyRsopToInteractiveUser_1",
    "displayName": "Determine if interactive users can generate Resultant Set of Policy data (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_grouppolicy_denyrsoptointeractiveuser_1_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_denyrsoptointeractiveuser_1_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_grouppolicy_denyrsoptointeractiveuser_1_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}