{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "RSAKeyUsageForLocalAnchorsEnabled",
        "Check RSA key usage for server certificates issued by local trust anchors",
        "\\Microsoft Edge WebView2",
        "Microsoft Edge WebView2",
        "Microsoft Edge Web View2",
        "Both",
        "Software\\Policies\\Microsoft\\Edge\\WebView2"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edge_webview2v2~Policy~microsoft_edge_webview2/RSAKeyUsageForLocalAnchorsEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edge_webview2v2~policy~microsoft_edge_webview2_rsakeyusageforlocalanchorsenabled",
    "categoryId": "c945edd8-c865-4932-806d-83752e3f46ad",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edge_webview2v2~policy~microsoft_edge_webview2_rsakeyusageforlocalanchorsenabled",
    "description": "The X.509 key usage extension declares how the key in a certificate can be\r\nused. These instructions ensure certificates aren't used in an unintended\r\ncontext, which protects against a class of cross-protocol attacks on HTTPS and\r\nother protocols. HTTPS clients must verify that server certificates match the\r\nconnection's TLS parameters.\r\n\r\nIf this policy is enabled,\r\nMicrosoft Edge will perform this key\r\ncheck. This helps prevent attacks where an attacker manipulates the browser into\r\ninterpreting a key in ways that the certificate owner did not intend.\r\n\r\nIf this policy is set to disabled or not configured,\r\nMicrosoft Edge will skip this key check in\r\nHTTPS connections that negotiate TLS 1.2 and use an RSA certificate that\r\nchains to a local trust anchor. Examples of local trust anchors include\r\npolicy-provided or user-installed root certificates. In all other cases, the\r\ncheck is performed independent of this policy's setting.\r\n\r\nThis policy is available for administrators to preview the behavior of a\r\nfuture release, which will enable this check by default. At that point, this\r\npolicy will remain temporarily available for administrators that need more\r\ntime to update their certificates to meet the new RSA key usage requirements.\r\n\r\nConnections that fail this check will fail with the error\r\nERR_SSL_KEY_USAGE_INCOMPATIBLE. Sites that fail with this error likely have a\r\nmisconfigured certificate. Modern ECDHE_RSA cipher suites use the\r\n\"digitalSignature\" key usage option, while legacy RSA decryption cipher suites\r\nuse the \"keyEncipherment\" key usage option. If uncertain, administrators should\r\ninclude both in RSA certificates meant for HTTPS.",
    "helpText": "",
    "name": "RSAKeyUsageForLocalAnchorsEnabled",
    "displayName": "Check RSA key usage for server certificates issued by local trust anchors (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edge_webview2v2~policy~microsoft_edge_webview2_rsakeyusageforlocalanchorsenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge_webview2v2~policy~microsoft_edge_webview2_rsakeyusageforlocalanchorsenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edge_webview2v2~policy~microsoft_edge_webview2_rsakeyusageforlocalanchorsenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}