{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_AlwaysUseMSOAuthForAutodiscover",
        "Autodiscover is always capable of using modern authentication",
        "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
        "Microsoft Outlook 2016\\Account Settings\\Exchange",
        "Exchange",
        "User",
        "software\\policies\\microsoft\\exchange",
        "alwaysusemsoauthforautodiscover"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/outlk16v7~Policy~L_MicrosoftOfficeOutlook~L_ToolsAccounts~L_Exchangesettings/L_AlwaysUseMSOAuthForAutodiscover",
    "rootDefinitionId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_alwaysusemsoauthforautodiscover",
    "categoryId": "c4dbc05f-da1e-440d-8beb-91bf9dad1875",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_alwaysusemsoauthforautodiscover",
    "description": "This policy setting controls whether Autodiscover is always capable of using modern authentication, regardless of the authentication methods supported by the primary mailbox connection type.\r\n\r\nBy default, Autodiscover only uses authentication methods that are supported by the primary mailbox connection type. Modern authentication won't always be one of the supported authentication methods for some connection types.\r\n\r\nIf you enable this policy setting, Autodiscover is always capable of using modern authentication, regardless of the authentication methods supported by the primary mailbox connection type. Enabling this policy setting may result in additional prompts for users to provide their password, when modern authentication is used, but not supported for the connection type.\r\n\r\nIf you disable or don’t configure this policy setting, Autodiscover will only use authentication methods supported by the primary mailbox connection type.",
    "helpText": "",
    "name": "L_AlwaysUseMSOAuthForAutodiscover",
    "displayName": "Autodiscover is always capable of using modern authentication (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_alwaysusemsoauthforautodiscover_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_alwaysusemsoauthforautodiscover_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_outlk16v7~policy~l_microsoftofficeoutlook~l_toolsaccounts~l_exchangesettings_l_alwaysusemsoauthforautodiscover_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}