{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "AM_EstimateFileHandlerRisk",
        "Trust logic for file attachments",
        "\\Windows Components\\Attachment Manager",
        "Administrative Templates\\Windows Components\\Attachment Manager",
        "Attachment Manager"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-attachmentmanager#admx-attachmentmanager-am-estimatefilehandlerrisk"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_AttachmentManager/AM_EstimateFileHandlerRisk",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_estimatefilehandlerrisk",
    "categoryId": "3f8299b3-6803-4576-be08-7c311d04b8b9",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_attachmentmanager_am_estimatefilehandlerrisk",
    "description": "This policy setting allows you to configure the logic that Windows uses to determine the risk for file attachments.\r\n\r\nPreferring the file handler instructs Windows to use the file handler data over the file type data. For example, trust notepad.exe, but don't trust .txt files.\r\n\r\nPreferring the file type instructs Windows to use the file type data over the file handler data. For example, trust .txt files, regardless of the file handler.\r\n\r\nUsing both the file handler and type data is the most restrictive option. Windows chooses the more restrictive recommendation which will cause users to see more trust prompts than choosing the other options.\r\n\r\nIf you enable this policy setting, you can choose the order in which Windows processes risk assessment data.\r\n\r\nIf you disable this policy setting, Windows uses its default trust logic, which prefers the file handler over the file type.\r\n\r\nIf you do not configure this policy setting, Windows uses its default trust logic, which prefers the file handler over the file type.\r\n ",
    "helpText": "",
    "name": "AM_EstimateFileHandlerRisk",
    "displayName": "Trust logic for file attachments (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_estimatefilehandlerrisk_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_estimatefilehandlerrisk_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_attachmentmanager_am_estimatefilehandlerrisk_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_attachmentmanager_am_estimatefilehandlerrisk_am_trustlogicsetting",
                    "required": true
                }
            ]
        }
    ]
}