{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "OnlyOnPremisesImplicitSigninEnabled",
        "Only on-premises account enabled for implicit sign-in",
        "\\Microsoft Edge\\Identity and sign-in",
        "Microsoft Edge\\Identity and sign-in",
        "Identity and sign-in"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev94~Policy~microsoft_edge~Identity/OnlyOnPremisesImplicitSigninEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev94~policy~microsoft_edge~identity_onlyonpremisesimplicitsigninenabled",
    "categoryId": "45a89c1f-0a34-4f78-b28f-d30b623fa423",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev94~policy~microsoft_edge~identity_onlyonpremisesimplicitsigninenabled",
    "description": "Configure this policy to decide whether only on-premises accounts are enabled for implicit sign-in.\r\n\r\nIf you enable this policy, only on-premises accounts will be enabled for implicit sign-in. Microsoft Edge won't attempt to implicitly sign in to MSA or AAD accounts. Upgrade from on-premises accounts to AAD accounts will be stopped as well.\r\n\r\nIf you disable or don't configure this policy, all accounts will be enabled for implicit sign-in.\r\n\r\nThis policy will only take effect when policy 'ConfigureOnPremisesAccountAutoSignIn' (Configure automatic sign in with an Active Directory domain account when there is no Azure AD domain account) is enabled and set to 'SignInAndMakeDomainAccountNonRemovable'.",
    "helpText": "",
    "name": "OnlyOnPremisesImplicitSigninEnabled",
    "displayName": "Only on-premises account enabled for implicit sign-in (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev94~policy~microsoft_edge~identity_onlyonpremisesimplicitsigninenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev94~policy~microsoft_edge~identity_onlyonpremisesimplicitsigninenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev94~policy~microsoft_edge~identity_onlyonpremisesimplicitsigninenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}