{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PjSecurityLevel",
        "Security Level",
        "\\Microsoft Project 2016\\Project Options\\Security\\Tools | Macro",
        "Microsoft Project 2016\\Project Options\\Security\\Tools | Macro",
        "Tools | Macro"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/proj16v2~Policy~L_Proj~L_ProjectOptions~L_Security~L_PJMacro/L_PjSecurityLevel",
    "rootDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel",
    "categoryId": "26dfd0a7-546b-4583-b0c7-85b98ac5a40c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_l_pjsecuritylevel36",
    "description": "",
    "helpText": "",
    "name": "L_pjsecuritylevel36",
    "displayName": "Security Level (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_l_pjsecuritylevel36_3",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_l_pjsecuritylevel36_1",
            "description": null,
            "helpText": null,
            "name": "Low (not recommended)",
            "displayName": "Low (not recommended)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "1"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_l_pjsecuritylevel36_2",
            "description": null,
            "helpText": null,
            "name": "Medium",
            "displayName": "Medium",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "2"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_l_pjsecuritylevel36_3",
            "description": null,
            "helpText": null,
            "name": "High",
            "displayName": "High",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "3"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_l_pjsecuritylevel36_4",
            "description": null,
            "helpText": null,
            "name": "Very High",
            "displayName": "Very High",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "4"
            },
            "dependentOn": [
                {
                    "dependentOn": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel_1",
                    "parentSettingId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_pjmacro_l_pjsecuritylevel"
                }
            ],
            "dependedOnBy": []
        }
    ]
}