{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_DisableDocumentInformationPanel",
        "Disable Document Information Panel",
        "\\Microsoft Office 2016\\Document Information Panel",
        "Microsoft Office 2016\\Document Information Panel",
        "Document Information Panel"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_DocumentInformationpanel/L_DisableDocumentInformationPanel",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_documentinformationpanel_l_disabledocumentinformationpanel",
    "categoryId": "0696109e-045f-486a-9a6b-ab7877887bed",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_documentinformationpanel_l_disabledocumentinformationpanel",
    "description": "This policy setting controls whether Excel, PowerPoint, and Word users can view document information in the Document Information Panel.The Document Information Panel replaces the modal Properties dialog box in earlier versions of Excel, PowerPoint, and Word, and allows users to view and edit metadata that is associated with the document. Office 2016 developers can create custom Document Information Panels to record a variety of information relevant to the document or the organization. \r\n\r\nIf you enable this policy setting, forms and controls do not display in the Document Information Panel. The panel itself will display when users open it, but it will be blank. \r\n\r\nIf you disable or do not configure this policy setting, users can view the Document Information Panel.",
    "helpText": "",
    "name": "L_DisableDocumentInformationPanel",
    "displayName": "Disable Document Information Panel (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_documentinformationpanel_l_disabledocumentinformationpanel_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_documentinformationpanel_l_disabledocumentinformationpanel_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_documentinformationpanel_l_disabledocumentinformationpanel_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}