{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_StopCheckingToEnsureHyperlinkTextIsMeaningfulTextExtension",
        "Stop checking to ensure hyperlink text extension is meaningful if they include extensions",
        "\\Microsoft Word 2016\\File Tab\\Check Accessibility",
        "Microsoft Word 2016\\File Tab\\Check Accessibility",
        "Check Accessibility"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/word16v9~Policy~L_MicrosoftOfficeWord~L_FileTab~L_CheckAccessibility/L_StopCheckingToEnsureHyperlinkTextIsMeaningfulTextExtension",
    "rootDefinitionId": "user_vendor_msft_policy_config_word16v9~policy~l_microsoftofficeword~l_filetab~l_checkaccessibility_l_stopcheckingtoensurehyperlinktextismeaningfultextextension",
    "categoryId": "73bc2db9-d37f-4add-a64d-a8239273edb3",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_word16v9~policy~l_microsoftofficeword~l_filetab~l_checkaccessibility_l_stopcheckingtoensurehyperlinktextismeaningfultextextension",
    "description": "This policy setting prevents the Accessibility Checker from verifying that hyperlinks have meaningful text if they include extensions.\r\n\r\nIf you enable this policy setting, the Accessibility Checker will be prevented from verifying that hyperlinks have meaningful text if they include extensions.\r\n\r\nIf you disable or do not configure this policy setting, hyperlink text that include extensions will be checked and any issues will appear in the Accessibility Checker.",
    "helpText": "",
    "name": "L_StopCheckingToEnsureHyperlinkTextIsMeaningfulTextExtension",
    "displayName": "Stop checking to ensure hyperlink text extension is meaningful if they include extensions (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_word16v9~policy~l_microsoftofficeword~l_filetab~l_checkaccessibility_l_stopcheckingtoensurehyperlinktextismeaningfultextextension_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_word16v9~policy~l_microsoftofficeword~l_filetab~l_checkaccessibility_l_stopcheckingtoensurehyperlinktextismeaningfultextextension_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_word16v9~policy~l_microsoftofficeword~l_filetab~l_checkaccessibility_l_stopcheckingtoensurehyperlinktextismeaningfultextextension_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}