{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_UseOfficeForLabelling",
        "Use the Sensitivity feature in Office to apply and view sensitivity labels",
        "\\Microsoft Office 2016\\Security Settings",
        "Microsoft Office 2016\\Security Settings",
        "Security Settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v3~Policy~L_MicrosoftOfficeSystem~L_SecuritySettings/L_UseOfficeForLabelling",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_useofficeforlabelling",
    "categoryId": "50b4bc60-802c-477a-9366-80e09154595f",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_useofficeforlabelling",
    "description": "This policy setting controls whether sensitivity labels configured by an admin can be applied and viewed by using the Sensitivity feature in an Office app, such as Word, or by using the Microsoft Azure Information Protection add-in, if the add-in is installed and enabled.\r\n\r\nIf you enable this policy setting, the Sensitivity feature in an Office app can be used to apply and view sensitivity labels. If the Microsoft Azure Information Protection add-in is installed, the add-in is prevented from loading, even if the add-in is enabled, and the add-in can’t be used to apply sensitivity labels.\r\n\r\nIf you disable this policy setting, the Sensitivity feature won’t be available in an Office app and can’t be used to apply or view sensitivity labels. If the Microsoft Azure Information Protection add-in is installed and enabled, the add-in will be allowed to load and can be used to apply sensitivity labels.\r\n\r\nIf you don’t configure this policy setting:\r\n\r\n- If the Microsoft Azure Information Protection add-in is installed and enabled, the add-in will be allowed to load and can be used to apply sensitivity labels. The Sensitivity feature won’t be available in an Office app and can’t be used to apply or view sensitivity labels.\r\n- If the Microsoft Azure Information Protection add-in is not installed, or is installed but is disabled, then the Sensitivity feature in an Office app can be used to apply and view sensitivity labels.\r\n\r\nNote: This policy setting only applies to subscription versions of Office, such as Office 365 ProPlus.",
    "helpText": "",
    "name": "L_UseOfficeForLabelling",
    "displayName": "Use the Sensitivity feature in Office to apply and view sensitivity labels (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_useofficeforlabelling_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_useofficeforlabelling_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_useofficeforlabelling_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}