{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Always Show Notification Icon",
        "Start"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Start#alwaysshownotificationicon"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/Start/AlwaysShowNotificationIcon",
    "rootDefinitionId": "user_vendor_msft_policy_config_start_alwaysshownotificationicon",
    "categoryId": "311e1dac-a77c-4bc0-a376-35ad55923b7d",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_start_alwaysshownotificationicon",
    "description": "",
    "helpText": "",
    "name": "AlwaysShowNotificationIcon",
    "displayName": "Always Show Notification Icon (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_start_alwaysshownotificationicon_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "11.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.26200.6584",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_start_alwaysshownotificationicon_0",
            "description": "Auto-hide notification bell icon",
            "helpText": null,
            "name": "Auto-hide notification bell icon",
            "displayName": "Auto-hide notification bell icon",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_start_alwaysshownotificationicon_1",
            "description": "Show notification bell icon",
            "helpText": null,
            "name": "Show notification bell icon",
            "displayName": "Show notification bell icon",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}