{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "JavaScriptOptimizerAllowedForSites",
        "Allow JavaScript optimization on these sites",
        "\\Google\\Google Chrome\\Content settings",
        "Both",
        "Software\\Policies\\Google\\Chrome",
        "Content settings"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/chromeIntuneV141~Policy~googlechrome~ContentSettings/JavaScriptOptimizerAllowedForSites",
    "rootDefinitionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_javascriptoptimizerallowedforsites",
    "categoryId": "59d29716-55b0-4014-a458-38b408ff9530",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_javascriptoptimizerallowedforsites",
    "description": "Allows you to set a list of site url patterns that specify sites for which\r\nadvanced JavaScript optimizations are enabled.\r\n\r\nFor detailed information on valid site url patterns, please see\r\nhttps://cloud.google.com/docs/chrome-enterprise/policies/url-patterns.\r\nWildcards, *, are allowed.\r\n\r\nJavaScript optimization policy exceptions will only be enforced at a site\r\ngranularity (eTLD+1). A policy set for only subdomain.site.com will not\r\ncorrectly apply to site.com or subdomain.site.com since they both resolve to\r\nthe same eTLD+1 (site.com) for which there is no policy. In this case, policy\r\nmust be set on site.com to apply correctly for both site.com and\r\nsubdomain.site.com.\r\n\r\nThis policy applies on a frame-by-frame basis and not based on top level\r\norigin url alone, so e.g. if site-one.com is listed in the JavaScriptOptimizerAllowedForSites policy but site-one.com loads a frame   containing site-two.com then site-one.com will have JavaScript optimizations\r\nenabled, but site-two.com will use the policy from DefaultJavaScriptOptimizerSetting, if set, or default to JavaScript\r\noptimizations enabled. Blocklist entries have higher priority than allowlist\r\nentries, which in turn have higher priority than the configured default value.\r\n\r\nIf this policy is not set for a site then the policy from DefaultJavaScriptOptimizerSetting applies to the site, if set, otherwise\r\nJavascript optimization is enabled for the site.\r\n\r\nExample value:\r\n\r\n[*.]example.edu",
    "helpText": "",
    "name": "JavaScriptOptimizerAllowedForSites",
    "displayName": "Allow JavaScript optimization on these sites (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_javascriptoptimizerallowedforsites_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_javascriptoptimizerallowedforsites_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_javascriptoptimizerallowedforsites_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_chromeintunev141~policy~googlechrome~contentsettings_javascriptoptimizerallowedforsites_javascriptoptimizerallowedforsitesdesc",
                    "required": true
                }
            ]
        }
    ]
}