{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "SharedWorkerBlobURLFixEnabled",
        "Make SharedWorker blob URL behavior aligned with the specification",
        "\\Microsoft Edge",
        "Microsoft Edge"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/microsoft_edgev134~Policy~microsoft_edge/SharedWorkerBlobURLFixEnabled",
    "rootDefinitionId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_sharedworkerbloburlfixenabled",
    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_sharedworkerbloburlfixenabled",
    "description": "According to Service Worker specification\r\nhttps://w3c.github.io/ServiceWorker/#control-and-use-worker-client, workers\r\nshould inherit controllers for blob URLs. Currently, only DedicatedWorkers\r\ninherit the controller, while SharedWorkers do not.\r\n\r\nEnabled/Unset: Microsoft Edge inherits\r\nthe controller for SharedWorker blob URLs, aligning with the specification.\r\n\r\nDisabled: Behavior remains unchanged, not aligning with the specification.\r\n\r\nThis policy is temporary and will be removed in a future update.",
    "helpText": "",
    "name": "SharedWorkerBlobURLFixEnabled",
    "displayName": "Make SharedWorker blob URL behavior aligned with the specification (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_sharedworkerbloburlfixenabled_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_sharedworkerbloburlfixenabled_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_microsoft_edgev134~policy~microsoft_edge_sharedworkerbloburlfixenabled_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}