{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "sz_AdminComponents_Title",
        "Add/Delete items",
        "\\Desktop\\Desktop",
        "Administrative Templates\\Desktop\\Desktop",
        "Desktop"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-desktop#admx-desktop-sz-admincomponents-title"
    ],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/ADMX_Desktop/sz_AdminComponents_Title",
    "rootDefinitionId": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title",
    "categoryId": "a69e7a98-5af7-4834-bae1-2a1047663a71",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title",
    "description": "Adds and deletes specified Web content items.\r\n\r\nYou can use the \"Add\" box in this setting to add particular Web-based items or shortcuts to users' desktops. Users can close or delete the items (if settings allow), but the items are added again each time the setting is refreshed.\r\n\r\nYou can also use this setting to delete particular Web-based items from users' desktops. Users can add the item again (if settings allow), but the item is deleted each time the setting is refreshed.\r\n\r\nNote: Removing an item from the \"Add\" list for this setting is not the same as deleting it. Items that are removed from the \"Add\" list are not removed from the desktop. They are simply not added again.\r\n\r\nNote: For this setting to take affect, you must log off and log on to the system.\n ",
    "helpText": "",
    "name": "sz_AdminComponents_Title",
    "displayName": "Add/Delete items (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "10.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.19041.1202",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title_sz_atc_adminadditem",
                    "required": true
                },
                {
                    "dependedOnBy": "user_vendor_msft_policy_config_admx_desktop_sz_admincomponents_title_sz_atc_admindeleteitem",
                    "required": true
                }
            ]
        }
    ]
}