{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "none",
    "keywords": [
        "L_PreventAccessToUserSpecifiedServices",
        "Prevent users from adding online presentation services in PowerPoint and Word",
        "\\Microsoft Office 2016\\Present Online",
        "Microsoft Office 2016\\Present Online",
        "Present Online"
    ],
    "infoUrls": [],
    "baseUri": "./User/Vendor/MSFT/Policy",
    "offsetUri": "/Config/office16v2~Policy~L_MicrosoftOfficeSystem~L_Broadcast/L_PreventAccessToUserSpecifiedServices",
    "rootDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_broadcast_l_preventaccesstouserspecifiedservices",
    "categoryId": "5bf4c2ba-be08-4cda-bf33-d10707580d78",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "settingsCatalog,template",
    "id": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_broadcast_l_preventaccesstouserspecifiedservices",
    "description": "This policy setting allows you to prevent users from adding new or previously created presentation services to the list of online presentation services in PowerPoint and Word. These services appear when a user selects the More services link under Present Online on the Share tab in Backstage view.\r\n\r\nIf you enable or do not configure this policy setting, the More services link does not allow users to add a new presentation service. In addition, all services previously added by users are removed from the list.\r\n\r\nIf you disable this policy setting, the More Services link provides an option for users to add a new presentation service. In addition, the list of services previously added by users appears in the list of services.",
    "helpText": "",
    "name": "L_PreventAccessToUserSpecifiedServices",
    "displayName": "Prevent users from adding online presentation services in PowerPoint and Word (User)",
    "defaultOptionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_broadcast_l_preventaccesstouserspecifiedservices_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "5.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_broadcast_l_preventaccesstouserspecifiedservices_0",
            "description": null,
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_broadcast_l_preventaccesstouserspecifiedservices_1",
            "description": null,
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}