{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "Enabled",
        "Firewall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/HyperVFirewallRules/{0}/Enabled",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "toggle",
    "visibility": "template",
    "riskLevel": "low",
    "id": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_enabled",
    "description": "Indicates whether the rule is enabled or disabled. If not specified - a new rule is enabled by default.",
    "helpText": "",
    "name": "Enabled",
    "displayName": "Enabled",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_enabled_0",
            "description": "Disabled",
            "helpText": null,
            "name": "Disabled",
            "displayName": "Disabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_enabled_1",
            "description": "Enabled",
            "helpText": null,
            "name": "Enabled",
            "displayName": "Enabled",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}