{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        " Firewall Rule Name",
        "Firewall"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/HyperVFirewallRules/{0}",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}",
    "description": "Unique alpha numeric identifier for the rule.  The rule name must not include a forward slash (/).",
    "helpText": "",
    "name": "{FirewallRuleName}",
    "displayName": " Firewall Rule Name",
    "childIds": [
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_firewallrulename",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_priority",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_direction",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_vmcreatorid",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_protocol",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_localaddressranges",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_localportranges",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_remoteaddressranges",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_remoteportranges",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_action",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_enabled",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_profiles",
        "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_name"
    ],
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.22621",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_firewallrulename",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_priority",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_direction",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_vmcreatorid",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_protocol",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_localaddressranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_localportranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_remoteaddressranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_remoteportranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_action",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_enabled",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_profiles",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_hypervfirewallrules_{firewallrulename}_name",
            "required": true
        }
    ]
}