{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        " Firewall Rule Name",
        "Firewall"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/FirewallRules/{0}",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
    "description": "Unique alpha numeric identifier for the rule.  The rule name must not include a forward slash (/).",
    "helpText": "",
    "name": "{FirewallRuleName}",
    "displayName": " Firewall Rule Name",
    "childIds": [
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_firewallrulename",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_packagefamilyname",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_filepath",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_fqbn",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_servicename",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_protocol",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_localportranges",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_remoteportranges",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_icmptypesandcodes",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_localaddressranges",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_remoteaddressranges",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_remoteaddressdynamickeywords",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_description",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_enabled",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_profiles",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_action_type",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_direction",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_edgetraversal",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_localuserauthorizedlist",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_policyappid",
        "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_name"
    ],
    "maximumCount": 150,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_firewallrulename",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_packagefamilyname",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_filepath",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_fqbn",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_app_servicename",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_protocol",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_localportranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_remoteportranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_icmptypesandcodes",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_localaddressranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_remoteaddressranges",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_remoteaddressdynamickeywords",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_description",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_enabled",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_profiles",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_action_type",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_direction",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_edgetraversal",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_localuserauthorizedlist",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_policyappid",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_name",
            "required": true
        }
    ]
}