{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "License Type",
        "Windows Licensing"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/WindowsLicensing-csp/"
    ],
    "baseUri": "./Vendor/MSFT/WindowsLicensing",
    "offsetUri": "/DeviceLicensingService/LicenseType",
    "rootDefinitionId": "vendor_msft_windowslicensing_devicelicensingservice_licensetype",
    "categoryId": "f8a973d8-b5d6-4d3e-9e82-63f61107fd0c",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "id": "vendor_msft_windowslicensing_devicelicensingservice_licensetype",
    "description": "Get/Replace License Type: User Based License = 0, Device Based License = 1\r\n ",
    "helpText": "",
    "name": "LicenseType",
    "displayName": "License Type",
    "defaultOptionId": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.4",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "88.8.88888",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "iotEnterprise",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_windowslicensing_devicelicensingservice_licensetype_0",
            "description": "User Based License",
            "helpText": null,
            "name": "User Based Subscription",
            "displayName": "User Based License",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_windowslicensing_devicelicensingservice_licensetype_1",
            "description": "Device Based License",
            "helpText": null,
            "name": "Device Based Subscription",
            "displayName": "Device Based License",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}