{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "TamperProtection (Device)",
        "Defender"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/en-us/windows/client-management/mdm/defender-csp#:~:text=Configuration/TamperProtection"
    ],
    "baseUri": "./Vendor/MSFT/Defender",
    "offsetUri": "/Configuration/TamperProtectionOptions",
    "rootDefinitionId": "vendor_msft_defender_configuration_tamperprotection_options",
    "categoryId": "e8400c82-34c8-4d6e-bbf9-85220f3205ea",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "vendor_msft_defender_configuration_tamperprotection_options",
    "description": "This setting can be used to turn on controlled configuration or tamper protection to help protect important security features from unwanted changes and interference.\r\n\r\nIf the setting is configured to Tamper Protection (On), this turns on tamper protection to enforce tamper protected settings to their secure defaults. This includes real-time protection, behavior monitoring, and more. Settings are configured with an MDM solution, such as Intune and is available in Windows 10 Enterprise E5 or equivalent subscriptions.\r\n\r\nIf the setting is configured to Controlled Configuration (On), this turns on controlled configuration, which enforces the configuration coming from Intune exclusively and any non-configured settings to their secure defaults. Controlled configuration is applicable to Antivirus and Endpoint detection and response settings.\r\n\r\nIf the setting is configured to OFF, this turns off Controlled Configuration and Tamper Protection.",
    "helpText": null,
    "name": "ControlledConfiguration",
    "displayName": "Controlled Configuration (Device)",
    "defaultOptionId": "vendor_msft_defender_configuration_tamperprotection_options_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.10586",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "unknown",
            "windowsEducation",
            "windowsMultiSession",
            "surfaceHub",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_defender_configuration_tamperprotection_options_1",
            "description": null,
            "helpText": null,
            "name": "Offboarding",
            "displayName": "Off",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Offboarding"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "vendor_msft_defender_configuration_tamperprotection_blob",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_controlledconfiguration_blob",
                    "required": false
                }
            ]
        },
        {
            "itemId": "vendor_msft_defender_configuration_tamperprotection_options_0",
            "description": null,
            "helpText": null,
            "name": "Onboarding",
            "displayName": "Tamper Protection (On)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Onboarding"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "vendor_msft_defender_configuration_tamperprotection_blob",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_controlledconfiguration_blob",
                    "required": false
                }
            ]
        },
        {
            "itemId": "vendor_msft_defender_configuration_tamperprotection_options_2",
            "description": null,
            "helpText": null,
            "name": "ControlledConfig_Onboarding",
            "displayName": "Controlled Configuration (On)",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "ControlledConfig_Onboarding"
            },
            "dependentOn": [],
            "dependedOnBy": [
                {
                    "dependedOnBy": "vendor_msft_controlledconfiguration_blob",
                    "required": false
                },
                {
                    "dependedOnBy": "vendor_msft_defender_configuration_tamperprotection_blob",
                    "required": false
                }
            ]
        }
    ]
}