{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
    "accessTypes": "add,delete,get",
    "keywords": [
        " Connection Profile ID",
        "Wireless Network Preference"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/WirelessNetworkPreference",
    "offsetUri": "/ConnectionProfiles/{0}",
    "rootDefinitionId": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}",
    "categoryId": "0d9ee4f5-7d6b-41fd-9089-b0886f7ff944",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}",
    "description": "Unique identifier of a network preference policy. Unique ID is auto-generated.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "{ConnectionProfileID}",
    "displayName": " Connection Profile ID (Windows Insiders only)",
    "childIds": [
        "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_priority",
        "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_stayconnected",
        "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_wirelesstype",
        "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_cellular_plmnid"
    ],
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.25272",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "dependentOn": [],
    "dependedOnBy": [
        {
            "dependedOnBy": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_priority",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_stayconnected",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_wirelesstype",
            "required": false
        },
        {
            "dependedOnBy": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_cellular_plmnid",
            "required": false
        }
    ]
}