{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get",
    "keywords": [
        "Wireless Network Preference"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/WirelessNetworkPreference",
    "offsetUri": "/ConnectionProfiles/{0}/ConnectionProfileID",
    "rootDefinitionId": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}",
    "categoryId": "0d9ee4f5-7d6b-41fd-9089-b0886f7ff944",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "none",
    "riskLevel": "low",
    "id": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}_connectionprofileid",
    "description": null,
    "helpText": null,
    "name": "ConnectionProfileID",
    "displayName": null,
    "defaultValue": null,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.25272",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 100
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
        "format": "guid",
        "inputValidationSchema": null,
        "maximumLength": 87516,
        "minimumLength": 0,
        "isSecret": false,
        "fileTypes": []
    },
    "dependentOn": [
        {
            "dependentOn": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}",
            "parentSettingId": "vendor_msft_wirelessnetworkpreference_connectionprofiles_{connectionprofileid}"
        }
    ],
    "dependedOnBy": []
}