{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "Require Network In OOBE (Device)",
        "TenantLockdown",
        "Tenant Lockdown"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/TenantLockdown",
    "offsetUri": "/RequireNetworkInOOBE",
    "rootDefinitionId": "vendor_msft_tenantlockdown_requirenetworkinoobe",
    "categoryId": "c4ce54b8-e555-4447-9791-dd8e9dbb86b0",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "vendor_msft_tenantlockdown_requirenetworkinoobe",
    "description": "true - Require network in OOBE, false - no network connection requirement in OOBE",
    "helpText": null,
    "name": "RequireNetworkInOOBE",
    "displayName": "Require Network In OOBE (Device)",
    "defaultOptionId": "vendor_msft_tenantlockdown_requirenetworkinoobe_false",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [
            "windowsProfessional",
            "windowsEnterprise",
            "windowsEducation"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_tenantlockdown_requirenetworkinoobe_true",
            "description": null,
            "helpText": null,
            "name": "true",
            "displayName": "true",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "true"
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_tenantlockdown_requirenetworkinoobe_false",
            "description": null,
            "helpText": null,
            "name": "false",
            "displayName": "false",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "false"
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}