{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "get,replace",
    "keywords": [
        "Network Discovery Option",
        "Wireless Network Preference"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/WirelessNetworkPreference-csp/"
    ],
    "baseUri": "./Vendor/MSFT/WirelessNetworkPreference",
    "offsetUri": "/Parameters/CellularParameters/NetworkDiscoveryOption",
    "rootDefinitionId": "vendor_msft_wirelessnetworkpreference_parameters_cellularparameters_networkdiscoveryoption",
    "categoryId": "0d9ee4f5-7d6b-41fd-9089-b0886f7ff944",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "vendor_msft_wirelessnetworkpreference_parameters_cellularparameters_networkdiscoveryoption",
    "description": "Configures which approach should be used in the network discovery process. There are two possible values: (0) no network scan will be performed – rather, registration and connection will be attempted with each eSIM profile in descending order of preference; or (1) Network scan will be performed using the current active eSIM profile. This option works for modems that when performing a network scan show the complete list of available networks independently of which eSIM profile is active.\r\n This setting is only available to Windows Insiders",
    "helpText": "",
    "name": "NetworkDiscoveryOption",
    "displayName": "Network Discovery Option (Windows Insiders only)",
    "defaultOptionId": "vendor_msft_wirelessnetworkpreference_parameters_cellularparameters_networkdiscoveryoption_0",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.25272",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsHome",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval",
            "windowsCPC"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_wirelessnetworkpreference_parameters_cellularparameters_networkdiscoveryoption_0",
            "description": "No network scan will be performed -- rather, registration and connection will be attempted with each eSIM profile in descending order of preference.",
            "helpText": null,
            "name": "No network scan will be performed -- rather, registration and connection will be attempted with each eSIM profile in descending order of preference.",
            "displayName": "No network scan will be performed -- rather, registration and connection will be attempted with each eSIM profile in descending order of preference.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_wirelessnetworkpreference_parameters_cellularparameters_networkdiscoveryoption_1",
            "description": "Network scan will be performed using the current active eSIM profile.",
            "helpText": null,
            "name": "Network scan will be performed using the current active eSIM profile.",
            "displayName": "Network scan will be performed using the current active eSIM profile.",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}