{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Maintenance Start Time",
        "SharedPC",
        "Shared PC"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/SharedPC",
    "offsetUri": "/MaintenanceStartTime",
    "rootDefinitionId": "vendor_msft_sharedpc_maintenancestarttime",
    "categoryId": "891d2958-5a8c-479c-aa68-69b1b6c735e1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "vendor_msft_sharedpc_maintenancestarttime",
    "description": "Daily start time of maintenance hour. Given in minutes from midnight. Default is 0 (12am).",
    "helpText": null,
    "name": "MaintenanceStartTime",
    "displayName": "Maintenance Start Time",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "valueDefinition": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
        "maximumValue": 1440,
        "minimumValue": 0
    },
    "defaultValue": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
        "settingValueTemplateReference": null,
        "value": 0
    },
    "dependentOn": [],
    "dependedOnBy": []
}