{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Deletion Policy",
        "SharedPC",
        "Shared PC"
    ],
    "infoUrls": [],
    "baseUri": "./Vendor/MSFT/SharedPC",
    "offsetUri": "/DeletionPolicy",
    "rootDefinitionId": "vendor_msft_sharedpc_deletionpolicy",
    "categoryId": "891d2958-5a8c-479c-aa68-69b1b6c735e1",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "settingsCatalog,template",
    "riskLevel": "low",
    "id": "vendor_msft_sharedpc_deletionpolicy",
    "description": "Configures when accounts will be deleted. Allowed values: 0 (delete immediately), 1 (delete at disk space threshold), 2 (delete at disk space threshold and inactive threshold).",
    "helpText": null,
    "name": "DeletionPolicy",
    "displayName": "Deletion Policy",
    "defaultOptionId": "vendor_msft_sharedpc_deletionpolicy_1",
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": null,
        "windowsSkus": [],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 1,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_sharedpc_deletionpolicy_0",
            "description": null,
            "helpText": null,
            "name": "Delete immediately",
            "displayName": "Delete immediately",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 0
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_sharedpc_deletionpolicy_1",
            "description": null,
            "helpText": null,
            "name": "Delete at disk space threshold",
            "displayName": "Delete at disk space threshold",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 1
            },
            "dependentOn": [],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_sharedpc_deletionpolicy_2",
            "description": null,
            "helpText": null,
            "name": "Delete at disk space threshold and inactive threshold",
            "displayName": "Delete at disk space threshold and inactive threshold",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 2
            },
            "dependentOn": [],
            "dependedOnBy": []
        }
    ]
}