{
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
    "accessTypes": "add,delete,get,replace",
    "keywords": [
        "Interface Types",
        "Firewall"
    ],
    "infoUrls": [
        "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
    ],
    "baseUri": "./Vendor/MSFT/Firewall",
    "offsetUri": "/MdmStore/FirewallRules/{0}/InterfaceTypes",
    "rootDefinitionId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
    "categoryId": "4a5e4714-00ac-4793-b0cc-5049041b0ed7",
    "settingUsage": "configuration",
    "uxBehavior": "default",
    "visibility": "template",
    "riskLevel": "low",
    "id": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes",
    "description": "String value. Multiple interface types can be included in the string by separating each value with a \",\". Acceptable values are \"RemoteAccess\", \"Wireless\", \"Lan\", and \"All\".\n If more than one interface type is specified, the strings must be separated by a comma.",
    "helpText": "",
    "name": "InterfaceTypes",
    "displayName": "Interface Types",
    "defaultOptionId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes_all",
    "maximumCount": 100,
    "minimumCount": 0,
    "applicability": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
        "description": null,
        "platform": "windows10",
        "deviceMode": "none",
        "technologies": "mdm,configManager,microsoftSense",
        "configurationServiceProviderVersion": "1.0",
        "maximumSupportedVersion": null,
        "minimumSupportedVersion": "10.0.16299",
        "windowsSkus": [
            "windowsEnterprise",
            "windowsProfessional",
            "windowsEducation",
            "holographicForBusiness",
            "windowsMultiSession",
            "iotEnterprise",
            "windowsCloudN",
            "windows11SE",
            "iotEnterpriseSEval"
        ],
        "requiresAzureAd": false,
        "requiredAzureAdTrustType": "none"
    },
    "occurrence": {
        "minDeviceOccurrence": 0,
        "maxDeviceOccurrence": 1
    },
    "referredSettingInformationList": [],
    "options": [
        {
            "itemId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes_remoteaccess",
            "description": "RemoteAccess",
            "helpText": null,
            "name": "RemoteAccess",
            "displayName": "Remote Access",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "RemoteAccess"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes_wireless",
            "description": "Wireless",
            "helpText": null,
            "name": "Wireless",
            "displayName": "Wireless",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Wireless"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes_lan",
            "description": "Lan",
            "helpText": null,
            "name": "Lan",
            "displayName": "Lan",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "Lan"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes_mobilebroadband",
            "description": "MobileBroadband",
            "helpText": null,
            "name": "MobileBroadband",
            "displayName": "[Not Supported] Mobile Broadband",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "MobileBroadband"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes_mbb",
            "description": "MobileBroadband",
            "helpText": null,
            "name": "MBB",
            "displayName": "Mobile Broadband",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "MBB"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        },
        {
            "itemId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}_interfacetypes_all",
            "description": "All",
            "helpText": null,
            "name": "All",
            "displayName": "All",
            "optionValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "All"
            },
            "dependentOn": [
                {
                    "dependentOn": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}",
                    "parentSettingId": "vendor_msft_firewall_mdmstore_firewallrules_{firewallrulename}"
                }
            ],
            "dependedOnBy": []
        }
    ]
}